{
    "patent_id": "US-10831163-B2",
    "title": "Syntax translation from first syntax to second syntax based on string analysis ",
    "assignee": "Johnson Controls Technology Company",
    "publication_date": "2020-11-10",
    "patent_link": "https://patents.google.com/patent/US10831163B2/en",
    "inventors": [
        "Youngchoon Park"
    ],
    "classifications": [
        "G05B13/0265",
        "G05B15/02",
        "G06N7/005",
        "G06N7/01",
        "G05B2219/21088",
        "G05B2219/25011"
    ],
    "abstract": "A computerized method of assigning a building automation system point type to a plurality of unclassified data points is provided. The method includes receiving unclassified data points and attributes for each data point. The method includes receiving classifications for a first subset of the unclassified data points. Each classification associates a data point with a building automation system point type. The method includes generating a term set containing substrings that appear in the attributes. The method includes generating a first matrix describing a frequency that the substrings appear in the attributes. The method includes calculating an indicator of a probability that the presence of the selected substring results in the data point belonging to the selected point type. The method includes assigning a point type to a second subset by finding the substring and potential point type pair having the greatest indication of probability.",
    "claims": "\n1. A building system of a building comprising one or more storage devices having instructions stored thereon that, when executed by one or more processors, cause the one or more processors to:\nreceive a plurality of strings in a first syntax representing a plurality of entities of the building;\nidentify the plurality of entities of the building in a second syntax different than the first syntax and a plurality of relationships between the plurality of entities by analyzing the plurality of strings with a classification technique, the classification technique indicating an entity definition of the second syntax for each of the plurality of entities; and\ngenerate a data structure in the second syntax based on the entity definition of the second syntax for each of the plurality of entities and the plurality of relationships.\n2. The building system of claim 1, wherein the plurality of entities of the building comprise at least one of points, equipment, and building spaces of the building.\n3. The building system of claim 1, wherein the instructions cause the one or more processors to:\ngenerate a user interface comprising indications of the plurality of entities of the building in the second syntax;\ncause a user device to display the user interface; and\nreceive, via the user device, an indication of one or more of the plurality of relationships from the user device based on one or more user interactions with the user interface.\n4. The building system of claim 1, wherein the one or more storage devices store a list of known entity types;\nwherein the instructions cause the one or more processors to assign one known entity type of the list of known entity types to each of the plurality of strings.\n5. The building system of claim 1, wherein each of the plurality of entities are points of a plurality of pieces of equipment of the building.\n6. The building system of claim 1, wherein the plurality of entities of the building are points of a plurality of pieces of building equipment of the building;\nwherein the building system further comprises the plurality of pieces of building equipment of the building, wherein the plurality of pieces of building equipment are configured to monitor and control one or more building spaces of the building using the points.\n7. The building system of claim 1, wherein the plurality of entities are data points, wherein the plurality of strings form text descriptions of attributes of the data points.\n8. The building system of claim 1, wherein the instructions cause the one or more processors to identify the plurality of entities of the building in the second syntax different than the first syntax by generating a set of probability values for a string of the plurality of strings, each probability value of the set of probability values corresponding to a different entity type and indicating a probability that the string belongs to a corresponding entity type based on one or more characters of the string;\nwherein the one or more characters of the string are an input to the classification technique and the set of probability values are an output of the classification technique.\n9. The building system of claim 1, wherein the classification technique is at least one of a Bayes classification technique or a latent semantic indexing technique.\n10. A method of syntax translation for a building, the method comprising:\nreceiving, by one or more processing circuits, a plurality of strings in a first syntax representing a plurality of entities of the building;\nidentifying, by the one or more processing circuits, the plurality of entities of the building in a second syntax different than the first syntax and a plurality of relationships between the plurality of entities by analyzing the plurality of strings with a classification technique, the classification technique indicating an entity definition of the second syntax for each of the plurality of entities; and\ngenerating, by the one or more processing circuits, a data structure in the second syntax based on the entity definition of the second syntax for each of the plurality of entities and the plurality of relationships.\n11. The method of claim 10, wherein the plurality of entities of the building comprise at least one of points, equipment, and building spaces of the building.\n12. The method of claim 10, further comprising:\ngenerating, by the one or more processing circuits, a user interface comprising indications of the plurality of entities of the building in the second syntax;\ncausing, by the one or more processing circuits, a user device to display the user interface; and\nreceiving, by the one or more processing circuits, via the user device, an indication of one or more of the plurality of relationships from the user device based on one or more user interactions with the user interface.\n13. The method of claim 10, further comprising:\ncausing, by the one or more processing circuits, one or more storage devices to store a list of known entity types;\nassigning, by the one or more processing circuits, one known entity type of the list of known entity types to each of the plurality of strings.\n14. The method of claim 10, wherein each of the plurality of entities are points of a plurality of pieces of equipment of the building.\n15. The method of claim 10, wherein the plurality of entities of the building are points of a plurality of pieces of building equipment of the building;\nwherein the method further comprises monitoring and controlling, by the plurality of pieces of building equipment, one or more building spaces of the building using the points.\n16. The method of claim 10, wherein the plurality of entities are data points, wherein the plurality of strings form text descriptions of attributes of the data points.\n17. The method of claim 10, wherein identifying, by the one or more processing circuits, the plurality of entities of the building in the second syntax different than the first syntax by generating a set of probability values for a string of the plurality of strings, each probability value of the set of probability values corresponding to a different entity type and indicating a probability that the string belongs to a corresponding entity type based on one or more characters of the string;\nwherein the one or more characters of the string are an input to the classification technique and the set of probability values are an output of the classification technique.\n18. The method of claim 10, wherein the classification technique is at least one of a Bayes classification technique or a latent semantic indexing technique.\n19. One or more storage devices storing instructions thereon that, when executed by one or more processing circuits, cause the one or more processing circuits to:\nreceive a plurality of strings in a first syntax representing a plurality of entities of a building;\nidentify the plurality of entities of the building in a second syntax different than the first syntax and a plurality of relationships between the plurality of entities by analyzing the plurality of strings with a classification technique and based on user input received from a user device, the classification technique indicating an entity definition of the second syntax for each of the plurality of entities; and\ngenerate a data structure in the second syntax based on the entity definition of the second syntax for each of the plurality of entities and the plurality of relationships.\n20. The one or more storage devices of claim 19, wherein the plurality of entities of the building comprise at least one of points, equipment, and building spaces of the building."
}