{
    "patent_link": "https://patents.google.com/patent/US4542452A/en",
    "patent_id": "US4542452A",
    "title": "Programmable controller",
    "abstract": "A programmable controller is provided with a controller body including a microprocessor having a ROM for storing user programs connected with a socket thereto. A programmer which is connected by a connector to a data bus or the controller body has a means to switch to a program mode to write a user program in a RAM by operating keys, and a test run mode to execute the user program written in RAM on the controller body, and a means to copy the user program written in RAM of the programmer to said ROM. The user program stored in ROM which is inserted in said socket is executed when the programmer is isolated from the controller body. The system program of the controller body includes a basic control function program for executing a single loop control, a cascade control function program for executing the cascade control and a selective control function program for the selective control, so that the control operation function is decided by selecting one of said control operation functions programs by a single instruction of the user programs.",
    "inventors": [
        "Yoshio Fukai",
        "Masato Yamamoto",
        "Masuo Hanawaka"
    ],
    "assignee": "Yokogawa Electric Corp",
    "classifications": [
        "G05B19/056",
        "G05B2219/11101",
        "G05B2219/1127",
        "G05B2219/1161",
        "G05B2219/13002",
        "G05B2219/13006",
        "G05B2219/13013",
        "G05B2219/13029",
        "G05B2219/13095",
        "G05B2219/13142",
        "G05B2219/13171",
        "G05B2219/14005",
        "G05B2219/14054",
        "G05B2219/15039",
        "G05B2219/15048"
    ],
    "claims": "\n1. A programmable controller comprising a controller having a data bus, a microprocessor coupled to said data bus, a first ROM coupled to said data bus for storing a system program, a second ROM coupled to said data bus for storing a user program, a first RAM coupled to said data bus for storing data, said second RAM being removably connected with a socket to said data bus, a display unit having front panels for displaying measured and set value operating outputs, means for specifying the operating mode and means for changing the set value and manual operation of the output,\na programmer removably connected to said controller having a second RAM for storing said user program, a third ROM for storing a control program, a keyboard for use in programming, a programmer display for use in programming, and a changeover switch for changing said programmer from a program mode to a test run mode, whereby said programmer, when connected to said controller, may be switched from a program mode for writing the user program in the second RAM using said keyboard to the test run mode for said controller thereby executing the user program written in said second RAM and checking such execution using said programmer display whereas said controller executes the user program stored in said second ROM when said programmer is disconnected from, said controller,\nsaid system program of said controller being provided with a basic function program equivalent to the function performed by a cascade controller having two process controllers connected in series, a selective control function program equivalent to the function performed by a selective type controller having a plurality of process controllers connected in parallel, whereby a control operational function of the controller is determined by selecting a control function program by a command from a user program.\n2. A programmable controller according to claim 1, having an initial value of a control parameter stored in said second ROM for resetting the control parameter from said second ROM to said first RAM when the control parameter in said first RAM volatilizes.\n3. A programmable controller according to claim 1, having said user program stored in said second RAM of said programmer copied in said second ROM, said second ROM being connected by said socket to said controller.\n4. A programmable controller according to claim 1, wherein said programmer is provided with ROM writer means for copying the user program stored in said second RAM in said second ROM.\n5. A programmable controller according to claim 1, wherein said programmer has a LOAD instruction key, a STORE instruction key and a plurality of FUNC instruction keys on said keyboard, said FUNC instruction keys having a basic control function key, a cascade control function key and a selective control function key as control functions keys to decide a control operation function, said keyboard including an arithmetic operation key and keys corresponding individually to an operation function of a selector and a limiter.\n6. A programmable controller according to claim 1, wherein said second RAM of said programmer is provided with a separate storage area for storing a model program to provide a simulation of a control operation using said model program during said test run mode.\n7. A programmable controller according to claim 1, wherein said programmer has a program area designation switch for designating whether a program will be written for a control operation of said second RAM or for the operation of said programmer in a model program mode.\n8. A programmable controller according to claim 1, having means for transferring said user program in said second ROM to said second RAM in said programmer by means of said keyboard.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4028682A",
        "US4038533A",
        "US4064394A",
        "US4091446A",
        "US4129862A",
        "US4138718A",
        "US4200915A",
        "US4215398A",
        "US4303973A",
        "US4371922A",
        "US4385349A",
        "US4390942A",
        "US4418381A",
        "US4431988A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4639916A",
        "DE3627300A1",
        "US4658347A",
        "US4663704A",
        "US4685064A",
        "US4710863A",
        "US4740886A",
        "US4789942A",
        "US4797670A",
        "US4823254A",
        "US4937864A",
        "US5014185A",
        "US5043861A",
        "US5146207A",
        "US5218525A",
        "US5251302A",
        "US5301336A",
        "DE4416793A1",
        "US5471380A",
        "US5485400A",
        "US5764507A",
        "US5862401A",
        "US6006338A",
        "DE29912848U1",
        "US20030081787A1",
        "US20030081790A1",
        "US20030135687A1",
        "US20030153988A1",
        "WO2004053602A1",
        "US20040230322A1",
        "US20050053662A1",
        "US7768444B1",
        "US7799273B2"
    ],
    "citedby_ftf": [
        "JPS6188361A",
        "JPH0564518B2",
        "GB8517155D0",
        "CH674780A5",
        "US4762502A",
        "JPH04256103A"
    ]
}