{
    "patent_id": "US-11410046-B2",
    "title": "Learning-based service migration in mobile edge computing ",
    "assignee": "Cisco Technology, Inc.",
    "publication_date": "2022-08-09",
    "patent_link": "https://patents.google.com/patent/US11410046B2/en",
    "inventors": [
        "Dantong Liu",
        "Qing Zhao",
        "Khashayar Mirfakhraei",
        "Gautam Dilip Bhanage",
        "Xu Zhang",
        "Ardalan Alizadeh"
    ],
    "classifications": [
        "H04L67/1097",
        "G06F9/4856",
        "G06N3/006",
        "G06N3/04",
        "G06N3/044",
        "G06N3/045",
        "G06N3/084",
        "G06N7/01",
        "H04L41/0893",
        "H04L41/0894",
        "H04L41/16",
        "H04L41/50",
        "H04L41/5019",
        "H04L41/5054",
        "H04L67/10",
        "H04L67/148",
        "H04L67/34",
        "H04L41/046",
        "H04L41/5067",
        "H04L43/0852"
    ],
    "abstract": "Learning-based service migration in mobile edge computing may be provided. First, a service migration policy may be created for a network that includes a plurality of edge clouds configured to provide a service to users. Next, a movement of a user receiving the service from a source edge cloud may be detected. The source edge cloud may be associated with a first area and the detected movement may be from the first area to a second area. Then, the service migration policy may be applied to determine whether to migrate the service for the user from the source edge cloud. In response to determining to migrate the service, a target edge cloud may be identified and the service for the user may be migrated from the source edge cloud to the target edge cloud. The service migration policy may then be updated based on a success of the migration.",
    "claims": "\n1. A method comprising:\nreceiving a state of a network, the network comprising a plurality of edge clouds configured to provide a service to users;\nreceiving a predicted state-value function and a predicted action-value function;\ndetermining an action to perform based on the state, the predicted state-value function, and the predicted action-value function, the action comprising one of maintaining the service for a user at a source edge cloud or migrating the service for the user from the source edge cloud to a target edge cloud;\nperforming the action;\nreceiving a reward indicating a success of the action performed;\nstoring data associated with the state, the action, and the reward in a network statistic pool;\niteratively determining actions to perform and receive rewards indicating successes of the actions performed based on varying states of the network received over a period of time to optimize a service migration policy for the network; and\nwherein, in response to the action comprising migration of the service for the user from the source edge cloud to the target edge cloud, receiving the reward indicating the success of the action comprises receiving a scalar value representing a Quality of Service (QoS) as perceived by the user less a data transferring cost and a cost function associated with transferring time for the migration.\n2. The method of claim 1, wherein receiving the predicted state-value function and the predicted action-value function comprises receiving the predicted state-value function and the predicted action-value function as output from a Deep Neural Network (DNN), the DNN trained with data stored in the network statistic pool.\n3. The method of claim 1, wherein determining the action to perform based on the state, the predicted state-value function, and the predicted action-value function comprises:\nproviding the state, the predicted state-value function, and the predicted action-value function as input to a policy determination function; and\nreceiving the action as output from the policy determination function.\n4. The method of claim 1, wherein, in response to the action comprising maintenance of the service for the user at the source edge cloud, receiving the reward indicating the success of the action comprises receiving a scalar value representing a Quality of Service (QoS) as perceived by the user.\n5. A system comprising:\na memory storage being disposed in an agent, wherein the agent is an entity within a network that comprises a plurality of edge clouds configured to provide a service to users; and\na processing unit coupled to the memory storage and being disposed in the agent, wherein the processing unit is operative to:\nreceive a state of the network;\nreceive a predicted state-value function and a predicted action-value function;\ndetermine an action to perform based on the state, the predicted state-value function, and the predicted action-value function, the action comprising one of maintaining the service for a user at a source edge cloud or migrating the service for the user from the source edge cloud to a target edge cloud;\nperform the action;\ndetermine a reward indicating a success of the action performed;\nstore data associated with the state, the action, and the reward in a network statistic pool;\niteratively determine actions to perform and rewards indicating successes of the actions performed based on varying states of the network received over a period of time to optimize a service migration policy for the network; and\nwherein, in response to the action comprising migration of the service for the user from the source edge cloud to the target edge cloud, receive the reward indicating the success of the action comprises receiving a scalar value representing a Quality of Service (QoS) as perceived by the user less a data transferring cost and a cost function associated with transferring time for the migration.\n6. The system of claim 5, wherein the state of the network includes a latency of the network, an amount of energy consumed by the network, and a cost for each of the plurality of edge clouds to provide the service to the users.\n7. The system of claim 5, wherein the network further comprises a central cloud, a backhaul network, and a plurality of access points corresponding the plurality of edge clouds.\n8. The system of claim 7, wherein the agent is the central cloud, one of the plurality of edge clouds, or one of the users.\n9. The system of claim 5, wherein the predicted state-value function and the predicted action-value function are received as output from a Deep Neural Network (DNN) trained with data stored in the network statistic pool.\n10. The system of claim 9, wherein the processing unit is further operative to store data associated with the varying states and corresponding iteratively determined actions and rewards in the network statistic pool to enable continuous training of the DNN.\n11. A non-transitory computer-readable medium that stores a set of instructions which when executed perform a method executed by the set of instructions comprising:\nreceiving a state of a network, the network comprising a plurality of edge clouds configured to provide a service to users;\nreceiving a predicted state-value function and a predicted action-value function;\ndetermining an action to perform based on the state, the predicted state-value function, and the predicted action-value function, the action comprising one of maintaining the service for a user at a source edge cloud or migrating the service for the user from the source edge cloud to a target edge cloud;\nperforming the action;\nreceiving a reward indicating a success of the action performed;\nstoring data associated with the state, the action, and the reward in a network statistic pool;\niteratively determining actions to perform and receive rewards indicating successes of the actions performed based on varying states of the network received over a period of time to optimize a service migration policy for the network; and\nwherein, in response to the action comprising migration of the service for the user from the source edge cloud to the target edge cloud, receiving the reward indicating the success of the action comprises receiving a scalar value representing a Quality of Service (QoS) as perceived by the user less a data transferring cost and a cost function associated with transferring time for the migration.\n12. The non-transitory computer-readable medium of claim 11, wherein receiving the predicted state-value function and the predicted action-value function comprises receiving the predicted state-value function and the predicted action-value function as output from a Deep Neural Network (DNN), the DNN trained with data stored in the network statistic pool.\n13. The non-transitory computer-readable medium of claim 11, wherein determining the action to perform based on the state, the predicted state-value function, and the predicted action-value function comprises:\nproviding the state, the predicted state-value function, and the predicted action-value function as input to a policy determination function; and\nreceiving the action as output from the policy determination function.\n14. The non-transitory computer-readable medium of claim 11, wherein, in response to the action comprising maintenance of the service for the user at the source edge cloud, receiving the reward indicating the success of the action comprises receiving a scalar value representing a Quality of Service (QoS) as perceived by the user."
}