{
    "patent_link": "https://patents.google.com/patent/US5991443A/en",
    "patent_id": "US5991443A",
    "title": "Graphics image manipulation",
    "abstract": "In an image source for multimedia applications such as networked computer games, a graphics engine (16) generates pixel images one line at a time using a scan-line algorithm and supplies the generated scan lines to an encoder (18) where they are buffered. The encoder codes the buffered pixel data as macroblocks of, for example 16×16 pixels according to MPEG or similar standards. When the graphics engine has sent sufficient scan lines for a first macroblock to the encoder, it sends a signal (FLAG) on receipt of which the encoder begins coding the pixel data as a macroblock in a line of macroblocks whilst continuing to receive scan lines from the graphics engine (16). To increase encoder efficiency, the graphics engine specifies to the encoder global (GMV) and macroblock (BMV) motion vectors for substantially all or selected ones of the macroblocks of an image respectively. Completed coded macroblock lines may be sent to a remote user over a data network, with user commands for modifing the composition of subsequent image frames being received on a back-channel (26) of the network.",
    "inventors": [
        "Richard D. Gallery",
        "Octavius J. Morris",
        "Edward S. Eilley",
        "David E. Penna"
    ],
    "assignee": "US Philips Corp",
    "classifications": [
        "H04N19/00",
        "A63F13/12",
        "A63F13/30",
        "A63F13/52",
        "H04N19/527",
        "H04N7/17318"
    ],
    "claims": "\n1. Encoded image generation apparatus comprising:\na graphics image generator operable to generate pixel image frames:\nand an encoder coupled to the graphics, image generator and arranged to encode each generated image frame as a series of macroblocks of pixel data, each of said macroblocks being m pixels wide by n pixels high, where m and n are integers; and\nwherein said graphics image generator is configured to generate an image frame as successive areas of pixels, to pass pixel data for said areas to said encoder, and to send a control signal to said encoder as soon as pixel data for n lines of a macroblock have been passed; and\nsaid encoder is configured to receive and buffer said pixel data and, on receipt of said control signal, to begin to encode a macroblock in a line of macroblocks of said buffered pixel data.\n2. Apparatus as claimed in claim 1, wherein said graphics image generator is configured to generate an image frame as successive lines of pixel data, to pass said lines to said encoder, and to send said control signal to said encoder every n lines; and said encoder is configured to receive and buffer said lines and, on receipt of said control signal, to encode said buffered lines of pixel data as a macroblock in a line of macroblocks.\n3. Apparatus as claimed in claim 2, wherein said graphics image generator implements a scan line algorithm in the generation of said lines of pixel data, said graphics image generator including a memory holding data defining image primitives and means for determining, and storing a list of, those of said image primitives which are active for a given pixel line.\n4. Apparatus as claimed in claim 1, wherein said encoder is arranged to code said macroblocks of pixel data in terms of a motion vector, and to perform a comparison search with respect to a current macroblock and the preceding image frame to determine a motion vector for a current macroblock.\n5. Apparatus as claimed in claim 4, wherein said graphics image generator is arranged to output to said encoder a global motion vector for an image frame and said encoder begins said comparison search for each macroblock of that image frame from said global motion vector.\n6. Apparatus as claimed in claim 4, wherein said graphics image generator is arranged to output to said encoder a block motion vector for an identified one or a group of macroblocks of an image, and said encoder begins said comparison search for that identified macroblock, or each of said group of macroblocks, from said block motion vector.\n7. Apparatus as claimed in claim 1, further comprising an input for user command signals, in response to which command signals said graphics image generator changes at least a part of an image in a given image frame in one or more successive further image frames.\n8. Apparatus as claimed in claim 1, wherein said encoder is operable to encode said generated images as I-frames or P-frames according to MPEG standards.\n9. A video signal distribution system comprised of a video server together with one or more user terminals connected thereto by a data transmission network, wherein the or each of said user terminals comprises a decoder and display device operable to display generated pixel images, and user input means operable to generate and send user command signals to said video server, said video server comprising:\na graphics image generator operable to generate and output data defining pixel images as successive areas of pixels and configured to output a control signal as soon as pixel data for n lines of a macroblock of an image have been output;\nan encoder coupled to receive and buffer said pixel data and to receive said control signal from said graphics image generator, and being arranged to encode said pixel data as a series of macroblocks of pixel data, each of said macroblocks being m pixels wide by n pixels high, where m and n are integers, and to output said encoded pixel data to said one or more user terminals via said data transmission network; and\nan input coupled to receive said user command signals from said data transmission network and arranged to supply them to said graphics image generator; wherein said graphics image generator is arranged to change at least a part of an image in a given image frame in one or more successive further image frames, and said encoder is configured to begin to encode a macroblock in a line of macroblocks of said buffered pixel data on receipt of said control signal.\n10. A system as claimed in claim 9, wherein said graphics image generator is configured to generate images as successive lines of pixel data, to pass said lines to said encode, and to send said control signal to said encoder every n lines; and said encoder is configured to receive and buffer said lines and, on receipt of said control signal, to begin to encode said buffered lines of pixel data as a macroblock in a line of macroblocks.\n11. A system as claimed in claim 10, wherein said graphics image generator implements a scan line algorithm in the generation of said lines of pixel data, said graphics image generator including a memory holding data defining image primitives and means for determining, and storing a list of, those of said image primitives which are active for a given pixel line.\n12. A system as claimed in claim 9, wherein said encoder is arranged to code said macroblocks of pixel data in terms of a motion vector, and to perform a comparison search with respect to a current macroblock and the preceding image frame to determine a motion vector for a current macroblock.\n13. A system as claimed in claim 12, wherein said graphics image generator is arranged to output to said encoder a global motion vector for an image and said encoder begins said comparison search for each macroblock of that image from said global motion vector.\n14. A system as claimed in claim 12, wherein said graphics image generator is arranged to output to said encoder a block motion vector for an identified one or a group of macroblocks of an image, and said encoder begins said comparison search for that identified macroblock, or each of said group of macroblocks, from said block motion vector.\n15. A system as claimed in claim 9, further comprising an input for user command signals, in response to which signals said graphics image generator changes at least a part of an image in a given image frame in one or more successive further image frames.\n16. A system as claimed in claim 9, wherein said encoder is operable to encode said generated images as I-frames or P-frames according to MPEG standards.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US5241401A",
        "US5265180A",
        "US5333012A",
        "US5535288A",
        "US5570133A",
        "US5627581A",
        "US5644660A",
        "US5703966A"
    ],
    "citations_ftf": [
        "ES2099086T3",
        "ZA943336B",
        "US5659691A"
    ],
    "citedby_own": [
        "WO2002058400A2",
        "US20020120368A1",
        "GB2388506A",
        "US20030214506A1",
        "US20050212806A1",
        "US20080043643A1",
        "US20080159638A1",
        "US20080267069A1",
        "US20090083653A1",
        "US20100067798A1",
        "US8147339B1",
        "US20130132510A1",
        "US8506402B2",
        "US8520961B2",
        "US8532412B2",
        "US8560331B1",
        "US8613673B2",
        "US8771064B2",
        "US8840476B2",
        "US8888592B1",
        "US8926435B2",
        "US8968087B1",
        "US20150215366A1",
        "US20160286228A1",
        "US9878240B2"
    ],
    "citedby_ftf": [
        "WO1999060498A1",
        "US20060230428A1",
        "US9061206B2",
        "US8284842B2",
        "US8074248B2",
        "US9042454B2",
        "US9826197B2",
        "EP2382756B1",
        "FR2940690B1",
        "FR2940703B1",
        "FR2940689B1",
        "JP5866125B2",
        "KR102287971B1",
        "EP2695388B1",
        "WO2013106390A1",
        "US9123084B2",
        "WO2014145921A1",
        "US9219922B2"
    ]
}