{
    "patent_link": "https://patents.google.com/patent/US3810104A/en",
    "patent_id": "US3810104A",
    "title": "Programmable magnetics for a numerical control system",
    "abstract": "A programmable controller connects to a numerical control system to operate the magnetics on a machine tool. An interface circuit which includes a programmable decoder connects to receive auxiliary command words generated by the numerical control and selectively set addressable storage elements. The programmable controller operates under the direction of a control program, to read the condition of the addressable storage elements, to read the condition of devices on the machine tool, and in response to these conditions operate output devices on the machine tool. A first embodiment of the invention includes a separate read only memory which performs the decoding function and a second embodiment uses a portion of the controller memory to perform this function.",
    "inventors": [
        "T Markley"
    ],
    "assignee": "Allen Bradley Co LLC",
    "classifications": [],
    "claims": "\n1. A programmable logic circuit for controlling auxiliary functions on a machine tool, the combination comprising: an interface circuit connected to a numerical control system to receive and decode auxiliary command words generated by the numerical control system and to selectively generate in response thereto STATE logic signals; an addressable storage bank containing a plurality of storage elements connected to receive and store STATE logic signals generated by the interface circuit; and a programmable controller connected to selectively address the storage elements in said addressable storage bank and programmed to read the condition of any such storage element and control the auxiliary functions on the machine tool.\n2. The circuit as recited in claim 1 in which said interface circuit includes a programmable decoder connected to receive and identify the auxiliary command words.\n3. The circuit as recited in claim 2 in which said programmable decoder includes a memory which is programmed to receive auxiliary command words at a set of input terminals and in response to each, generate a digital output signal which indicates the address of a selected storage element in said addressable storage bank.\n4. The circuit as recited in claim 3 in which said programmable decoder includes a decoder circuit connected to receive the digital output signals generated by said memory, and in response to each, generate a STATE logic signal to the addressed storage element.\n5. The circuit as recited in claim 1 in which said programmable controller includes a memory containing a decoding program and a controller program, and in which said interface circuit includes an addressable multiplexer connected to the programmable controller and connected to receive and store the auxiliary command words.\n6. The circuit as recited in claim 5 in which the decoding program operates the programmable controller to examine each bit of an auxiliary command word stored in the addressable multiplexer and to thereby identify the auxiliary command word and generate a STATE logic signal to a preselected storage element in said addressable storage bank.\n7. A programmable logic circuit for coupling a programmable controller with a digital control system that generates digital command words, the combination comprising: an addressable multiplexer connected to receive and store said digital command words, said addressable multiplexer being operable in response to instructions generated by said programmable controller to read out said stored digital command words to said conroller; and An addressable storage bank connected to said programmable controller, said addressable storage bank including a plurality of storage elements which are selectively addressable by said programmable controller and which are responsive when addressed to either store a STATE logic signal generated by said programmable controller or read a stored STATE logic signal to said programmable controller; wherein said programmable controller includes a decoding program which decodes a digital command word stored in said addressable multiplexer by reading the condition of each bit thereof, and having identified said digital command word, to generate a state logic signal to one of said addressable storage elements.\n8. The circuit as recited in claim 7 wherein said decoding program is stored in a controller memory with a controller program, and in which an interface control circuit is connected to receive and store in a first control flip-flop a flag signal generated by said digital control system when a digital command word is generated to said addressable multiplexer, and in which said interface control circuit is responsive to said flag signal to generate an enable signal to the addressable multiplexer and the addressable storage bank.\n9. The circuit as recited in claim 8 in which a memory control circuit is connected to said controller memory, and said memory control circuit is operable to address and read out in sequence each instruction in both the decoding and controller programs stored in said memory.\n10. The circuit as recited in claim 9 which includes a memory reset bus connected to said memory control circuit and connected to a recycle gate in said interface control circuit. wherein a memory reset instruction is stored at the end of said decoding program and said recycle gate is responsive to the flag signal stored in said interface control circuit and to a digital signal which results when said memory reset instruction is read from the controller memory, to generate a digital signal on said memory reset bus which operates said memory circuit to reread the decoding program.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "GB1126891A",
        "US3536902A",
        "US3566362A",
        "US3566364A",
        "US3573445A",
        "US3686639A",
        "US3701113A",
        "US3719931A",
        "US3753243A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US3975622A",
        "US3997879A",
        "US4021783A",
        "DE2652706A1",
        "US4038533A",
        "US4050098A",
        "FR2346757A1",
        "DE2735258A1",
        "DE2743492A1",
        "US4095094A",
        "US4122519A",
        "US4138718A",
        "FR2399057A1",
        "US4149235A",
        "US4165534A",
        "US4176403A",
        "DE2950979A1",
        "US4215398A",
        "US4215396A",
        "US4215399A",
        "US4215395A",
        "US4215397A",
        "US4228495A",
        "US4247317A",
        "US4298928A",
        "US4314329A",
        "US4326263A",
        "US4742443A",
        "DE2954696C2",
        "US5908483A"
    ],
    "citedby_ftf": [
        "JPS6141402B2"
    ]
}