{
    "patent_link": "https://patents.google.com/patent/US5661820A/en",
    "patent_id": "US5661820A",
    "title": "Method and apparatus for detecting a desired behavior in digital image data",
    "abstract": "A method for detecting stellate lesions in digitized mammographic image data includes the steps of prestoring a plurality of reference images, calculating a plurality of features for each of the pixels of the reference images, and creating a binary decision tree from features of randomly sampled pixels from each of the reference images. Once the binary decision tree has been created, a plurality of features, preferably including an ALOE feature (analysis of local oriented edges), are calculated for each of the pixels of the digitized mammographic data. Each of these plurality of features of each pixel are input into the binary decision tree and a probability is determined, for each of the pixels, corresponding to the likelihood of the presence of a stellate lesion, to create a probability image. Finally, the probability image is spatially filtered to enforce local consensus among neighboring pixels and the spatially filtered image is output.",
    "inventors": [
        "W. Philip Kegelmeyer, Jr."
    ],
    "assignee": "Individual",
    "classifications": [
        "G06N5/01",
        "G06F18/24323"
    ],
    "claims": "\n1. An apparatus for detecting a desired behavior within digital image data of a plurality of pixels, comprising:\nstorage means for prestoring a plurality of reference images;\ncalculating means for calculating a plurality of features for each of a plurality of pixels for each of the reference images;\ncomputing means for creating a binary decision tree from calculated features of random samples of pixels from each of the reference images, said calculating means further calculating a plurality of features for each of the pixels of the digital image data;\ninput means for inputting each of the plurality of features of each pixel of the digital image data into the binary decision tree;\ndetermining means for determining a probability, corresponding to the likelihood of a presence of the desired behavior, for each of the pixels of the digital image data based upon binary decision tree results to create a probability image;\nfiltering means for spatial filtering the probability image to enforce local consensus among neighboring pixels within the probability image; and\noutput means for outputting the spatially filtered image, wherein at least one of the plurality of features for each of the pixels of the digital image data is calculated by a calculating means including,\naccessing means for accessing, for each of a plurality of pixels of the digital image data, digital image data of each pixel and pixels surrounding each of the plurality of pixels in predetermined window dimensions,\norientation means for computing edge orientation values of the accessed digital image data, for each of the plurality of pixels,\nhistogramming means for histogramming, for each of the plurality of pixels, the computed edge orientation values, and\ncomputing means for computing a standard deviation of each histogram to create a feature for identifying a probable presence of the desired behavior in each of the plurality of pixels in which the standard deviation of the orientation histogram indicates a characteristic degree of orientation heterogeneity.\n2. The apparatus of claim 1, wherein the filtering means comprises:\nthreshold means for thresholding each of the pixels of digital image data based upon each of the determined probabilities; and\nmedian filtering means for median filtering windows of pixels, each of the pixels being included in at least one window and each of the windows being of a predetermined size so as to include a plurality of pixels.\n3. The apparatus of claim 1, wherein the filtering means comprises:\nmean filtering means for mean filtering windows of pixels, based upon each of the determined probabilities, each of the pixels being included in at least one window and each of the windows being of a predetermined size so as to include a plurality of pixels; and\nthresholding means for thresholding each of the mean filtered pixels of digital image data to enforce the local consensus among neighboring pixels.\n4. The apparatus of claim 1, wherein the output means includes a display for displaying the spacially filtered image.\n5. The apparatus of claim 1, wherein the determining means determines a probability, for each of the pixels of the digital image data, corresponding to detection of an abnormality.\n6. The apparatus of claim 1, wherein the computing means further computes classification probabilities for terminal nodes of the binary decision tree based upon input of the features of each pixel of the references images through the binary decision tree.\n7. The apparatus of claim 1, wherein the digital image data is prestored data accessed by the accessing means.\n8. The apparatus of claim 1, further comprising input means for inputting the digital image data for subsequent calculation by the calculating means.\n9. The apparatus of claim 8, wherein the input means includes a keyboard.\n10. The apparatus of claim 8, wherein the input means includes a scanner for scanning an object to create the digital image data.\n11. The apparatus of claim 8, wherein the computing means further creates a feature for identifying a probable absence of the desired behavior in each of the plurality of pixels in which the standard deviation of the orientation histogram fails to indicate a characteristic degree of orientation heterogeneity.\n12. The apparatus of claim 1, wherein the output means includes a display.\n13. The apparatus of claim 1, wherein the output means includes a printer.\n14. The apparatus of claim 3, wherein the desired behavior is an abnormality.\n15. The apparatus of claim 14, wherein the abnormality is a stellate lesion and the digital image data is digitized mammographic image data.\n16. The apparatus of claim 1, wherein the orientation means includes an edge operator to compute edge orientation values.\n17. The apparatus of claim 16, wherein the edge operator is a Sobel edge operator which computes an arc-tangent of a ratio of vertical and horizontal derivatives.\n18. The apparatus of claim 1, wherein at least one of the features calculated by the calculating means is a Laws texture feature.\n19. The apparatus of claim 1, further comprising\nsampling means for sampling, randomly, a plurality of pixels and for outputting the calculated features of the randomly sampled pixels to the computing means for creation of the binary decision tree.\n20. The apparatus of claim 19, wherein at least one of the features calculated by the feature calculating means is a Laws texture feature.\n21. A method for detecting a desired behavior within digital image data of a plurality of pixels, the method comprising the steps of:\n(a) prestoring a plurality of reference images;\n(b) calculating a plurality of features for each of a plurality of pixels for each of the reference images;\n(c) creating a binary decision tree from calculated features of random samples of pixels from each of the reference images;\n(d) calculating a plurality of features for each of the pixels of the digital image data;\n(e) inputting each of the plurality of features of each pixel of digital image data into the binary decision tree;\n(f) determining a probability, corresponding to the likelihood of a presence of the desired behavior, for each of the pixels of the digital image data based upon binary decision tree results to create a probability image;\n(g) spatial filtering the probability image to enforce local consensus among neighboring pixels within the probability image; and\n(h) outputting the spatially filtered image, wherein at least one of the plurality of features for each of the pixels of the digital image data is calculated, in at least one of steps (b) and (d), by the substeps of,\n(i) accessing, for each of a plurality of pixels of the digital image data, digital image data of each pixel and pixels surrounding each of the plurality of pixels in predetermined window dimensions,\n(ii) computing edge orientation values of the accessed digital image data, for each of the plurality of pixels,\n(iii) histogramming, for each of the plurality of pixels, the computed edge orientation value, and\n(iv) computing a standard deviation of each histogram to create a feature for identifying a probable presence of the desired behavior in each of the plurality of pixels in which the standard deviation of the orientation histogram indicates a characteristic degree of orientation heterogeneity.\n22. The method of claim 21, wherein step (g) comprises the substeps of:\n(i) thresholding each of the pixels of digital image data based upon each of the determined probabilities; and\n(ii) median filtering windows of pixels, each of the pixels being included in at least one window and each of the windows being of a predetermined size so as to include a plurality of pixels.\n23. The method of claim 21, wherein step (g) comprises the substeps of:\n(i) mean filtering windows of pixels, based upon each of the determined probabilities, each of the pixels being included in at least one window and each of the windows being of a predetermined size so as to include a plurality of pixels; and\n(ii) thresholding each of the mean filtered pixels of digital image data to enforce the local consensus among neighboring pixels.\n24. The method of claim 21, wherein step (h) of outputting includes displaying the spacially filtered image.\n25. The method of claim 21, wherein step (f) determines a probability, for each of the pixels of the digital image data, corresponding to detection of an abnormality.\n26. The method of claim 21, further comprising the step of:\ncomputing classification probabilities for terminal nodes of the created binary decision tree of step (c), based upon input of the features of each pixel of the reference images through the binary decision tree.\n27. The method of claim 21, wherein the digital image data is accessed prestored data.\n28. The method of claim 21, further comprising the substep of:\ninputting the digital image data for subsequent calculation.\n29. The method of claim 28, wherein the substep of inputting is done through a keyboard.\n30. The method of claim 28, wherein the substep of inputting includes the further substep of scanning an object to create the digital image data.\n31. The method of claim 28, wherein the computing step further creates a feature for identifying a probable absence of the desired behavior in each of the plurality of pixels in which the standard deviation of the orientation histogram fails to indicate a characteristic degree of orientation heterogeneity.\n32. The method of claim 21, wherein the output step (h) includes displaying.\n33. The method of claim 21, wherein the output step (h) includes printing.\n34. The method of claim 21, wherein the desired behavior is an abnormality.\n35. The method of claim 34, wherein the abnormality is a stellate lesion and the digital image data is digitized mammographic image data.\n36. The method of claim 21, wherein the substep (ii) of at least one of steps (b) and (d) includes computing edge orientation values with an edge operator.\n37. The method of claim 36, wherein the substep (ii) of at least one of steps (b) and (d) includes computing an arc-tangent of a ratio of vertical and horizontal derivatives with the edge operator which is a Sobel edge operator.\n38. The method of claim 21, wherein at least one of the features calculated in at least one of steps (b) and (d) is a Laws texture feature.\n39. The method of claim 21, further comprising the steps of:\nsampling, randomly, a plurality of pixels of each of the reference images; and\noutputting a plurality of features for each of the sampled pixels for creation of the binary decision tree in step (c).\n40. The method of claim 39, wherein at least one of the features calculated in at least one of steps (b) and (d) is a Laws texture feature.\n41. An apparatus for detecting a desired behavior within digital image data of a plurality of pixels, comprising:\nstorage means for prestoring a plurality of reference images;\ncalculating means for calculating a plurality of features for each of a plurality of pixels for each of the reference images;\ncomputing means for creating a binary decision tree from calculated features of random samples of pixels from each of the reference images, said calculating means further calculating a plurality of features for each of the pixels of the digital image data;\ninput means for inputting each of the plurality of features of each pixel of the digital image data into the binary decision tree;\ndetermining means for determining a probability, corresponding to the likelihood of a presence of the desired behavior, for each of the pixels of the digital image data based upon binary decision tree results, to create a probability image;\nfiltering means for spatial filtering the probability image to enforce local consensus among neighboring pixels within the probability image; and\noutput means for outputting the spatially filtered image, wherein at least one of the plurality of features for each of the pixels of the digital image data is calculated by a calculating means including,\naccessing means for accessing, for each of a plurality of pixels of the digital image data, digital image data of each pixel and pixels surrounding each of the plurality of pixels in predetermined window dimensions,\norientation means for computing edge orientation values of the accessed digital image data, for each of the plurality of pixels,\nhistogramming means for histogramming, for each of the plurality of pixels, the computed edge orientation values, and\ndetecting means for detecting a probable presence of the desired behavior in each of the plurality of pixels for which the orientation histogram indicates a characteristic degree of orientation heterogeneity.\n42. The apparatus of claim 41, wherein the detecting means further is for detecting an absence of the desired behavior in each of the plurality of pixels for which the orientation histogram fails to indicate a characteristic degree of orientation heterogeneity.\n43. The apparatus of claim 42, further comprising:\nindicating means for indicating, for each of the plurality of pixels, the detected probable presence or absence of the desired behavior.\n44. A method for detecting a desired behavior within digital image data of a plurality of pixels, the method comprising the steps of:\n(a) prestoring a plurality of reference images;\n(b) calculating a plurality of features for each of a plurality of pixels for each of the reference images;\n(c) creating a binary decision tree from calculated features of random samples of pixels of each of the reference images;\n(d) calculating a plurality of features for each of the pixels of the digital image data;\n(e) inputting each of the plurality of features of each pixel of digital image data into the binary decision tree;\n(f) determining a probability, corresponding to the likelihood of a presence of the desired behavior, for each of the pixels of the digital image data based upon binary decision tree results to create a probability image;\n(g) spatial filtering the probability image to enforce local consensus among neighboring pixels within the probability image; and\n(h) outputting the spatially filtered image, wherein at least one of the plurality of features for each of the pixels of the digital image data is calculated, in at least one of steps (b) and (d), by the substeps of,\n(i) accessing, for each of a plurality of pixels of the digital image data, digital image data of each pixel and pixels surrounding each of the plurality of pixels in predetermined window dimensions,\n(ii) computing edge orientation values of the accessed digital image data, for each of the plurality of pixels,\n(iii) histogramming, for each of the plurality of pixels, the computed edge orientation values; and\n(iv) detecting a probable presence of the desired behavior in each of the plurality of pixels for which the orientation histogram indicates a characteristic degree of orientation heterogeneity.\n45. The method of claim 44, wherein the identifying substep step (iv) further includes detecting an absence of the desired behavior in each of the plurality of pixels for which the orientation histogram fails to indicate a characteristic degree of orientation heterogeneity.\n46. The method of claim 44, further comprising the substep of:\n(v) indicating, for each of the plurality of pixels, the detected probable presence or absence of the desired behavior.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4340911A",
        "US4376932A",
        "US4798215A",
        "US4875478A",
        "US4905150A",
        "US4907156A",
        "US4961231A",
        "US4961425A",
        "US5078142A",
        "US5133020A",
        "US5263097A",
        "US5394484A"
    ],
    "citations_ftf": [
        "US5343390A",
        "US5319549A"
    ],
    "citedby_own": [
        "US5930392A",
        "US6091841A",
        "US6101275A",
        "US6137898A",
        "US6173076B1",
        "US6335979B1",
        "US6404908B1",
        "US6477262B2",
        "US20030072484A1",
        "US20030088825A1",
        "US6574357B2",
        "US20040013306A1",
        "US6757415B1",
        "US6757412B1",
        "WO2005078635A1",
        "US6970587B1",
        "US20060100939A1",
        "US20060098844A1",
        "US20060110044A1",
        "US7130866B2",
        "US20070174280A1",
        "US7298877B1",
        "US7308126B2",
        "US7383237B2",
        "US20080240504A1"
    ],
    "citedby_ftf": [
        "AU723079B2",
        "US5799100A",
        "US6397200B1",
        "US6711283B1",
        "US7738688B2",
        "US7668362B2",
        "US7518652B2",
        "US7088474B2",
        "US7116440B2",
        "US7257268B2",
        "US7463761B2",
        "JP5336088B2",
        "US8164622B2",
        "US7801348B2",
        "US7738683B2",
        "US8010555B2",
        "WO2008005868A2",
        "US8131035B2",
        "WO2008137667A1",
        "EP2249702A4",
        "WO2010048584A2",
        "WO2011072211A2",
        "US8625897B2",
        "US8918771B2",
        "US9443633B2",
        "US9384422B2"
    ]
}