{
    "patent_id": "US-11711388-B2",
    "title": "Automated detection of malware using trained neural network-based file classifiers and machine learning ",
    "assignee": "SparkCognition, Inc.",
    "publication_date": "2023-07-25",
    "patent_link": "https://patents.google.com/patent/US11711388B2/en",
    "inventors": [
        "Lucas McLane",
        "Jarred CAPELLMAN"
    ],
    "classifications": [
        "H04L63/1425",
        "G06F21/55",
        "G06F21/563",
        "G06F21/564",
        "G06N3/045",
        "G06N3/084",
        "H04L63/1416",
        "G06N20/20",
        "G06N5/01"
    ],
    "abstract": "Automated malware detection for application file packages using machine learning (e.g., trained neural network-based classifiers) is described. A particular method includes generating, at a first device, a first feature vector based on occurrences of character n-grams corresponding to a first subset of files of multiple files of an application file package. The method includes generating, at the first device, a second feature vector based on occurrences of attributes in a second subset of files of the multiple files. The method includes sending the first feature vector and the second feature vector from the first device to a second device as inputs to a file classifier. The method includes receiving, at the first device from the second device, classification data associated with the application file package based on the first feature vector and the second feature vector. The classification data indicates whether the application file package includes malware.",
    "claims": "\n1. A computing device comprising:\na memory configured to store instructions; and\na processor configured to execute the instructions from the memory to perform operations comprising:\nidentifying, among multiple files of a file package, a first plurality of files having a first file type, the file package including multiple files of two or more different file types;\nidentifying, among the multiple files of the file package, a second plurality of files having a second file type, wherein the second file type is distinct from the first file type;\ngenerating, based on the first file type, a first feature vector based on first features extracted from the first plurality of files;\ngenerating, based on the second file type, a second feature vector based on second features extracted from the second plurality of files, wherein the first features are distinct from the second features; and\ngenerating classification data associated with the file package, the classification data indicating whether the file package includes malware, wherein the classification data is generated based on the first feature vector and the second feature vector.\n2. The computing device of claim 1, wherein the first features correspond to character information associated with the first plurality of files, and wherein the second features correspond to an occurrence of attributes in the second plurality of files.\n3. The computing device of claim 1, wherein the first file type is an executable file type and the second file type is a non-executable file type.\n4. The computing device of claim 1, wherein the first feature vector is generated based on:\nzero-skip n-gram data indicating occurrences of adjacent characters in printable characters representing a first file of the first plurality of files;\nskip n-gram data indicating occurrences of non-adjacent characters in the printable characters representing the first file; and\nn-gram data indicating occurrences of groups of entropy indicators in a first set of entropy indicators derived from first file entropy data for the first file, each entropy indicator of the first set of entropy indicators having a value representing entropy of a corresponding chunk of the first file.\n5. The computing device of claim 1, wherein the second feature vector is based on occurrences of attributes in a second file of the second plurality of files.\n6. The computing device of claim 5, wherein the attributes include requests for system permissions indicated by the second file.\n7. The computing device of claim 6, wherein the second feature vector includes a Boolean vector indicating whether each system permission of a particular group of system permissions is requested by the second file.\n8. The computing device of claim 5, wherein the attributes include references to application programming interface (API) classes associated with an operating system executed by the processor, the references to the API classes indicated by the second file.\n9. The computing device of claim 1, wherein the second feature vector indicates that particular information is present in a second file of the second plurality of files.\n10. The computing device of claim 1, wherein the operations further comprise initiating performance of one or more malware protection operations based on the classification data indicating that the file package includes malware.\n11. The computing device of claim 1, wherein the file package corresponds to an application file package of a mobile device application.\n12. The computing device of claim 1, wherein the classification data is generated using a feed-forward neural network that includes at least one hidden layer.\n13. A method comprising:\nidentifying, among multiple files of a file package, a first plurality of files having a first file type, where the multiple files of the file package include two or more different file types;\nidentifying, among the multiple files of the file package, a second plurality of files having a second file type, wherein the second file type is distinct from the first file type;\ngenerating, based on the first file type, a first feature vector based on first features extracted from the first plurality of files;\ngenerating, based on the second file type, a second feature vector based on second features extracted from the second plurality of files, wherein the first features are distinct from the second features; and\ngenerating classification data associated with the file package, the classification data indicating whether the file package includes malware, wherein the classification data is generated based on the first feature vector and the second feature vector.\n14. The method of claim 13, wherein the first file type corresponds to an executable file type, and wherein the first feature vector is generated based on:\nzero-skip n-gram data for the first plurality of files, first zero-skip n-gram data of the zero-skip n-gram data indicating occurrences of adjacent characters in printable characters representing a first file of the first plurality of files;\nskip n-gram data for the first plurality of files, first skip n-gram data of the skip n-gram data indicating occurrences of non-adjacent characters in the printable characters representing the first file; and\nn-gram data for the first plurality of files, first n-gram data of the n-gram data indicating occurrences of groups of entropy indicators in a first set of entropy indicators derived from first file entropy data for the first file, each entropy indicator of the first set of entropy indicators having a value representing entropy of a corresponding chunk of the first file.\n15. The method of claim 13, further comprising combining the first feature vector and the second feature vector to generate a combined feature vector, wherein the classification data is generated based on the combined feature vector.\n16. The method of claim 13, wherein the second feature vector is based on occurrences of attributes in the second plurality of files.\n17. The method of claim 13, further comprising:\nprocessing the first plurality of files to generate printable characters representing the first plurality of files; and\nprocessing the printable characters to generate zero-skip n-gram data and skip n-gram data.\n18. The method of claim 17, further comprising applying a hash function to the skip n-gram data to generate a reduced skip n-gram representation, and wherein the first feature vector includes a Boolean vector indicating occurrences of skip n-grams in the reduced skip n-gram representation.\n19. A computer-readable storage device storing instructions that, when executed, cause a computer to perform operations comprising:\nidentifying, among multiple files, a first plurality of files having a first file type, where the multiple files include two or more different file types;\nidentifying, among the multiple files, a second plurality of files including a second plurality of files having a second file type, wherein the second file type is distinct from the first file type;\ngenerating, based on the first file type, a first feature vector based on first features extracted from the first plurality of files;\ngenerating, based on the second file type, a second feature vector based on second features extracted from the second plurality of files, wherein the first features are distinct from the second features; and\ngenerating classification data associated with the multiple files, the classification data indicating whether the multiple files includes malware, wherein the classification data is generated based on the first feature vector and the second feature vector.\n20. The computer-readable storage device of claim 19, wherein the classification data associated with the multiple files is further based on the second feature vector wherein the first features correspond to entropy information associated with the first plurality of files, and wherein the second features correspond to an occurrence of attributes in the second plurality of files.",
    "status": "Active",
    "citations_own": [
        "US5724593A",
        "US6006221A",
        "US6144934A",
        "US6167398A",
        "US6311183B1",
        "US20020103783A1",
        "US6460050B1",
        "US20030023866A1",
        "US20030070088A1",
        "US20030074183A1",
        "US6578032B1",
        "US20040073810A1",
        "US20040128355A1",
        "US20060015326A1",
        "US20060018541A1",
        "US20060037080A1",
        "US20060100852A1",
        "US20070028302A1",
        "US20070230787A1",
        "US7296030B2",
        "US7305385B1",
        "US20080027934A1",
        "US20080120720A1",
        "US20080184367A1",
        "US20080201779A1",
        "US20080263669A1",
        "US20090150308A1",
        "US20090172815A1",
        "US20090193293A1",
        "US20100169244A1",
        "US20100192222A1",
        "US7873947B1",
        "US20110044499A1",
        "US20110099635A1",
        "US20110179491A1",
        "US20120084859A1",
        "US20120155767A1",
        "US20120159620A1",
        "US20120159631A1",
        "US8230510B1",
        "US8233726B1",
        "US20120210423A1",
        "US8260914B1",
        "US20120240236A1",
        "US20120239379A1",
        "US20120260342A1",
        "US20120317644A1",
        "US8347386B2",
        "US8375450B1",
        "US8401982B1",
        "US20130110501A1",
        "US20130139261A1",
        "US20130191915A1",
        "US20130198119A1",
        "US20130227683A1",
        "US20130253910A1",
        "US20130282645A1",
        "US20130326625A1",
        "US8631330B1",
        "US20140019486A1",
        "US20140090061A1",
        "US8726391B1",
        "US8789172B2",
        "US8813222B1",
        "US8826439B1",
        "US20140283065A1",
        "US20140279763A1",
        "US20140298461A1",
        "US20150033341A1",
        "US20150052601A1",
        "US20150106931A1",
        "US20150170649A1",
        "US20150193695A1",
        "US20150248556A1",
        "US9224067B1",
        "US20150379426A1",
        "US20160065534A1",
        "US9280747B1",
        "US20160099967A1",
        "US20160127397A1",
        "US20160151918A1",
        "US9407653B2",
        "US20160241574A1",
        "US20160255107A1",
        "US20160292276A1",
        "US20160335435A1",
        "US20160378984A1",
        "US20170004306A1",
        "US20170032279A1",
        "US20170085585A1",
        "US20170083825A1",
        "US20170111515A1",
        "US9646158B1",
        "US20170134397A1",
        "US9652616B1",
        "US20170142140A1",
        "US9667653B2",
        "US9690938B1",
        "US9705904B1",
        "US20170208085A1",
        "US20170208084A1",
        "US20170262633A1",
        "US20170300632A1",
        "US9864956B1",
        "US20180012142A1",
        "US20180046938A1",
        "US20180048578A1",
        "US20180052904A1",
        "US20180063169A1",
        "US20180124095A1",
        "US10007786B1",
        "US20180181752A1",
        "US10063572B2",
        "US10075453B2",
        "US20180288077A1",
        "US10127382B2",
        "US20190007433A1",
        "US10193902B1",
        "US10685293B1",
        "US11556648B2"
    ],
    "citations_ftf": [
        "US9292668B1"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US10305923B2",
        "US20190317480A1",
        "US10841333B2",
        "CN111386526A",
        "US10984101B2",
        "US11727112B2",
        "JP7195796B2",
        "US11641406B2",
        "US11070632B2",
        "US11010472B1",
        "US11244050B2",
        "CN109858251B",
        "US11392689B2",
        "US11258805B2",
        "KR102046748B1",
        "US10990565B2",
        "US10817475B1",
        "US10963437B2",
        "US11138154B2",
        "US10733158B1",
        "US11714905B2",
        "US11216614B2",
        "US10706323B1",
        "US11461673B2",
        "US11270000B1",
        "US11250131B2",
        "GB202020440D0",
        "US11785024B2",
        "US20220358289A1",
        "US20230259620A1",
        "US11792162B1"
    ]
}