{
    "patent_id": "US-7333970-B2",
    "title": "Inference machine ",
    "assignee": "Ontoprise Gmbh",
    "publication_date": "2008-02-19",
    "patent_link": "https://patents.google.com/patent/US7333970B2/en",
    "inventors": [
        "Jurgen Angele"
    ],
    "classifications": [],
    "abstract": "The invention relates to an inference machine which is used to answer questions relating to predetermined data with the aid of an ontology, which is used to structure data, and a declarative system of rules, which reproduces additional knowledge. During the evaluation of a query, inference protocols, relating to the instantiation of the regulations which appear during evaluation, are read in an evaluation unit associated with the inference unit. Explanations relating to the evaluation of the rules are generated in the evaluation unit according to the inference protocols. A logical derivation of the answer becomes transparent. The system can answer technical questions and can carry out and explain technical considerations.",
    "claims": "\n1. A data processing system, comprising:\na) a database;\nb) a computer unit for generating an ontology comprising a class structure that defines the structure of data stored in said database, and a declarative system of rules,\nwherein the rules combine elements of the class structure and/or data;\nc) an input/output unit for inputting a query to retrieve data from said database and for outputting data responsive to the query; and\nd) a first inference unit in which the rules are evaluated for generating an answer to the query;\nwherein:\ne) the first inference unit is associated with an evaluation unit, which comprises a second inference unit;\nf) within the second inference unit an explanation of the answer to the query is generated by evaluating predefined explanation rules;\ng) inference protocols are read into the evaluation unit, which state, which rules were evaluated for answering the query, and which contain the facts, which were used for instantiation of the rules for answering the query; and\nh) the inference protocols form instances of the explanation rules.\n2. The data processing system as claimed in claim 1, wherein the explanation rules are expressed in F-Logic.\n3. The data processing system as claimed in claim 1, wherein one explanation is allocated to a plurality of rules.\n4. The data processing system as claimed in claim 3, wherein for generating an explanation for a predetermined number of rules, an explanation rule or a group of explanation rules is provided by means of which the rules are described summarily.\n5. The data processing system as claimed in claim 1, wherein a selection of various explanation possibilities is performed by means of explanation rules.\n6. The data processing system as claimed in claim 1, wherein the explanations are dependent on external data.\n7. The data processing system as claimed in claim 6, wherein the external data are structured by means of an ontology.\n8. The data processing system as claimed in claim 6, wherein the external data are formed by user profiles of the users performing the queries.\n9. The data processing system as claimed in claim 6, wherein the external data form instances for the explanation rules.\n10. A method for retrieving information from a database, comprising the following steps:\ngenerating an ontology which comprises a class structure that defines the structure of data in the database, and a declarative system of rules,\nwherein the rules combine elements of the class structure and/or data;\ninputting a query;\nevaluating the query in a first inference unit by evaluating the rules and generating an answer containing data from said database;\nwithin a second inference unit, in an evaluation unit allocated to the first inference unit, generating an explanation of the answer to the query by evaluating predefined explanation rules; and\nreading inference protocols into the evaluation unit, which state which rules were evaluated for answering the query, and which contain the facts which were used for instantiation of the rules for answering the query;\nwherein the inference protocols form instances of the explanation rules.\n11. A computer-readable medium containing computer program which, when run on a computer, executes the method claimed in claim 10.\n12. A data medium on which a data structure is stored which, after being loaded into a memory of a computer, executes the method claimed in claim 10.",
    "status": "Active",
    "citations_own": [
        "US4303911A",
        "US5398300A",
        "US5579441A",
        "US5974405A",
        "US6021403A",
        "US6421655B1",
        "US6631361B1",
        "US6963875B2",
        "US6976210B1"
    ],
    "citations_ftf": [
        "JP3560670B2",
        "DE10103845B4"
    ],
    "citedby_own": [
        "US20080033951A1",
        "US20080270117A1",
        "US20110202319A1"
    ],
    "citedby_ftf": [
        "US7013308B1",
        "US8666928B2",
        "DE102007004684A1",
        "DE102007033019B4",
        "US8838659B2",
        "DE202008017407U1",
        "US9805089B2",
        "US9672478B2",
        "US9110882B2",
        "US9785744B2",
        "WO2012058796A1",
        "CN102903008B",
        "CN105593879A",
        "US10430712B1",
        "EP3404558A1"
    ]
}