{
    "patent_link": "https://patents.google.com/patent/US20040244029A1/en",
    "patent_id": "US20040244029A1",
    "title": "Method of correlating advertising and recommender systems",
    "abstract": "Recommender system recommendations are analyzed to determine effects of online advertising to a group of subscribers interacting with the recommended. Conversely, online advertising campaigns are targeted based on observing a behavior of a recommender system, and mining discovered associations to optimize advertising parameters.",
    "inventors": [
        "John Gross"
    ],
    "assignee": "Individual",
    "classifications": [],
    "claims": "\n1. A method of measuring effects of advertising on a recommender system, which system is used for recommending items of interest to subscribers of an online content service provider, the method comprising the steps of:\n(a) measuring awareness of an item by the recommender system;\n(b) presenting advertising associated with the item to subscribers of the online content provider;\n(c) repeating step (a) to determine a change in awareness by the recommender system in response to the activities of step (b).\n2. The method of claim 1, wherein said awareness is measured by examining a frequency and/or probability that such item is recommended to a particular subscriber.\n3. The method of claim 1, further including a step (d): repeating steps (a) through (c) for a second online content service provider, and comparing a difference between a change in awareness by the online content service provider recommender system and a second recommender system used by said second online content service provider.\n4. The method of claim 3, further including a step (e): adjusting advertising to said second online content service provider and the online content service provider based on a learning rate for the item exhibited by their respective recommender systems.\n5. The method of claim 3, further including a step (e): adjusting advertising to said second online content service provider and the online content service provider based on a learning rate for subscriber changes in preferences exhibited by their respective recommender systems.\n6. A method of delivering advertising to a subscribers of an online content service provider, which online content service provider uses a recommender system for recommending items of interest to subscribers, the method comprising the steps of:\n(a) delivering advertising concerning a first item to the subscribers of the online content service provider;\n(b) measuring an awareness of a second item recommended by the recommender system to the subscribers of the online content service provider;\n(c) measuring an association exhibited by the recommender system between said first item and said second item, including a frequency and/or probability that said first item is also recommended to a subscriber when said first second item is recommended;\n(d) automatically adjusting said advertising delivered in step (a) associated with the first item to subscribers of the online content provider based on steps (b) and (c).\n7. The method of claim 6, wherein said advertising is provided under control of an entity separate from the online content service provider.\n8. The method of claim 6, wherein said advertising for the first item is reduced or eliminated in response to a determination that said second item and said first item are highly correlated.\n9. The method of claim 6, further including a step: measuring an awareness of said first item to determine if a change has occurred as a result of step (d).\n10. The method of claim 6, further including a step: identifying a learning rate for new items by the recommender system.\n11. The method of claim 6, further including a step: identifying a learning rate for new subscriber tastes by the recommender system.\n12. A method of delivering advertising to users of an online content service provider, which online content service provider uses a recommender system for recommending items of interest to users, the method comprising the steps of:\n(a) identifying a set of recommended items to be submitted to a user in response to a request for a recommendation on an item;\n(b) identifying whether any of said set of recommended items are associated with a preference to be given to one or more preferred items based on request provided by a third party;\n(c) altering said set of recommended items to be shown to said user and/or a presentation format of said set of recommended items based on the results of step (b).\n13. The method of claim 12, wherein said one or more preferred items are shown first to said user.\n14. The method of claim 12, wherein only said one or more preferred items are shown to said user.\n15. The method of claim 12, wherein said one or more preferred items are highlighted visually to said user compared to other of said set of recommended items.\n16. The method of claim 12, wherein at least some of said set of recommended items are removed prior to being shown to said user in response to a request for a recommendation.\n17. The method of claim 12, further including a step: identifying a learning rate for new items by the recommender system.\n18. The method of claim 12, further including a step: identifying a learning rate for new subscriber tastes by the recommender system.\n19. The method of claim 12, further including a step: operating a client device to identify any bias presented in set of recommendations actually shown to a user at a server device maintained by the online content service provider.\n20. The method of claim 12, further including a step: operating a client device to identify whether a recommender maintained by the online content service provider is accurately following a preference policy for recommendations specified by said third party.",
    "status": "Abandoned",
    "citations_own": [
        "US5671351A",
        "US5974396A",
        "US6006225A",
        "US6266649B1",
        "US6317722B1",
        "US6321221B1",
        "US6334127B1",
        "US20020055906A1",
        "US6412012B1",
        "US20020112249A1",
        "US20030088472A1",
        "US20030093338A1",
        "US20030110104A1",
        "US20030115149A1",
        "US6584450B1",
        "US6606619B2",
        "US6636585B2",
        "US6681211B1",
        "US20040054572A1",
        "US6766525B1",
        "US20040153389A1",
        "US6831663B2",
        "US20050015319A1",
        "US6904408B1",
        "US6963850B1",
        "US20060064304A1",
        "US7039631B1",
        "US7107238B2",
        "US7107227B1",
        "US7110954B2",
        "US7162432B2",
        "US7216085B1",
        "US7233927B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20080281674A1",
        "US20080294630A1",
        "US20080313040A1",
        "US20080313011A1",
        "US20090157605A1",
        "US20090164893A1",
        "US20090240572A1",
        "US20090319330A1",
        "US20100058430A1",
        "US20100070621A1",
        "US20100094849A1",
        "US20100179930A1",
        "US20110064221A1",
        "US20110087694A1",
        "US20120173324A1",
        "US20130159116A1",
        "US8656298B2",
        "US20150012359A1",
        "US9032451B2",
        "US20150245084A1",
        "US9600959B2",
        "US9754444B2",
        "US9767634B2",
        "US9788069B1",
        "US9800929B2",
        "US10003780B1",
        "US10055746B1",
        "US20190236647A1",
        "US10728603B2",
        "US10885570B2"
    ],
    "citedby_ftf": []
}