{
    "patent_id": "US-11610665-B2",
    "title": "Method and system for preference-driven food personalization ",
    "assignee": "Kraft Foods Group Brands Llc",
    "publication_date": "2023-03-21",
    "patent_link": "https://patents.google.com/patent/US11610665B2/en",
    "inventors": [
        "Tjarko Leifer",
        "Erik Andrejko",
        "Sivan Aldor-Noiman"
    ],
    "classifications": [
        "G16H10/60",
        "G16H20/60",
        "G06F16/335",
        "G06F16/90324",
        "G06F16/9035",
        "G06N20/10",
        "G06N3/045",
        "G06N3/08",
        "G06N3/084",
        "G06N3/088",
        "G06N5/04",
        "G06N20/20",
        "G06N5/01",
        "G06N5/025",
        "G06N7/01"
    ],
    "abstract": "A method for improving food-related personalized for a user including determining food-related preferences associated with a plurality of users to generate a user food preferences database; collecting dietary inputs from a subject matter expert (SME) at an SME interface associated with the user food preferences database; determining personalized food parameters for the user based on the user food-related preferences and the dietary inputs; receiving feedback associated with the personalized food parameters from the user; and updating the user food preferences database based on the feedback.",
    "claims": "\n1. A method for improving food-related personalization for a user comprising:\ndetermining user food-related preferences associated with the user;\nmapping the user food-related preferences to food parameters represented in a recipe vector space, comprising:\ninputting the user food-related preferences to a trained neural network model as input vectors, wherein the trained neural network model comprises a plurality of neuronal layers that each transform the input vector received from the preceding neuronal layer of the plurality of neuronal layers into an intermediate vector provided as an input vector to a subsequent neuronal layer,\nwherein the food parameters are represented by a vector in the recipe vector space equivalent to an intermediate vector transformed by at least one of the plurality of neuronal layers of a trained neural network;\ndetermining personalized parameters for the user based on the food parameters, wherein the personalized parameters comprise a set of recipe vectors represented in the recipe vector space, wherein the food-related preferences define a vector magnitude constraint, and wherein each of the recipe vectors in the set of recipe vectors defines a magnitude less than the vector magnitude constraint; and\ndetermining a recipe based on the personalized parameters.\n2. The method of claim 1, wherein the user food-related preferences comprise a health goal and wherein the health goal is inferred from supplementary data.\n3. The method of claim 2, wherein the supplementary data comprises data received from a third-party entity.\n4. The method of claim 1, wherein the user food-related preferences comprise natural language.\n5. The method of claim 1, further comprising determining dietary inputs from a subject matter expert (SME), wherein the personalized parameters for the user are determined based on the dietary inputs.\n6. The method of claim 5, wherein the dietary inputs are determined based on user analytics.\n7. The method of claim 6, wherein the user analytics comprise historic user selections of meal options.\n8. The method of claim 1, wherein the personalized food parameters comprise an alternative meal option that satisfies the user food-related preferences.\n9. The method of claim 8, further comprising determining the alternative meal option comprising:\ndetermining a subgroup of meal options sharing a food-related characteristic;\ncollecting a dietary input from a subject matter expert (SME) that selects a meal option from the subgroup as satisfying the user food-related preferences;\ngeneralizing the selection of the meal option to the other meal options in the subgroup as satisfying the user food-related preferences; and\ndetermining the alternative meal option from the subgroup.\n10. The method of claim 1, further comprising:\ntransmitting the recipe to the user;\ndetermining a response of the user to the recipe; and\nupdating the personalized parameters based on the response.\n11. The method of claim 10, wherein determining the response comprises receiving a score from the user; and wherein the personalized food parameters are updated based on the score.\n12. A system for improving food-related personalization for a user, comprising:\na remote computing system, wherein the remote computing system:\ndetermines user food-related preferences;\nmaps the user food-related preferences to food parameters represented in a recipe vector space by inputting the user food-related preferences to a trained neural network model as input vectors, wherein the trained neural network model comprises a plurality of neuronal layers that each transform the input vector received from the preceding neuronal layer of the plurality of neuronal layers into an intermediate vector provided as an input vector to a subsequent neuronal layer, wherein the food parameters are represented by a vector in the recipe vector space equivalent to an intermediate vector transformed by at least one of a plurality of neuronal layers of a trained neural network;\ndetermines personalized parameters for the user based on the food parameters, wherein the personalized parameters comprise a set of recipe vectors represented in the recipe vector space, wherein the food-related preferences define a vector magnitude constraint, and wherein each of the recipe vectors in the set of recipe vectors defines a magnitude less than the vector magnitude constraint; and\ndetermines a first recipe based on the personalized food parameters;\nwherein the remote computing system is communicatively coupled to a user device, wherein the user device:\ndetermines user information; and\nprovides the user information to the remote computing system.\n13. The system of claim 12, wherein the first recipe is determined by generating the first recipe.\n14. The system of claim 13, wherein generating the first recipe comprises processing the personalized parameters according to a recipe generation model.\n15. The system of claim 12, wherein the first recipe is associated with a first timestamp and the remote computing system further configured to determine a second recipe associated with a second timestamp wherein the second recipe represents a temporal change in user eating habits from the first recipe to the second recipe.\n16. The system of claim 12, wherein the user information comprises a first user action, and wherein determining user food-related preferences comprises inferring user food-related preferences based on the first user action.\n17. The system of claim 16, wherein the first user action comprises a user click.\n18. The system of claim 16, wherein the remote computing system is further configured to:\nsend the first recipe to the user device;\nreceive a second user action associated with the first recipe from the user device; and\nupdate the food parameters based on the second user action.\n19. The system of claim 12, wherein the user information comprises user selections and wherein the user food-related preferences are determined based on the user selections.\n20. The system of claim 12, wherein the user food-related preferences are determined by querying an API of a third-party health application to retrieve health-related metrics.",
    "status": "Active",
    "citations_own": [
        "US5212766A",
        "US6370513B1",
        "US20080086374A1",
        "WO2008091281A2",
        "US20090037288A1",
        "US20090075242A1",
        "US20090236333A1",
        "US20090254541A1",
        "US20110106740A1",
        "US8276505B2",
        "US8429026B1",
        "US20130224694A1",
        "US20130269297A1",
        "US20130280681A1",
        "US20140052722A1",
        "US8849805B2",
        "US20150066909A1",
        "US20150109451A1",
        "US20150170543A1",
        "US9129277B2",
        "US20150287056A1",
        "US20150290795A1",
        "US9212996B2",
        "US20160073886A1",
        "US20160081515A1",
        "US20160180739A1",
        "US20160232625A1",
        "US20160275397A1",
        "US20160350834A1",
        "US20170053551A1",
        "WO2017075498A1",
        "US20170316488A1",
        "US20170320655A1",
        "US20170372197A1",
        "US20180033074A1",
        "US20180137249A1",
        "KR20180060257A",
        "US20180203978A1",
        "US20180314804A1",
        "WO2018198100A1",
        "US20190050624A1",
        "US20190073581A1",
        "US20190147340A1",
        "US20190171707A1",
        "US20190197466A1",
        "US20190215424A1",
        "US20190228855A1",
        "US20190228856A1",
        "US20190236362A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20220207583A1"
    ],
    "citedby_ftf": [
        "US10720235B2",
        "US10776856B2",
        "US11182815B1",
        "FI20186037A1",
        "US11017688B1",
        "US11551803B1",
        "US11228810B1",
        "US11164478B2",
        "US10993465B2",
        "EP3772738A1",
        "US20210074392A1",
        "US11537685B2",
        "US11520677B1",
        "US11688504B2",
        "US11276129B2",
        "US11663683B2",
        "US11424019B2",
        "US11075001B1",
        "US10861076B1",
        "US10915818B1",
        "US11164069B1",
        "US11688506B2",
        "US10957424B1",
        "US11741689B2",
        "US11393572B2",
        "US10962473B1",
        "US11232259B1",
        "US11688507B2",
        "US11763928B2",
        "US20220246273A1",
        "US11514350B1",
        "EP4086913A1",
        "US11354722B1",
        "US11205101B1",
        "US20220383433A1",
        "US11348664B1",
        "US11404144B1",
        "US11373107B1"
    ]
}