{
    "patent_link": "https://patents.google.com/patent/US6591296B1/en",
    "patent_id": "US6591296B1",
    "title": "Remote notification of machine diagnostic information utilizing a unique email address identifying the sensor, the associated machine, and the associated machine condition",
    "abstract": "An email message is automatically generated when a sensor monitoring a machine detects a predetermined machine condition, such as a fault condition. When a predetermined condition is sensed, the sensor signals a local computer unit which, in turn, generates an email message that identifies the sensor, machine and site in the address of the email message. The email address for the sensor is included in the addressee line of the message. Accordingly, the addressor line of the message identifies the sensor that detected the machine condition, the machine on which the sensor is mounted and the plant location for the machine.",
    "inventors": [
        "George H. Ghanime"
    ],
    "assignee": "General Electric Co",
    "classifications": [
        "H04L12/54",
        "G06F11/0769",
        "G05B23/027",
        "G06F11/0748",
        "G05B2219/25222",
        "G05B2223/06"
    ],
    "claims": "\n1. A method for notifying a remote location of a machine condition using a local computer system and a remote computer system communicating with each other, wherein the method comprises:\n2. A method for notifying a remote location of a machine condition as in claim 1 further comprising the step of identifying the sensor in step (e) that detected the predetermined machine condition based on the email address of the received email message.\n3. A method for notifying a remote location of a machine condition as in claim 1 wherein the address of the sensor identifies the machine that the sensor is monitoring.\n4. A method for notifying a remote location of a machine condition as in claim 1 wherein the address of the sensor identifies a site at which the sensor is located.\n5. A method for notifying a remote location of a machine condition as in claim 1 wherein the address of the sensor includes a unique name identifying the sensor and machine being monitored by the sensor, and a domain name identifying a site at which the sensor and machine are located.\n6. A method for notifying a remote location of a machine condition as in claim 1 further comprising the step of storing a database correlating each email address of a sensor with information regarding the sensor.\n7. A method for notifying a remote location of a machine condition as in claim 1 further comprising the step of storing a database at the remote location, where the database correlates the email addresses of the sensors with information regarding the machine being monitored by the sensors.\n8. A method for notifying a remote location of a machine condition using a local computer system and a remote computer system communicating with each other, wherein the method comprises:",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4517468A",
        "US5819110A",
        "US5944787A",
        "US6065136A",
        "US6085244A",
        "US6108099A",
        "US6147601A",
        "US6298308B1"
    ],
    "citations_ftf": [
        "US5887216A",
        "JPH07297826A",
        "JPH10161880A",
        "JPH10187498A",
        "US6003070A",
        "JPH10320033A",
        "JP3480662B2",
        "JP3753523B2",
        "JPH11150769A",
        "JPH11252670A"
    ],
    "citedby_own": [
        "US20020010803A1",
        "US20020056015A1",
        "US20020059467A1",
        "US20020073356A1",
        "US20020128731A1",
        "US20020152290A1",
        "US20020184348A1",
        "US20030018394A1",
        "US20030046382A1",
        "US20030079012A1",
        "US20030098798A1",
        "US20030108354A1",
        "US20030110248A1",
        "US20030160811A1",
        "US20040059903A1",
        "US20040102873A1",
        "US6748341B2",
        "US20040117159A1",
        "US20040261531A1",
        "US6886039B1",
        "EP1533479A2",
        "US20050143958A1",
        "US20050143947A1",
        "US20050142415A1",
        "US20050151660A1",
        "US20050193270A1",
        "US20050246411A1",
        "US20050262209A1",
        "US20050262210A1",
        "US20050275556A1",
        "US7092992B1",
        "US20060211414A1",
        "US7206834B1",
        "US20080052027A1",
        "US20080071501A1",
        "US20080313006A1",
        "US20090009311A1",
        "US20090290767A1",
        "US20090292658A1",
        "US20090292928A1",
        "US20090292702A1",
        "US20090292713A1",
        "US7631044B2",
        "US20100005149A1",
        "US20100293493A1",
        "US20110072095A1",
        "US8239170B2",
        "US8311774B2",
        "US8429225B2",
        "US20130159267A1",
        "US20130283063A1",
        "US8620853B2",
        "US8660980B2",
        "US8963691B1",
        "US9113234B2",
        "US9250625B2",
        "US9256224B2",
        "US10295965B2"
    ],
    "citedby_ftf": [
        "SE0300054D0",
        "US7283914B2",
        "DE102005063080A1",
        "US7840332B2",
        "DE102007022006A1"
    ]
}