{
    "patent_id": "US-9349100-B2",
    "title": "Method for providing a prompt for real-time cognitive assistance ",
    "assignee": "International Business Machines Corporation",
    "publication_date": "2016-05-24",
    "patent_link": "https://patents.google.com/patent/US9349100B2/en",
    "inventors": [
        "James R. Kozloski",
        "Clifford A. Pickover",
        "Irina Rish"
    ],
    "classifications": [
        "G06N7/005",
        "G16H20/70",
        "G06F19/3481",
        "G06N20/00",
        "G06N7/01",
        "A61B5/0476",
        "A61B5/369",
        "A61B5/4088"
    ],
    "abstract": "Techniques for providing a prompt for real-time cognitive assistance. A method includes analyzing input from at least one environmental sensor to identify context information pertaining to a user situation, identifying a likely subsequent cognitive task of the user in the user situation based on the context information and use of a learned model, determining an action with respect to information to be suggested to the user via a corresponding prompt, wherein the determining is based on the likely subsequent cognitive task, the context information and information learned from at least one previous user situation, computing a confidence value to represent a level of certainty in the action, and providing the prompt to the user if the action has a confidence value greater than a threshold value corresponding to the action.",
    "claims": "\n1. A method for providing a prompt for real-time cognitive assistance, the method comprising:\nanalyzing input from at least one environmental sensor to identify context information pertaining to a user situation;\nforecasting a subsequent cognitive task of the user in the user situation based on the context information and use of a learned model;\ndetermining a combination of two or more words to be communicated by the user in anticipation of the user communicating said combination of two or more words, wherein the determining is based on the forecasted subsequent cognitive task, the context information and information learned from at least one previous user situation;\ncomputing a confidence value to represent a level of certainty in the combination of two or more words to be communicated by the user in connection with the forecasted subsequent cognitive task;\nupdating the confidence value at a specified interval until the confidence value reaches a threshold value; and\nproviding a prompt to the user, wherein said prompt contains the combination of two or more words to be communicated by the user, upon the confidence value reaching the threshold value;\nwherein at least one of the steps is carried out by a computer device.\n2. The method of claim 1, wherein the threshold value corresponding to the combination of two or more words to be communicated by the user is modified based on feedback pertaining to the combination of two or more words to be communicated by the user.\n3. The method of claim 1, further comprising:\nanalyzing user input to identify a cognitive state of the user.\n4. The method of claim 3, wherein the user input comprises brain wave activity or an electroencephalogram (EEG).\n5. The method of claim 3, wherein the user input comprises information from a stored user profile that specifies at least one aspect of the user.\n6. The method of claim 5, wherein the at least one aspect of the user includes a state of a user disease, nationality of the user, location of the user, language of the user, or employment of the user.\n7. The method of claim 1, wherein the input includes audio, video or text-based input.\n8. The method of claim 1, further comprising:\nanalyzing input provided by an individual to supplement identification of the user situation.\n9. The method of claim 8, wherein the individual comprises the user or an additional individual.\n10. The method of claim 1, further comprising:\nusing a learned model to identify a state of an environment involved in the user situation.\n11. The method of claim 1, wherein said forecasting comprises performing an analysis of at least one word combination or word association of the user.\n12. The method of claim 1, wherein said forecasting comprises analyzing at least one word combination used by at least one additional individual.\n13. The method of claim 1, wherein said forecasting comprises determining at least one set of words commonly used in a particular context.\n14. The method of claim 1, wherein said determining comprises incorporating input from at least one Internet source.\n15. The method of claim 1, wherein the confidence value can be indicated via a visual indicator, an audio indicator, a textual change, or a speech change.\n16. The method of claim 1, further comprising:\nimplementing machine-learning capability to learn from at least one previously observed situation and the user's past behavior to adapt the determining step to a user's cognitive tasks and environment.\n17. The method of claim 1, wherein the prompt is a speech output or a visual output.\n18. The method of claim 1, further comprising:\ngenerating a summary of the user situation and the context information; and\ndistributing the summary to a pre-configured set of individuals for feedback.\n19. The method of claim 1, further comprising:\nstoring the prompt in a database.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US6236968B1",
        "US6632174B1",
        "US20070214416A1",
        "US20080004926A1",
        "US20090287678A1",
        "US20100174533A1",
        "US20100188230A1",
        "US7881936B2",
        "US20110070835A1",
        "US7925525B2",
        "US20110258153A1",
        "US20110270117A1",
        "US20130138424A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20140236903A1",
        "US10235990B2",
        "US10318639B2",
        "US10373515B2",
        "US10659593B2",
        "US10740402B2",
        "US11341962B2",
        "US11429874B2",
        "US11544576B2",
        "US11562258B2",
        "US11568236B2"
    ],
    "citedby_ftf": [
        "US9208661B2",
        "JP5727980B2",
        "US20140229407A1",
        "US9711056B1",
        "US9743243B1",
        "US20170315825A1",
        "US11540757B2",
        "US20190216383A1",
        "US20190216406A1",
        "US10572591B2",
        "US11228613B2",
        "US10127825B1",
        "EP3682373A4",
        "US20190139428A1",
        "US20190188552A1",
        "US11633103B1",
        "US11120226B1",
        "US11631401B1",
        "US10602974B1",
        "US10909973B2",
        "JP7135887B2",
        "US11037428B2",
        "US11150923B2",
        "US11423583B2",
        "US11620855B2",
        "US11495211B2",
        "WO2022204570A1"
    ]
}