{
    "patent_link": "https://patents.google.com/patent/US6063028A/en",
    "patent_id": "US6063028A",
    "title": "Automated treatment selection method",
    "abstract": "A method useful for facilitating choosing a treatment or treatment regime and for predicting the outcome of a treatment for a disorder which is diagnosed and monitored by a physician or other appropriately trained and licensed professional, such as for example, a psychologist, based upon the symptoms experienced by a patient. Unipolar depression is an example of such a disorder, however the model may find use with other disorders and conditions wherein the patient response to treatment is variable. In the preferred embodiment, the method for predicting patient response includes the steps of performing at least one measurement of a symptom on a patient and measuring that symptom so as to derive a baseline patient profile, such as for example, determining the symptom profile with time; defining a set of a plurality of predictor variables which define the data of the baseline patient profile, wherein the set of predictor variables includes predictive symptoms and a set of treatment options; deriving a model that represents the relationship between patient response and the set of predictor variables; and utilizing the model to predict the response of said patient to a treatment. A neural net architecture is utilized to define a non-linear, second order model which is utilized to analyze the patient data and generate the predictive database from entered patient data.",
    "inventors": [
        "Joanne Sylvia Luciano"
    ],
    "assignee": "Advanced Biological Laboratories SA",
    "classifications": [
        "G16H50/50",
        "G16Z99/00",
        "G16H10/20",
        "G16H10/60",
        "G16H40/63",
        "G16H50/20",
        "G16H70/20"
    ],
    "claims": "\n1. A method for predicting a response of a patient to a selected treatment for unipolar depression from at least one pre-treatment clinical symptom, comprising:\na.) performing at least one measurement of said pre-treatment clinical symptom on said patient and measuring said pre-treatment clinical symptom which is a predictive symptom selected from the group consisting of predictive symptoms so as to derive data for a baseline patient profile;\nb.) defining a set of a plurality of predictor variables which define said data for said baseline patient profile, said set of predictor variables comprising said predictive symptoms and a set of treatment options;\nc.) deriving a model that represents a relationship between a response of a patient in a study and said set of predictor variables, said relationship derived through using at least one automated non-linear algorithm; and\nd.) utilizing said model of step c) to predict the response of said patient to the selected treatment.\n2. The method according to claim 1, wherein said model is a multilayer neural network, and wherein said at least one automated non-linear algorithm is a back propagation learning algorithm.\n3. The method according to claim 2, wherein said neural network has at least three layers and at least two hidden units.\n4. The method according to claim 1, wherein said relationship in step c) is determined via quadratic regression.\n5. The method according to claim 4, further comprising using a set of independent variables in said quadratic regression, said set of independent variables representing interactions between said predictive symptoms.\n6. The method according to claim 5, further comprising estimating said interactions between said predictive symptoms by multiplying at least a first measured severity for a first predictive symptom times a second measured severity for a second predictive symptom.\n7. The method according to claim 1, further comprising utilizing the model of step c) to rank the response to the treatment of at least one pre-treatment clinical symptom to indicate the predictive importance of said at least one pre-treatment clinical symptom.\n8. The method according to claim 7, wherein said model is a multilayer neural network utilizing a back propagation learning algorithm having three layers and two hidden units, and an output; and said influence of a predictive symptom is determined by summing a first product and a second product, said first product being a first weight from said predictive symptom to a first hidden unit multiplied by a second weight from said first hidden unit to said output, and\nsaid second product being a third weight from said predictive symptom to a second hidden unit multiplied by a fourth weight from said second hidden unit to said output.\n9. The method according to claim 1, wherein said predictive symptoms are selected from the group consisting of Mood, Work, and Energy.\n10. The method according to claim 1, wherein said predictive symptoms are selected from the group consisting of Mood, Overall Severity, and Middle and Late Sleep.\n11. The method according to claim 1, wherein said model of step c) is a neural network.\n12. A method of treating depression in a clinical patient comprising the following steps:\na.) defining a set of predictor variables which define a set of data of a baseline patient profile, said set of predictor variables comprising predictive symptoms and a set of treatment options;\nb.) developing a trained outcome prediction and an expected response for each treatment option of said set of treatment options, each said trained outcome prediction based upon an automated non-linear analysis of patient symptoms measured in at least one study over time in response to each said treatment option;\nc.) selecting a first preferred treatment from said set of treatment options based on said trained outcome prediction;\nd.) applying said first preferred treatment to said clinical patient to obtain a first response; and\ne.) monitoring said patient by comparing said first response of said clinical patient to said trained outcome prediction for said first preferred treatment to obtain a difference measurement which is used to provide an updated outcome prediction for said clinical patient.\n13. The method of claim 12 further including the step of selecting a second preferred treatment from said set of treatment options based on said updated outcome prediction when said first response deviates from said trained outcome prediction for said first selected treatment.\n14. A method of treating a disorder which is diagnosable and treated based upon a patient's symptom and for which a patient could have a variable response to treatment, comprising:\na.) developing an outcome prediction for a set of treatment options and an integrated expected recovery pattern for each treatment option in said set of treatment options, said outcome prediction and said integrated expected recovery pattern for each said treatment option based on computer analysis that utilizes a non-linear algorithm of known patient symptoms and recovery patterns;\nb.) selecting for said patient a first preferred treatment option from said set of treatment options;\nc.) generating a first expected recovery pattern associated with said first preferred treatment option, said first expected recovery pattern having a first expected recovery time period;\nd.) applying said first preferred treatment option to said patient;\ne.) monitoring said patient during said first expected recovery time period to develop a patient treatment response;\nf.) comparing said patient treatment response and said first expected recovery pattern; and\ng.) selecting a second preferred treatment option from said set of treatment options when said patient treatment response varies significantly from said first expected recovery pattern thereby defining a treatment intervention for said patient.\n15. The method according to claim 14, wherein the monitoring of step e.) comprises developing an individual patient recovery profile, and the comparing of step f.) and the selecting of step g.) comprise:\n1.) developing a difference between said individual patient recovery profile and said first expected recovery pattern;\n2.) determining whether said difference is within an acceptable range, indicating a normal patient recovery;\n1.) developing a difference between said individual patient recovery profile and said first expected recovery pattern;\n2.) determining whether said difference is within an acceptable range, indicating a normal patient recovery;\n3. ) determining whether said difference is outside said acceptable range indicating an unacceptable patient recovery pattern; and\n4.) selecting a second preferred treatment option from said set of treatment options when said difference is outside said acceptable range.\n4.) selecting a second preferred treatment option from said set of treatment options when said difference is outside said acceptable range.\n16. The method according to claim 14, wherein the monitoring comprises assessing said observed symptoms of said patient at various time intervals during said first expected recovery time period.\n17. The method according to claim 16, wherein said disorder is unipolar depression, and said symptoms comprise Early Sleep, Middle and Late Sleep, Energy, Work, Mood, Cognition, and Aniety.\n18. The method according to claim 14, wherein said treatment intervention effect is represented by an immediate effect and a delayed effect,\nsaid immediate effect represented by a step function, which step function coincides with the onset of treatment;\nsaid delayed effect represented by a sigmoid function of time with delay and steepness of the onset of the delayed effect.\n19. A method for predicting a response of a patient to a treatment for an affective disorder from at least one pre-treatment clinical symptom, comprising the steps of:\na.) performing at least one measurement of said pre-treatment clinical symptom on said patient, said pre-treatment symptom being a predictive symptom, and measuring said pre-treatment clinical symptom at selected time intervals so as to derive data representing a baseline patient profile;\nb.) defining a set of a plurality of predictor variables which define data of said baseline patient profile, said set of predictor variables comprising predictive symptoms and a set of treatment options;\nc.) deriving a model that represents a relationship between said set of predictor variables and a response exhibited by a recipient of one of said set of treatment options, said relationship derived by using at least one automated non-linear algorithm; and\nd.) utilizing said model of step c) to predict the response of said patient to said treatment by comparing said model and said baseline patient profile.\n20. The method according to claim 19, wherein said model is a multilayer neural network, and wherein said at least one algorithm is a back propagation learning algorithm.\n21. The method according to claim 20, wherein said neural network has at least three layers and at least two hidden units.\n22. The method according to claim 19, wherein said relationship in step c) is determined via quadratic regression.\n23. The method according to claim 22, further comprising using a set of independent variables in said quadratic regression, said set of independent variables representing interactions between said predictive symptoms.\n24. The method according to claim 23, further comprising estimating said interactions between said predictive symptoms by multiplying at least a first measured severity for a first predictive symptom times a second measured severity for a second predictive symptom.\n25. The method according to claim 19, further comprising utilizing the model of step c) to rank by influence on the response each of said predictive symptoms to indicate the predictive importance of each of said predictive symptoms and utilizing the predictive importance to select of at least one of said predictive symptoms for use in measuring said pre-treatment clinical symptom.\n26. The method according to claim 25, wherein said model is a multilayer neural network utilizing a back propagation learning algorithm having three layers and two hidden units, and an output; and said influence of a predictive symptom is determined by summing a first product and a second product, said first product being a first weight from said predictive symptom to a first hidden unit multiplied by a second weight from said first hidden unit to said output, and said second product being a third weight from said predictive symptom to a second hidden unit multiplied by a fourth weight from said second hidden unit to said output.\n27. The method according to claim 19, wherein said set of predictive symptoms is selected from the group consisting of Mood, Work, and Energy.\n28. The method according to claim 19, wherein said set of predictive symptoms is selected from the group consisting of Mood, Severity, and Middle and Late Sleep.\n29. The method according to claim 19, further comprising: before step a), providing at least one paired set of a known baseline patient profile and a treatment outcome, which at least one paired set is used in step c) for deriving said model.\n30. The method according to claim 29, wherein said model of step c) is a neural network.\n31. A method of treating an affective disorder in a patient comprising the following steps:\na.) defining a set of predictor variables, said set of predictor variables defining a set of data of a baseline patient profile, said set of predictor variables comprising predictive symptoms and a set of treatment options;\nb.) developing an outcome prediction for said set of treatment options, said outcome prediction based upon an analysis of patient symptoms, said analysis utilizing an automated nonlinear algorithm;\nc.) selecting a first preferred treatment option from said set of treatment options based on said outcome prediction;\nd.) applying said first preferred treatment option to said patient; and\ne.) monitoring said patient by comparing a response of said patient to said treatment option to said outcome prediction to provide an updated outcome prediction for said patient.\n32. The method of claim 31, further including the step of selecting and applying a second preferred treatment option from said set of treatment options based on said updated outcome prediction when said updated outcome prediction and said outcome prediction differ.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5435324A"
    ],
    "citations_ftf": [
        "US4839822A",
        "US5086479A",
        "JPH03223933A",
        "JPH03250243A",
        "US5598509A",
        "US5517405A",
        "US5591588A",
        "US5708591A",
        "US5812992A",
        "US5983211A",
        "US6052679A",
        "US6092058A",
        "US6185548B1"
    ],
    "citedby_own": [
        "WO2000069331A1",
        "US6280198B1",
        "US6287254B1",
        "US20010021801A1",
        "WO2001077952A1",
        "US20020026104A1",
        "US20020049782A1",
        "US6450956B1",
        "US20020143563A1",
        "US20020143577A1",
        "WO2003019184A1",
        "US20030046113A1",
        "WO2003021257A1",
        "US6537213B2",
        "WO2003029912A2",
        "WO2003030705A2",
        "WO2003032827A1",
        "US20030088365A1",
        "US6565359B2",
        "US6584445B2",
        "US6587828B1",
        "US20030135096A1",
        "US20030144829A1",
        "US6607390B2",
        "US20030171657A1",
        "US20030204413A1",
        "US6673062B2",
        "US20040015906A1",
        "US20040023197A1",
        "US20040087836A1",
        "US20040102685A1",
        "US20040117054A1",
        "US20040148140A1",
        "US20040172401A1",
        "US6792304B1",
        "US20040230127A1",
        "GB2401949A",
        "US20040236237A1",
        "US20040236776A1",
        "US20040241629A1",
        "US20050027331A1",
        "US20050032066A1",
        "US20050085343A1",
        "US20050090372A1",
        "US20050090718A1",
        "EP1546985A1",
        "US20050154267A1",
        "US20050154536A1",
        "US20050182309A1",
        "US20060147884A1",
        "US20060155204A1",
        "US20060200009A1",
        "US20060206359A1",
        "WO2006108641A1",
        "US20060253301A1",
        "US20060253006A1",
        "US20060253300A1",
        "US20060293573A1",
        "US20060293838A1",
        "US20070022062A1",
        "US20070027723A1",
        "US20070203423A1",
        "US20070224599A1",
        "US7329226B1",
        "US20080041656A1",
        "US20080052259A1",
        "US20080056518A1",
        "US20080064543A1",
        "US20080124689A1",
        "US20080126276A1",
        "US20080126277A1",
        "US20080165978A1",
        "US20080167575A1",
        "US20080184154A1",
        "US20080187145A1",
        "US20080194924A1",
        "US20080194927A1",
        "US20080212789A1",
        "US20080228677A1",
        "US20080235049A1",
        "US20080240452A1",
        "US20080269636A1",
        "US20080298614A1",
        "US20090006129A1",
        "US20090030290A1",
        "US7488290B1",
        "US20090043795A1",
        "US20090054743A1",
        "US20090070136A1",
        "US20090132465A1",
        "US20090137923A1",
        "US20100063843A1",
        "US20100063930A1",
        "US20100063830A1",
        "US20100063840A1",
        "US20100076950A1",
        "US20100120168A1",
        "US20100120169A1",
        "US20100120170A1",
        "US20100151062A1",
        "US20100153016A1",
        "US20100169340A1",
        "US20100169313A1",
        "US20100169342A1",
        "US20100169262A1",
        "US20100198616A1",
        "US20100295685A1",
        "US20110053128A1",
        "US20110093298A1",
        "US20110119212A1",
        "US20110161269A1",
        "US20110281247A1",
        "US20110301977A1",
        "US20120179136A1",
        "US20120221355A1",
        "US8356997B1",
        "US8369937B2",
        "US8380531B2",
        "US8533029B2",
        "US8626791B1",
        "US8670994B2",
        "US8971519B1",
        "US20150112232A1",
        "US9031870B2",
        "US9053431B1",
        "US9129054B2",
        "US9152765B2",
        "US20160042141A1",
        "US9298889B2",
        "US9384652B2",
        "US9395234B2",
        "US9454644B2",
        "US9542853B1",
        "US20170049597A1",
        "US9604020B2",
        "US20170220937A1",
        "US9797764B2",
        "US9875440B1",
        "WO2017216645A3",
        "WO2018204311A1",
        "US20190115093A1",
        "US10276054B2",
        "US10436488B2",
        "US10565329B2",
        "US10593429B2",
        "US10607736B2",
        "US10699811B2",
        "US10818394B2",
        "US10912482B2",
        "US10943273B2",
        "US10971254B2",
        "US10987026B2",
        "US11065056B2",
        "US11172885B2",
        "US11322227B2",
        "US11379717B2",
        "US11510577B2",
        "US11568990B2"
    ],
    "citedby_ftf": [
        "US7353238B1",
        "US6648649B2",
        "US6876991B1",
        "US7702394B2",
        "US7181054B2",
        "US20030101076A1",
        "US20040249669A1",
        "US6904434B1",
        "US7286970B2",
        "US20030204415A1",
        "PL376531A1",
        "CA2505416A1",
        "US20040148243A1",
        "US7643943B2",
        "US20060194211A1",
        "US20040259144A1",
        "US7505948B2",
        "US7467119B2",
        "US7194301B2",
        "WO2005050563A2",
        "US7282031B2",
        "WO2005086068A2",
        "US20050260549A1",
        "EP1789923A1",
        "US7644049B2",
        "US7682308B2",
        "US8484048B2",
        "US8005707B1",
        "US20070038474A1",
        "US20080194922A1",
        "US10016249B2",
        "US10460080B2",
        "US20070168227A1",
        "US20070179806A1",
        "US20070198300A1",
        "US7711734B2",
        "US20080051770A1",
        "US8112302B1",
        "US20110045998A1",
        "US20090287120A1",
        "US9717896B2",
        "US8636670B2",
        "US20090216611A1",
        "US20090318773A1",
        "US20100131434A1",
        "CA2974259A1",
        "US20120116799A1",
        "US8977574B2",
        "US8631040B2",
        "WO2012045030A2",
        "US9569723B2",
        "US9626650B2",
        "US10445846B2",
        "US9336493B2",
        "US9047559B2",
        "US20130073306A1",
        "US9087306B2",
        "US9244887B2",
        "US9147218B2",
        "US9934259B2",
        "US10169720B2",
        "US9892370B2",
        "US9208209B1",
        "US20160070880A1",
        "US9418339B1",
        "US10983682B2",
        "US11594310B1",
        "US11257574B1",
        "US11229406B2",
        "US10331490B2",
        "US11107589B2",
        "US10338994B1",
        "US10255085B1",
        "US10560313B2",
        "US10685283B2",
        "US11309082B2",
        "US20220238197A1"
    ]
}