{
    "patent_id": "US-11050778-B2",
    "title": "Complex application attack quantification, testing, detection and prevention ",
    "assignee": "Risksense, Inc.",
    "publication_date": "2021-06-29",
    "patent_link": "https://patents.google.com/patent/US11050778B2/en",
    "inventors": [
        "Anand Paturi",
        "Srinivas Mukkamala",
        "Caleb Hightower"
    ],
    "classifications": [
        "G06Q10/06",
        "G06F16/986",
        "G06F21/54",
        "G06F21/577",
        "G06N5/022",
        "G06N5/04",
        "G06Q30/018",
        "H04L63/1416",
        "H04L63/1433",
        "H04L67/02",
        "H04L67/1095",
        "H04L67/22",
        "H04L67/535",
        "G06F16/9024",
        "G06F18/214",
        "G06F2221/033",
        "G06F2221/2101",
        "G06K9/6256",
        "G06N20/00",
        "G06N7/005",
        "G06N7/01",
        "G06Q10/10"
    ],
    "abstract": "An apparatus and method for cyber risk quantification calculated from the likelihood of a cyber-attack on the target enterprise and/or cyber ecosystem based on its security posture. The cyber-attack likelihood can be derived as a probability-based time-to-event (TTE) measure using survivor function analysis. The likelihood probability measure can also be passed to cyber risk frameworks to determine financial impacts of the cyber-attacks. Embodiments of the present invention also relate to an apparatus and method (1) to identify and validate application attack surfaces and protect web applications against business logic-based attacks, sensitive data leakage and privilege escalation attacks; and/or (2) that protects web applications against business logic-based attacks, sensitive data leakage and privilege escalation attacks. This can include implementing an intelligent learning loop using artificial intelligence that creates an ontology-based knowledge base from application request and response sequences. Stochastic probabilistic measures are preferably applied to a knowledge base for predicting malicious user actions in real time.",
    "claims": "\n1. A method for quantifying the likelihood of cyber attacks on target assets comprising:\na processing unit monitoring and receiving security event data and security scan data from organizational security controls in one or more networks, wherein the security event data corresponds to security events observed within the organizational security controls, and the security scan data is gathered from security scanning performed in the one or more networks;\ntransferring the security event data and the security scan data to a service provider cloud directly through a secure communication or through an onsite module;\ncollecting by the processing unit, a plurality of security entities from the one or more networks;\ncreating a master time-to-event (“TTE”) index, wherein in the master TTE index, each of the plurality of security entities is associated with a TTE value that indicates time-to-attack or compromise;\nmapping the security entities and associated TTE values from active analysis results and the security events from the organizational security controls to form an organizational TTE index comprising the TTE values;\nsynchronizing the organizational TTE index with the master TTE index for at least some of the security entities;\ncalculating a cyber-attack likelihood by applying a survivor function or a cox regression analysis to the organizational TTE index;\nand\nquantifying risk by inputting the cyber-attack likelihood into a cyber risk quantification framework.\n2. The method of claim 1 wherein the active analysis results are inferred by the processing unit based at least in part on data from vulnerability and configuration scanners and wherein passive analysis results are inferred by the processing unit based at least in part on data from passive scan tools and further wherein TTE for each security entity within the security events is calculated.\n3. The method of claim 2 wherein synchronizing the organizational TTE index with the Master TTE index for the security entities comprises using a feedback loop whereby TTEs assigned to each security entity in the master TTE are imported into the organizational TTE index.\n4. The method of claim 3 wherein the feedback loop updates the TTEs of the security entities in the master TTE index based on TTE derived from security events observed within the organizational security controls.\n5. The method of claim 1 wherein the organizational TTE index communicates with the organizational security controls to apply contextual attributes to the security entities.\n6. The method of claim 1 wherein calculating a cyber-attack likelihood comprises calculating a likelihood of exploit for vulnerabilities.\n7. The method of claim 6 wherein calculating a cyber-attack likelihood further comprises using a result of the likelihood of exploit for vulnerabilities calculation in combination with input from an exploit likelihood determination to determine risk quantification for a target organization.\n8. The method of claim 1 wherein the cyber risk quantification framework comprises factor analysis of information risk.\n9. The method of claim 1 wherein the master TTE implements a coherent mapping index between security entities and their TTE values.\n10. The method of claim 9 wherein security entity data is gathered from one or more of the public internets, the dark web and a threat intelligence team.\n11. The method of claim 1 further comprising gathering information relating to a security incident from public sources and the dark web.\n12. The method of claim 11 wherein the security incident is mapped to security entities and a TTE is derived in terms of Time-to-Compromise.\n13. The method of claim 12 wherein mappings between the security incident and security entities are stored as a knowledge map for further predictive analysis.\n14. The method of claim 1 wherein the organizational TTE index represents the security entities and corresponding organizational TTEs that are pertinent to the organization such that survivor function techniques can be applied to it.\n15. The method of claim 14 wherein the organizational TTE index gathers security findings from active and passive security analysis.\n16. The method of claim 14 wherein the security findings from active and passive security analysis are mapped to the master TTE index and the corresponding organizational TTE index is synchronized in real time.\n17. The method of claim 1 further comprising a feedback loop that passes security events and processed logs from organizational security infrastructure to the master TTE index.\n18. The method of claim 17 wherein the master TTE index updates its TTE values based on observations gathered from the security events.\n19. The method of claim 17 wherein the master TTE index pushes updated TTE values to the organizational TTE index.\n20. The method of claim 1 wherein calculating a cyber-attack likelihood comprises calculating a likelihood of a cyber-attack against a target organization.\n21. The method of claim 20 wherein calculating a cyber-attack likelihood comprises calculating the likelihood of a cyber-attack for each target asset within an organizational infrastructure.\n22. The method of claim 1 wherein calculating a cyber-attack likelihood comprises determining a likelihood of a cyber-attack for each target asset based on a weighted aggregate of likelihood of exploit of all vulnerabilities within each target asset.\n23. The method of claim 1 wherein calculating a cyber-attack likelihood comprises determining a likelihood of exploit for each of a plurality of vulnerabilities by applying survivor function analysis on the organizational TTE index after the organizational TTE index has been synchronized with the master index.\n24. The method of claim 1 further comprising displaying the survivor function as a forecast of exploit likelihood over a predetermined time period.\n25. The method of claim 24 wherein the predetermined time period is derived automatically or accepted as manual input.\n26. The method of claim 24 wherein the predetermined time period is derived automatically and is based at least partially on an organizational patch cycle.\n27. The method of claim 1 wherein quantifying risk comprises calculating organizational risk based on an organization's existing vulnerabilities.\n28. The method of claim 20 wherein quantifying risk comprises combining the cyber-attack likelihood with financial frameworks to derive financial impacts for a target organization.\n29. A non-transitory computer-readable medium comprising computer software for quantifying the likelihood of cyber-attack on target assets comprising:\ncode causing a processing unit to monitor and receive security event data and security scan data from organizational security controls in one or more networks, wherein the security event data corresponds to security events observed within the organizational security controls, and the security scan data is gathered from security scanning performed in the one or more networks;\ncode transferring the security event data and the security scan data to a service provider cloud directly through a secure communication or through an onsite module;\ncode collecting by the processing unit, a plurality of security entities from the one or more networks:\ncode for creating a master time-to-event (“TTE”) index, wherein in the master TTE index, each of the plurality of security entities is associated with a TTE value that indicates time-to-attack or compromise;\ncode for mapping the security entities and associated TTE values from active analysis results and the security events from the organizational security controls to form an organizational TTE index comprising the TTE values;\ncode for synchronizing the organizational TTE index with the master TTE index for at least some of the security entities;\ncode for calculating a cyber-attack likelihood by applying a survivor function or a cox regression analysis to the organizational TTE index;\ncode for quantifying risk by inputting the cyber-attack likelihood into a cyber risk quantification framework.",
    "status": "Active",
    "citations_own": [
        "US20050050377A1",
        "US20070143672A1",
        "US20090319249A1",
        "US7941855B2",
        "US20130198119A1",
        "US20140096249A1",
        "US20150082442A1",
        "US20150213207A1",
        "US20150381649A1",
        "US9306962B1",
        "US20160099962A1",
        "US20170220964A1",
        "US20170363504A1",
        "US20180124097A1",
        "US10050999B1",
        "US20180295154A1"
    ],
    "citations_ftf": [
        "US20020065912A1",
        "US9160710B2",
        "WO2012158649A2",
        "US8448233B2",
        "US9027136B2",
        "WO2016186975A1",
        "US10904281B2",
        "US11330016B2"
    ],
    "citedby_own": [
        "US11108806B2",
        "US20210288979A1",
        "WO2023034603A1",
        "US11698907B2"
    ],
    "citedby_ftf": [
        "US11252172B1",
        "US11176491B2",
        "US11625482B2",
        "US11438361B2",
        "US11244043B2",
        "CN110138627B",
        "US11632386B2",
        "US11363052B2",
        "US11265341B1",
        "US11698977B1",
        "US11562068B2",
        "US11677774B2",
        "US11316886B2",
        "US20210294317A1",
        "US11418533B2",
        "US10949543B1",
        "CN112039877B",
        "US11711393B2",
        "US20220131887A1",
        "CN112910865B",
        "CN112966063B",
        "CN113382010B",
        "CN113407945B",
        "CN113612763B",
        "US11509682B1",
        "CN114238648B",
        "KR102580469B1",
        "CN115829034B"
    ]
}