{
    "patent_link": "https://patents.google.com/patent/US20070162379A1/en",
    "patent_id": "US20070162379A1",
    "title": "Computer-implemented method and system for managing keyword bidding prices",
    "abstract": "A computer-implemented method and system for managing keyword bidding prices are disclosed. An example system embodiment includes an automatic keyword bidding module, operably coupled with a processor and a memory, operable to determine a revenue per click value associated with a keyword, obtain bidding information associated with the keyword, obtain automatic bid controls associated with the keyword, and automatically generate a bid value for the keyword based on the revenue per click value, the bidding information, and the automatic bid controls.",
    "inventors": [
        "Darrin Skinner"
    ],
    "assignee": "eBay Inc",
    "classifications": [
        "G06Q30/0247",
        "G06F16/951",
        "G06Q30/02",
        "G06Q30/0242",
        "G06Q30/0251",
        "G06Q30/0256",
        "G06Q30/0273",
        "G06Q30/0275",
        "G06Q30/0277",
        "G06Q30/08",
        "G06Q40/04"
    ],
    "claims": "\n1. A computer-implemented method comprising:\ndetermining a revenue per click value associated with a keyword;\nobtaining bidding information associated with the keyword;\nobtaining automatic bid controls associated with the keyword; and\nautomatically generating a bid value for the keyword based on the revenue per click value, the bidding information, and the automatic bid controls.\n2. The method as claimed in claim 1 further including submitting the bid value via an API.\n3. The method as claimed in claim 1 wherein the bidding information is obtained via an API.\n4. The method as claimed in claim 1 wherein the bidding information includes a last bid amount.\n5. The method as claimed in claim 1 further including determining a maximum cost per click value (CPC) required to yield a desired average CPC.\n6. The method as claimed in claim 1 wherein the automatic bid controls include a maximum cost per click value that can be automatically bid for the keyword.\n7. The method as claimed in claim 1 wherein the automatic bid controls include a scaling factor for the revenue per click value.\n8. The method as claimed in claim 1 wherein the automatic bid controls include a gap position target value.\n9. The method as claimed in claim 1 wherein the automatic bid controls include a bid increment factor.\n10. The method as claimed in claim 1 wherein the automatic bid controls include a bid increment velocity factor.\n11. An article of manufacture comprising at least one machine readable storage medium having one or more computer programs stored thereon and operable on one or more computing systems to:\ndetermine a revenue per click value associated with a keyword;\nobtain bidding information associated with the keyword;\nobtain automatic bid controls associated with the keyword; and\nautomatically generate a bid value for the keyword based on the revenue per click value, the bidding information, and the automatic bid controls.\n12. The article of manufacture as claimed in claim 11 being further operable to submit the bid value via an API.\n13. The article of manufacture as claimed in claim 11 being further operable to obtain the bidding information via an API.\n14. The article of manufacture as claimed in claim 11 wherein the bidding information includes a last bid amount.\n15. The article of manufacture as claimed in claim 11 being further operable to determine a maximum cost per click value (CPC) required to yield a desired average CPC.\n16. The article of manufacture as claimed in claim 11 wherein the automatic bid controls include a maximum cost per click value that can be automatically bid for the keyword.\n17. The article of manufacture as claimed in claim 11 wherein the automatic bid controls include a scaling factor for the revenue per click value.\n18. The article of manufacture as claimed in claim 11 wherein the automatic bid controls include a gap position target value.\n19. The article of manufacture as claimed in claim 1 1 wherein the automatic bid controls include a bid increment factor.\n20. The article of manufacture as claimed in claim 11 wherein the automatic bid controls include a bid increment velocity factor.\n21. A system comprising:\na processor;\na memory coupled to the processor to store information related to keywords; and\nan automatic keyword bidding module, operably coupled with the processor and the memory, operable to determine a revenue per click value associated with a keyword, obtain bidding information associated with the keyword, obtain automatic bid controls associated with the keyword, and automatically generate a bid value for the keyword based on the revenue per click value, the bidding information, and the automatic bid controls.\n22. The system as claimed in claim 21 being further operable to submit the bid value via an API.\n23. The system as claimed in claim 21 being further operable to obtain the bidding information via an API.\n24. The system as claimed in claim 21 being further operable to determine a maximum cost per click value (CPC) required to yield a desired average CPC.",
    "status": "Active",
    "citations_own": [
        "US20020013763A1",
        "US20020038282A1",
        "US20020038241A1",
        "US20020072895A1",
        "US20020111847A1",
        "US20020116313A1",
        "US20020128949A1",
        "US20020188694A1",
        "US6499030B1",
        "US20030055729A1",
        "US20030055816A1",
        "US20030088525A1",
        "US20030105677A1",
        "US6704727B1",
        "US20040068460A1",
        "US20040088241A1",
        "US20040199496A1",
        "US6826572B2",
        "US20050065844A1",
        "US20050071325A1",
        "US6876997B1",
        "US20050097024A1",
        "US20050137939A1",
        "US20050144064A1",
        "US20050144065A1",
        "US20050223000A1",
        "US20050228797A1",
        "US20060004628A1",
        "US20060149623A1",
        "US20060206516A1",
        "US20070027754A1",
        "US20070143266A1",
        "US20070156757A1"
    ],
    "citations_ftf": [
        "US7225151B1",
        "JP2005521971A",
        "US20040010518A1",
        "US8311890B2",
        "US20040199397A1",
        "EP1661018A4",
        "US20050149396A1",
        "EP1723596A1",
        "US7752200B2",
        "US7734503B2",
        "US20060173744A1",
        "US7962510B2",
        "US20070027792A1",
        "US7930236B2",
        "US20070130004A1",
        "US7752190B2"
    ],
    "citedby_own": [
        "US20050149388A1",
        "US20070143266A1",
        "US20070156757A1",
        "US20080059298A1",
        "US20080082405A1",
        "US20080082655A1",
        "US20080126236A1",
        "US20080167948A1",
        "US7428522B1",
        "US20080238926A1",
        "US20080294630A1",
        "US20080300967A1",
        "US20090157612A1",
        "US20090164890A1",
        "US20090187479A1",
        "US20090299855A1",
        "US20090313126A1",
        "US20090319372A1",
        "US20090327331A1",
        "US20090327083A1",
        "US20100082422A1",
        "US20100082429A1",
        "US20100082421A1",
        "US20100094673A1",
        "US7716229B1",
        "US20100185687A1",
        "US7809714B1",
        "US20100306225A1",
        "US20110010263A1",
        "US20110040604A1",
        "US20110145058A1",
        "US20110161091A1",
        "US20110161479A1",
        "US20110184803A1",
        "US20110191182A1",
        "US20110197137A1",
        "US20110202827A1",
        "US20110282741A1",
        "US20120166291A1",
        "US20120226539A1",
        "US20120265601A1",
        "US20120278131A1",
        "US20130006757A1",
        "US8380709B1",
        "US20130091519A1",
        "US8452691B2",
        "US20130304577A1",
        "US20130317933A1",
        "US8700614B1",
        "US8706607B2",
        "WO2015012747A1",
        "US20150039419A1",
        "US20150112764A1",
        "US9047642B2",
        "US9117180B1",
        "US9230229B2",
        "US9483788B2",
        "US9489692B1",
        "US20160350408A1",
        "US9519920B1",
        "US9626691B2",
        "US9665875B2",
        "US9679314B1",
        "US20170236148A1",
        "US9741080B1",
        "US9747622B1",
        "US20170301350A1",
        "US9805425B2",
        "US20170345048A1",
        "US9842312B1",
        "US10121153B1",
        "US10204074B1",
        "US10269024B2",
        "US10362364B2",
        "US10402431B2",
        "US10474957B2",
        "US20190370853A1",
        "US10540660B1",
        "US10546262B2",
        "US10614491B2",
        "US10635412B1",
        "US10650332B1",
        "US10713666B2",
        "US10810654B1",
        "US10872350B1",
        "US10929890B2",
        "US10949876B2",
        "US10970769B2",
        "US10970463B2",
        "CN112800113A",
        "US11023947B1",
        "US20210248197A1",
        "US11205179B1",
        "US11449903B2",
        "US11463578B1",
        "US11475510B2",
        "US11514493B1",
        "US11676192B1",
        "US20230245173A1",
        "US11734368B1"
    ],
    "citedby_ftf": [
        "US20080091487A1",
        "US20100274661A1",
        "US20080109438A1",
        "US20080249855A1",
        "KR100930787B1",
        "KR100859216B1",
        "JP5168537B2",
        "US8290921B2",
        "KR100910518B1",
        "US20090112690A1",
        "US20090248585A1",
        "US8918328B2",
        "WO2010002174A2",
        "KR101042466B1",
        "US8315908B1",
        "JP5710616B2",
        "US8544033B1",
        "US8214348B2",
        "US8639715B1",
        "US8370330B2",
        "US9135352B2",
        "US8880492B2",
        "US8700599B2",
        "US8792912B2",
        "US8983925B2",
        "CN103294684B",
        "US20150134464A1",
        "US8719089B1",
        "TWI509546B",
        "WO2015009936A2",
        "WO2015030929A1",
        "CN104731818B",
        "US10692102B2",
        "US10389752B2",
        "US9959351B2",
        "US10839441B2",
        "US11055761B2",
        "CN107807878B",
        "US10699302B2",
        "US10146509B1",
        "US11360742B2",
        "CN109360017B",
        "US10956920B1"
    ]
}