{
    "patent_id": "US-2019258943-A1",
    "title": "Rule-based system and method to be used in the system ",
    "assignee": "Profium Oy",
    "publication_date": "2019-08-22",
    "patent_link": "https://patents.google.com/patent/US20190258943A1/en",
    "inventors": [
        "Tommi KOIVULA",
        "Jari Vänttinen"
    ],
    "classifications": [
        "G06N5/022",
        "G06F16/248",
        "G06F17/30554",
        "G06N5/01",
        "G06N5/025",
        "G06N5/046"
    ],
    "abstract": "A computer-implemented reasoning method for analyzing inference by using a data model with facts and rules, wherein the data model is used for analyzing rule triggering by means of an algorithm. The method includes providing the data model as a data structure with a first presentation and a second presentation. The first presentation is a presentation of property values for subjects, whereby each property value states an explicit fact or a missing fact. The second presentation is a presentation of rules for the relations of the properties, the rules having been constructed in an expanded form showing separately all combinations of property relations. The algorithm combines the presentations of the data structure by matching the rules against the properties of the subjects. A search result is obtained, which exposes the relations between the rule results and the property values of the subjects.",
    "claims": "\n1. A computer-implemented reasoning method for analyzing inference by using a data model with facts and rules, the data model being used for analyzing rule triggering by means of an algorithm, the method comprising:\nproviding the data model as a data structure with\na presentation of property values for subjects, whereby each property value states an explicit fact or a missing fact, and\na presentation of rules for the relations of the properties, the rules having been constructed in an expanded form showing separately all combinations of property relations,\nthe algorithm combining the presentations of the data structure by matching the rules against the properties of the subjects,\nobtaining a search result exposing the relations between the rule results and the property values of the subjects, and\ninterpreting the search result on the basis of the property values.\n2. The method of claim 1, wherein the explicit facts and missing facts have been given numerical truth values enabling interpreting the search result for predicting reasoning results of inferred facts/produced properties.\n3. The method of claim 2, wherein one or more missing explicit fact is interpreted as an additional fact(s), which, when inserted in the data structure, triggers one or more rules thereof.\n4. The method of claim 1, wherein the search result is interpreted to predict required facts that produces a given property/infers a fact for one or more subjects.\n5. The method of claim 4, wherein a required explicit fact to make a given rule to match for a subject is indicated by a property value stating the property to be true, and a missing fact is indicated by a property value stating the property to be false.\n6. The method of claim 2, wherein the subjects and rules that are closest to trigger is found by means of the missing explicit facts making a given rule to trigger, whereby closeness is measured by at least one of:\nthe amount of missing explicit facts, and\nthe weights of the missing explicit facts or their corresponding properties.\n7. The method of claim 6, wherein the method further comprises sorting rules and subjects based on how close the rules are to match.\n8. The method of claim 1, wherein the explicit facts and missing facts have been given numerical truth values enabling interpreting the search result for explaining reasoning results of inferred facts/produced properties.\n9. The method of claim 8, wherein the search result is interpreted to determine if a given property for one or more subjects is true and can thus be inferred from explicit facts and satisfy the satisfiability formula.\n10. The method of claim 8, wherein the search result is interpreted to find the explicit fact(s) that produced a given inferred property for one or more subjects.\n11. The method of claim 8, wherein whereby the facts that made the rule to match for a subject is indicated by the values of the required properties for that rule.\n12. The method of claim 1, wherein the data model is provided by constructing a satisfiability formula for the presentations of the properties in the form of a satisfiability matrix with rows for presenting the subjects and columns for presenting the properties,\nconstructing a search formula for the presentation of the rules in the form of a search matrix from properties and expanded forms of the rules, the expanded rules being presented by rows and the columns by the properties,\nobtaining the search result as a resulting data structure in the form of a result matrix by multiplying the satisfiability matrix and the search matrix.\n13. The method of claim 12, wherein the multiplication of the satisfiability matrix and the search matrix is followed by concatenation.\n14. The method of claim 12, wherein:\nthe explicit facts and missing facts are given numerical truth values in the satisfiability matrix for enabling interpreting the search result for predicting reasoning results of inferred facts/produced properties, and\ninterchanging the given numerical truth values of explicit facts and missing facts for enabling interpreting the search result for explaining reasoning results of inferred facts/produced properties.\n15. The method of claim 12, wherein the method further comprises interpreting the state of any property for each subject based on the existence of explicit facts indicated by the property values of the cells of the result matrix.\n16. The method of claim 12, further comprising interpreting the result matrix by means of values that indicate the required facts that make the rule that infers a property of interest to match for a subject.\n17. The method of claims 1, wherein the method further comprises updating the data structure by insertion or deletion of new subjects, rules, and/or facts, whereafter the data model is re-run.\n18. The method of claim 1, wherein the method is performed in a network of one or more nodes and further comprising distributing at least one method step into another processing node than the executing node.\n19. The method of claim 18, wherein the method further comprises providing said another node with an individual working memory, shared access to a rule set and/or the right to check/evaluate the value of a property for any subject.\n20. A non-transitory computer-readable data storage media comprising computer instructions which when executed by a processor cause the processor to perform the method of claim 1.\n21. A system for reasoning comprising:\na data base module with a data structure of rules, facts and/or configuration data, the data structure comprising a set of properties stating explicit facts and a set of rules that represent relations of the properties,\na user interface,\na module with an algorithm applying the rules to the data structure by combining the presentations of the data structure by matching the rules against the facts of the subjects and obtaining a search result that exposes the relations between the rule results and the property values of the subjects,\n22. The system of claim 21, further comprising an explanatory interface.",
    "status": "Abandoned",
    "citations_own": [],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": []
}