{
    "patent_link": "https://patents.google.com/patent/US20030229635A1/en",
    "patent_id": "US20030229635A1",
    "title": "Efficient evaluation of queries with mining predicates",
    "abstract": "A method for evaluating a user query on a database having a mining model that classifies records contained in the database into classes when the query comprises at least one mining predicate that refers to a class of database records. An upper envelope is derived for the class referred to by the mining predicate corresponding to a query that returns a set of database records that includes all of the database records belonging to the class. The upper envelope is included in the user query for query evaluation. The method may be practiced during a preprocessing phase by evaluating the mining model to extract a set of classes of the database records and deriving an upper envelope for each class. These upper envelopes are stored for access during user query evaluation.",
    "inventors": [
        "Surajit Chaudhuri",
        "Vivek Narasayya",
        "Sunita Sarawagi"
    ],
    "assignee": "Microsoft Technology Licensing LLC",
    "classifications": [
        "G06F16/285",
        "G06F2216/03",
        "Y10S707/99932",
        "Y10S707/99934"
    ],
    "claims": "\n1. A method for evaluating a user query on a database having a mining model that classifies records contained in the database into classes and assigns a class label to each record, wherein the query comprises at least one mining predicate that refers to a class label of database records, the method comprising the steps of:\nderiving an upper envelope for the class label referred to by the mining predicate wherein the upper envelope corresponds to a query predicate that returns a set of database records that includes all of the database records having that class label assigned thereto; and\nincluding the upper envelope with the user query for query evaluation.\n2. The method of claim 1 wherein the deriving step is performed during a preprocessing phase by:\nbuilding a mining model;\nevaluating the mining model to extract a set of classes and class labels for the database records;\nderiving an upper envelope for each class label while building the model; and\nstoring the upper envelopes for access during user query evaluation.\n3. The method of claim 1 comprising the step of forming an upper envelope by combining a plurality of upper envelopes.\n4. The method of claim 3 wherein the user query seeks to return data records whose class label is a member of a given set of class labels and wherein the upper envelope comprises a disjunct of the upper envelopes for each class label in the set of class labels referred to by the user query.\n5. The method of claim 3 wherein the database has at least two mining models and wherein the user query seeks to return data records whose class label has been assigned the same class label by all mining models and wherein the upper envelope is formed by enumerating class labels for each of the mining models, finding upper envelopes for each mining model by forming a conjunctive expression of the upper envelope for each class label in the mining model, and taking the disjunction of these conjunctive expressions over all class labels.\n6. The method of claim 3 wherein the mining model assigns a class label to a data record that predicts the value of a given column in the data record and the user query seeks to return data records in which the predicted value matches the actual value in the data column and wherein the upper envelope for that class is formed by enumerating each class label for the mining model, finding an upper envelope for each class label, forming a conjunctive expression of the upper envelope and a predicate that selects data records where the given column is equal to the class label, and forming a disjunctive expression of these conjunctive expressions over all class labels.\n7. The method of claim 1 wherein the mining model is a decision tree comprising a root node connected to test nodes having test conditions and leaf nodes having a class label and wherein the upper envelope for a given class label is derived by forming a conjunct of the test conditions between the root and each leaf node having the given class label and forming a disjunct of the conjuncts of the test conditions.\n9. The method of claim 1 wherein the mining model is a rule based learner comprising a set of if-then rules, each rule having a body comprising conditions on the data attributes and a head comprising one of the class labels and wherein the upper envelope for a given class label is derived by forming a disjunct of the rules having the given class label as the head.\n10. The method of claim 1 wherein the data records have n attributes and the mining model assigns class labels to each data record and each class label of each data record is assigned a position based on attribute values in an n dimensional space having a dimension for each attribute and wherein the upper envelope for a given class label is derived by forming a disjunct of boundaries of regions that cover all data records having the given class label.\n10. The method of claim 9 wherein the boundaries are described in terms of ranges of attribute values.\n11. The method of claim 9 wherein the upper envelope for a given class label is derived by describing an initial region that covers the entire n dimensional space, removing sub-regions that do not contain any data records having the given class label, and describing the resulting region.\n12. The method of claim 11 wherein a sub-region is removed from the initial region by calculating a probability that the data records in the sub-region have a given class label and removing the sub-region if the probability is below a predetermined threshold.\n13. The method of claim 12 wherein a probability that data records in the sub-region having a certain class label is calculated for all class labels and the upper envelope for the given class label is derived by removing a sub-region based on a comparison between the probability for the given class label and the probabilities for the other class labels.\n14. The method of claim 11 wherein sub-regions that contain data records having different class labels are shrunk and re-evaluated to determine if they should be removed.\n15. The method of claim 11 wherein sub-regions that contain data records having different class labels are split into sub-regions and the split sub-regions are re-evaluated to determine if they should be removed.\n16. The method of claim 15 wherein the sub-regions are split in a manner that minimizes entropy.\n17. The method of claim 11 comprising the step of merging sub-regions that have been removed.\n18. The method of claim 9 wherein the mining model determines each class as a centroid and a region surrounding the centroid and wherein the upper envelope for a given class label is derived by describing a set of rectangular regions that cover the region for the given class label.\n19. The method of claim 1 wherein the upper envelopes are removed prior to execution of the user query.\n20. The method of claim 1 wherein the size of the upper envelope is limited to a predetermined number of terms.\n21. A computer readable medium having computer executable instruction stored thereon for performing method steps for evaluating a user query on a database having a mining model that classifies records contained in the database into classes and assigns a class label to each record, wherein the query comprises at least one mining predicate that refers to a class label of database records, the method steps comprising:\nderiving an upper envelope for the class label referred to by the mining predicate wherein the upper envelope corresponds to a query predicate that returns a set of database records that includes all of the database records having that class label assigned thereto; and\nincluding the upper envelope with the user query for query evaluation.\n22. The computer readable medium of claim 21 wherein the deriving step is performed during a preprocessing phase by:\nbuilding a mining model;\nevaluating the mining model to extract a set of classes and class labels for the database records;\nderiving an upper envelope for each class label while building the model; and\nstoring the upper envelopes for access during user query evaluation.\n23. The computer readable medium of claim 21 wherein the method steps comprise the step of forming an upper envelope by combining a plurality of upper envelopes.\n24. The computer readable medium of claim 23 wherein the user query seeks to return data records whose class label is a member of a given set of class labels and wherein the upper envelope comprises a disjunct of the upper envelopes for each class label in the set of class labels referred to by the user query.\n25. The computer readable medium of claim 23 wherein the database has at least two mining models and wherein the user query seeks to return data records whose class label has been assigned the same class label by all mining models and wherein the upper envelope is formed by enumerating class labels for each of the mining models, finding upper envelopes for each mining model by forming a conjunctive expression of the upper envelope for each class label in the mining model, and taking the disjunction of these conjunctive expressions over all class labels.\n26. The computer readable medium of claim 23 wherein the mining model assigns a class label to a data record that predicts the value of a given column in the data record and the user query seeks to return data records in which the predicted value matches the actual value in the data column and wherein the upper envelope for that class is formed by enumerating each class label for the mining model, finding an upper envelope for each class label, forming a conjunctive expression of the upper envelope and a predicate that selects data records where the given column is equal to the class label, and forming a disjunctive expression of these conjunctive expressions over all class labels.\n27. The computer readable medium of claim 23 wherein the mining model is a decision tree comprising a root node connected to test nodes having a test condition and leaf nodes having a class label and wherein the upper envelope for a given class label is derived by forming a conjunct of the test conditions between the root and each leaf node having the given class label and forming a disjunct of the conjuncts of the test conditions.\n28. The computer readable medium of claim 21 wherein the mining model is a rule based learner comprising a set of if-then rules, each rule having a body comprising conditions on the data attributes and a head comprising one of the class labels and wherein the upper envelope for a given class label is derived by forming a disjunct of the rules having the given class label as the head.\n29. The computer readable medium of claim 21 wherein the data records have n attributes and the mining model assigns class labels to each data record and each class label of each data record is assigned a position based on attribute values in an n dimensional space having a dimension for each attribute and wherein the upper envelope for a given class label is derived by forming a disjunct of boundaries of regions that cover all data records having the given class label.\n30. The computer readable medium of claim 29 wherein the boundaries are described in terms of ranges of attribute values.\n31. The computer readable medium of claim 29 wherein the upper envelope for a given class label is derived by describing an initial region that covers the entire n dimensional space, removing sub-regions that do not contain any data records having the given class label, and describing the resulting region.\n32. The computer readable medium of claim 31 wherein sub-regions that contain data records having different class labels are shrunk and re-evaluated to determine if they should be removed.\n33. The computer readable medium of claim 31 wherein sub-regions that contain data records having different class labels are split into sub-regions and the split sub-regions are re-evaluated to determine if they should be removed.\n34. The computer readable medium of claim 31 wherein the method steps comprise the step of merging sub-regions that have been removed.\n35. The computer readable medium of claim 29 wherein the mining model determines each class as a centroid and a region surrounding the centroid and wherein the upper envelope for a given class label is derived by describing a set of rectangular regions that cover the region for the given class label.\n36. An apparatus for evaluating a user query on a database having a mining model that classifies records contained in the database into classes and assigns a class label to each record, wherein the query comprises at least one mining predicate that refers to a class label of database records, the method comprising the steps of:\nmeans for deriving an upper envelope for the class label referred to by the mining predicate wherein the upper envelope corresponds to a query predicate that returns a set of database records that includes all of the database records having that class label associated therewith; and\nmeans for including the upper envelope with the user query for query evaluation.\n37. The apparatus of 36 wherein the means for deriving an upper envelope does so during a preprocessing phase by:\nbuilding a mining model;\nevaluating the mining model to extract a set of classes and class labels for the database records;\nderiving an upper envelope for each class label while building the model; and\nstoring the upper envelopes for access during user query evaluation.\n38. The apparatus of claim 36 comprising means for forming an upper envelope by combining a plurality of upper envelopes.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US20020143755A1",
        "US6629095B1",
        "US6804669B2"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20030145000A1",
        "US20030195889A1",
        "US20040236758A1",
        "US20050004907A1",
        "US20050102303A1",
        "US20060069694A1",
        "US20060106777A1",
        "US7051037B1",
        "US20060218132A1",
        "US20060282411A1",
        "US20070198479A1",
        "US20070288465A1",
        "US20080189237A1",
        "US20080270392A1",
        "US20080288310A1",
        "US20100287214A1",
        "US20110066551A1",
        "US20110173037A1",
        "US20130086038A1",
        "US20140244234A1",
        "US9336302B1",
        "US10083172B2",
        "US10387911B1",
        "CN111274391A",
        "US11205103B2"
    ],
    "citedby_ftf": [
        "US7447687B2",
        "US7716167B2",
        "US7953694B2",
        "US7895191B2",
        "EP1763795B1",
        "US7707143B2",
        "US8176016B1",
        "US8195734B1",
        "US8504733B1",
        "US8280899B2",
        "US9798783B2",
        "US9679000B2",
        "US9600539B2",
        "US9187088B1",
        "US9582540B2"
    ]
}