{
    "patent_link": "https://patents.google.com/patent/US4625510A/en",
    "patent_id": "US4625510A",
    "title": "Stress limiter apparatus for a gas turbine engine",
    "abstract": "A stress limiter apparatus for a gas turbine engine (10) is disclosed. A proportional fuel fuel control (11) regulates the fuel flow (Wf) from a hydromechanical unit (36) based upon an error signal (E) representing the difference between a demanded speed signal (Nd) and an actual speed signal (N1). The demanded speed signal (Nd) is generated by an integrator (32) as the time integral of one of the acceleration terms (A1, A2, A3) selected by gate 38. The demanded acceleration term (A1) is generated by junction (26) as the difference between the demanded signal (Nd) and a scheduled speed signal (Ngs). The acceleration terms (A2, A3) are generated by junctions (44, 46) and scheduling means (40, 42) which form stress limiter circuits.",
    "inventors": [
        "Rowland M. Evans"
    ],
    "assignee": "Honeywell ASCa Inc",
    "classifications": [
        "F02C9/28",
        "F05D2270/04",
        "F05D2270/114"
    ],
    "claims": "\n1. A fuel control for gas turbine comprising:\n(a) means for controlling the fuel flow to the gas turbine engine as a function of a demanded speed signal;\n(b) means for generating said demanded speed signal as the time integral of a selected acceleration term;\n(c) means for generating a demanded acceleration term as a function of at least one operating parameter of the engine;\n(d) a plurality of summing means for generating difference signals between an actual parameter signal related to a stress limit and a predetermined limit value;\n(e) a plurality of scheduling means for determining stress limit acceleration terms as functions of the difference signals generated by said summing means; and\n(f) means for comparing said acceleration terms and for generating said elected acceleration term as the lowest of said acceleration terms, wherein said scheduling means provides:\n(i) a difference signal determined as a function having a maximum acceleration value exceeding the maximum value of said demanded acceleration for operation of the engine in a normal range, (ii) decreasing acceleration values for operation of the engine within a predetermined range of a stress limit, (iii) a zero acceleration value for operation of the engine at the stress limit, (iv) increasing deceleration values for operation of the engine beyond the stress limit, and (v) a maximum deceleration value for operation of the engine in a dangerous range.\n2. A fuel control as defined in claim 1 wherein said stress limit acceleration term generating means includes:\nmeans for generating an actual parameter spool speed signal as a function of the actual spool speed of the gas turbine engine.\n3. A fuel control as defined in claim 1 wherein said stress limit acceleration term generating means includes:\nmeans for generating an actual parameter turbine temperature signal as a function of the actual turbine inlet temperature of the engine.\n4. A fuel control as defined in claim 1 wherein the engine is of the free turbine type and said stress limit acceleration term generating means includes:\nmeans for generating an actual parameter free turbine speed signal as a function of the actual free turbine speed of the engine.\n5. A fuel control as defined in claim 1 wherein the engine is of the free turbine type and said stress limit acceleration term generating means includes:\nmeans for generating an actual parameter free turbine torque signal as a function of the actual torque applied by the free turbine of the engine.\n6. A fuel control for a gas turbine engine as defined in claim 1 wherein:\nsaid stress limit is selected as the low pressure spool overspeed limit.\n7. A fuel control for a gas turbine engine as defined in claim 6 wherein:\nsaid decreasing acceleration values are selected to initiate when the low pressure spool speed reaches a predetermined percentage of the low pressure spool overspeed limit.\n8. A fuel control for a gas turbine engine as defined in claim 7 wherein:\nsaid maximum deceleration value is selected to inititate when the low pressure spool speed reaches a predetermined limit.\n9. A fuel control for a gas turbine engine as defined in claim 8 wherein:\nsaid maximum deceleration value is the maximum deceleration value of said demanded acceleration.\n10. A fuel control for a gas turbine engine as defined in claim 1 wherein:\nsaid stress limit is selected as the free turbine overspeed limit.\n11. A fuel control for a gas turbine engine as defined in claim 10 wherein:\nsaid decreasing acceleration values are selected to initiate when the free turbine speed reaches a predetermined percentage of the free turbine overspeed limit.\n12. A fuel control for a gas turbine engine as defined in claim 11 wherein:\nsaid maximum deceleration value is selected to initiate when the free turbine speed exceeds the free turbine overspeed limit by a predetermined percentage.\n13. A fuel control for a gas turbine engine as defined in claim 12 wherein:\nsaid maximum deceleration value is the maximum deceleration value of said demanded acceleration.\n14. A fuel control for a gas turbine engine as defined in claim 1 wherein:\nsaid stress limit is selected as the turbine inlet temperature limit.\n15. A fuel control for a gas turbine engine as defined in claim 14 wherein:\nsaid decreasing acceleration values are selected to initiate when the turbine inlet temperature exceeds the turbine inlet temperature limit by a predetermined amount.\n16. A fuel control for a gas turbine engine as defined in claim 15 wherein:\nsaid maximum deceleration value is selected to initiate when the turbine inlet temperature is within 50° C. of the turbine inlet temperature limit.\n17. A fuel control for a gas turbine engine as defined in claim 16 wherein:\nsaid maximum deceleration value is the maximum deceleration value of said demanded acceleration.\n18. A fuel control for a gas turbine engine as defined in claim 1 wherein:\nsaid stress limit is selected as the free turbine torque limit.\n19. A fuel control for a gas turbine engine as defined in claim 18 wherein:\nsaid decreasing acceleration values are selected to initiate when the free turbine torque reaches a predetermined percentage of the free turbine torque limit.\n20. A fuel control for a gas turbine engine as defined in claim 19 wherein:\nsaid maximum deceleration values are selected to initiate when the free turbine torque exceeds the free turbine torque limit by a predetermined amount.\n21. A fuel control for a gas turbine engine as defined in claim 20 wherein:\nsaid maximum deceleration value is the maximum deceleration value of said demanded acceleration.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US3790765A",
        "US3956884A",
        "US4018044A",
        "US4040250A",
        "US4100731A",
        "US4171613A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4783957A",
        "US4928484A",
        "US4993221A",
        "US5231823A",
        "US5285634A",
        "US5299417A",
        "US6216437B1",
        "US6725099B2",
        "US20040114666A1",
        "US20100162718A1",
        "US20130180260A1",
        "US20160069276A1",
        "EP3000986A1",
        "EP3199783A1",
        "EP2506095A3",
        "US10801361B2",
        "US11274599B2",
        "US11274611B2",
        "US11293353B2",
        "US11326525B2",
        "US11391219B2",
        "US11536205B2",
        "US11781476B2"
    ],
    "citedby_ftf": []
}