{
    "patent_link": "https://patents.google.com/patent/US5157491A/en",
    "patent_id": "US5157491A",
    "title": "Method and apparatus for video broadcasting and teleconferencing",
    "abstract": "A video teleconferencing network among several remote sites includes a central switching system for receiving and processing signals from the remote sites. Video cameras are located at each one of the remote sites for generating video signals. Each camera includes an optical system having a plurality of lens systems for processing colors of different frequencies. Each one of the lens systems includes a shutter for generating amplitude vectorial signals proportional to the amplitude of the color signal being processed by the lens system. Each one of the lens systems further includes means responsive to the frequency of the corresponding color being processed by the particular lens system, for generating vectorial signals proportional to the frequency of the color signal being processed by the lens system. A modular monitor has a relatively small size liquid crystal modular screen, for use by an individual user to display texts and graphics. The modular screen includes a plurality of modules selectively engageable to one another, by the individual user, to form a single unitary screen. A user station is adapted to be coupled to the single unitary screen, for controlling the display of information thereon.",
    "inventors": [
        "L. Samuel A. Kassatly"
    ],
    "assignee": "Individual",
    "classifications": [
        "H04N7/08",
        "H04N21/2365",
        "H04N21/4347",
        "H04N7/0806",
        "H04N7/15",
        "H04N9/8042",
        "H04N9/8227"
    ],
    "claims": "\n1. A network for providing video teleconferencing capability among several remote sites, comprising:\na) central switching means for receiving and processing signals from the remote sites;\nb) means for generating video signals at the remote sites;\nc) means for transmitting said video signals to said central switching means;\nd) said central switching means including:\ni) means for allocating a different channel to said video signals from each one of the remote sites, each channel being indicative of one of the remote sites and having a predetermined carrier frequency;\nii) means for scanning said allocated channels to generate signals identificative of said allocated channels;\niii) means for feeding back said channel identifying signals to the remote sites over a first carrier frequency;\niv) multiplexer means for compressing and multiplexing said video signals of said allocated channels, said multiplexer means including means for modulating said video signals over a second carrier frequency, sand said video signals being modulated over said predetermined carrier frequencies of their respective channels and over said second carrier frequency; and\nv) means for transmitting said multiplexer signals from said central switching means to the selecting remote sites; and\ne) each remote site including:\ni) selection means for using said feedback channel identifying signals to selectively identify and select the channels to be revised by each remote site;\nii) means for receiving said multiplexed signals;\niii) means for demultiplexing and separating said received signals into separate channels;\niv) means for storing the separated signals for a predetermined period of time;\nv) means for decompressing and reconstructing the signals of the selected channel on a real-time basis; and\nvi) monitor means for displaying the reconstructed signals of the selected channel on a real-time basis.\n2. The video teleconferencing network as defined in claim 1, wherein:\na) said multiplexer means is responsive to said selection means from each one of the remote sites, for compressing and multiplexing only the channels which were selected by said selection means; and\nb) said means for transmitting transmits only said selected and multiplexed channels to the particular remote site which made the selection.\n3. The video teleconferencing network as defined in claim 1, wherein:\na) said central switching means further comparator means for differentiating said video signals from the remote sites, and for comparing the differential signals to said video signals; and\nb) said multiplexer means samples only said video signals when the first derivative of said video signals is different from zero.\n4. The video teleconferencing as defined in claim 1, wherein said means for generating video signals includes an optical system, said optical system comprising:\na) a plurality of lens system means for processing colors of different frequencies;\nb) each one of said lens system means including shutter means, for generating amplitude vectorial signals proportional to the amplitude of the color signal being processed by said lens system;\nc) each one of said lens systems further including means responsive to the frequency of the corresponding color being processed by said particular lens system, for frequency generating vectorial signals proportional to the frequency of the color signal being processed by said lens system;\nd) amplitude mixing means for generating a resulting amplitude signal proportional to the vectorial sum of said amplitude vectorial signals; and\ne) frequency mixing means for generating a resulting frequency signal proportional to the vectorial sum of frequency vectorial signals.\n5. The video teleconferencing network as defined in claim 4,\na) wherein said optical system includes three lens system means for processing blue, red and green color signals;\nb) wherein said amplitude vectorial signals are proportional to the amplitudes of the blue, red and green signals;\nc) wherein said frequency vectorial signals are proportional to the frequencies of the blue, red and green signals;\nd) wherein said lens systems are rotated with angular velocities (Wb, Wr and Wg) proportional to the frequencies of the blue, red and green colors respectively;\ne) wherein said resulting vectorial amplitude signal (Ao) is calculated by mixing the blue, red and green amplitude vectorial signals (Ab, Ar and Ag), as follows:\nAo=Ar.l+Ag.m+Ab.n,\nwhere l, m and n are unit vectors.\nf) wherein said resulting vectorial frequency signal (Wo) is calculated by mixing the blue, red and green frequency vectorial signals (Wb, Wr and Wg), as follows:\nWo=Wr.i+Wg.j+Wb.k,\nwhere i, j and k are unit vectors; and\ng) wherein said vectorial units 1, m and n have equal absolute values; and wherein the absolute values of said vectorial units i, j, and k are proportional to the selected frequencies of the red, green and blue colors respectively.\n6. The video teleconferencing network as defined in claim 1, wherein said monitor means includes a modular monitor comprising:\na) a liquid crystal modular screen, for use by an individual user to display texts and graphics;\nb) said modular screen including a plurality of modules selectively engageable to one another, by the individual user, to form a single unitary screen;\nc) user station means adapted to be coupled to said single unitary screen, for controlling the display of information on said unitary screen; and\nd) said modules being disengageable from one another by the individual user.\n7. The video teleconferencing network as defined in claim 6, wherein each one of said modules includes:\na) a plurality of horizontal matrix transistor elements, wherein each one of said transistor elements has a drain and a gate;\nb) a plurality of vertical matrix transistor elements each;\nc) drain shift register means for providing output signals from the drains of said vertical matrix transistor elements;\nd) gate shift register means for providing output signals from the gates of said horizontal matrix transistor elements;\ne) wherein said drain shift register means from said modules are selectively, serially coupled to form a single drain shift register for said unitary screen; and\nf) wherein said gate shift register means from said modules are selectively, serially coupled to form a single gate shift register for said unitary screen.\n8. The video teleconferencing network as defined in claim 4, wherein said monitor means includes a modular monitor comprising:\na) a liquid crystal modular screen, for use by an individual user to display texts and graphics;\nb) said modular screen including a plurality of modules selectively engageable to one another, by the individual user, to form a single unitary screen;\nc) user station means adapted to be coupled to said single unitary screen, for controlling the display of information on said unitary screen; and\nd) said modules being disengageable from one another by the individual user.\n9. The video teleconferencing network as defined in claim 5, wherein said monitor means includes a modular monitor comprising:\na) a liquid crystal modular screen, for use by an individual user to display texts and graphics;\nb) said modular screen including a plurality of modules selectively engageable to one another, by the individual user, to form a single unitary screen;\nc) user station means adapted to be coupled to said single unitary screen, for controlling the display of information on said unitary screen; and\nd) said modules being disengageable from one another by the individual user.\n10. The video teleconferencing network as defined in claim 5, wherein each one of said modules includes:\na) a plurality of horizontal matrix transistor elements, wherein each one of said transistor elements has a drain and a gate;\nb) a plurality of vertical matrix transistor elements each;\nc) drain shift register means for providing output signals from the drains of said vertical matrix transistor elements;\nd) gate shift register means for providing output signals from the gates of said horizontal matrix transistor elements;\ne) wherein said drain shift register means from said modules are selectively, serially coupled to form a single drain shift register for said unitary screen; and\nf) wherein said gate shift register means from said modules are selectively, serially coupled to form a single gate shift register for said unitary screen.\n11. A teleconferencing method for providing selective video communication capability among a plurality of remote sites and a central video switching exchange (CVSE), the teleconferencing method comprising the steps of:\na) initiating a video call to one or more remote sites for participating in a video teleconferencing session;\nb) the CVSE allocating a plurality of different video channels to the participating remote sites, each video channel corresponding to one of the participating remote sites;\nc) the CVSE generating signals for identifying said video channels, said video identifying signals being distinct from said video channels;\nd) transmitting said channel identifying signals to the participating remote sites;\ne) each of the remote sites selecting the desired video identifying signals indicative of the desired video channels to be viewed at the selecting remote site;\nf) the remote sites feeding back said selected video identifying signals to the CVSE;\ng) the CVSE scanning said fed back video identifying signals for identifying the video channels selected by each of the remote sites;\nh) the CVSE compressing and multiplexing said allocated video channels and modulating said video channels over a second carrier frequency, each of said video channels having a predetermined carrier frequency, and said video channels including video signals being modulated over said predetermined carrier frequencies of their respective video channels and over said second carrier frequency, the CVSE compressing and multiplexing said signals from said allocated video channels into separate video signal packets, each packet corresponding to the particular selection of the video channels made by one of the remote sites;\ni) the CVSE transmitting said video signal packets to the corresponding remote site;\nj) each of the remote sites receiving its corresponding compressed and multiplexed video signal packet;\nk) each of the remote sites demultiplexing and separating the received video signal packets into separate video channels;\nl) each of the remote sites reconstructing the demultiplexed video channels on a real-time basis; and\nm) each of the remote sites displaying the signals of said reconstructed video channels on a real-time basis.\n12. The teleconferencing method as defined in claim 11, wherein the CVSE continually scans said fed back video identifying signals for identifying the video channels selected by each of the remote sites, and for compressing and transmitting only the signals from those video channels which were individually selected by each of the remote sites.\n13. The teleconferencing method as defined in claim 12, further including the step of having the CVSE pass the video signals incoming from each of the remote sites through a Fourier transformer for generating sinusoidal signals.\n14. The teleconferencing method as defined in claim 13, further including the step of limiting the incoming video signals from the remote sites to the most desirable sinusoidal signals.\n15. The teleconferencing method as defined in claim 14, wherein said step of compressing and multiplexing, includes compressing and multiplexing only those desirable sinusoidal signals.\n16. The teleconferencing method as defined in claim 11, further including the steps of:\na) differentiating the video signals incoming from the remote sites; and\nb) sampling only those video signals whose first derivative is different from zero.\n17. The teleconferencing method as defined in claim 11, further including the steps of:\na) differentiating the video signals (Sn) incoming from the remote sites for generating first derivative signals (dSn/Dt); and\nb) differentiating said first derivative signals (dSn/dt) for generating second derivative signals (ddSn/ddt).\n18. The teleconferencing method as defined in claim 13, further including the steps of:\na) differentiating the desired Fourier transformed video signals (Sn) incoming from the remote sites for generating first derivative signals (dSn/dt);\nb) differentiating said first derivative signals (dSn/dt) for generating second derivative signals (ddSn/ddt); and\nc) adding said Fourier transformed video signals (Sn) to said corresponding second derivative signals (ddSn/ddt) to generate signals DSn.\n19. A video teleconferencing network for providing selective video communication capability among a plurality of remote sites and a central video switching exchange (CVSE), the teleconferencing network comprising:\na) means for initiating a video call to one or more remote sites for participating in a video teleconferencing session;\nb) means for allocating a plurality of different video channels to the participating remote sites, each video channel corresponding to one of the participating remote sites;\nc) means for generating signals for identifying said video channels, said video identifying signals being distinct from said video channels;\nd) means for transmitting said channel identifying signals to all the participating remote sites;\ne) control mean located at the remote sites for selecting the desired video identifying signals indicative of the desired video channels to be viewed at the selecting remote site;\nf) feed-back means at the remote sites for feeding back said selected video identifying signals to the CVSE;\ng) means for scanning said fed back video identifying signals for identifying the video channels selected by each of the remote sites;\nh) multiplexer means for compressing and multiplexing said allocated video channels and modulating said video channels over a second carrier frequency, each of said video channels having a predetermined carrier frequency, and said video channels including video signals being modulated over the predetermined carrier frequencies of their respective video channels and over said second carrier frequency, said multiplexer means compressing and multiplexing said video signals from said allocated video channels into separate video signal packets, each packet corresponding to the particular selection of the video channels made by one of the remote sites;\ni) means for transmitting said video signal packets to the corresponding remote site;\nj) reception means at the remote sites for receiving a corresponding compressed and multiplexed video signal packet;\nk) means located at the remote sites for demultiplexing and separating the received video signal packets into separate video channels;\nl) means for reconstructing the demultiplexed video channels, at the remote sites, on a real-time basis; and\nm) display means at the remote sites for displaying the signals of said reconstructed video channels on a real-time basis.\n20. The teleconferencing network as defined in claim 19, wherein:\na) the CVSE includes means for continually scanning said fed back video identifying signals for identifying the video channels selected by each of the remote sites, and for compressing and transmitting only the signals from those video channels which were individually selected by each of the remote sites;\nb) Fourier transform means for transforming the video signals incoming from each of the remote sites through to generate sinusoidal signals (Sn);\nc) means for limiting said Fourier transformed video signals (Sn) from the remote sites to the most desirable sinusoidal signals;\nd) means for differentiating said video signals (Sn) for generating first derivative signals (dSn/dt);\ne) means for differentiating said first derivative signals (dSn/dt) for generating second derivative signals (ddSn/ddt); and\nf) means for adding said Fourier transformed video signals (Sn) to said corresponding second derivative signals (ddSn/ddt) to generate signals DSn.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3213201A",
        "US3693090A",
        "US3733430A",
        "US4215370A",
        "US4215369A",
        "US4300161A",
        "US4408836A",
        "US4410980A",
        "US4442454A",
        "US4450477A",
        "US4467356A",
        "US4533936A",
        "US4593318A",
        "US4597058A",
        "US4646135A",
        "US4650929A",
        "US4654799A",
        "US4689661A",
        "US4806922A",
        "US4824215A",
        "US4832457A",
        "US4874227A",
        "US4896209A",
        "US4903126A",
        "US4975771A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5241382A",
        "US5262875A",
        "WO1994014138A1",
        "WO1994024773A1",
        "US5371535A",
        "US5390177A",
        "US5392223A",
        "US5408261A",
        "US5434913A",
        "US5442462A",
        "US5446491A",
        "US5490247A",
        "US5493568A",
        "US5506954A",
        "US5530699A",
        "US5534941A",
        "US5537141A",
        "US5553064A",
        "US5557333A",
        "US5559559A",
        "US5566238A",
        "EP0738440A1",
        "US5572247A",
        "US5574934A",
        "US5579389A",
        "US5600797A",
        "US5617148A",
        "US5631967A",
        "US5632007A",
        "US5673393A",
        "US5675393A",
        "US5677728A",
        "US5682196A",
        "US5724091A",
        "US5751694A",
        "US5754765A",
        "US5767913A",
        "US5768517A",
        "US5799111A",
        "US5809237A",
        "US5831679A",
        "US5835129A",
        "US5861881A",
        "US5862388A",
        "US5877801A",
        "US5949891A",
        "US5956034A",
        "US5991801A",
        "US6049694A",
        "US6125398A",
        "US6157385A",
        "US6195667B1",
        "US6212547B1",
        "US6222683B1",
        "US6275934B1",
        "US6314474B1",
        "US6331869B1",
        "US6341044B1",
        "US6351750B1",
        "US6356296B1",
        "US6363418B1",
        "US6369818B1",
        "US6373642B1",
        "US6426774B1",
        "US20020124051A1",
        "US6466254B1",
        "US6493032B1",
        "US20020188950A1",
        "US20030021166A1",
        "US20030041060A1",
        "US20030069812A1",
        "US20030122954A1",
        "US6654045B2",
        "US20040010804A1",
        "US20040073953A1",
        "US6731284B1",
        "US20040119815A1",
        "US6898620B1",
        "US6924832B1",
        "US20050198006A1",
        "US20050219407A1",
        "US7185054B1",
        "US20070093672A1",
        "US20070103739A1",
        "US7277010B2",
        "US20070291128A1",
        "US20080065268A1",
        "US7397363B2",
        "US20080313686A1",
        "US20100115418A1",
        "US7747086B1",
        "US7822278B1",
        "US20110050841A1",
        "US7937740B2",
        "US8077963B2",
        "US8108577B1",
        "US8107527B1",
        "US8209051B2",
        "US8255966B2",
        "US8340819B2",
        "US8345768B1",
        "US8463435B2",
        "US8560753B1",
        "US8670017B2",
        "US8718837B2",
        "US8836751B2",
        "US8849679B2",
        "US8849680B2",
        "US8855414B1",
        "US8861750B2",
        "US8892260B2",
        "US8897920B2",
        "US8902278B2",
        "US8930019B2",
        "US8935005B2",
        "US8996165B2",
        "US9014848B2",
        "US9075136B1",
        "US9098611B2",
        "US9138891B2",
        "US9160783B2",
        "US9174342B2",
        "US9193065B2",
        "US9198728B2",
        "US9251313B2",
        "US9264664B2",
        "US9323250B2",
        "US9361021B2",
        "US9375843B2",
        "US9498886B2",
        "US9842192B2",
        "US9974612B2",
        "US10011247B2",
        "US10152876B2",
        "US10343283B2",
        "US10471588B2",
        "US10546441B2",
        "US10562492B2",
        "US10769739B2",
        "US10796268B2",
        "US10808882B2",
        "US10856031B2",
        "US10875182B2",
        "US11154981B2",
        "US11389064B2",
        "US11399153B2",
        "US11636944B2",
        "US11742094B2"
    ],
    "citedby_ftf": []
}