{
    "patent_id": "US-11357502-B2",
    "title": "Surgical stapling device with independent tip rotation ",
    "assignee": "Covidien Lp",
    "publication_date": "2022-06-14",
    "patent_link": "https://patents.google.com/patent/US11357502B2/en",
    "inventors": [
        "David C. Racenet",
        "Ralph A. Stearns",
        "Philip C. Roy",
        "John W. Beardsley",
        "Lee A. Olson"
    ],
    "classifications": [
        "A61B17/068",
        "A61B17/07207",
        "A61B2017/07214",
        "A61B2017/07285",
        "A61B2017/2922",
        "A61B2017/2923",
        "A61B2017/2925",
        "A61B2017/2927",
        "A61B2017/2932",
        "A61B2017/2937",
        "A61B2017/2946"
    ],
    "abstract": "A surgical stapling device is disclosed which includes a handle assembly, an endoscopic body portion and a tool assembly. The tool assembly is rotatably and pivotally supported on a distal end of the endoscopic body portion. A tool assembly rotation mechanism is provided which includes a rotation knob, a substantially rigid tube and a flexible member interconnecting the rigid tube to the tool assembly. The substantially rigid tube translates rotation of the rotation knob to rotation of the flexible member and provides a channel for passage of other components of the surgical stapling device.",
    "claims": "\n1. A surgical device comprising:\nan elongate body portion having a proximal portion and a distal portion, the elongate body defining a first longitudinal axis;\na tool assembly supported on the distal portion of the elongate body portion and defining a second longitudinal axis, the tool assembly rotatable about the second longitudinal axis;\nan actuation member associated with the tool assembly;\na tool assembly rotation mechanism including a rigid tube and a flexible member, the rigid tube positioned within the body portion and having a proximal portion and a distal portion, the distal portion of the rigid tube operably connected to the tool assembly via the flexible member; and\na flexible firing cable operably connected to the actuation member, the flexible firing cable extending through the rigid tube and the flexible member of the tool assembly rotation mechanism.\n2. The surgical device of claim 1, further including a flexible retraction cable coupled to the actuation member, wherein the flexible firing cable is movable to move the actuation member in one direction along the second longitudinal axis and the flexible firing cable is movable to move the actuation member in a second opposite direction along the second longitudinal axis.\n3. The surgical device of claim 2, wherein the flexible retraction cable and the flexible firing cable both operate in tension.\n4. The surgical device of claim 3, further including a handle assembly having a stationary handle portion and an operating trigger, the operating trigger operably connected to the actuation member by the flexible retraction cable and the flexible firing cable.\n5. The surgical device of claim 4, wherein the elongate body portion is rotatable in relation to the handle assembly about the first longitudinal axis.\n6. The surgical device of claim 1, wherein the tool assembly is pivotally supported on the distal portion of the elongate body portion about an axis transverse to the first longitudinal axis.\n7. The surgical device of claim 1, wherein the flexible member includes a hollow bellows.\n8. The surgical device of claim 1, wherein the flexible member includes a coil spring.\n9. The surgical device of claim 1, wherein the tool assembly includes a cartridge assembly and an anvil assembly, the cartridge assembly including a plurality of staples, the anvil assembly movable in relation to the cartridge assembly between spaced and approximated positions.\n10. The surgical device according to claim 9, wherein the plurality of staples of the cartridge assembly are arranged in a plurality of linear rows.\n11. The surgical device according to claim 1, wherein the tool assembly rotation mechanism includes a first gear fixedly secured to the rigid tube.\n12. The surgical device of claim 11, wherein the tool assembly rotation mechanism includes a spacer tube and a second gear, the spacer tube positioned about the rigid tube and the second gear rotatably supported on the spacer tube in engagement with the first gear.\n13. The spacer device of claim 12, further comprising a rotation knob having an inner surface, the inner surface of the rotation knob having rotation knob gear teeth, the rotation knob gear teeth engaging with the second gear such that rotation of the rotation knob effects rotation of the second gear which in turn effects rotation of the rigid tube.\n14. A surgical device comprising:\na handle assembly;\nan elongate body portion having a proximal portion and a distal portion and defining a first longitudinal axis, the proximal portion of the elongate body portion coupled to the handle assembly such that the elongate body portion is rotatable in relation to the handle assembly about the first longitudinal axis;\na tool assembly defining a second longitudinal axis, the tool assembly rotatably and pivotally supported on the distal portion of the elongate body portion, the tool assembly being pivotal about a pivot axis that is substantially transverse to the first longitudinal axis of the body portion and rotatable about the second longitudinal axis;\nan actuation member operatively connected to the handle assembly and movable to actuate the tool assembly; and\na control mechanism coupled to the tool assembly and operable to effect rotation of the tool assembly in relation to the elongate body portion, the control mechanism including a hollow tube positioned within the body portion and a hollow bellows coupling the hollow tube to the tool assembly; and\na flexible firing cable operably connected to the actuation member, the flexible firing cable extending through the hollow tube and the hollow bellows of the tool assembly rotation mechanism.\n15. The surgical device of claim 14, wherein the tool assembly includes a cartridge assembly and an anvil, the cartridge assembly having a plurality of staples, the anvil assembly movable in relation to the cartridge assembly between spaced and approximated positions.\n16. The surgical device of claim 15, wherein the plurality of staples of the cartridge assembly is arranged in a plurality of linear rows.\n17. The surgical device of claim 16, further including a drive sled positioned adjacent to the actuation member, and a knife blade supported by the actuation member."
}