{
    "patent_id": "US-11488714-B2",
    "title": "Machine learning for collaborative medical data metrics ",
    "assignee": "HealthPals, Inc.",
    "publication_date": "2022-11-01",
    "patent_link": "https://patents.google.com/patent/US11488714B2/en",
    "inventors": [
        "Sushant Shankar",
        "Rajesh Dash"
    ],
    "classifications": [
        "G16H50/20",
        "G06N20/00",
        "G06N3/042",
        "G06N3/08",
        "G06N5/022",
        "G06N5/025",
        "G06N5/046",
        "G06N7/005",
        "G06N7/01",
        "G16H10/60",
        "G16H20/30",
        "G16H20/60",
        "G16H50/30",
        "G16H50/70",
        "G06F16/35",
        "G06F18/217",
        "G06F18/24155",
        "G06K9/6262",
        "G06K9/6278",
        "G06N3/02",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/082",
        "G06N3/088",
        "G16H10/40",
        "G16H15/00",
        "G16H20/10",
        "G16H80/00"
    ],
    "abstract": "A medical knowledge database including medical knowledge information, medical diagnoses, and medical treatments, is used for machine learning for collaborative medical data metrics. Medical data is collected from a plurality of clinicians serving a first plurality of patients and assembling a medical knowledge database that includes medical knowledge information, medical diagnoses, and medical treatments. The medical knowledge database is a function of demographics and comprises a medical probabilistic rules graph. The medical knowledge database is augmented based on further medical data collected from a second plurality of clinicians. The further medical data is based on individual patient treatment outcomes collected by the second plurality of clinicians. Medical data from a further patient is applied to the medical probabilistic rules graph. A medical diagnosis is provided, based on the medical data applied from a further patient to the rules graph. The medical diagnosis is used to institute a treatment plan.",
    "claims": "\n1. A computer-implemented method for machine-learned collaborative medical diagnosis comprising:\ncollecting medical data from a plurality of clinicians serving a first plurality of patients and assembling a medical knowledge database using a neural network to perform machine learning, wherein the database includes medical knowledge information, medical diagnoses, and medical treatments, wherein the medical knowledge database contains data representing a plurality of edges and nodes that comprise a medical probabilistic directed acyclic rules graph generated by the neural network;\npruning the medical probabilistic directed acyclic rules graph by removing paths having a probability below a predetermined threshold;\naugmenting the medical knowledge database and the medical probabilistic directed acyclic rules graph by training the neural network based on further medical data collected from a second plurality of clinicians, wherein the further medical data is based on individual patient treatment outcomes collected by the second plurality of clinicians;\napplying medical data from a further patient to the medical probabilistic directed acyclic rules graph that was augmented by training the neural network; and\nproviding a medical diagnosis for the further patient, based on the medical data applied from the further patient to the medical probabilistic directed acyclic rules graph generated by the neural network.\n2. The method of claim 1 wherein the medical diagnosis is used to institute a treatment plan.\n3. The method of claim 2 wherein the treatment plan that was instituted comprises a change in treatment.\n4. The method of claim 1 wherein the medical diagnosis comprises a list of evidence-based treatments, lab work recommendations, diagnostic recommendations, or lifestyle interventions.\n5. The method of claim 1 wherein the medical diagnosis provides evidence-based gaps in care or errors in treatment plans.\n6. The method of claim 1 wherein the collecting, the augmenting, the applying, and the providing comprise machine learning medical analysis.\n7. The method of claim 1 further comprising further augmenting the medical knowledge database based on non-medical data.\n8. The method of claim 7 further comprising applying further non-medical data from the further patient to the medical probabilistic rules graph, wherein the medical probabilistic rules graph has been updated based on the medical knowledge database that was further augmented.\n9. The method of claim 1 further comprising projecting an impact for the further patient due to a change in medical treatment.\n10. The method of claim 1 further comprising projecting an impact due to a change in behavior.\n11. The method of claim 1 further comprising generating a treatment plan for the further patient based on the medical probabilistic rules graph that was augmented.\n12. The method of claim 11 wherein the further patient is within the first plurality of patients or a second plurality of patients.\n13. The method of claim 11 wherein the treatment plan for the further patient is further based on health background descriptors.\n14. The method of claim 1 wherein there is overlap between the first plurality of patients and a second plurality of patients.\n15. The method of claim 1 further comprising performing a query by a clinician of the medical knowledge database.\n16. The method of claim 15 wherein the query is based on demographic data from an additional further patient.\n17. The method of claim 16 wherein the query results in a diagnosis for the additional further patient.\n18. The method of claim 1 wherein the plurality of clinicians and the second plurality of clinicians have one or more clinicians in common.\n19. The method of claim 1 wherein the augmenting the medical knowledge database is accomplished with a deep learning system.\n20. The method of claim 19 further comprising mapping a medical treatment to efficacy using the deep learning system.\n21. The method of claim 19 further comprising determining an anticipated medical outcome based on a medical treatment and a clinical state for the further patient.\n22. The method of claim 1 wherein the assembling the medical knowledge database includes generating medical rules based on the medical knowledge information.\n23. The method of claim 22 wherein a subset of the medical rules is included in the medical probabilistic rules graph.\n24. The method of claim 23 wherein the medical rules apply rules within the subset of the medical rules in a specific order based on an ordering.\n25. The method of claim 1 further comprising providing feedback to improve the medical knowledge information based on evaluating treatment results.\n26. A computer program product embodied in a non-transitory computer readable medium for machine learned collaborative medical diagnosis, the computer program product comprising code which causes one or more processors to perform operations of:\ncollecting medical data from a plurality of clinicians serving a first plurality of patients and assembling a medical knowledge database using a neural network to perform machine learning, wherein the database includes medical knowledge information, medical diagnoses, and medical treatments, wherein the medical knowledge database contains data representing a plurality of edges and nodes that comprise a medical probabilistic directed acyclic rules graph generated by the neural network;\npruning the medical probabilistic directed acyclic rules graph by removing paths having a probability below a predetermined threshold;\naugmenting the medical knowledge database and the medical probabilistic directed acyclic rules graph by training the neural network based on further medical data collected from a second plurality of clinicians, wherein the further medical data is based on individual patient treatment outcomes collected by the second plurality of clinicians;\napplying medical data from a further patient to the medical probabilistic directed acyclic rules graph that was augmented by training the neural network; and\nproviding a medical diagnosis for the further patient, based on the medical data applied from the further patient to the medical probabilistic directed acyclic rules graph generated by the neural network.\n27. A computer system for machine learned collaborative medical diagnosis comprising:\na memory which stores instructions;\none or more processors attached to the memory wherein the one or more processors, when executing the instructions which are stored, are configured to:\ncollect medical data from a plurality of clinicians serving a first plurality of patients and assembling a medical knowledge database using a neural network to perform machine learning, wherein the database includes medical knowledge information, medical diagnoses, and medical treatments, wherein the medical knowledge database contains data representing a plurality of edges and nodes that comprise a medical probabilistic directed acyclic rules graph generated by the neural network;\naugment the medical knowledge database and the medical probabilistic directed acyclic rules graph by training the neural network based on further medical data collected from a second plurality of clinicians, wherein the further medical data is based on individual patient treatment outcomes collected by the second plurality of clinicians;\napply medical data from a further patient to the medical probabilistic directed acyclic rules graph that was augmented by training the neural network; and\nprovide a medical diagnosis for the further patient, based on the medical data applied from the further patient to the medical probabilistic directed acyclic rules graph generated by the neural network.",
    "status": "Active",
    "citations_own": [
        "US20080201280A1",
        "US8015136B1",
        "US20140350967A1",
        "WO2014186838A1",
        "US8956287B2",
        "US20150051461A1",
        "US8977347B2",
        "US20150087926A1",
        "US9042970B2",
        "US9119554B2",
        "US20160055307A1",
        "US20160371446A1",
        "US20170024640A1",
        "US20170076052A1"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "CN109313929A",
        "US10068207B2",
        "US10839961B2",
        "US11404147B2",
        "CN107169078A",
        "TWI778289B",
        "US11763950B1",
        "WO2020074191A1",
        "US11154240B2",
        "US11625789B1",
        "US11621085B1",
        "US11238469B1",
        "US20210005320A1",
        "EP3796236A1",
        "CN114586107A",
        "US10936962B1",
        "US11270785B1",
        "US10857426B1",
        "US11699107B2",
        "CN111462894B",
        "US11620282B2",
        "CN112466462B",
        "TW202230396A",
        "CN112786198A",
        "WO2022212324A1",
        "US11275903B1"
    ]
}