{
    "patent_link": "https://patents.google.com/patent/US20100082421A1/en",
    "patent_id": "US20100082421A1",
    "title": "Click through rate prediction system and method",
    "abstract": "A computer implemented method comprises analyzing a plurality of attributes of a sample of online documents using a boosted decision tree and generating a model from it. The model is used to predict a click through rate (CTR) of an additional online document based on the analyzing. The predicted CTR is output to a display device, storage medium or network.",
    "inventors": [
        "Looja Tuladhar",
        "Manish Satyapal Gupta"
    ],
    "assignee": "Altaba Inc",
    "classifications": [
        "G06Q30/02",
        "G06Q10/04",
        "G06Q20/102",
        "G06Q30/0242",
        "G06Q30/0283"
    ],
    "claims": "\n1 A computer implemented method comprising:\nanalyzing a plurality of attributes of a sample of online documents using a boosted decision tree and generating a model therefrom;\nusing the model to predict a click through rate (CTR) of an additional online document based on the analyzing;\noutputting the predicted CTR to a display device, storage medium or network.\n2. The method of claim 1, further comprising:\nusing the model to predict respective click through rates (CTR) of a plurality of additional online documents based on the analyzing;\nusing the respective predicted CTR of each of the plurality of additional online documents as an input factor for ranking the plurality of additional online documents; and\nrendering the additional online documents or portions thereof for display in order of their respective rankings.\n3. The method of claim 1, wherein the additional online document is one of the group consisting of an advertisement, a response to a search query, a photograph, a movie, an image, an audio clip, a video clip and a commercial document product.\n4. The method of claim 1, wherein the plurality of attributes include at least one of the group consisting of CTR of other documents by the same author as the additional online document, CTR of other documents published by the same publisher of the additional online document, and CTR of other documents having the same type as the additional online document.\n5. The method of claim 1, wherein the plurality of attributes include a CTR of other documents having titles that are the same as or similar to a title of the additional online document.\n6. The method of claim 5, wherein similarity of any two documents is determined by cardinality of a difference set that includes non-overlapping terms included in the title of one of the two documents but not included in the title of the other of the two documents.\n7. The method of claim 1, wherein the plurality of attributes include a measure indicating an amount of spam feedback received relating to the document.\n8. A method comprising:\nanalyzing a plurality of attributes of a sample of online job advertisements using a regression technique and generating a model therefrom;\nusing the model to predict a click through rate (CTR) of an additional online job advertisement based on the analyzing;\noutputting the predicted CTR to a display device, storage medium or network.\n9. The method of claim 8, wherein the additional online job advertisement is associated with a job, and the plurality of attributes include at least one of the group consisting of: CTR of other jobs having a title that is the same as the job, CTR of other jobs for an employer that is the same as the job, CTR of other jobs a location proximate a location of the job, CTR of other jobs having the same type as the job.\n10. The method of claim 8, wherein the additional online job advertisement is associated with a job, and the plurality of attributes include a CTR of other jobs having titles that are similar to a title of the job.\n11. The method of claim 10, wherein similarity of any two job titles is determined by cardinality of a difference set that includes non-overlapping terms included in one of the job titles but not included in another job title.\n12. The method of claim 8, further comprising:\ndetermining a fee for rendering the additional online job advertisement based on the predicted CTR;\nreceiving a payment of the determined fee from an advertiser; and\nrendering the advertisement in response to receiving the payment of the determined fee.\n13. The method of claim 8, further comprising:\nusing the model to predict respective click through rates (CTR) of a plurality of additional online job advertisements based on the analyzing;\nusing the respective predicted CTR of each of the plurality of additional online job advertisements as an input factor for ranking the plurality of additional online job advertisements; and\nrendering the additional online job advertisements for display in order of their respective rankings in response to an online job query.\n14. The method of claim 8, wherein the regression technique is one of the group consisting of boosted decision tree, logistic regression, Bayesian classifiers and Software Vector Machines.\n15. A system comprising:\na machine readable storage medium storing a sample of online documents;\na processor configured for analyzing a plurality of attributes of the sample of online documents using a boosted decision tree and generating a model therefrom;\nthe processor configured to use the model to predict a click through rate (CTR) of an additional online document based on the analyzing;\nthe processor configured to output the predicted CTR to a display device, storage medium or network.\n16. The system of claim 15, wherein:\nthe processor is configured to use the model to predict respective click through rates (CTR) of a plurality of additional online documents based on the analyzing;\nthe processor is configured to use the respective predicted CTR of each of the plurality of additional online documents as an input factor for ranking the plurality of additional online documents; and\nthe processor is configured to render the additional online documents or portions thereof for display in order of their respective rankings.\n17. The system of claim 15, wherein the plurality of attributes include at least one of the group consisting of CTR of other documents by the same author as the additional online document, CTR of other documents published by the same publisher of the additional online document, and CTR of other documents having the same type as the additional online document.\n18. The system of claim 15, wherein the plurality of attributes include a CTR of other documents having titles that are the same as or similar to a title of the additional online document.\n19. The system of claim 18, wherein similarity of any two documents is determined by cardinality of a difference set that includes non-overlapping terms included in the title of one of the two documents but not included in the title of the other of the two documents.\n20. A system comprising:\na machine readable storage medium storing a sample of online job advertisements;\na processor configured for analyzing a plurality of attributes of the sample of online job advertisements using a regression technique and generating a model therefrom;\nthe processor configured to use the model to predict a click through rate (CTR) of an additional online job advertisement based on the analyzing;\nthe processor is configured to output the predicted CTR to a display device, storage medium or network.\n21. The system of claim 20, wherein the additional online job advertisement is associated with a job, and the plurality of attributes include at least one of the group consisting of: CTR of other jobs having a title that is the same as or similar to the job, CTR of other jobs for an employer that is the same as the job, CTR of other jobs a location proximate a location of the job, CTR of other jobs having the same type as the job.\n22. The system of claim 21, wherein similarity of any two job titles is determined by cardinality of a difference set that includes non-overlapping terms included in one of the job titles but not included in another job title.\n23. The system of claim 20, wherein:\nthe processor is configured to determine a fee for rendering the additional online job advertisement based on the predicted CTR;\nthe processor is configured to receive a payment of the determined fee from an advertiser; and\nthe processor is configured to render the advertisement in response to receiving the payment of the determined fee.\n24. The system of claim 20, wherein:\nthe processor is configured to use the model to predict respective click through rates (CTR) of a plurality of additional online job advertisements based on the analyzing;\nthe processor is configured to use the respective predicted CTR of each of the plurality of additional online job advertisements as an input factor for ranking the plurality of additional online job advertisements; and\nthe processor is configured to render the additional online job advertisements for display in order of their respective rankings in response to an online job query.\n25. The system of claim 20, wherein the regression technique is one of the group consisting of boosted decision tree, logistic regression, Bayesian classifiers and Software Vector Machines.\n26. A machine readable storage medium encoded with computer program code, wherein when the computer program code is executed by a processor, the processor performs a machine implemented method comprising the steps of:\nanalyzing a plurality of attributes of a sample of online documents using a boosted decision tree and generating a model therefrom;\nusing the model to predict a click through rate (CTR) of an additional online document based on the analyzing;\noutputting the predicted CTR to a display device, storage medium or network.\n27. The machine readable storage medium of claim 26, further comprising:\nusing the model to predict respective click through rates (CTR) of a plurality of additional online documents based on the analyzing;\nusing the respective predicted CTR of each of the plurality of additional online documents as an input factor for ranking the plurality of additional online documents; and\nrendering the additional online documents or portions thereof for display in order of their respective rankings.\n28. The machine readable storage medium of claim 26, wherein the plurality of attributes include at least one of the group consisting of CTR of other documents by the same author as the additional online document, CTR of other documents published by the same publisher of the additional online document, and CTR of other documents having the same type as the additional online document.\n29. The machine readable storage medium of claim 26, wherein the plurality of attributes include a CTR of other documents having titles that are the same as or similar to a title of the additional online document.\n30. The machine readable storage medium of claim 29, wherein similarity of any two documents is determined by cardinality of a difference set that includes non-overlapping terms included in the title of one of the two documents but not included in the title of the other of the two documents.\n31. A machine readable storage medium encoded with computer program code, wherein when the computer program code is executed by a processor, the processor performs a machine implemented method comprising the steps of:\nanalyzing a plurality of attributes of a sample of online job advertisements using a regression technique and generating a model therefrom;\nusing the model to predict a click through rate (CTR) of an additional online job advertisement based on the analyzing;\noutputting the predicted CTR to a display device, storage medium or network.\n32. The machine readable storage medium of claim 31, wherein the additional online job advertisement is associated with a job, and the plurality of attributes include at least one of the group consisting of: CTR of other jobs having a title that is the same as the job, CTR of other jobs for an employer that is the same as the job, CTR of other jobs a location proximate a location of the job, CTR of other jobs having the same type as the job.\n33. The machine readable storage medium of claim 31, wherein the additional online job advertisement is associated with a job, and the plurality of attributes include a CTR of other jobs having titles that are similar to a title of the job.\n34. The machine readable storage medium of claim 33, wherein similarity of any two job titles is determined by cardinality of a difference set that includes non-overlapping terms included in one of the job titles but not included in another job title.\n35. The machine readable storage medium of claim 31, further comprising:\ndetermining a fee for rendering the additional online job advertisement based on the predicted CTR;\nreceiving a payment of the determined fee from an advertiser; and\nrendering the advertisement in response to receiving the payment of the determined fee.\n36. The machine readable storage medium of claim 31, further comprising:\nusing the model to predict respective click through rates (CTR) of a plurality of additional online job advertisements based on the analyzing;\nusing the respective predicted CTR of each of the plurality of additional online job advertisements as an input factor for ranking the plurality of additional online job advertisements; and\nrendering the additional online job advertisements for display in order of their respective rankings in response to an online job query.\n37. The machine readable storage medium of claim 31, wherein the regression technique is one of the group consisting of boosted decision tree, logistic regression, Bayesian classifiers and Software Vector Machines.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US6272507B1",
        "US20040054572A1",
        "US20050165766A1",
        "US6990628B1",
        "US20060095336A1",
        "US20060294068A1",
        "US20070005568A1",
        "US20070118432A1",
        "US20070156677A1",
        "US20070162379A1",
        "US20070174114A1",
        "US20080004962A1",
        "US20080189179A1",
        "US20080256064A1",
        "US20080301116A1",
        "US20090124241A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20100082566A1",
        "US20100138410A1",
        "US20100153315A1",
        "US20100250361A1",
        "US20110029516A1",
        "CN102346745A",
        "WO2012071396A1",
        "US20130173571A1",
        "US8527526B1",
        "CN103377435A",
        "US8589228B2",
        "US20140006611A1",
        "US8732177B1",
        "US20140149205A1",
        "US8782197B1",
        "US20140278757A1",
        "US8874589B1",
        "US8886799B1",
        "US8886575B1",
        "US8914500B1",
        "US9053185B1",
        "JP2015111382A",
        "US9065727B1",
        "US9104960B2",
        "CN104933475A",
        "TWI503675B",
        "WO2015175835A1",
        "US20160321734A1",
        "CN106156127A",
        "US20170091670A1",
        "US20170255906A1",
        "EP3301628A4",
        "CN108961071A",
        "CN109460513A",
        "CN109615060A",
        "US20190130437A1",
        "US10331685B2",
        "WO2019144892A1",
        "US10482482B2",
        "US10489818B2",
        "US10559004B2",
        "US10846353B2",
        "CN112767038A",
        "CN112966577A",
        "CN113283948A",
        "CN113435523A",
        "US11256991B2",
        "US11301525B2",
        "US11575632B2"
    ],
    "citedby_ftf": [
        "GB2525758A",
        "US20120310729A1",
        "US10176484B2",
        "US9335883B2",
        "US20130097011A1",
        "US20130268374A1",
        "US9947029B2",
        "US9460215B2",
        "US10607253B1",
        "CN105162643B",
        "US11676060B2",
        "US10685070B2",
        "US10922713B2",
        "US10572908B2",
        "US11106682B2",
        "CN109543066B",
        "US10885282B2"
    ]
}