{
    "patent_id": "US-11445660-B2",
    "title": "Method for recommending seeding rate for corn seed using seed type and sowing row width ",
    "assignee": "Climate Llc",
    "publication_date": "2022-09-20",
    "patent_link": "https://patents.google.com/patent/US11445660B2/en",
    "inventors": [
        "Lijuan Xu",
        "Sanjay Lamsal"
    ],
    "classifications": [
        "A01C7/102",
        "A01B79/005",
        "A01C21/00",
        "G06N5/04",
        "G06N7/005",
        "G06N7/01"
    ],
    "abstract": "A computer system and computer-implemented techniques for determining and presenting improved seeding rate recommendations for sowing hybrid seeds in a field is provided. In an embodiment, determining and presenting seeding rate recommendations for a field may be accomplished using a server computer system that receives over a digital communication network, electronic digital data representing hybrid seed properties, including hybrid seed type, and sowing row width. Using digitally programmed seeding query logic, within the server computer system, receiving digital data representing planting parameters including hybrid seed type information and sowing row width. The seeding query logic then retrieves a set of one or more seeding models from an electronic digital seeding data repository based upon the planting parameters. Each of the seeding model retrieved contain a regression model for the hybrid seed type modeling a relationship between plant yield and seeding rate on a specific field. Using mixture model logic, within the server computer system, generating an empirical mixture model in digital computer memory that represents a composite distribution of the set of one or more seeding models. The mixture model logic then generates an optimal seeding rate distribution dataset in digital computer memory based upon the empirical mixture model, where the optimal seeding rate distribution dataset represents the optimal seeding rate across all measure fields. Using optimal seeding rate recommendation logic, within the server computer system, calculating and presenting on a digital display device an optimal seeding rate recommendation that is based upon the optimal seeding rate distribution dataset.",
    "claims": "\n1. A computer-implemented method of determining and presenting an improved seeding rate recommendation for sowing plant seeds in a field, the method comprising:\nusing seeding query logic in a server computer system, receiving digital data representing planting parameters comprising information for a hybrid seed type and planting row width;\nusing the seeding query logic, retrieving a set of multiple digital seeding models from an electronic digital seeding data repository based upon the planting parameters, wherein the multiple digital seeding models each contain a regression model defining, for the hybrid seed type, a relationship between plant yield and seeding rate at a specific field;\nusing mixture model logic in the server computer system, generating an empirical mixture model in digital computer memory as a composite distribution of the multiple digital seeding models;\nusing the mixture model logic, generating a seeding rate distribution for the planting parameters, in the digital computer memory, based upon a sampling of values from the empirical mixture model; and\nusing optimal seeding rate recommendation logic in the server computer system, calculating and presenting on a digital display device a seeding rate recommendation, for the planting parameters, based upon the seeding rate distribution.\n2. The method of claim 1, wherein the planting parameters further comprise soil property data, climatology data related to a climate at or near a geographic location of the specific field, and geo-location data specifying a geographic of the specific field.\n3. The method of claim 1, wherein each regression model is based upon multiple data points measured at the specific field.\n4. The method of claim 3, wherein the multiple data points measured at the specific field comprise, for each regression model, digital data representing the hybrid seed type, and also the plant yield and the seeding rate defined by said regression model.\n5. The method of claim 1, wherein each regression model comprises a log-normal distribution of the relationship between plant yield and seeding rate defined by said regression model at the specific field.\n6. The method of claim 3, wherein each digital seeding model further comprises joint posterior distributions that represent distributions of regression parameters used to calculate the regression model of said digital seeding model.\n7. The method of claim 1, wherein generating the seeding rate distribution is based upon a negative inverse of parameter values selected from the empirical mixture model.\n8. The method of claim 1, wherein generating the seeding rate distribution comprises applying a random sampling to select the sampling of values from the empirical mixture model.\n9. The method of claim 8, wherein applying the random sampling includes applying a Monte Carlo random sampling to select the sampling of values from the empirical mixture model.\n10. The method of claim 1, wherein calculating the seeding rate recommendation further comprises determining a median yield for the seeding rate distribution.\n11. The method of claim 1, wherein presenting the seeding rate recommendation further comprises presenting variability associated with the seeding rate recommendation, where the variability is characterized as median absolute deviation.\n12. A non-transitory storage media including instructions which, when executed by one or more computing devices, cause performance, by the one or more computing devices, of the following steps:\nreceiving digital data representing planting parameters comprising information for a hybrid seed type and planting row width;\nretrieving a set of digital seeding models from an electronic digital seeding data repository based upon the planting parameters, wherein the digital seeding models each contain a regression model defining, for the hybrid seed type, a relationship between plant yield and seeding rate at a specific field;\ngenerating an empirical mixture model in digital computer memory based upon the digital seeding models, as a composite distribution of the digital seeding models;\ngenerating a seeding rate distribution for the planting parameters, in the digital computer memory, based upon sampling of values from the empirical mixture model; and\ncalculating and presenting on a digital display device a seeding rate recommendation, for the planting parameters, based upon the seeding rate distribution.\n13. The non-transitory storage media of claim 12, wherein the planting parameters further comprise soil property data, climatology data related to a climate at or near a geographic location of the field, and geo-location data specifying a geographic of the field.\n14. The non-transitory storage media of claim 12, wherein each regression model for the hybrid seed type is based upon data points measured at the specific field.\n15. The non-transitory storage media of claim 14, wherein the data points measured at the specific field comprising, for each regression model, digital data representing the hybrid seed type, the plant yield, and the seeding rate of the hybrid seed planted.\n16. The non-transitory storage media of claim 14, wherein each regression model for the hybrid seed type comprises a log-normal distribution of the relationship between plant yield and seeding rate at the specific field.\n17. The non-transitory storage media of claim 14, wherein each digital seeding model further comprises joint posterior distributions that represent distributions of regression parameters used to calculate the regression model of said digital seeding model.\n18. The non-transitory storage media of claim 12, wherein generating the seeding rate distribution is based upon a negative inverse of parameter values selected from the empirical mixture model.\n19. The non-transitory storage media of claim 18, wherein generating the seeding rate distribution includes applying a Monte Carlo random sampling generator to select the values from the empirical mixture model.\n20. The non-transitory storage media of claim 12, wherein calculating the seeding rate recommendation further comprises determining a median yield for the seeding rate distribution; and\nwherein presenting the seeding rate recommendation further comprises presenting variability associated with the seeding rate recommendation, where the variability is characterized as median absolute deviation.",
    "status": "Active",
    "citations_own": [
        "US20030009282A1",
        "US6662185B1",
        "US20050086010A1",
        "US20130066666A1",
        "US20150206255A1",
        "US20190327881A1"
    ],
    "citations_ftf": [
        "US8078367B2",
        "US8411904B2",
        "US8477295B2",
        "WO2013119459A1",
        "ES2903049T3"
    ],
    "citedby_own": [
        "US20230030200A1"
    ],
    "citedby_ftf": [
        "US11212962B2",
        "US20170115862A1",
        "US10111415B2",
        "WO2017148818A1",
        "WO2017197274A1",
        "US20170344896A1",
        "WO2018049289A1",
        "US10657372B2",
        "US11263707B2",
        "US11568340B2",
        "US11562444B2",
        "US11423492B2",
        "US10477756B1",
        "EP3785214A1",
        "US10999967B2",
        "US20200005401A1",
        "EP3830750A4",
        "CA199221S",
        "US11653588B2",
        "US11641800B2",
        "US11178818B2",
        "US11467605B2",
        "US11240961B2",
        "US11589509B2",
        "US11079725B2",
        "US11672203B2",
        "US11166406B2",
        "WO2020172603A1",
        "US11770988B2",
        "US11234366B2",
        "US11778945B2",
        "US11212954B2",
        "WO2021062147A1",
        "US20210243951A1",
        "US10878967B1",
        "US11477940B2",
        "US11592822B2",
        "US11727680B2",
        "US11675354B2",
        "US11650587B2",
        "US11635765B2",
        "US11711995B2",
        "US11474523B2",
        "US20220110246A1",
        "US11369055B1"
    ]
}