{
    "patent_id": "US-11317909-B2",
    "title": "Surgical device having multiple drivers ",
    "assignee": "Covidien Lp",
    "publication_date": "2022-05-03",
    "patent_link": "https://patents.google.com/patent/US11317909B2/en",
    "inventors": [
        "Michael P. Whitman",
        "Donald Malinouskas",
        "Peter Datcuk",
        "David Nicholas"
    ],
    "classifications": [
        "A61B17/068",
        "A61B17/07207",
        "A61B17/072",
        "A61B90/98",
        "A61B2017/00199",
        "A61B2017/00398",
        "A61B2017/00464",
        "A61B2017/00734",
        "A61B2017/07214",
        "A61B2017/2912",
        "A61B2017/2923",
        "A61B2017/2926",
        "A61B2017/2943"
    ],
    "abstract": "A surgical device is provided, the surgical device including a first driver for performing a first movement function; a second driver for performing a second movement function; a first rotatable drive shaft configured, upon actuation, to cause selective engagement of one of the first and second drivers with a second rotatable drive shaft, wherein the second rotatable drive shaft is configured to drive the selectively engaged one of the first and second drivers. Third and fourth drivers may also be included. The drivers may function to rotate a shaft portion of the surgical device relative to, and about the longitudinal axis of, a handle; move a jaw portion relative to the shaft portion; move a first jaw relative to a second jaw; and/or move a surgical member within the second jaw.",
    "claims": "\n1. A surgical device, comprising:\na handle;\na shaft having a proximal end portion coupled to the handle and a distal end portion and defining a longitudinal axis;\na jaw portion pivotably coupled to the distal end portion of the shaft, the jaw portion including:\na first jaw member;\na second jaw member; and\na cutting and stapling element;\na first rotatable drive shaft;\na second rotatable drive shaft;\na first driver;\na second driver;\na third driver; and\na function selector module movable by the first rotatable drive shaft between a first functional position in which the second rotatable drive shaft engages the first driver, a second functional position in which the second rotatable drive shaft engages the second driver, and a third functional position in which the second rotatable drive shaft engages the third driver configured to pivot the first jaw member relative to the second jaw member.\n2. The surgical device according to claim 1, further comprising:\na first motor coupled to the first rotatable drive shaft, the first motor configured to rotate the first rotatable drive shaft.\n3. The surgical device according to claim 2, further comprising:\na second motor coupled to the second rotatable drive shaft, the second motor configured to rotate the second rotatable drive shaft.\n4. The surgical device according to claim 1, wherein the first driver is configured to rotate the shaft about the longitudinal axis defined by the shaft relative to the handle.\n5. The surgical device according to claim 1, wherein the second driver is configured to pivot the jaw portion about a pivot axis perpendicular to the longitudinal axis.\n6. The surgical device according to claim 1, further comprising:\na fourth driver, wherein the function selector module movable by the first rotatable drive shaft to a fourth functional position in which the second rotatable drive shaft engages the fourth driver configured to move the cutting and stapling element.\n7. A surgical device, comprising:\na handle;\na shaft having a proximal end portion coupled to the handle and a distal end portion and defining a longitudinal axis;\na jaw portion pivotably coupled to the distal end portion of the shaft, the jaw portion including:\na first jaw member;\na second jaw member; and\na cutting and stapling element\na rotatable drive shaft;\na plurality of drivers, wherein a first driver of the plurality of drivers is configured to pivot the first jaw member relative to the second jaw member; and\na function selector module movable between a plurality of positions in which the rotatable drive shaft engages one of the plurality of drivers.\n8. The surgical device according to claim 7, further comprising:\na first motor configured to move the function selector module.\n9. The surgical device according to claim 8, further comprising:\na second motor coupled to the rotatable drive shaft, the second motor configured to rotate the rotatable drive shaft.\n10. The surgical device according to claim 7, wherein a second driver of the plurality of drivers is configured to rotate the shaft about the longitudinal axis defined by the shaft relative to the handle.\n11. The surgical device according to claim 7, wherein a third driver of the plurality of drivers is configured to pivot the jaw portion about a pivot axis perpendicular to the longitudinal axis.\n12. The surgical device according to claim 7, wherein a fourth driver of the plurality of drivers is configured to move the cutting and stapling element."
}