{
    "patent_link": "https://patents.google.com/patent/US7231245B2/en",
    "patent_id": "US7231245B2",
    "title": "System and method of assessment of neurological conditions using EEG",
    "abstract": "The present invention is a system and method that produces features and indices that indicate the presence or absence of a disease or condition, or of the progression of a disease or condition. The system and method of the present invention also produce features and indices that predict responsiveness to medication from a premedication baseline. The system and method of the present invention further incorporates a testing methodology to improve the performance characteristics of the features or indices. To obtain such features and indices, time domain, power spectrum, bispectrum and higher order spectrum values are derived from biopotential signals taken from the subject being tested.",
    "inventors": [
        "Scott D. Greenwald",
        "Charles P. Smith",
        "Jeffrey C. Sigl",
        "Philip H. Devlin"
    ],
    "assignee": "Covidien LP",
    "classifications": [
        "A61B5/4839",
        "A61B5/165",
        "A61B5/374",
        "A61B5/4088",
        "G06F2218/08"
    ],
    "claims": "\n1. A system of assessing neurological conditions comprising:\none or more electrodes for acquiring biopotential signals,\na processor for deriving, from said biopotential signals, Kth-order spectral values, where K is an integer greater than 1, and deriving from said Kth order spectral values features indicative of neurological conditions, said processor using a differential testing methodology to derive said features.\n2. The system of claim 1 further comprising an infusion device connected to said processor for administering a controlled dose of a pharmacological agent as part of said differential testing methodology.\n3. A method of assessing neurological conditions comprising the steps of\nacquiring biopotential signals,\nderiving, from said biopotential signals, Kth-order spectral values, where K is an integer greater than 1, and\nderiving at least one feature indicative of neurological conditions from said Kth order spectral using a differential test methodology.\n4. The method of claim 3 further comprising the step of administering a controlled dose of a pharmacological agent as part of said differential test methodology.\n5. A method of assessing neurological conditions comprising the steps of:\nacquiring biopotential signals from a human subject,\nderiving, from said biopotential signals, Kth-order spectral values, where K is an integer greater than 1, and\nderiving from said Kth order spectral values a prediction of the effectiveness of a specific therapeutic intervention at least one hour after said intervention.\n6. A system of assessing neurological conditions comprising\none or more electrodes for acquiring biopotential signals and\na processor for deriving, from said biopotential signals, Kth-order spectral values, where K is an integer greater than 1 and for deriving from said Kth order spectral values a prediction of the effectiveness of a specific therapeutic intervention at least one hour after said intervention.\n7. A system of assessing neurological conditions comprising:\none or more electrodes for acquiring biopotential signals, and\na processor for deriving, from said biopotential signals, at least one feature indicative of neurological conditions, one of said at least one feature being a prediction of the effectiveness of a therapeutic intervention in achieving a desired behavioral effect at least one hour after said intervention,\nwherein said at least one feature indicative of neurological conditions is a Kth -order spectral value, where K is an integer greater than 1.\n8. A system of assessing neurological conditions comprising:\none or more electrodes for acquiring biopotential signals, and\na processor for deriving, from said biopotential signals, at least one feature indicative of neurological conditions, one of said at least one feature being a prediction of the effectiveness of a therapeutic intervention in achieving a desired behavioral effect at least one hour after said intervention,\nwherein said at least one feature indicative of neurological conditions is a statistical measure.\n9. A system of assessing neurological conditions comprising:\none or more electrodes for acquiring biopotential signals, and\na processor for deriving, from said biopotential signals, at least one feature indicative of neurological conditions, one of said at least one feature being a prediction of the effectiveness of a therapeutic intervention in achieving a desired behavioral effect at least one hour after said intervention,\nwherein said at least one feature indicative of neurological conditions is a time domain measure.\n10. A system of assessing neurological conditions comprising:\none or more electrodes for acquiring biopotential signals, and\na processor for deriving, from said biopotential signals, at least one feature indicative of neurological conditions, one of said at least one feature being a prediction of the effectiveness of a therapeutic intervention in achieving a desired behavioral effect at least one hour after said intervention,\nwherein said at least one feature indicative of neurological conditions is a cordance measure.\n11. A system of assessing neurological conditions comprising:\none or more electrodes for acquiring biopotential signals, and\na processor for deriving, from said biopotential signals, at least one feature indicative of neurological conditions, one of said at least one feature being a prediction of the effectiveness of a therapeutic intervention in achieving a desired behavioral effect, said processor using a differential testing methodology to derive said at least one feature.\n12. The system of claim 11 further comprising an infusion device connected to said processor for administering a controlled dose of a pharmacological agent as part of said differential testing methodology.\n13. A method of assessing neurological conditions comprising the steps of:\nacquiring biopotential signals from a human subject, and\nderiving from said biopotential signals at least one feature indicative of neurological conditions, one of said at least one feature being a prediction of the effectiveness of a therapeutic intervention in achieving a desired behavioral effect at least one hour after said intervention,\nwherein said feature indicative of neurological conditions Kth -order spectral value, where K is an integer greater than 1.\n14. A method of assessing neurological conditions comprising the steps of:\nacquiring biopotential signals from a human subject, and\nderiving from said biopotential signals at least one feature indicative of neurological conditions, one of said at least one feature being a prediction of the effectiveness of a therapeutic intervention in achieving a desired behavioral effect at least one hour after said intervention,\nwherein said feature indicative of neurological conditions is a statistical measure.\n15. A method of assessing neurological conditions comprising the steps of:\nacquiring biopotential signals from a human subject, and\nderiving from said biopotential signals at least one feature indicative of neurological conditions, one of said at least one feature being a prediction of the effectiveness of a therapeutic intervention in achieving a desired behavioral effect at least one hour after said intervention,\nwherein said feature indicative of neurological conditions is a time domain measure.\n16. A method of assessing neurological conditions comprising the steps of:\nacquiring biopotential signals from a human subject, and\nderiving from said biopotential signals at least one feature indicative of neurological conditions, one of said at least one feature being a prediction of the effectiveness of a therapeutic intervention in achieving a desired behavioral effect at least one hour after said intervention,\nwherein said feature indicative of neurological conditions is a cordance measure.\n17. A method of assessing neurological conditions comprising the steps of\nacquiring biopotential signals, and\nderiving, from said biopotential signals, at least one feature indicative of neurological conditions, said features being derived using a differential testing methodology, wherein said at least one feature indicative of neurological conditions is a prediction of the effectiveness of a therapeutic intervention in achieving a desired behavioral effect.\n18. The method of claim 17, wherein said prediction is derived before an initiation of said therapeutic intervention.\n19. The method of claim 17, wherein said prediction is derived before the clinical appearance of said therapeutic intervention.\n20. The method of claim 17 wherein a controlled dose of a pharmacological agent is administered as part of said differential testing methodology.\n21. A method of assessing neurological conditions comprising the steps of:\nacquiring biopotential signals from a human subject, and\nderiving, from said biopotential signals, at least two features indicative of neurological conditions and,\ncombining said features into an index indicative of neurological conditions, said index being a prediction of the effectiveness of a therapeutic intervention in achieving a desired behavioral effect at least one hour after said intervention,\nwherein said at least one feature indicative of neurological conditions is a Kth-order spectral value, where K is an integer greater than 1.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4533346A",
        "US4907597A",
        "US5010891A",
        "US5230346A",
        "US5269315A",
        "US5311876A",
        "US5320109A",
        "US5458117A",
        "US5846208A",
        "US6024707A",
        "US6343229B1",
        "US6622036B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20050216071A1",
        "US20060077064A1",
        "US20060167370A1",
        "US20070100251A1",
        "US20090264957A1",
        "US20090264956A1",
        "US20090264967A1",
        "US20100114237A1",
        "US20100185113A1",
        "US20110119212A1",
        "US20110137371A1",
        "US20110160608A1",
        "US20110172545A1",
        "US20110196693A1",
        "US20110201962A1",
        "US8244475B2",
        "US8265743B2",
        "US8538512B1",
        "US8565886B2",
        "US8706181B2",
        "US8758018B2",
        "US9538949B2",
        "US9757041B2",
        "US9849241B2",
        "WO2018107181A1",
        "US10154815B2",
        "US11273283B2",
        "US11364361B2",
        "US11382571B2",
        "US11395634B2",
        "US11395594B2",
        "US11406269B2",
        "US11452839B2",
        "US11478190B2",
        "US11717686B2",
        "US11723579B2",
        "US11786694B2"
    ],
    "citedby_ftf": [
        "KR20080096855A",
        "EP1601329A4",
        "US8512221B2",
        "MXPA05011913A",
        "US7117108B2",
        "US7212865B2",
        "US20060019224A1",
        "CA2578597C",
        "US20090220429A1",
        "US7720530B2",
        "US7904144B2",
        "KR101218618B1",
        "US8311622B2",
        "CN101346098B",
        "WO2007143663A2",
        "US20080021340A1",
        "US8244341B2",
        "US20090247894A1",
        "IL196487A",
        "WO2011025953A1",
        "US9095266B1",
        "US9037224B1",
        "AU2012284246B2",
        "JP6123167B2",
        "WO2014059418A1",
        "WO2014143896A2",
        "US9747421B2",
        "US10702208B2",
        "US20200383627A1",
        "EP4233716A3",
        "CN112057090B",
        "WO2022126031A1",
        "WO2023039179A1",
        "CN114081493A"
    ]
}