{
    "patent_link": "https://patents.google.com/patent/US6067552A/en",
    "patent_id": "US6067552A",
    "title": "User interface system and method for browsing a hypertext database",
    "abstract": "A method and apparatus for traversing a hypertext system is provided. A set of descriptive document index terms is provided for documents in the database. Means are provided for the user to specify both the set of relevant index term values and the weighted relative ranking of the set of index terms. Means are provided for comparing the set of index terms specified by the user with sets of document index terms. The comparisons result in a ranked list of the selectively linked electronic documents. In one aspect, the electronic documents are ranked in accordance with the relevancy of each document with respect to the user. In another aspect, each electronic document in that database is indirectly linked with the user's present position through intermediate, dynamically generated tree links. The intermediate tree links are generated in accordance with the relevancy of each document with respect to the user and the efficiency of each index term to differentiate between relevant documents.",
    "inventors": [
        "Tonny Yu"
    ],
    "assignee": "CBS Interactive Inc",
    "classifications": [
        "G06F16/9558",
        "Y10S707/99935"
    ],
    "claims": "\n1. A method for a user of a computer system to traverse a hypertext database to retrieve an electronic document stored in the hypertext database, the method comprising the steps of:\n(A) storing in the hypertext database a plurality of hypertext nodes, each of the hypertext nodes corresponding to an electronic document, wherein each of the hypertext nodes may be selectively linked to another of said hypertext nodes;\n(B) storing an index in association with the hypertext database, the index comprising a plurality of descriptive index terms, in which each of the descriptive index terms is assigned to one of the electronic documents;\n(C) receiving a weighted relevancy ranking of each descriptive index term;\n(D) receiving a set of relevant index term values;\n(E) comparing the set of relevant index term values with sets of the descriptive index terms using the weighted relevancy ranking and the set of relevant index term values;\n(F) producing a list of electronic documents based on the comparing step (E), in which the list is ranked in accordance with the relevancy of each document with respect to the user based on the weighted relevancy ranking and in which each document in the list contains at least one of the relevant index term values.\n2. The method of claim 1, wherein step (C) further includes the step of receiving a weighted relevancy ranking that is combined with a historical weighted relevancy ranking, and in which step (E) further includes the step of for the purpose of comparing the set of relevant index term values with sets of the descriptive index terms using the weighted relevancy ranking, the set of relevant index term values, and the historical weighted relevancy ranking.\n3. The method recited in claim 1, further comprising the step of receiving a historical weighted average relevancy rank value for each of the descriptive index terms, and in which step (C) comprises the step of setting a weighted relevancy ranking of each descriptive index term equal to the historical weighted average relevancy rank value for that descriptive index term.\n4. The method recited in claim 1, further comprising the step of linking the ranked list of electronic documents to an intermediate tree, in which the intermediate tree is linked to the user's position within the hypertext database.\n5. The method recited in claim 1, further comprising the step of linking each electronic document in the hypertext database to a present position of the user in the hypertext database by an intermediate, dynamically generated tree link.\n6. The method recited in claim 5, further comprising the step of generating each intermediate, dynamically generated tree link in accordance with relevance to the user of the document to which the tree link is linked and in accordance with efficiency of each index term to differentiate between relevant documents.\n7. The method recited in claim 5, further including the step of computing relevance to the user of the document to which the tree link as a function of the set of index terms and the weighted relevancy ranking of the index terms.\n8. The method recited in claim 5, further including the step of computing efficiency of each index term from the distribution of the index term in the documents.\n9. The method of claim 5, wherein the step of indexing the hypertext database includes the step of assigning a efficiency value to each index term, in which the efficiency value is a numerical indication of how well each descriptive index term differentiates the tree links.\n10. The method of claim 9, in which step (F) further includes the step of ranking the documents based on a weighted combination of the user relevancy ranking of each descriptive index term and the efficiency value of each descriptive index term.\n11. The method as recited in claim 5, further including the step of receiving from the user a limit value that identifies a maximum breadth of a tree of the tree links and thereby limits browsing complexity.\n12. The method of claim 11, further including the step of applying a hashing formula that uses the index terms, to minimize a depth of the tree based upon the limit value, and to thereby balance the tree.\n13. A computer-readable medium carrying one or more sequences of instructions for a user of a computer system to traverse a hypertext database to retrieve an electronic document stored in the hypertext database, wherein execution of the one or more sequences of instructions by one or more processors causes the one or more processors to perform the steps of:\n(A) storing in the hypertext database a plurality of hypertext nodes, each of the hypertext nodes corresponding to an electronic document, wherein each of the hypertext nodes may be selectively linked to another of said hypertext nodes;\n(B) storing an index in association with the hypertext database, the index comprising a plurality of descriptive index terms, in which each of the descriptive index terms is assigned to one of the electronic documents;\n(C) receiving a weighted relevancy ranking of each descriptive index term;\n(D) receiving a set of relevant index term values;\n(E) comparing the set of relevant index term values with sets of the descriptive index terms using the weighted relevancy ranking and the set of relevant index term values;\n(F) producing a list of electronic documents based on the comparing step (E), in which the list is ranked in accordance with the relevancy of each document with respect to the user based on the weighted relevancy ranking and in which each document in the list contains at least one of the relevant index term values.\n14. The computer-readable medium of claim 13, wherein step (C) further includes the step of receiving a weighted relevancy ranking that is combined with a historical weighted relevancy ranking, and in which step (E) further includes the step of for the purpose of comparing the set of relevant index term values with sets of the descriptive index terms using the weighted relevancy ranking, the set of relevant index term values, and the historical weighted relevancy ranking.\n15. The computer-readable medium recited in claim 13, further comprising the step of receiving a historical weighted average relevancy rank value for each of the descriptive index terms, and in which step (C) comprises the step of setting a weighted relevancy ranking of each descriptive index term equal to the historical weighted average relevancy rank value for that descriptive index term.\n16. The computer-readable medium recited in claim 13, further comprising the step of linking the ranked list of electronic documents to an intermediate tree, in which the intermediate tree is linked to the user's position within the hypertext database.\n17. The computer-readable medium recited in claim 13, further comprising the step of linking each electronic document in the hypertext database to a present position of the user in the hypertext database by an intermediate, dynamically generated tree link.\n18. The computer-readable medium recited in claim 17, further comprising the step of generating each intermediate, dynamically generated tree link in accordance with relevance to the user of the document to which the tree link is linked and in accordance with efficiency of each index term to differentiate between relevant documents.\n19. The method recited in claim 17, further including the step of computing relevance to the user of the document to which the tree link as a function of the set of index terms and the weighted relevancy ranking of the index terms.\n20. The method recited in claim 17, further including the step of computing efficiency of each index term from the distribution of the index term in the documents.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5408655A",
        "US5418948A",
        "US5452468A",
        "US5488725A",
        "US5729730A",
        "US5913215A",
        "US5933822A",
        "US5983248A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "WO2000068837A1",
        "WO2000079454A1",
        "US6175832B1",
        "US6178308B1",
        "WO2001053960A1",
        "US6272507B1",
        "WO2001067207A2",
        "US6292796B1",
        "US6298344B1",
        "US6321227B1",
        "WO2002001378A1",
        "US20020007285A1",
        "WO2002019164A1",
        "US20020035563A1",
        "WO2002027554A1",
        "US6377961B1",
        "US6397219B2",
        "WO2002042862A2",
        "US20020103789A1",
        "US6456619B1",
        "US20020138482A1",
        "US20020147789A1",
        "US20020147775A1",
        "WO2002082297A1",
        "US20030023584A1",
        "US6526398B2",
        "US20030050846A1",
        "US20030084048A1",
        "US20030084021A1",
        "US20030084404A1",
        "US20030088554A1",
        "US20030103088A1",
        "US6584468B1",
        "US20030131314A1",
        "US20030157470A1",
        "US6615207B1",
        "US20030177202A1",
        "US6625596B1",
        "US20030195896A1",
        "US6654737B1",
        "WO2003098466A1",
        "US20030229628A1",
        "US20040024790A1",
        "US20040030683A1",
        "US20040047596A1",
        "US20040064500A1",
        "US20040068514A1",
        "US20040078432A1",
        "US6741984B2",
        "US6742023B1",
        "US20040107208A1",
        "US20040117290A1",
        "US20040133560A1",
        "US20040162820A1",
        "US20040186827A1",
        "US20040199419A1",
        "US6810410B1",
        "US6816857B1",
        "US20040236737A1",
        "US6826555B2",
        "US20040243565A1",
        "US20040243581A1",
        "US20040268247A1",
        "US6850935B1",
        "US20050038770A1",
        "US20050050037A1",
        "US20050086204A1",
        "US20050108325A1",
        "US6920448B2",
        "US20050187923A1",
        "US20050216446A1",
        "US20050216478A1",
        "US20050273730A1",
        "US20050278298A1",
        "US20060004607A1",
        "US20060031218A1",
        "US20060036609A1",
        "US7020847B1",
        "US7024416B1",
        "US20060074628A1",
        "US7028027B1",
        "US7031964B1",
        "US20060085387A1",
        "US20060101498A1",
        "US7047242B1",
        "US7111243B1",
        "US7120641B2",
        "US7124093B1",
        "US7133870B1",
        "US20060277208A1",
        "US20070022110A1",
        "US20070043714A1",
        "US7216298B1",
        "US20070124301A1",
        "US20070161214A1",
        "US20070168344A1",
        "US20070180066A1",
        "US20070180386A1",
        "US20070180432A1",
        "US7257589B1",
        "US7263662B1",
        "US7266553B1",
        "WO2007106148A2",
        "US20070225795A1",
        "US20070239667A1",
        "US20070244852A1",
        "US20070299961A1",
        "US20080005764A1",
        "US20080027769A1",
        "US7346604B1",
        "US20080104032A1",
        "US20080162457A1",
        "US20080162415A1",
        "US20080222561A1",
        "US20080250027A1",
        "US20080256069A1",
        "US20080306945A1",
        "US20080306908A1",
        "US20090006389A1",
        "US7493553B1",
        "US7519605B2",
        "US20090125511A1",
        "CN100585591C",
        "US7689536B1",
        "US20100169325A1",
        "US20100169301A1",
        "US20100223261A1",
        "US20110029851A1",
        "US20110213783A1",
        "US8051096B1",
        "US8275661B1",
        "US8326861B1",
        "US20130086466A1",
        "US8417731B2",
        "US20130166541A1",
        "US8548995B1",
        "US8572069B2",
        "US8595475B2",
        "US8843536B1",
        "US20140297618A1",
        "US8918812B2",
        "US20150156168A1",
        "US9633356B2",
        "US9652787B2",
        "US9734447B1",
        "US10417246B1",
        "US11330024B2",
        "US11442998B2",
        "US11812111B2"
    ],
    "citedby_ftf": []
}