{
    "patent_link": "https://patents.google.com/patent/US5101424A/en",
    "patent_id": "US5101424A",
    "title": "Method for generating a monitor program for monitoring text streams and executing actions when pre-defined patterns, are matched using an English to AWK language translator",
    "abstract": "The disclosure is a technique to automatically generate AWK code from English text for monitoring text streams and executing actions when predefined patterns are matched. The English to AWK Translator in ITM can translate English keywords and data into executable AWK programs. Since text steams from a modem port can be monitored the same way as a file, it is possible to monitor telephone switches with the AWK programs generated by the Translator. With an automated monitor system like the Ineractive Text Monitor, telephony engineers will free themselves of expensive and boring babysitting sessions when they monitor switches looking for problems to occur.",
    "inventors": [
        "John W. Clayton",
        "Steven B. Lucovsky"
    ],
    "assignee": "Nortel Networks Ltd",
    "classifications": [
        "H04M3/08",
        "H04Q11/0414"
    ],
    "claims": "\n1. A method of creating a monitor program for monitoring text streams contained in log reports produced by a telephone switch, comprising the steps of:\nselecting text strings with individual character patterns required to be matched with corresponding character patterns in text streams contained in the log reports;\ncreating a pattern definition according to the selected text strings;\nstoring said pattern definition in a session file;\nselecting action definitions and corresponding action keywords such tat the selected action is executed when a pattern definition is matched;\nreading the session file containing the pattern definition;\nassociating each keyword with a corresponding software code; and\nlisting the corresponding software codes for each keyword to create the monitor program.\n2. A method as defined in claim 1, wherein said monitor program is executed by:\nactivating said monitor program;\nreceiving text strings from I/O means connected to said telephone switch;\nreading the text strings;\nsending action commands to an action file when a match is found in said text strings;\nreading the action requests from the action file;\nperforming the action requests; and\ndeactivating the monitor program.\n3. A method as defined in claim 2, wherein said text strings are stored into a text file once they are received.\n4. A method as defined in claim 3, wherein said action commands are sent to an action file when a match is found in said text file.\n5. A method as defined in claim 1, further comprising the step of:\nconverting unselected characters in said pattern definition to UNIX metacharacters.\n6. A method as defined in claim 1, wherein said corresponding software code is an AWK code.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4782506A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5347564A",
        "WO1995005718A1",
        "US5640575A",
        "US5796948A",
        "US5937182A",
        "US6185560B1",
        "US6505245B1",
        "US20030018630A1",
        "US6594634B1",
        "US20030177253A1",
        "US20030221013A1",
        "US6711558B1",
        "US6771956B1",
        "US20050038662A1",
        "US20050055416A1",
        "US20060053295A1",
        "US20060294059A1",
        "US7174453B2",
        "US20070067108A1",
        "US20070130140A1",
        "US20070260602A1",
        "US20070277036A1",
        "US20070294157A1",
        "US20080086274A1",
        "US20080114725A1",
        "US20090161568A1",
        "US7602785B2",
        "US20090287628A1",
        "US7640336B1",
        "US7660793B2",
        "US7716330B2",
        "US7921046B2",
        "US7954114B2",
        "US7970722B1",
        "US20120159564A1",
        "US8346953B1",
        "US8452849B2",
        "US8701014B1",
        "US8762249B2",
        "US8874672B2",
        "US8965964B1",
        "US9203794B2",
        "US9203647B2",
        "US9203879B2",
        "US9246975B2",
        "US9319356B2",
        "US9633093B2",
        "US9633097B2",
        "US9647872B2",
        "US9667585B2",
        "US9990393B2",
        "US10037568B2",
        "US10108929B2",
        "US10121196B2",
        "US10146845B2",
        "CN109101302A",
        "US10187334B2",
        "US10572824B2",
        "US10650452B2",
        "US10846624B2",
        "US10902013B2",
        "US10942943B2",
        "US20220207020A1",
        "US11436672B2"
    ],
    "citedby_ftf": []
}