{
    "patent_id": "US-10699218-B2",
    "title": "Energy analytics learning machine ",
    "assignee": "Akw Analytics Inc.",
    "publication_date": "2020-06-30",
    "patent_link": "https://patents.google.com/patent/US10699218B2/en",
    "inventors": [
        "Roger N. Anderson",
        "Boyi Xie",
        "Leon L. Wu",
        "Arthur Kressner"
    ],
    "classifications": [
        "G06N20/00",
        "G06N20/10",
        "G06N20/20"
    ],
    "abstract": "Energy Analytics Learning Machine (or EALM) system is a machine learning based, “brutally empirical” analysis system for use in optimizing the payout from one or more energy sources. EALM system optimizes exploration, production, distribution and/or consumption of an energy source while minimizing costs to the producer, transporter, refiner and/or consumer. Normalized data are processed to determine clusters of correlation in multi-dimensional space to identify a machine learned ranking of importance weights for each attribute. Predictive and prescriptive optimization on the normalized energy data is performed utilizing unique combinations of machine learning and statistical algorithm ensembles. The unstructured textual energy data are classified to correlate with optimal production to capture the dynamics of one or more energy sources of physically real or theoretically calculated systems to provide categorization results from labeled data sets to identify patterns.",
    "claims": "\n1. A method for optimizing efficiency and gathering data from at least one energy source using an energy analytics learning machine system to maximize a payout from said at least one energy source while minimizing costs, for the producer, transporter, and/or consumer:\ncollecting structured digital energy data and unstructured textual energy data from said at least one energy source, said at least one energy source being a real physical energy source or theoretically calculated system;\nreceiving an incoming data stream over a communications network and storing the incoming data into a systems integration database by a processor based server or cloud based distribution of servers to provide collected energy data, the incoming data comprising digital exogenous data, real-time and historical endogenous data, historical data from surrounding physical or interrelated energy sources, and time-lapse progress, status and maintenance from new data sources over time including from public and private data sources;\nrecording a 3-dimensional spatial location and time-lapse 4-dimensional time-series for each data set of the collected energy data;\ncleaning the collected energy data to eliminate extraneous and noisy data;\nnormalizing and storing the clean collected energy data;\nprocessing the normalized energy data to determine clusters of correlation in multi-dimensional space to simultaneously identify a machine learned ranking of importance weights for each attribute of said at least one energy source;\nranking said importance weights, and identifying patterns to enhance the value of the collected energy data and the normalized energy data;\nperforming predictive analysis and prescriptive optimization on the normalized energy data to increase the payout from said at least one energy source and to reduce operational costs by utilizing machine learning and statistical algorithms, including at least two of the following: linear and non-linear support vector machine classifiers and regressors, decision trees, hidden Markov models, random forests, gradient boosting machines, Bayesian models, neural networks and deep learning networks, bagging and boosting ensemble models, feature selection, clustering, approximation and dynamic programming methods;\nclassifying unstructured textual energy data to correlate with optimal performance by utilizing progressive clustering with learned seeds, information extraction and retrieval, image recognition, text mining, keyword and key phrase extraction, semantic and sentiment analysis, entity and pattern recognition and knowledge discovery processing to capture the dynamics of said at least one energy source of physically real or theoretically calculated system to provide categorization results from labeled data sets to identify energy production and consumption patterns;\ndisplaying data and analyses, transmitting recommendations, and receiving actual field actions and reactions on a graphical user interface on a network-enabled processing device over a communications network, the recommendations being based on the collected energy data from said at least one energy source, or one or more predicted conditions, communications with the one or more of the real or theoretical energy systems, autonomous and personalized to steer disparate data simultaneously to interpreters working on field or theoretical energy operations that are needed to improve future performance from said at least one energy source in response to one or more trends, said one or more predicted conditions, or recommendations displayed on the graphical user interface connected to the energy analytics learning machine system;\nscoring and ranking the combined importance weights of attributes to predict maximum performance at minimum costs when convolved with specific attributes of said at least one energy source;\nconvolving importance weight values of attributes received by the energy analytics learning machine system from historical energy data and attribute data from each new energy source as it progresses in real time to predict future performance of said each new energy source before actual results are delivered to the energy analytics learning machine system;\nutilizing the 4-dimensional time-series attributes during each time-lapse stage to automatically classify performance effectiveness of said each time-lapse stage and provide recommendations to maximize future performance of said each new energy data source; and\nwherein the recommendations are directed autonomously to optimize the performance of said at least one energy source while minimizing costs over time.\n2. The method of claim 1, wherein said at least one energy source being optimized is at least one of production, distribution and consumption of at least one of the following: oil, natural gas, liquid natural gas (LNG), and electricity generated by power plants, the power plants being nuclear, oil, coal, natural gas, solar, hydroelectric or wind.\n3. The method of claim 1, wherein the payout from said at least one energy source is maximized while minimizing costs to at least one of the following: a producer, a transporter, a refiner and a consumer.\n4. The method of claim 1, wherein all energy sources work within a similar though separately managed markets and regulators, said all energy sources being either co-located or located in different cities, counties, states or countries.\n5. The method of claim 1, further comprising receiving data from digital field devices into the systems integration database; combining the received data with real time exogenous data comprising weather forecasts; feeding the historical data and the real-time data into a data cleaning system to recognize a quality of the combination with the received data from a comparison with historical performance of at least one of each digital field device and a data stream.\n6. The method of claim 1, further comprising:\ndetermining clusters of like correlations in one or more conditions that will likely result in a more productive energy source using the energy analytics learning machine system;\ngenerating from machine learning predicted production, transportation or consumption volumes of said at least one energy source over time;\ndisplaying identified trends and predicted production, transportation or consumption conditions;\nalerting an operator when an anomaly between the predicted production, transportation or consumption conditions and observed field conditions arise to modify and report a modification of at least one of estimated ultimate optimization of efficiency, profitability and recovery from the energy analytics learning machine system; and\nwherein the energy analytics learning machine system has a coverage of multiple aspects in the analytics, including:\nat least one of the following regressions: linear regression, support vector regression, regression trees, random forest regression, neural networks and deep learning networks;\nat least one of the following classifications: logistic regression, support vector machines, nearest neighbors, decision trees and random forest, neural networks, and deep learning networks;\nat least one of the following clustering methods: k-means, k-medoids, expectation-maximization, agglomerative clustering, and nonparametric Bayesian models;\nat least one of the following feature selection and feature engineering processes: information gain, Chi-square, principal component analysis, and filter and wrapper feature selections;\nat least one of the following ensemble methods: bagging, boosting, gradient boosting machine, and random forests;\nat least one of the following time series analyses: autoregressive integrated moving average (AMNIA), generalized autoregressive conditional heteroskedasticity (GARCH), multivariate time series analysis, hidden Markov models, nonparametric Bayesian models; and\nat least one of the following large-scale or big data analyses: MapReduce, approximation, and locality sensitivity hashing.\n7. The method of claim 6, further comprising recommending a cessation or abandonment of production, distribution or consumption of said at least one energy in response to a determination by the energy analytics learning machine system that anomalous conditions cannot be economically corrected.\n8. The method of claim 1, further comprising receiving at least one of historical exogenous data, real-time exogenous data and the real-time endogenous data of said at least one energy source over a secure wireless or wired network, and wherein the historical exogenous data and the real-time exogenous data include at least one of historical weather data, forecast weather data, and production data from surrounding energy sources under similar historical conditions; and computing forecast of future product for said at least one energy source.\n9. The method of claim 8, further comprising querying one or more systems integration databases of multiple surrounding energy sources in an area or querying one integrated master systems integration database comprising regionally relevant geologic and geophysical data, the historical exogenous data, the real-time exogenous data, and the real-time endogenous data to forecast production of said at least one energy source.\n10. The method of claim 1, wherein a support vector regression is utilized to estimate relative importance weights of attributes inputted into the energy analytics learning machine system and a linear regression to assign a positive or negative correlation sign to product for each weight; and wherein the attributes comprise:\nrelevant geological and geophysical data;\ncombining parameters of the support vector regression and linear regression to enable construction of tornado diagrams representing visually the importance weights of each attribute that correlates with a positive production prediction result and the importance weights of each attribute that correlates with a negative production prediction result for all energy sources in the area or play.\n11. The method of claim 10, f and g is convolved, where f is the importance weight values of attributes computed by the energy analytics learning machine system from historical data from all energy sources in the area or play and g is each attribute value specific to an energy source as it progresses; and wherein f * g is an integral transform of a product of two functions as attributes specific to said energy source, and the integral transform predicts the future production of said energy source, before commencement of said at least one energy source.\n12. The method of claim 1, further comprising managing one or more prescriptive analytics calculations to maximize production of said at least one energy source while minimizing the costs by: computing multiple learning models operatively coupled to the systems integration database and receiving the collected energy data from the field in real time in an exit poll like voting procedure by the energy analytics learning machine system; generating at least one predicted condition by the energy analytics learning machine system; and storing resulting changes in operations in the system integration database from field operations in response to a recommended action.\n13. The method of claim 1, further comprising computing a forecast for production of said at least one energy source for a duration of a productive history of said at least one energy source, before commencement of said at least one energy source; continuously monitoring and updating the production as said at least one energy source ages; and providing an estimated ultimate recovery modification recommendations when a deviation from a forecasted, estimated ultimate recovery is predicted.",
    "status": "Active",
    "citations_own": [
        "US8352227B2",
        "US8560476B2",
        "US20140157172A1",
        "US20150317589A1",
        "US10281447B2"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US11354921B2",
        "US11538076B1"
    ],
    "citedby_ftf": [
        "US10956014B2",
        "JP6723439B2",
        "US10754060B2",
        "US10345780B2",
        "SG11202000350RA",
        "US11037080B2",
        "CN108491226B",
        "US11466554B2",
        "US10698766B2",
        "WO2019216889A1",
        "CN112513831A",
        "US11023724B2",
        "US11506052B1",
        "CN109510811B",
        "CN109281662B",
        "CN109272154B",
        "US11521142B2",
        "US10929411B2",
        "US10579231B1",
        "US20200143396A1",
        "US11719842B2",
        "US11520077B2",
        "WO2020123097A1",
        "BR112021011246A2",
        "WO2020123100A2",
        "US11397272B2",
        "CN109779604B",
        "US11282093B2",
        "EP3915069A4",
        "WO2020185863A1",
        "CA3134774A1",
        "US11280164B2",
        "US11512590B2",
        "US11492896B2",
        "US11634980B2",
        "US11542811B2",
        "US20220282595A1",
        "US11556612B2",
        "US11514383B2",
        "US20210080928A1",
        "US11401801B2",
        "US11668854B2",
        "WO2021096489A1",
        "GB2602909A",
        "CN111046341B",
        "US11651278B2",
        "US11598898B2",
        "US11715034B2",
        "US20210233008A1",
        "US11639649B2",
        "CA3098212A1",
        "US11555943B2",
        "WO2021194467A1",
        "US11481413B2",
        "US11704579B2",
        "US11521324B2",
        "CN111753957B",
        "US20220134556A1",
        "US20220229958A1",
        "CN113033599A",
        "CA3207222A1",
        "CN112906298B",
        "US11530609B2",
        "US11579334B2",
        "CN113092337B",
        "US20220356690A1",
        "WO2022241444A1",
        "WO2022250670A1",
        "CN113779690B",
        "WO2023097070A1",
        "CN114184154B",
        "CN114415575B",
        "CN114384886B",
        "CN114860815B",
        "CN114880957B",
        "CN115983088B",
        "CN115481577B",
        "CN116341764B",
        "CN116432890B"
    ]
}