{
    "patent_id": "US-11017312-B2",
    "title": "Expanding training questions through contextualizing feature search ",
    "assignee": "International Business Machines Corporation",
    "publication_date": "2021-05-25",
    "patent_link": "https://patents.google.com/patent/US11017312B2/en",
    "inventors": [
        "Donna K. Byron",
        "Alexander Pikovsky",
        "Mary D. Swift"
    ],
    "classifications": [
        "G06N20/00",
        "G06N5/041",
        "G06F16/9035"
    ],
    "abstract": "Mechanisms for training a Question and Answer (QA) system are provided. The QA system receives a training question for processing by the QA system and processes the training question to generate an answer to the training question, from a portion of content. The QA system identifies a repeatable pattern of content present in the portion of content in association with the answer to the training question. The QA system applies the repeatable pattern of content to other portions of content to generate at least one additional training question and at least one additional entry in a ground truth data structure to thereby expand a set of training questions and expand the ground truth data structure. The QA system is then trained using the expanded set of training questions and expanded ground truth data structure.",
    "claims": "\n1. A method, in a data processing system having a processor and a memory and implementing a Question and Answer (QA) system, the method comprising:\nreceiving, by the QA system, a training question for processing by the QA system;\nprocessing, by the QA system, the training question to generate an answer to the training question, from a portion of content in a corpus of information;\nidentifying, by the QA system, a repeatable pattern of content present in the portion of content in association with the answer to the training question;\napplying, by the QA system, the repeatable pattern of content to other portions of content to generate at least one additional training question and at least one additional entry in a ground truth data structure to thereby expand a set of training questions and expand the ground truth data structure;\nstoring the expanded set of training questions and expanded ground truth data structure; and\ntraining the QA system using the expanded set of training questions and expanded ground truth data structure, wherein the portion of content is an unstructured natural language portion of content and the repeatable pattern of content is identified by identifying a structure within the unstructured natural language portion of content that comprises a plurality of entries, each entry having the repeatable pattern of content.\n2. The method of claim 1, wherein identifying the repeatable pattern comprises applying one or more rules associated with a type of the portion of content, wherein the one or more rules specify a repeatable structure of the portion of content indicative of a repeatable pattern for identifying first elements of the at least one additional training question, and second elements of at least one additional answer to the at least one additional training question.\n3. The method of claim 2, wherein the one or more rules specify metadata patterns indicative of a repeatable pattern associated with a group of elements of the portion of content.\n4. The method of claim 1, wherein the portion of content comprises a document in a corpus of documents, and wherein the structure comprises at least one of a table data structure, a list data structure, bulleted data, or outlined data with headings and subheadings.\n5. The method of claim 1, wherein applying the repeatable pattern of content to other portions of content to generate at least one additional training question and at least one additional entry in a ground truth data structure further comprises:\nselecting, based on the repeatable structure of the portion of content, each element in the repeatable structure that is in a parallel position in the repeatable structure to the answer generated for the training question, to thereby generate selected elements; and\nverifying each of the selected elements in the repeatable structure.\n6. The method of claim 5, wherein verifying each of the selected elements in the repeatable structure comprises:\nfor each selected element performing at least one of bayesian reasoning or ontology based reasoning to infer a semantic type of the selected element;\nevaluating whether a sufficient number of the selected elements are of a similar semantic type to a semantic type of the answer to the training question; and\nstoring each of the selected elements as additional answers in the at least one additional answer in response to the evaluation indicating that a sufficient number of the selected elements are of a similar semantic type to the semantic type of the answer to the training question.\n7. The method of claim 6, wherein applying the repeatable pattern of content to other portions of content to generate at least one additional training question and at least one additional entry in a ground truth data structure further comprises:\nidentifying relation terms in the training question;\nsearching the portion of content for the relation terms;\ndetermining a structural relation of the repeatable structure based on an identification of the relation terms in the portion of content;\nverifying the structural relation of the repeatable structure returns semantically similar answers to the answer to the training question; and\nstoring tuples of relation terms and the additional answers in response to the structural relation being verified.\n8. The method of claim 7, wherein applying the repeatable pattern of content to other portions of content to generate at least one additional training question and at least one additional entry in a ground truth data structure further comprises, for each stored tuple:\nconverting the stored tuples to a natural language question; and\nstoring an entry in the ground truth data structure correlating the natural language question with the additional answer associated with the tuple.\n9. The method of claim 1, wherein the repeatable pattern of content is a portion of a table structure, and wherein applying the repeatable pattern of content to other portions of content to generate at least one additional training question and at least one additional entry in a ground truth data structure further comprises:\nselecting, based on the portion of the table structure, each element in the portion of the table structure that is in a parallel position, in the table structure, to the answer generated for the training question, to thereby generate selected elements; and\nverifying each of the selected elements in the repeatable structure.\n10. A computer program product comprising a computer readable storage medium having a computer readable program stored therein, wherein the computer readable program, when executed on a computing device implementing a Question and Answer (QA) system, causes the computing device to:\nreceive, by the QA system, a training question for processing by the QA system;\nprocess, by the QA system, the training question to generate an answer to the training question, from a portion of content in a corpus of information;\nidentify, by the QA system, a repeatable pattern of content present in the portion of content in association with the answer to the training question;\napply, by the QA system, the repeatable pattern of content to other portions of content to generate at least one additional training question and at least one additional entry in a ground truth data structure to thereby expand a set of training questions and expand the ground truth data structure; and\nstore the expanded set of training questions and expanded ground truth data structure; and\ntrain the QA system using the expanded set of training questions and expanded ground truth data structure, wherein the portion of content is an unstructured natural language portion of content and the repeatable pattern of content is identified by identifying a structure within the unstructured natural language portion of content that comprises a plurality of entries, each entry having a same pattern of content.\n11. The computer program product of claim 10, wherein the computer readable program further causes the computing device to identify the repeatable pattern at least by applying one or more rules associated with a type of the portion of content, wherein the one or more rules specify a repeatable structure of the portion of content indicative of a repeatable pattern for identifying first elements of the at least one additional training question, and second elements of at least one additional answer to the at least one additional training question.\n12. The computer program product of claim 11, wherein the one or more rules specify metadata patterns indicative of a repeatable pattern associated with a group of elements of the portion of content.\n13. The computer program product of claim 10, wherein the portion of content comprises a document in a corpus of documents, and wherein the structure comprises at least one of a table data structure, a list data structure, bulleted data, or outlined data with headings and subheadings.\n14. The computer program product of claim 11, wherein the computer readable program further causes the computing device to apply the repeatable pattern of content to other portions of content to generate at least one additional training question and at least one additional entry in a ground truth data structure at least by:\nselecting, based on the repeatable structure of the portion of content, each element in the repeatable structure that is in a parallel position in the repeatable structure to the answer generated for the training question, to thereby generate selected elements; and\nverifying each of the selected elements in the repeatable structure.\n15. The computer program product of claim 14, wherein verifying each of the selected elements in the repeatable structure comprises:\nfor each selected element performing at least one of bayesian reasoning or ontology based reasoning to infer a semantic type of the selected element;\nevaluating whether a sufficient number of the selected elements are of a similar semantic type to a semantic type of the answer to the training question; and\nstoring each of the selected elements as additional answers in the at least one additional answer in response to the evaluation indicating that a sufficient number of the selected elements are of a similar semantic type to the semantic type of the answer to the training question.\n16. The computer program product of claim 15, wherein the computer readable program further causes the computing device to apply the repeatable pattern of content to other portions of content to generate at least one additional training question and at least one additional entry in a ground truth data structure at least by:\nidentifying relation terms in the training question;\nsearching the portion of content for the relation terms;\ndetermining a structural relation of the repeatable structure based on an identification of the relation terms in the portion of content;\nverifying the structural relation of the repeatable structure returns semantically similar answers to the answer to the training question; and\nstoring tuples of relation terms and the additional answers in response to the structural relation being verified.\n17. The computer program product of claim 16, wherein the computer readable program further causes the computing device to apply the repeatable pattern of content to other portions of content to generate at least one additional training question and at least one additional entry in a ground truth data structure at least by, for each stored tuple:\nconverting the stored tuples to a natural language question; and\nstoring an entry in the ground truth data structure correlating the natural language question with the additional answer associated with the tuple.\n18. The computer program product of claim 10, wherein the repeatable pattern of content is a portion of a table structure, and wherein the computer readable program further causes the computing device to apply the repeatable pattern of content to other portions of content to generate at least one additional training question and at least one additional entry in a ground truth data structure at least by:\nselecting, based on the portion of the table structure, each element in the portion of the table structure that is in a parallel position, in the table structure, to the answer generated for the training question, to thereby generate selected elements; and\nverifying each of the selected elements in the repeatable structure.\n19. An apparatus comprising:\na processor; and\na memory coupled to the processor, wherein the memory comprises instructions which, when executed by the processor, cause the processor to:\nreceive a training question for processing by a Question and Answer (QA) system associated with the apparatus;\nprocess the training question to generate an answer to the training question, from a portion of content in a corpus of information;\nidentify a repeatable pattern of content present in the portion of content in association with the answer to the training question;\napply the repeatable pattern of content to other portions of content to generate at least one additional training question and at least one additional entry in a ground truth data structure to thereby expand a set of training questions and expand the ground truth data structure; and\nstore the expanded set of training questions and expanded ground truth data structure; and\ntrain the QA system using the expanded set of training questions and expanded ground truth data structure, wherein the portion of content is an unstructured natural language portion of content and the repeatable pattern of content is identified by identifying a structure within the unstructured natural language portion of content that comprises a plurality of entries, each entry having a same pattern of content.",
    "status": "Active",
    "citations_own": [
        "US20060173834A1",
        "US20060235689A1",
        "US20070022099A1",
        "US20070196804A1",
        "US20080195378A1",
        "US20090162824A1",
        "US20090287678A1",
        "US20090292687A1",
        "US7756800B2",
        "US7870117B1",
        "US7873624B2",
        "US20110066587A1",
        "US20110125734A1",
        "US20120041950A1",
        "US8346792B1",
        "US20130007055A1",
        "US20130018652A1",
        "US20130066886A1",
        "US20130226846A1",
        "US8543565B2",
        "US8645391B1",
        "US20140046947A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US11281852B2"
    ],
    "citedby_ftf": [
        "US20160179063A1",
        "US10318591B2",
        "US10606849B2",
        "US10607142B2",
        "US20180068222A1",
        "US10762992B2",
        "US11176463B2",
        "US10387560B2",
        "TWI645303B",
        "CN106844558A",
        "WO2018170876A1",
        "US10902346B2",
        "US11170660B2",
        "US10482180B2",
        "US11226997B2",
        "US11250038B2",
        "US11003705B2",
        "US10565189B2",
        "WO2019187463A1",
        "US11080598B2",
        "CN110659354B",
        "CN109241254B",
        "US10929602B2",
        "KR102128549B1",
        "US11144337B2",
        "US10929392B1",
        "US10970322B2",
        "US11100917B2",
        "US11036803B2",
        "CN110955765A",
        "US20220164393A1"
    ]
}