{
    "patent_id": "US-11169207-B2",
    "title": "Testing of semiconductor chips with microbumps ",
    "assignee": "Taiwan Semiconductor Manufacturing Company, Ltd.",
    "publication_date": "2021-11-09",
    "patent_link": "https://patents.google.com/patent/US11169207B2/en",
    "inventors": [
        "Wei-Cheng Wu",
        "Hsien-Pin Hu",
        "Shang-Yun Hou",
        "Shin-puu Jeng",
        "Chen-Hua Yu",
        "Chao-Hsiang Yang"
    ],
    "classifications": [
        "G01R31/2896",
        "H01L22/32",
        "G01R1/0416",
        "G01R31/2601",
        "G01R31/2884",
        "G01R31/2886",
        "G01R31/2889",
        "G01R31/2893",
        "H01L24/06",
        "H01L2224/02377",
        "H01L2224/0392",
        "H01L2224/0401",
        "H01L2224/05027",
        "H01L2224/05147",
        "H01L2224/05552",
        "H01L2224/05568",
        "H01L2224/05655",
        "H01L2224/0614",
        "H01L2224/0616",
        "H01L2224/1146",
        "H01L2224/1147",
        "H01L2224/11849",
        "H01L2224/13005",
        "H01L2224/13083",
        "H01L2224/13111",
        "H01L2224/13113",
        "H01L2224/13116",
        "H01L2224/13139",
        "H01L2224/13147",
        "H01L2224/13155",
        "H01L2224/14131",
        "H01L2224/16238",
        "H01L24/03",
        "H01L24/05",
        "H01L24/11",
        "H01L24/13",
        "H01L2924/00012",
        "H01L2924/00014",
        "H01L2924/01047",
        "H01L2924/014",
        "H01L2924/20752"
    ],
    "abstract": "A device includes a test pad on a chip. A first microbump has a first surface area that is less than a surface area of the test pad. A first conductive path couples the test pad to the first microbump. A second microbump has a second surface area that is less than the surface area of the test pad. A second conductive path couples the test pad to the second microbump.",
    "claims": "\n1. A device comprising:\na test pad on a chip, the test pad being quadrilateral in shape;\na first microbump pad having a first surface area that is less than a surface area of the test pad, the first microbump pad being arranged proximate to a first edge of the quadrilateral;\na second microbump pad having a second surface area that is equal to or less than the surface area of the test pad, the second microbump pad being arranged proximate to a second edge of the quadrilateral; and\na third microbump pad having a third surface area that is less than the surface area of the test pad, the third microbump pad being arranged proximate to a third edge of the quadrilateral.\n2. The device of claim 1, wherein the first microbump pad is octagonal in shape.\n3. The device of claim 1, wherein the test pad includes an upper surface with probe damage.\n4. The device of claim 1, wherein the second microbump pad is arranged proximate to the second edge of the quadrilateral such that the first microbump pad and the second microbump pad are arranged symmetrically about opposite edges of the test pad.\n5. The device of claim 4, wherein the second microbump pad is octagonal in shape.\n6. The device of claim 4, wherein the first edge is an upper edge of the quadrilateral and the second edge is a lower edge of the quadrilateral.\n7. The device of claim 6, further comprising:\na fourth microbump pad having a fourth surface area that is less than the surface area of the test pad, the fourth microbump pad being arranged proximate to a right edge of the quadrilateral such that the third microbump pad and the fourth microbump pad are arranged symmetrically about the test pad.\n8. The device of claim 7, wherein the third microbump pad and the fourth microbump pad are each octagonal in shape.\n9. The device of claim 8, wherein each of the first microbump pad, the second microbump pad, the third microbump pad, and the fourth microbump pad have equal surfaces areas.\n10. A device comprising:\na test pad on a chip, the test pad being quadrilateral in shape;\na first microbump pad that is octagonal in shape and having a first surface area that is less than a surface area of the test pad, the first microbump pad being arranged proximate to a first edge of the quadrilateral;\nwherein the test pad includes an upper surface with probe damage;\na second microbump pad having a second surface area that is less than the surface area of the test pad, the second microbump pad being arranged proximate to a second edge of the quadrilateral; and\na third microbump pad having a third surface area that is less than the surface area of the test pad, the third microbump pad being arranged proximate to a third edge of the quadrilateral.\n11. The device of claim 10, wherein a width of the first microbump pad is approximately 50 μm.\n12. The device of claim 10, wherein the first edge of the quadrilateral is opposite the second edge of the quadrilateral.\n13. The device of claim 10, further comprising:\na fourth microbump pad having a fourth surface area that is less than the surface area of the test pad, the fourth microbump pad being arranged proximate to a fourth edge of the quadrilateral.\n14. A test structure for performing electrical tests of devices under one or more microbumps, comprising:\na first chip including a test pad surrounded by two or more microbump structures;\nan substrate spaced apart from the first chip; and\nwherein the two or more microbump structures extend between the first chip and the substrate.\n15. The test structure of claim 14, wherein each of the two or more microbump structures comprises a microbump pad having a microbump pad area that is less than a test pad area of the test pad.\n16. The test structure of claim 15, wherein a distance between the microbump pad of a microbump structure and the test pad ranges from about 20 μm to about 80 μm.\n17. The test structure of claim 14, wherein the test pad is quadrilateral in shape.\n18. The test structure of claim 17, wherein at least one of the two or more microbump structures includes a microbump pad that is octagonal in shape and that has a microbump pad surface area that is less than a surface area of the test pad.\n19. The test structure of claim 14, wherein the test pad includes a probe mark thereon.\n20. The test structure of claim 14, further comprising a passivation layer over the test pad."
}