{
    "patent_link": "https://patents.google.com/patent/US6132969A/en",
    "patent_id": "US6132969A",
    "title": "Methods for testing biological network models",
    "abstract": "The present invention provides methods and systems for testing and confirming how well a network model represents a biological pathway in a biological system. The network model comprises a network of logical operators relating input cellular constituents (e.g., mRNA or protein abundances) to output classes of cellular constituents, which are affected by the pathway in the biological system. The methods of this invention provide, first, for choosing complete and efficient experiments for testing the network model which compare relative changes in the biological system in response to perturbations of the network. The methods also provide for determining an overall goodness of fit of the network model to biological system by: predicting from the network model how output classes behave in response to the chosen experiments, finding measures of relative change of cellular constituents actually observed in the chosen experiments, finding goodnesses of fit of each observed cellular constituent to an output class with which the cellular constituent has the strongest correlation, and determining an overall goodness of fit of the network model from the individual goodnesses of fit of each observed cellular constituent. Additionally, these methods provide for testing the significance of the overall goodness of fit according to a nonparametric statistical test using an empirically determined distribution of possible goodnesses of fit. This invention also provides for computer systems for carrying out the computational steps of these methods.",
    "inventors": [
        "Roland Stoughton",
        "Richard M. Karp"
    ],
    "assignee": "Microsoft Technology Licensing LLC",
    "classifications": [
        "G16B5/00",
        "G16B5/10"
    ],
    "claims": "\n1. A method for testing or confirming a network model for a biological system,\nsaid network model comprising:\na plurality of input constituents; and\na plurality of output classes represented by boolean functions of values of perturbations or modifications to one or more of said input constituents;\nsaid method comprising:\n(a) assigning one or more cellular constituents to a particular output class having a defined change that best matches a measured change, wherein\n(i) said measured change is provided by data from one or more network testing experiments, said data comprising measured changes in the one or more cellular constituents from a first input state to a second input state,\n(ii) said defined change is provided by an influence matrix which defines changes of each output class from the first input state to the second input state according to the network model; and\n(b) determining an overall goodness of fit of said data to the network model, wherein the network model is tested or confirmed by said overall goodness of fit.\n2. The method of claim 1 wherein, for each of the one or more cellular constituents assigned to a particular output class, the particular output class having a defined change that best matches a measured change is identified by means of an objective measure of the difference between said measured change and said defined change.\n3. The method of claim 2 wherein\nthe objective measure of the difference between said measured change and said defined change for each of the one or more cellular constituents assigned to a particular output class comprises the maximum likelihood of observing said measured change of said cellular constituent.\n4. The method of claim 3 wherein said overall goodness of fit comprises the product of said maximum likelihoods for each of the one or more cellular constituents.\n5. The method of claim 2 wherein said objective measure comprises a correlation of said measured change of said cellular constituent with said defined change of said cellular constituent for one of said output classes.\n6. The method of claim 5 wherein said objective measure comprises the absolute value of said correlation.\n7. The method of claim 5 wherein said correlation is provided by a method comprising correlating the absolute values of said measured change of said cellular constituent with said defined change of said cellular constituent for one of said output class.\n8. The method of claim 1 wherein said step of determining an overall goodness of fit of said data to the network model comprises:\n(i) determining, for each of the one or more cellular constituents assigned to a particular output class, a value of an objective measure of the difference between the measured change and the defined change; and\n(ii) combining the values of said objective measure for each of the one or more cellular constituents assigned to a particular output class,\nwherein said combined values of said objective measure comprise said overall goodness of fit.\n9. The method of claim 8 wherein the values of said objective measure for each of the one or more cellular constituents assigned to a particular output class are additively combined.\n10. The method of claim 8 further comprising a step of assessing the significance of said overall goodness of fit by a method comprising\n(i) obtaining an expected probability distribution of overall goodness of fit values, and\n(ii) assessing the statistical significance of said overall goodness of fit in view of said expected probability distribution.\n11. The method of claim 10 wherein said expected probability distribution is obtained by a method comprising repeatedly:\n(i) randomly permuting the measured changes for each of the one or more cellular constituents with respect to the one or more network testing experiments, to produce randomly permuted measured changes; and\n(ii) determining an overall goodness of fit value for said randomly permuted measured changes; until a plurality of overall goodness of fit values is generated,\nwherein said plurality of overall goodness of fit values comprises said expected probability distribution of overall goodness of fit values.\n12. The method of claim 1 further wherein said network testing experiments are chosen according to a method comprising:\n(a) identifying a covering set of input states, said covering set of input states comprising, for any pair of output classes, input states which distinguish said pair of output classes; and\n(b) choosing pairs of input states, each pair of input states comprising\n(i) a first input state in said covering set, and\n(ii) a second input state in said covering set,\nwherein, for any pair of output classes, said first input state and said second input state distinguish said pair of output classes,\nwherein said chosen network testing experiments comprise measured changes in one or more cellular constituents from the first input state to the second input state of each chosen pair of input states.\n13. The method of claim 12 wherein said step of identifying a covering set of input states comprises determining a solution to a linear integer programming problem, wherein\nsaid linear integer programming problem comprises a pair of inequalities for each output class, said pair of inequalities consisting of:\n(i) a first inequality representing all input states in which output classes in a pair of output classes have different behaviors, and\n(ii) a second inequality representing all input states in which output classes in a pair of output classes have the same behavior.\n14. The method of claim 13\nwherein all input states in said covering set of input states are assigned individual experimental costs, and\nwherein the solution to said linear integer programming problem minimizes the sum of individual experimental costs of all input states in said covering set of input states.\n15. The method of claim 13 wherein the solution to said linear integer programming problem is determined by means of a branch-and-bound algorithm.\n16. The method of claim 12 wherein said step of choosing pairs of input states comprises determining a solution to a linear integer programming problem, wherein\nsaid linear integer programming problem comprises an inequality for each possible pair of output classes, said inequality representing all pairs of input states in the covering set in which output classes in said pair of output classes have different behaviors.\n17. The method of claim 16 wherein the solution to said linear integer programming problem is determined by means of a branch-and-bound algorithm.\n18. The method of claim 1\nwherein said cellular constituents comprise protein species present in said biological system; and\nwherein said measured changes in the one or more cellular constituents comprise measured changes in activities of said protein species.\n19. The method of claim 1 wherein said perturbations or modifications to one or more input constituents is done by a method comprising modifying said one or more input constituents.\n20. The method of claim 19 wherein said one or more input constituents are modified by a method comprising deleting genes encoding said input constituents.\n21. The method of claim 19 wherein said one or more input constituents are modified by a method comprising causing expression of said one or more input constituents under the control of a controllable expression system.\n22. The method of claim 19 wherein said one or more input constituents are modified by a method comprising controllable transfection of genes expressing said one or more input constituents.\n23. The method of claim 19 wherein said one or more input constituents are modified by a method comprising controllably decreasing abundances of RNA species encoding said one or more input constituents in said biological system.\n24. The method of claim 23 wherein said method of controllably decreasing said abundances of RNA species comprises exposing said biological system to ribozymes targeted to cleave said RNA species.\n25. The method of claim 19 wherein said one or more input constituents are modified by a method comprising controllably decreasing the rate of translation of RNA species encoding said one or more input constituents in said biological system.\n26. The method of claim 25 wherein said method of controllably decreasing the rate of translation of RNA species comprises exposing said biological system to antisense nucleic acids or antisense nucleic acid mimics that hybridize to said RNA species or to DNA encoding said RNA species.\n27. The method of claim 19 wherein said one or more input cellular constituents are abundances of protein species or activities of protein species, and wherein said one or more input constituents are modified by a method comprising controllably decreasing one or more of said abundances in said biological system.\n28. The method of claim 27 wherein said method of controllably decreasing one or more of said abundances comprises causing expression in said biological system of one or more of said protein species as fusion proteins comprising said protein species and a degron, wherein said degron is controllable to increase the rate of degradation of said protein species.\n29. The method of claim 19 wherein said one or more input constituents are activities of protein species, and wherein said one or more input constituents are modified by a method comprising controllably decreasing said activities in said biological system.\n30. The method of claim 29 wherein said method of controllably decreasing said activities comprises exposing said biological system to antibodies, wherein said antibodies bind said protein species.\n31. The method of claim 29 wherein said method of controllably decreasing said activities comprises exposing said biological system to drugs which directly and specifically inhibit said activities of said protein species.\n32. The method of claim 29 wherein said method of controllably decreasing said activities comprises exposing said biological system to a dominant negative mutant protein species, wherein said dominant negative mutant protein species are proteins inhibiting said activities.\n33. The method of claim 1\nwherein said cellular constituents comprise protein species present in said biological system; and\nwherein said measured changes in the one or more cellular constituents comprise measured changes in abundances of said protein species.\n34. The method of claim 33 wherein the abundances of said plurality of protein species are measured by a method comprising contacting an antibody array with proteins from said biological system, wherein said antibody array comprises a surface with attached antibodies, said antibodies capable of binding with said plurality of protein species.\n35. The method of claim 33 wherein the abundances of said plurality of protein species are measured by a method comprising performing two-dimensional electrophoresis of proteins from said biological system.\n36. The method of claim 1 further comprising a step of assessing the statistical signifcance of alternative network models according to the Maximum Likelihood method.\n37. The method of claim 1 wherein said changes defined by said influence matrix comprise:\n(i) indications of no change of a cellular constituent from the first input state to the second input state, and\n(ii) indications of change of a cellular constituent from the first input state to the second input state.\n38. The method of claim 1 wherein said changes defined by said normalized influence matrix comprise:\n(i) indications of no change of a cellular constituent from the first input state to the second input state, and\n(ii) indications of change of a cellular constituent from the first input state to the second input state and the direction of said change of the cellular constituent from the first input state to the second input state.\n39. The method of claim 1 wherein said changes defined by said normalized influence matrix comprise:\n(i) indications of no change of a cellular constituent from the first input state to the second input state,\n(ii) indications of relative increase of a cellular constituent from the first input state to the second input state, and\n(iii) indications of relative decrease of a cellular constituent from the first input state to the second input state.\n40. The method of claim 1 wherein said influence matrix is normalized such that:\n(i) the mean value of all elements of said influence matrix defining the behavior of an output class is zero, and\n(ii) the sum of the squares of all elements of said influence matrix defining the behavior of an output class has the same value as the sum of the squares of all elements of said influence matrix defining the behavior of any other output class.\n41. The method of claim 1 wherein said measured change is normalized by expected additive and multiplicative measurement errors.\n42. The method of claim 1 wherein said biological system comprises one or more cells of a yeast.\n43. The method of claim 42 wherein said yeast is a strain of Saccharomyces cerevisiae.\n44. The method of claim 1 wherein at least one of said input constituents comprises one or more drugs.\n45. The method of claim 1\nwherein said cellular constituents comprise RNA species present in said biological system;and\nwherein said measured changes in the one or more cellular constituents comprise measured changes in abundances of said RNA species.\n46. The method of claim 45 wherein the abundances of said plurality of RNA species are measured by a method comprising contacting a gene transcript array with RNA from said biological system, or with cDNA derived therefrom, wherein a gene transcript array comprises a surface with attached nucleic acids or nucleic acid mimics, said nucleic acids or nucleic acid mimics capable of hybridizing with said plurality of RNA species, or with cDNA derived therefrom.\n47. The method of claim 46 wherein said measured changes in the one or more cellular constituents from a first input state to a second input state are provided by a method comprising:\n(i) contacting one or more gene transcript arrays with RNA, or with cDNA derived therefrom, from said biological system in said first input state, and\n(ii) contacting one or more gene transcript arra s with RNA, or with cDNA derived therefrom, from said biological system in said second input state.\n48. A computer system for testing or confirming a network model for a biological system,\nsaid network model comprising:\na plurality of input constituents; and\na plurality of output classes represented by boolean functions of values of perturbations or modifications to one or more of said input constituents,\nsaid computer system comprising:\na processor;\na memory coupled to said processor and encoding one or more programs, said one or more programs causing said processor to execute steps of:\n(a) assigning one or more cellular constituents to a particular output class having a defined change that best matches a measured change, wherein\n(i) said measured change is provided by data from one or more network testing experiments, said data comprising measured changes in the one or more cellular constituents from a first input state to a second input state,\n(ii) said defined change is provided by an influence matrix which defines changes of each output class from the first input state to the second input state according to the network model; and\n(b) determining an overall goodness of fit of said data to the network model, wherein the network model is tested or confirmed by said overall goodness of fit.\n49. The computer system of claim 48 wherein\nsaid one or more programs further cause said processor to execute a step of determining a value of an objective measure of the difference between said measured change and said defined change; and\nsaid step of assigning said one or more cellular constituents to the particular output class is done according to said value of the objective measure.\n50. The computer system of claim 48 wherein said one or more programs cause the processor to execute the step of determining an overall goodness of fit of said data to the network model by further executing steps comprising:\n(i) determining, for each of the one or more cellular constituents assigned to an output class, a value of an objective measure of the difference between the measured change and the defined change; and\n(ii) combining said values of said objective measure for each of the one or more cellular constituents assigned to an output class,\nwherein said combined values of said objective measure comprise said overall goodness of fit.\n51. The computer system of claim 50 wherein said one or more programs further cause said processor to execute steps of:\n(i) obtaining an expected probability distribution of overall goodness of fit values; and\n(ii) determining a statistical significance of said overall goodness of fit from said expected probability distribution.\n52. The computer system of claim 51 wherein said one or more programs cause said processor to execute the step of obtaining an expected probability distribution of overall goodness of fit values by further executing steps which comprise repeatedly:\n(i) randomly permuting the measured changes for each of the one or more cellular constituents with respect to the one or more network testing experiment so that randomly permuted measured changes are produced; and\n(ii) determining an overall goodness of fit value for said randomly permuted measured changes,\nuntil a plurality of overall goodness of fit values is generated, and\nwherein said plurality of overall goodness of fit values comprises said expected probability distribution of overall goodness of fit values.\n53. A computer system for choosing one or more network testing experiments for testing or confirming a network model for a biological system,\nsaid network model comprising:\na plurality of input constituents; and\na plurality of output classes represented by boolean functions of values of perturbations or modifications to one or more of said input constituents,\nsaid computer system comprising:\na processor; and\na memory coupled to said processor and encoding one or more programs,\nsaid one or more programs causing said processor to execute steps of:\n(a) identifying a covering set of input states, said covering set of input states comprising, for any pair of output classes, input states which distinguish said pair of output classes; and\n(b) choosing pairs of input states, each pair of input states comprising\n(i) a first input state in said covering set, and\n(ii) a second input state in said covering set,\nwherein, for any pair of output classes, said first input state and said second input state distinguish said pair of output classes,\nwherein said chosen network testing experiments comprise measured changes in one or more cellular constituents from the first input state to the second input state of each chosen pair of input states.\n54. A method for testing or confirming a network model for a biological system,\nsaid network model comprising:\na plurality of input constituents; and\na plurality of output classes represented by boolean functions of values of perturbations or modifications to one or more of said input constituents,\nsaid method comprising:\n(a) measuring changes of one or more cellular constituents in one or more network testing experiments, which network testing experiments comprise perturbations or modifications of one or more of said input constituents from a first input state to a second input state;\n(b) constructing an influence matrix that defines changes for each output class from said first input state to said second input state according to said network model;\n(c) assigning said one or more cellular constituents to one or more output classes for which the defined changes from the influence matrix best match the measured changes provided by step (a) of each of said one or more cellular constituents; and\n(d) determining an overall goodness of fit of said measured changes to the network model.\n55. The method of claim 54 wherein said network testing experiments are chosen according to a method comprising:\n(i) identifying a covering set of input states, said covering set of input states comprising, for any pair of output classes, input states which distinguish said pair of output classes; and\n(ii) choosing pairs of input states, each pair of input states comprising\na first input state in said covering set, and\na second input state in said covering set,\nwherein, for any pair of output classes, said first input state and said second input state in said pairs of input states distinguish said pair of output classes, and\nwherein said chosen network testing experiments comprise perturbations or modifications of one or more cellular constituents from said first input state to said second input state in said pairs of input states.\n56. The method of claim 55 wherein said step of identifying a covering set of input states comprises determining a solution to a linear integer programming problem, wherein said linear integer programming problem comprises a pair of inequalities for each output class, said pair of inequalities consisting of:\n(i) a first inequality representing all input states in which output classes in a pair of output classes have different behaviors, and\n(ii) a second inequality representing all input states in which output classes in a pair of output classes have the same behavior.\n57. The method of claim 56 wherein the solution to said linear integer programming problem is determined by means of a branch-and-bound algorithm.\n58. The method of claim 55 wherein said step of choosing pairs of input states comprises determining a solution to a linear integer programming problem, wherein said linear integer programming problem comprises an inequality for each possible pair of output classes, said inequality representing all pairs of input states in the covering set in which output classes in said pair of output classes have different behaviors.\n59. The method of claim 58 wherein the solution to said linear integer programming problem is determined by means of a branch-and-bound algorithm.\n60. A method of choosing one or more network testing experiments for testing or confirming a network model for a biological system,\nsaid network model comprising:\na plurality of input constituents; and\na plurality of output classes represented by boolean functions of values of perturbations or modifications to one or more of said input constituents,\nsaid method comprising:\n(a) identifying a covering set of input states, said covering set of input states comprising, for any pair of output classes, input states which distinguish said pair of output classes; and\n(b) choosing pairs of input states, each pair of input states comprising\n(i) a first input state in said covering set, and\n(ii) a second input state in said covering set,\nwherein, for any pair of output classes, said first input state and said second input state distinguish said pair of output classes,\nwherein said chosen network testing experiments comprise measured changes in one or more cellular constituents from the first input state to the second input state of each chosen pair of input states.\n61. The method of claim 60 wherein said step of identifying a covering set of input states comprises determining a solution to a linear integer programming problem, wherein said linear integer programming problem comprises a pair of inequalities for each output class, said pair of inequalities consisting of:\n(i) a first inequality representing all input states in which output classes in a pair of output classes have different behaviors, and\n(ii) a second inequality representing all input states in which output classes in a pair of output classes have the same behavior.\n62. The method of claim 61 wherein the solution to said linear integer programming problem is determined by means of a branch-and-bound algorithm.\n63. The method of claim 61\nwherein all input states in said covering set of input states are assigned individual experimental costs, and\nwherein the solution to said linear integer programming problem minimizes the sum of individual experimental costs of all input states in said covering set of input states.\n64. The method of claim 60 wherein said step of choosing pairs of input states comprises determining a solution to a linear integer programming problem, wherein said linear integer programming problem comprises an inequality for each possible pair of output classes, said inequality representing all pairs of input states in the covering set in which output classes in said pair of output classes have different behaviors.\n65. The method of claim 64 wherein the solution to said linear integer programming problem is determined by means of a branch-and-bound algorithm.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "WO1994017208A1",
        "US5445934A",
        "US5569588A",
        "WO1997010365A1",
        "US5645988A",
        "WO1997027317A1",
        "EP0816511A1",
        "WO1998006874A1",
        "US5744305A",
        "US5800992A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20010012983A1",
        "US20010018182A1",
        "US6300078B1",
        "US20020012939A1",
        "US20020049788A1",
        "WO2002065119A1",
        "US20020119462A1",
        "US20020155422A1",
        "WO2002088383A2",
        "US6486706B2",
        "WO2002095654A1",
        "US20020182652A1",
        "US6492837B1",
        "US20020194154A1",
        "US20020194201A1",
        "US20020198858A1",
        "WO2002103608A2",
        "US6529045B2",
        "US6529861B1",
        "WO2003021257A1",
        "US20030059792A1",
        "US6556962B1",
        "WO2003040992A1",
        "US20030143520A1",
        "US20030154003A1",
        "US20030215786A1",
        "US20030219771A1",
        "WO2003100541A2",
        "US20030224394A1",
        "US20030224363A1",
        "US20030229451A1",
        "US20030233218A1",
        "US20040029149A1",
        "US6692916B2",
        "US20040048264A1",
        "US6713257B2",
        "US20040072723A1",
        "US20040072160A1",
        "US20040076954A1",
        "US20040110216A1",
        "US20040133352A1",
        "US6763308B2",
        "US20040210398A1",
        "US20040225449A1",
        "US6832205B1",
        "US20040254736A1",
        "EP1488235A2",
        "US6859735B1",
        "US20050060101A1",
        "US20050060100A1",
        "EP1540505A2",
        "US20050154536A1",
        "US20050187745A1",
        "US6950752B1",
        "US7003403B1",
        "US7013221B1",
        "US20060057618A1",
        "WO2005052181A3",
        "US20060111849A1",
        "US20060115826A1",
        "US20060122816A1",
        "US20060147899A1",
        "US20060241869A1",
        "US7130746B2",
        "US20070016390A1",
        "US20070016383A1",
        "US20070027634A1",
        "US20070043515A1",
        "US20070054269A1",
        "US20070055448A1",
        "US20070061086A1",
        "US20070082332A1",
        "US20070093969A1",
        "US20070130196A1",
        "US20080004824A1",
        "US7319945B1",
        "US20080059513A1",
        "US7371516B1",
        "US20080183395A1",
        "US20080200345A1",
        "US20080281526A1",
        "US20080294403A1",
        "US20080312886A1",
        "US20090023182A1",
        "US20090087848A1",
        "US20090192847A1",
        "US20090204333A1",
        "US7729864B2",
        "US7751981B2",
        "US20100223295A1",
        "US7807447B1",
        "US7809781B1",
        "US7836111B1",
        "EP2291791A1",
        "US20110071767A1",
        "WO2012170436A1",
        "US8843356B2",
        "US8971519B1",
        "US20150262082A1",
        "US20170193183A1",
        "US20170235914A1",
        "US20190025297A1",
        "US10534813B2",
        "US10943273B2"
    ],
    "citedby_ftf": [
        "JP3443039B2",
        "GB0225109D0",
        "EP1383911A4",
        "US6691042B2",
        "US7418351B2",
        "US7996155B2",
        "JP2006525811A",
        "US7881872B2",
        "US8447526B2",
        "JP5237817B2",
        "CN107133492B"
    ]
}