{
    "patent_link": "https://patents.google.com/patent/US6006225A/en",
    "patent_id": "US6006225A",
    "title": "Refining search queries by the suggestion of correlated terms from prior searches",
    "abstract": "A search engine is disclosed which suggests related terms to the user to allow the user to refine a search. The related terms are generated using query term correlation data which reflects the frequencies with which specific terms have previously appeared within the same query. The correlation data is generated and stored in a look-up table using an off-line process which parses a query log file. The table is regenerated periodically from the most recent query submissions (e.g., the last two weeks of query submissions), and thus strongly reflects the current preferences of users. Each related term is presented to the user via a respective hyperlink which can be selected by the user to submit a modified query. In one embodiment, the related terms are added to and selected from the table so as to guarantee that the modified queries will not produce a NULL query result.",
    "inventors": [
        "Dwayne E. Bowman",
        "Ruben E. Ortega",
        "Michael L. Hamrick",
        "Joel R. Spiegel",
        "Timothy R. Kohn"
    ],
    "assignee": "Amazon Technologies Inc",
    "classifications": [
        "G06F16/3325",
        "G06F16/2425",
        "G06F16/2428",
        "G06F16/3322",
        "G06F16/951",
        "Y10S707/99932",
        "Y10S707/99934",
        "Y10S707/99935"
    ],
    "claims": "\n1. In a computer system that implements a search engine which is accessible to a community of users, a method of assisting users in refining search queries to enhance discovery, the method comprising the computer-implemented steps of:\n(a) processing search queries submitted to the search engine by a plurality of users over a period of time to generate query term correlation data, the query term correlation data reflecting frequencies with which query terms appear together within the same search query;\n(b) receiving a search query from a user, the search query including at least one query term;\n(c) using at least the query term correlation data to identify a plurality of additional query terms that are deemed to be related to the at least one query term; and\n(d) presenting the plurality of additional query terms to the user for selection to allow the user to refine the search query.\n2. The method of claim 1, wherein step (a) comprises generating a data structure which that links key terms to related terms based on correlations between occurrences of terms within historical query submissions, and step (c) comprises accessing the data structure to look up related terms.\n3. The method of claim 1, wherein the search query includes multiple query terms, and step (c) comprises the sub-steps of:\n(c1) for each of the multiple query terms, identifying a set of terms that have previously occurred in combination with the respective query term within a successful query; and\n(c2) selecting, as the additional terms, a set of terms that are common to all of the sets identified in step (c1).\n4. The method of claim 3, wherein step (d) comprises presenting the additional terms via a user interface which inhibits the user from selecting more than one additional term, the method thereby guaranteeing that a modified query produced by adding an additional term will not produce a NULL query result.\n5. The method of claim 4, wherein step (d) comprises presenting the user with a plurality of hyperlinks which can be selected to submit a modified query, each hyperlink adding a different respective additional term to the query.\n6. The method of claim 1, wherein step (a) comprises processing a log that includes search queries submitted to the search engine.\n7. The method of claim 6, wherein the step of processing the log comprises ignoring search queries that produced a NULL query result.\n8. The method of claim 6, wherein the step of processing the log comprises applying a time-based biasing function to the log to favor recent search query submissions over aged search query submissions, so that the query term correlation data and the additional terms reflects current preferences of the community of users.\n9. The method of claim 1, wherein step (a) comprises updating the query term correlation data substantially in real time as the search queries are received by the search engine.\n10. The method of claim 1, wherein step (d) comprises presenting the user with a plurality of hyperlinks, each hyperlink being selectable to submit a refined search query which includes a respective additional query term, the method thereby enabling the user to initiate a refined search with a single action.\n11. The method of claim 1, wherein step (a) further comprises evaluating postquery-submission actions of users to identify search queries that are deemed to have produced useful results, and weighting the search queries that produced useful results more heavily in generating the correlation data.\n12. The method of claim 1, wherein step (c) is performed in parallel with a step of applying the query to a database to be searched.\n13. The method of claim 1, further comprising using at least one of the additional terms to select query result items to display at the top of a query result listing.\n14. In a computer system that implements a search engine in which related terms are suggested to users to facilitate interactive refinement of search queries, a system for generating related terms, comprising:\na first process which generates a data structure that links key terms to related terms based at least upon correlations between occurrences of terms within historical query submissions; and\na second process which uses the data structure in combination with a search query submitted by a user to select related terms to suggest to the user.\n15. The system of claim 14, wherein the first process determines the correlations between occurrences of terms by at least parsing a log that includes historical query submissions.\n16. The system of claim 14, wherein the first process generates and updates the data structure substantially in real-time as search queries are received by the search engine.\n17. The system of claim 14, wherein the first process regenerates the data structure periodically from a log of recent query submissions, so that the related terms suggested to the user reflect current preferences of users.\n18. The system of claim 14, wherein the first process determines the correlations by at least counting a number of times the terms have occurred within the same query.\n19. The system of claim 14, wherein the first process ignores query submissions that produced NULL query results, so that the data structure reflects only successful query submissions.\n20. The system of claim 19, wherein the second process processes a multiple-term search query by at least:\n(a) for each term in the search query, using the data structure to identify a respective set of terms that were previously submitted to the search engine in combination with the term in a successful search query; and\n(b) selecting a set of related terms such that each related term is common to each set identified in step (a).\n21. The system of claim 20, further comprising a user interface process which presents the set of related terms to the user for selection such that no more than one related term can be added to the search query per query submission, the second process thereby ensuring that a modified query produced by adding a related term will not produce a NULL query result.\n22. In a computer system that implements a search engine that is accessible to a community of users, a method of assisting users in refining search queries to enhance discovery, the method comprising:\n(a) receiving a search query from a user, the search query including at least one query term;\n(b) using at least historical search query data to identify a plurality of additional query terms that are deemed to be related to the at least one query term, the historical search query data based on previously submitted search queries; and\n(c) presenting the plurality of additional query terms to the user for selection to allow the user to refine the search query.\n23. The method of claim 22, wherein the search query includes multiple query terms, and step (b) comprises the sub-steps of:\n(b1) for each of the multiple query terms, identifying a set of terms that have previously occurred in combination with the respective query term within a successful query; and\n(b2) selecting, as the additional query terms, a set of terms that are common to all of the sets identified in step (b1).\n24. The method of claim 23, wherein step (d) comprises using a user interface method which inhibits the user from selecting more than one additional term, the method thereby guaranteeing that a modified query produced by adding an additional term will not produce a NULL query result.\n25. In a search engine that suggests related terms to users to facilitate search refinement, a method of generating related terms so as to increase a likelihood that a modified query will not produce a NULL query result, the method comprising:\n(a) receiving a search query from a user, the query including at least one term;\n(b) for each term in the search query, using historical query information to identify a respective set of terms that were previously submitted to the search engine, in combination with the term, in a successful search query;\n(c) selecting a set of related terms such that each related term is common to each set identified in step (b); and\n(d) presenting the set of related terms to the user for addition to the search query.\n26. The method of claim 25, wherein step (d) comprises presenting the related terms via a user interface which inhibits the user from selecting more than one additional term to add to the query.\n27. The method of claim 26, wherein the step (d) comprises presenting the user with a plurality of hyperlinks, each hyperlink being selectable to submit a refined search query which includes a respective related term, the method thereby enabling the user to initiate a refined search with a single action.\n28. The method of claim 25, wherein the search query comprises multiple query terms.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5675819A",
        "US5721897A",
        "US5787422A",
        "US5794233A",
        "US5864845A",
        "US5911140A",
        "US5913215A"
    ],
    "citations_ftf": [
        "US5175814A",
        "US5278980A",
        "JP3219840B2",
        "JP3390197B2",
        "JPH06314296A",
        "JPH0877203A",
        "JP3422350B2",
        "US5865845A",
        "JPH09319767A",
        "US6006225A"
    ],
    "citedby_own": [
        "WO2000022493A2",
        "WO2000054185A1",
        "US6169986B1",
        "US6185558B1",
        "US6208988B1",
        "WO2001027712A2",
        "EP1104568A1",
        "WO2001063465A1",
        "US20010021914A1",
        "US6292796B1",
        "WO2001069455A2",
        "US20010032147A1",
        "US20010034694A1",
        "WO2001080177A2",
        "WO2001080079A2",
        "US6311179B1",
        "US20010044759A1",
        "WO2001088662A2",
        "US20010044772A1",
        "US20010047315A1",
        "US20020002575A1",
        "US20020016730A1",
        "US20020026390A1",
        "WO2002017137A1",
        "EP1184789A2",
        "US20020029390A1",
        "US6366907B1",
        "US6366891B1",
        "US20020042923A1",
        "US20020049752A1",
        "US20020055981A1",
        "WO2002037320A1",
        "US6408291B1",
        "US20020078230A1",
        "EP1225521A2",
        "US20020103920A1",
        "US6430558B1",
        "US20020129053A1",
        "US20020133392A1",
        "US20020161664A1",
        "KR100358921B1",
        "US6477524B1",
        "US6480853B1",
        "US20020194161A1",
        "US6505190B1",
        "US20030014405A1",
        "US20030014403A1",
        "US20030016250A1",
        "US6516312B1",
        "US20030033324A1",
        "US20030037050A1",
        "US6526402B2",
        "US20030055819A1",
        "US20030061219A1",
        "US20030065661A1",
        "US6549941B1",
        "US20030088553A1",
        "US20030088465A1",
        "US20030101286A1",
        "US6574622B1",
        "US20030120670A1",
        "US20030120560A1",
        "WO2003058450A1",
        "US20030135430A1",
        "US20030140309A1",
        "US20030139901A1",
        "US6601066B1",
        "US20030144911A1",
        "US20030149743A1",
        "US20030167212A1",
        "US6636848B1",
        "US20030208483A1",
        "GB2388450A",
        "US6665657B1",
        "US20030233581A1",
        "US20030233224A1",
        "US6668251B1",
        "US6671681B1",
        "US20040002959A1",
        "US20040024769A1",
        "US20040030780A1",
        "US20040034632A1",
        "US20040044661A1",
        "US6704727B1",
        "US20040049505A1",
        "US20040049478A1",
        "US6728704B2",
        "US20040083232A1",
        "US6742023B1",
        "US20040107190A1",
        "US20040117366A1",
        "US20040122816A1",
        "US6760720B1",
        "US20040133564A1",
        "US6765997B1",
        "US6769010B1",
        "US20040145777A1",
        "US6772150B1",
        "US20040162820A1",
        "US20040181310A1",
        "US20040194056A1",
        "US20040193438A1",
        "US20040199496A1",
        "US20040210589A1",
        "US20040210565A1",
        "US20040215531A1",
        "US20040221235A1",
        "US20040225553A1",
        "US20040243527A1",
        "US20040243568A1",
        "US20040244029A1",
        "US20040243604A1",
        "US20040243570A1",
        "US6829334B1",
        "US20040249808A1",
        "US20040255237A1",
        "US20040254919A1",
        "US20040254920A1",
        "US20040260621A1",
        "US6836537B1",
        "US20040267746A1",
        "US20050010860A1",
        "US20050038781A1",
        "US6862710B1",
        "US20050055337A1",
        "US20050055341A1",
        "US20050055321A1",
        "US6873996B2",
        "US20050071324A1",
        "US20050086583A1",
        "US20050097109A1",
        "US20050114322A1",
        "US20050114303A1",
        "US20050125229A1",
        "US20050125234A1",
        "US20050149738A1",
        "US20050177401A1",
        "US20050198068A1",
        "US20050203883A1",
        "US20050209992A1",
        "US20050222931A1",
        "US20050222987A1",
        "US20050222977A1",
        "US20050222976A1",
        "US20050226190A1",
        "US6957213B1",
        "US20050234952A1",
        "US20050234955A1",
        "US20050234972A1",
        "US20050234879A1",
        "US20050234973A1",
        "US20050234880A1",
        "US6963867B2",
        "US20050256853A1",
        "WO2005114508A1",
        "US20050267871A1",
        "US20050283465A1",
        "US20050283468A1",
        "US6983270B2",
        "US20060031219A1",
        "US7007294B1",
        "US20060069717A1",
        "US20060074891A1",
        "US7035864B1",
        "US20060095343A1",
        "US20060106769A1",
        "US20060122976A1",
        "US20060129534A1",
        "US20060129531A1",
        "US20060136345A1",
        "US20060136245A1",
        "US20060136451A1",
        "US20060149577A1",
        "US20060149716A1",
        "US20060155673A1",
        "US7080070B1",
        "US20060161520A1",
        "US20060173830A1",
        "US7089301B1",
        "US7092936B1",
        "US20060190439A1",
        "US20060190319A1",
        "US20060206476A1",
        "US20060218106A1",
        "US20060229932A1",
        "US20060242128A1",
        "US20060253427A1",
        "US20060259479A1",
        "US20060277162A1",
        "US20060288000A1",
        "US20070011154A1",
        "US20070016488A1",
        "US20070016856A1",
        "US20070016585A1",
        "US20070022385A1",
        "US20070033221A1",
        "US20070038614A1",
        "US20070038615A1",
        "US7181688B1",
        "US20070061313A1",
        "US20070083505A1",
        "US20070088683A1",
        "US20070094071A1",
        "US20070106937A1",
        "US20070112741A1",
        "US7231343B1",
        "US20070156669A1",
        "US20070162422A1",
        "US20070168342A1",
        "US7249118B2",
        "US20070192179A1",
        "US20070208738A1",
        "US20070239676A1",
        "US20070250498A1",
        "US7289799B1",
        "US7296016B1",
        "US7296019B1",
        "US20070271255A1",
        "US7305380B1",
        "US20070282811A1",
        "US20070288308A1",
        "US7310629B1",
        "US20070294615A1",
        "US20080010269A1",
        "WO2008011422A2",
        "US7325201B2",
        "US7330816B1",
        "US20080059451A1",
        "EP1898325A1",
        "US20080077471A1",
        "US20080082477A1",
        "US20080133487A1",
        "US20080140643A1",
        "US7392238B1",
        "US7401072B2",
        "US20080172380A1",
        "US7412442B1",
        "US20080201297A1",
        "US20080208824A1",
        "US20080215597A1",
        "US7428528B1",
        "US20080235275A1",
        "US20080243631A1",
        "US20080243632A1",
        "US20080244027A1",
        "US7433868B1",
        "US20080250008A1",
        "US20080256056A1",
        "US20080270403A1",
        "US20080281809A1",
        "US20080281808A1",
        "US20080281817A1",
        "US20080294619A1",
        "US7461058B1",
        "US7461061B2",
        "US20080306938A1",
        "US20080306937A1",
        "US20090006543A1",
        "US20090006326A1",
        "US20090006313A1",
        "US20090006045A1",
        "US20090006284A1",
        "US20090019020A1",
        "US7487145B1",
        "US7493319B1",
        "US7493325B1",
        "US7499940B1",
        "US20090063632A1",
        "US20090063585A1",
        "US20090063631A1",
        "US20090077047A1",
        "US20090094327A1",
        "US20090100049A1",
        "US7523103B2",
        "US20090125482A1",
        "US7536384B2",
        "US7542951B1",
        "US20090144263A1",
        "US7548906B2",
        "US7548915B2",
        "US20090157342A1",
        "US20090164895A1",
        "US20090187540A1",
        "US20090187515A1",
        "US7577665B2",
        "US7581237B1",
        "US7584221B2",
        "US7584159B1",
        "US7599917B2",
        "US20090254540A1",
        "US20090254653A1",
        "US7603360B2",
        "US7617184B2",
        "US20090299991A1",
        "US20090313237A1",
        "US20090313202A1",
        "US7636677B1",
        "US20090327268A1",
        "US7644054B2",
        "US20100010971A1",
        "US20100010977A1",
        "US7650304B1",
        "US7660581B2",
        "US7668850B1",
        "US7676394B2",
        "US20100082356A1",
        "US20100082657A1",
        "US7702318B2",
        "US20100114878A1",
        "US7716198B2",
        "US7716091B2",
        "US7720721B1",
        "US20100125569A1",
        "US7739142B2",
        "US7739295B1",
        "US7739280B2",
        "US7739277B2",
        "US20100153384A1",
        "US20100161659A1",
        "US7752209B2",
        "US7761448B2",
        "US20100185619A1",
        "US7769764B2",
        "US20100198857A1",
        "US20100205150A1",
        "US7779011B2",
        "US7783621B2",
        "US7788123B1",
        "US7788266B2",
        "US7792833B2",
        "US20100250578A1",
        "US7809714B1",
        "US20100262611A1",
        "US7827181B2",
        "US20100280835A1",
        "US20100287034A1",
        "US7840547B1",
        "US7840569B2",
        "US7860871B2",
        "US7890526B1",
        "US7895218B2",
        "US7912458B2",
        "US7930389B2",
        "US20110099164A1",
        "US20110119139A1",
        "US20110151839A1",
        "US7974885B1",
        "US7996396B2",
        "US20110218973A1",
        "US8019748B1",
        "US8019752B2",
        "US20110225155A1",
        "US8027879B2",
        "US20110246487A1",
        "US20110258212A1",
        "US8046259B1",
        "US8051374B1",
        "US8051369B2",
        "US20110270816A1",
        "US8065316B1",
        "US8065404B2",
        "CN102253943A",
        "US8073860B2",
        "US8078884B2",
        "US8082264B2",
        "US8082225B2",
        "US20110320470A1",
        "US8095476B2",
        "US8103545B2",
        "US8122034B2",
        "US20120047134A1",
        "US8131271B2",
        "US8130918B1",
        "US8135704B2",
        "CN102385577A",
        "US20120078935A1",
        "US8156499B2",
        "US8156128B2",
        "US8175585B2",
        "US20120117074A1",
        "US8185813B2",
        "US20120130976A1",
        "US8190989B1",
        "US8195133B2",
        "US8204881B2",
        "US8209344B2",
        "US8212740B1",
        "US8229914B2",
        "US8234249B2",
        "US8238888B2",
        "US20120203751A1",
        "US8245259B2",
        "US8260771B1",
        "US20120226681A1",
        "US8266162B2",
        "US8266242B2",
        "US8290810B2",
        "US8296294B2",
        "US8302030B2",
        "US20120278354A1",
        "US8311888B2",
        "US8316015B2",
        "US20120296927A1",
        "US8321411B2",
        "WO2012162597A1",
        "US8335791B1",
        "US8346792B1",
        "US8346791B1",
        "US8346757B1",
        "US20130013295A1",
        "US8364540B2",
        "US8364521B2",
        "US8370442B2",
        "US8375067B2",
        "US8412698B1",
        "US20130086034A1",
        "US8423541B1",
        "US8429184B2",
        "US8433297B2",
        "US8433713B2",
        "WO2013063029A1",
        "US8438178B2",
        "US8442983B2",
        "US20130159273A1",
        "US8478732B1",
        "US20130173619A1",
        "US8494899B2",
        "US8503995B2",
        "US8515935B1",
        "US8521731B2",
        "US8521725B1",
        "US8527510B2",
        "CN103294670A",
        "US8539024B2",
        "US20130246406A1",
        "US8543584B2",
        "US8549424B2",
        "US8571999B2",
        "US8571930B1",
        "US20130290320A1",
        "US8577915B2",
        "US8578410B2",
        "US20130298162A1",
        "US20130304818A1",
        "US8590013B2",
        "US8594996B2",
        "US8595475B2",
        "US8607138B2",
        "US8612208B2",
        "US8615719B2",
        "US8626785B2",
        "US20140012862A1",
        "US8645372B2",
        "US8645825B1",
        "US8645125B2",
        "US8655862B1",
        "US8660891B2",
        "US8667161B2",
        "US8666376B2",
        "US8676802B2",
        "US8682982B2",
        "US8688671B2",
        "US20140101159A1",
        "US8700604B2",
        "US8719264B2",
        "US8725756B1",
        "US8725739B2",
        "US8732151B2",
        "US8738635B2",
        "US8745012B2",
        "US8756241B1",
        "US8755763B2",
        "US8775396B2",
        "US8781813B2",
        "US8799804B2",
        "US8805339B2",
        "US8812526B2",
        "US8812733B1",
        "US8812493B2",
        "US8819659B2",
        "US8832100B2",
        "US8838633B2",
        "US20140280117A1",
        "US8843481B1",
        "US8843486B2",
        "US8849785B1",
        "US8875038B2",
        "US8892523B2",
        "US8903810B2",
        "US8914383B1",
        "US8918812B2",
        "US8930496B2",
        "US8959093B1",
        "US8972435B2",
        "US8972394B1",
        "US8972391B1",
        "US8984133B2",
        "US8989718B2",
        "US8996550B2",
        "US9002867B1",
        "US9009146B1",
        "US9015147B2",
        "US9031937B2",
        "US20150149482A1",
        "WO2015076662A1",
        "US9058406B2",
        "US20150186446A1",
        "US9078014B2",
        "US9076175B2",
        "US20150205833A1",
        "US9092510B1",
        "US9098569B1",
        "US9116995B2",
        "US9122755B2",
        "US9146966B1",
        "US9158835B2",
        "US9166714B2",
        "US9183323B1",
        "US9201979B2",
        "US9201931B2",
        "US9208213B2",
        "US9224167B2",
        "US9230028B1",
        "US9229924B2",
        "US9235627B1",
        "USRE45858E1",
        "US20160034584A1",
        "US9317605B1",
        "US20160140247A1",
        "US9348912B2",
        "US9355191B1",
        "US9374242B2",
        "US9386421B2",
        "US9384504B2",
        "US9405848B2",
        "US9405753B2",
        "US9418104B1",
        "US9442909B2",
        "US9449047B2",
        "US9471925B2",
        "US9495462B2",
        "US9516370B1",
        "US20160358352A1",
        "US9537706B2",
        "US9594831B2",
        "US9600566B2",
        "US9623119B1",
        "US9633356B2",
        "US9659058B2",
        "US9672289B1",
        "US9679259B1",
        "US9703892B2",
        "US9703779B2",
        "US9710556B2",
        "US9779390B1",
        "US9785715B1",
        "US9836533B1",
        "US9870465B1",
        "US9880983B2",
        "US20180052932A1",
        "US20180053235A1",
        "US9916368B2",
        "US9916349B2",
        "US9977827B2",
        "US9996523B1",
        "CN108280092A",
        "US10032131B2",
        "US10038756B2",
        "US10108968B1",
        "US10108699B2",
        "US10181116B1",
        "US20190095482A1",
        "US10261998B2",
        "US20190138540A1",
        "US20190171637A1",
        "US10324958B2",
        "US10346550B1",
        "US10382819B2",
        "US10387839B2",
        "US10387795B1",
        "US10394761B1",
        "US10409641B1",
        "US20190377728A1",
        "US10515119B2",
        "US10540516B2",
        "US10540607B1",
        "US10592930B2",
        "US10606851B1",
        "US10621281B2",
        "JP2020061083A",
        "US10642886B2",
        "US10769164B2",
        "US10789305B2",
        "US10803482B2",
        "US10911894B2",
        "US10956502B2",
        "US10956409B2",
        "US10984041B2",
        "US20210201932A1",
        "US11113299B2",
        "US11120007B2",
        "US11159469B2",
        "US11169979B2",
        "US11256687B2",
        "US11379473B1",
        "US11392582B2",
        "US11423018B1",
        "US11429879B2",
        "US11442820B2",
        "US20220335050A1",
        "US11494417B2",
        "US11562292B2",
        "US11568008B2",
        "US11625409B2",
        "US11675841B1",
        "US11681713B2",
        "US11741090B1",
        "US11809506B1",
        "US11811889B2"
    ],
    "citedby_ftf": [
        "USRE48056E1",
        "USRE47908E1",
        "US20060195595A1",
        "US6708221B1",
        "IL123129A",
        "US6321226B1",
        "US6523028B1",
        "US6532459B1",
        "US6370527B1",
        "US6359635B1",
        "GB9904662D0",
        "US6598039B1",
        "US6591261B1",
        "AUPQ163899A0",
        "US6519586B2",
        "US7885856B1",
        "AU7346000A",
        "US6775665B1",
        "US7328206B2",
        "US6810395B1",
        "US8271316B2",
        "US6665669B2",
        "US10002167B2",
        "US7797373B1",
        "US7263484B1",
        "GB0008232D0",
        "US7127450B1",
        "US6704728B1",
        "US6711561B1",
        "US6745181B1",
        "US6876997B1",
        "WO2001090921A2",
        "US7020658B1",
        "US6408277B1",
        "US8290768B1",
        "US9699129B1",
        "US7725526B1",
        "US6721749B1",
        "AUPQ921400A0",
        "EP1182581B1",
        "EP1327204A4",
        "US6647383B1",
        "US8010988B2",
        "US8205237B2",
        "US7225231B2",
        "US7197470B1",
        "US7185065B1",
        "NO20005867D0",
        "US7395261B1",
        "US20020116296A1",
        "US7644057B2",
        "US7027987B1",
        "US7231381B2",
        "US8484177B2",
        "US6748398B2",
        "US7136846B2",
        "US6980984B1",
        "US20030083958A1",
        "US9230256B2",
        "DE10134128A1",
        "JP2005502106A",
        "US7028024B1",
        "EP1412874A4",
        "US7284191B2",
        "US7133862B2",
        "US7809710B2",
        "US7752326B2",
        "AUPR796701A0",
        "AUPR796801A0",
        "US7149732B2",
        "US7539665B2",
        "US7013263B1",
        "US20030085927A1",
        "US7283992B2",
        "US20030115191A1",
        "US7206778B2",
        "US7096218B2",
        "JP2003216634A",
        "US6952691B2",
        "US7343372B2",
        "US20030163453A1",
        "JP2003281191A",
        "US20030220917A1",
        "US8275673B1",
        "US20030225761A1",
        "WO2004010331A1",
        "US7657598B2",
        "US20050125240A9",
        "US7072884B2",
        "US6938036B2",
        "US7287025B2",
        "US8055669B1",
        "US7729913B1",
        "US20040215608A1",
        "DE10319427A1",
        "US7194466B2",
        "US20050187913A1",
        "US8495002B2",
        "US20040225555A1",
        "US7403939B1",
        "US7854009B2",
        "US20050010559A1",
        "US20050044076A1",
        "US20050065774A1",
        "US8014997B2",
        "US7587394B2",
        "US7617205B2",
        "US7231375B2",
        "US7844589B2",
        "WO2005057359A2",
        "US20050138007A1",
        "US20070214126A1",
        "US8121997B2",
        "US7725414B2",
        "US7260568B2",
        "US7257577B2",
        "US20050267872A1",
        "US7746376B2",
        "CA2571509A1",
        "US9223868B2",
        "US7698626B2",
        "US7562069B1",
        "KR100806862B1",
        "US7533074B2",
        "US20060074980A1",
        "US7523085B2",
        "GB2420426A",
        "US7349896B2",
        "US20060149625A1",
        "US9092523B2",
        "US20060206517A1",
        "US20060212443A1",
        "EP1866738A4",
        "US7870147B2",
        "WO2006107956A1",
        "US7546289B2",
        "US7774383B2",
        "US7502810B2",
        "US9158855B2",
        "US20070016545A1",
        "US9715542B2",
        "US20070100779A1",
        "US20070033233A1",
        "US7844599B2",
        "US7672932B2",
        "US7747639B2",
        "US7516124B2",
        "US9507850B1",
        "US8688673B2",
        "JP2007102501A",
        "US7676517B2",
        "US8819048B1",
        "US8015222B2",
        "US20070124289A1",
        "US20070143258A1",
        "US7693819B2",
        "US20070185836A1",
        "US20070226189A1",
        "US7487144B2",
        "JP2007328714A",
        "US7814112B2",
        "US8301616B2",
        "US7664744B2",
        "US8589869B2",
        "US20080066135A1",
        "US20080062137A1",
        "US20080065722A1",
        "US8243017B2",
        "US7761805B2",
        "US9565387B2",
        "US7660783B2",
        "US7783636B2",
        "US9519715B2",
        "US20080109752A1",
        "US7630970B2",
        "US20080154874A1",
        "US7720826B2",
        "US20080177588A1",
        "JP4899128B2",
        "CN101276361B",
        "US7698344B2",
        "CN101281522B",
        "CN101286150B",
        "US8074234B2",
        "US8050998B2",
        "US7822774B2",
        "JP5057885B2",
        "US7613694B2",
        "AU2008203843A1",
        "KR100913051B1",
        "US7765204B2",
        "US9195743B2",
        "US8583670B2",
        "US9152699B2",
        "US7415460B1",
        "US8347326B2",
        "US8412571B2",
        "US20090241066A1",
        "US20090248627A1",
        "US8645409B1",
        "US8726146B2",
        "CN101546308B",
        "US20100094835A1",
        "US8463808B2",
        "US8386489B2",
        "US8577924B2",
        "US9158838B2",
        "US9087293B2",
        "US8298087B1",
        "US8041729B2",
        "US8224839B2",
        "US8788524B1",
        "US8601015B1",
        "JP5096411B2",
        "EP2438542A2",
        "US20110040774A1",
        "US8239282B2",
        "US20110191363A1",
        "US20110238686A1",
        "US8352460B2",
        "US8484015B1",
        "US8874727B2",
        "US8812298B1",
        "JP5542017B2",
        "US8918393B2",
        "US9069843B2",
        "WO2012052983A1",
        "ES2642379T3",
        "BR112013011570A2",
        "US9171045B2",
        "US8583669B2",
        "US8965882B1",
        "US9069814B2",
        "US9734252B2",
        "US9851950B2",
        "US8909627B1",
        "US20130173398A1",
        "US9152698B1",
        "US8965875B1",
        "US9141672B1",
        "WO2013126808A1",
        "US9424353B2",
        "US9043248B2",
        "US8959103B1",
        "US9405424B2",
        "US10216791B2",
        "US8676777B1",
        "US9384279B2",
        "CN103942204B",
        "JP6064629B2",
        "US9292537B1",
        "US10262063B2",
        "US9864781B1",
        "US9405855B2",
        "US20160092569A1",
        "US10025764B2",
        "US20160314510A1",
        "US20170140050A1",
        "US11188831B2",
        "US10909604B1",
        "US10970321B1"
    ]
}