{
    "patent_id": "US-11374021-B2",
    "title": "Manufacturing method of a nonvolatile semiconductor memory device ",
    "assignee": "Kioxia Corporation",
    "publication_date": "2022-06-28",
    "patent_link": "https://patents.google.com/patent/US11374021B2/en",
    "inventors": [
        "Masaru Kito",
        "Hideaki Aochi",
        "Ryota Katsumata",
        "Akihiro Nitayama",
        "Masaru Kidoh",
        "Hiroyasu Tanaka",
        "Yoshiaki Fukuzumi",
        "Yasuyuki Matsuoka",
        "Mitsuru Sato"
    ],
    "classifications": [
        "H10B43/40",
        "H01L27/11582",
        "H01L21/8221",
        "H01L27/0688",
        "H01L27/105",
        "H01L27/115",
        "H01L27/11556",
        "H01L27/11573",
        "H01L27/11578",
        "H10B41/27",
        "H10B43/20",
        "H10B43/27",
        "H10B69/00",
        "G11C16/0483"
    ],
    "abstract": "A nonvolatile semiconductor memory device that have a new structure are provided, in which memory cells are laminated in a three dimensional state so that the chip area may be reduced. The nonvolatile semiconductor memory device of the present invention is a nonvolatile semiconductor memory device that has a plurality of the memory strings, in which a plurality of electrically programmable memory cells is connected in series. The memory strings comprise a pillar shaped semiconductor; a first insulation film formed around the pillar shaped semiconductor; a charge storage layer formed around the first insulation film; the second insulation film formed around the charge storage layer; and first or nth electrodes formed around the second insulation film (n is natural number more than 1). The first or nth electrodes of the memory strings and the other first or nth electrodes of the memory strings are respectively the first or nth conductor layers that are spread in a two dimensional state.",
    "claims": "\n1. A manufacturing method of a nonvolatile semiconductor memory device comprising:\nforming first films and second films alternately in a first direction perpendicular to a surface of a semiconductor substrate, a material of the first films being different from a material of the second films;\nforming holes in the first films and the second films, the holes extending in the first direction, the holes including a first hole, a second hole and a third hole, the first hole and the second hole being arranged in a second direction perpendicular to the first direction, the first hole and the third hole being arranged in a third direction perpendicular to the first direction and the second direction;\nforming a semiconductor portion in one of the holes, an upper surface of the semiconductor portion being above an upper surface of a lowermost film of the first films;\nforming a first insulating film in the holes after forming the semiconductor portion; and\nforming a semiconductor film in the holes after forming the first insulating film.\n2. The manufacturing method according to claim 1, further comprising:\netching a lower end of the first insulating film.\n3. The manufacturing method according to claim 1, further comprising:\nforming a stepwise-shaped structure at an end portion of the first films in the third direction.\n4. The manufacturing method according to claim 1, further comprising:\nforming a stepwise-shaped structure at an end portion of the first films in the third direction before forming the holes.\n5. The manufacturing method according to claim 1, further comprising:\ndividing the first films and second films into a first unit and a second unit in the second direction, the first hole, the second hole and the third hole being in the first unit.\n6. The manufacturing method according to claim 5, wherein dividing the first films and second films is after forming the semiconductor film.\n7. The manufacturing method according to claim 1, further comprising:\ndividing an uppermost film of the first films into a first upper film and a second upper film in the second direction.\n8. The manufacturing method according to claim 7, wherein the first hole and the third hole are in the first upper film, and the second hole is in the second upper film.\n9. The manufacturing method according to claim 1, wherein the first insulating film includes a block insulating film, a charge trap film and a tunnel insulating film.\n10. The manufacturing method according to claim 9, wherein the charge trap film is silicon nitride.\n11. The manufacturing method according to claim 1, wherein the second films are silicon oxide.\n12. The manufacturing method according to claim 1, further comprising:\nforming a first trench extending in the third direction, the first films including an upper film and a lower film, the first trench dividing the upper film into a first upper film and a second upper film in the second direction, a lower end of the first trench being above the lower film.\n13. The manufacturing method according to claim 12, wherein the first hole and the third hole are in the first upper film, and the second hole is in the second upper film.\n14. The manufacturing method according to claim 13, further comprising:\nforming a second trench extending in the third direction, the second trench dividing the first films and the second films into a first unit and a second unit in the second direction, a lower end of the second trench being below the lower film, wherein the first hole, the second hole and the third hole are in the first unit.\n15. The manufacturing method according to claim 14, wherein forming the second trench is after forming the semiconductor film.\n16. The manufacturing method according to claim 11, further comprising:\nforming a first trench extending in the third direction, the first trench dividing the first films and the second films into a first unit and a second unit in the second direction, wherein the first hole, the second hole and the third hole are in the first unit.\n17. The manufacturing method according to claim 16, wherein dividing the first films and second films is after forming the semiconductor film.\n18. The manufacturing method according to claim 1, further comprising:\nforming a gate insulating film between the lowermost film and the semiconductor portion, the gate insulating film having a different structure from the first insulating film.\n19. The manufacturing method according to claim 1, further comprising:\nforming a gate insulating film between the lowermost film and the semiconductor portion, wherein the gate insulating film does not have a charge trap film."
}