{
    "patent_id": "US-2022230192-A1",
    "title": "Systems and Methods for Generating a Relationship Among a Plurality of Datasets to Generate a Desired Attribute Value ",
    "assignee": "James R. Jackson",
    "publication_date": "2022-07-21",
    "patent_link": "https://patents.google.com/patent/US20220230192A1/en",
    "inventors": [
        "James R. Jackson"
    ],
    "classifications": [
        "G06F16/288",
        "G06N20/10",
        "G06N20/20",
        "G06N3/126",
        "G06N5/01",
        "G06N5/041",
        "G06N5/048",
        "G06N7/01",
        "G06Q10/06315",
        "G06Q30/0201",
        "G06N3/084"
    ],
    "abstract": "A system or method for identifying a plurality of entities in a first dataset that satisfy a predetermined target attribute by deploying on the first dataset a relationship model generated from a second dataset having a plurality of entities not in the first dataset.",
    "claims": "\n1. A system configured to identify one or more potential users from information collected about a plurality of entities comprising:\none or more servers having associated processors and memory;\nan information collection module configured to collect entity information and to generate a first dataset of entity information;\nan interface configured to receive information about a provider's existing and former users, and configured to allow the provider to specify one or more desired characteristics of a potential user;\na processing module, configured to create a user dataset from the user information, which dataset is compatible with the first dataset;\na relationship module configured to generate one or more relationships for the user dataset that associates with each user one more values representative of the one or more desired characteristics; and\nan application module configured to deploy the one or more relationships on the first dataset to generate for each entity one more values representative of one or more the desired characteristic.\n2. The system of claim 1, wherein the relationship module comprises hardware logic and hardware executable code configured to implement a learning algorithm on the user dataset and to generate a model function for the user dataset configured to predict the one more desired characteristic for each user.\n3. The system of claim 2, wherein the first dataset comprises entity information collected from a plurality of computing devices.\n4. The system of claim 3, wherein the first dataset comprises location data for one or more entities.\n5. The system of claim 2, wherein the user dataset comprises data for each user related to the desired characteristic.\n6. The system of claim 4, wherein the user dataset is split into a training dataset, a validation dataset, and testing dataset for the learning algorithm.\n7. The system of claim 2, wherein the first dataset is modified to remove all data for entities that are also users before the one or more relationship is deployed on the first dataset.\n8. The system of claim 6, wherein the user dataset is augmented with data for entities in the first dataset that correspond to users in the user dataset before the user dataset is split.\n9. The system of claim 1, wherein the desired characteristic comprises duration.\n10. The system of claim 8, wherein the desired characteristic comprises duration.\n11. A method for identifying potential users from a first dataset containing entity information, comprising:\ncreating a first dataset of entity information;\nreceiving information concerning existing and/or former users of a provider;\ncreating a second dataset of the existing and/or former users of the provider from at least information received from the provider;\ngenerating a relationship for the second dataset configured to establish a value for each user in the second dataset concerning a preselected attribute;\napplying the relationship to at least a first portion of the first dataset to establish a value for each entity in the at least first portion concerning the preselected attribute; and\nidentifying potential users in the first dataset based on the attribute value.\n12. The method of claim 11, wherein generating the relationship comprises configuring hardware logic and hardware executable code to implement a learning algorithm on the second dataset and to generate a model function for the second dataset to predict the one more desired characteristic for each user.\n13. The method of claim 12, further comprising collecting entity information collected from a plurality of computing devices to create first dataset.\n14. The method of claim 13, wherein the first dataset comprises location data for one or more entities.\n15. The method of claim 12, wherein the user dataset comprises data for each user related to the desired characteristic.\n16. The method of claim 14, wherein the user dataset is split into a training dataset, a validation dataset, and testing dataset for the learning algorithm.\n17. The method of claim 12, further comprising modifying the first dataset to remove all data for entities that are also users before the one or more relationship is deployed on the first dataset.\n18. The method of claim 16, further comprising augmenting the user dataset with data for entities in the first dataset that correspond to users in the user dataset before the user dataset is split.\n19. The method of claim 11, wherein the desired characteristic comprises duration.\n20. A system configured to identify one or more users from information collected about a plurality of user of a provider, comprising:\none or more servers having associated processors and memory;\nan information collection module configured to collect entity information and to generate a first dataset of entity information;\nan interface configured to receive information about a provider's existing and former users, and configured to allow the provider to specify one or more desired characteristics of its users;\na processing module, configured to create a user dataset from the user information, which dataset is compatible with the first dataset;\na relationship module configured to generate one or more relationships for the first dataset that associates with each entity one more values representative of the one or more desired characteristics; and\nan application module configured to deploy the one or more relationships on the user dataset to generate for each user one more values representative of one or more the desired characteristic.",
    "status": "Pending",
    "citations_own": [
        "US9336433B1",
        "US20180316571A1",
        "US20190095478A1",
        "US11341513B2"
    ],
    "citations_ftf": [
        "US20060294095A1",
        "US8560471B2",
        "US8386574B2",
        "US20120166348A1",
        "US9036796B2",
        "US10169720B2",
        "US9960637B2",
        "EP3261292A1"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "WO2019040436A1",
        "WO2019165000A1",
        "EP3634018A1",
        "WO2020121084A1",
        "US11593510B1",
        "US11334680B1",
        "WO2020227434A1",
        "US11163807B2",
        "US11468129B2",
        "US11704566B2",
        "CN113076451B",
        "US11736899B2",
        "US11567965B2",
        "CN111259090B",
        "US20210256538A1",
        "CN111352966A",
        "JP2021140665A",
        "CN112418444B",
        "CN112200391B",
        "US11451842B2",
        "CN112667402B",
        "US11775969B2",
        "US20220318862A1",
        "US11587092B2",
        "US11797516B2",
        "US11789651B2",
        "CN113361263B",
        "CN115051863B",
        "CN115496129A"
    ]
}