{
    "patent_id": "US-11165806-B2",
    "title": "Anomaly detection using cognitive computing ",
    "assignee": "International Business Machines Corporation",
    "publication_date": "2021-11-02",
    "patent_link": "https://patents.google.com/patent/US11165806B2/en",
    "inventors": [
        "Sharon Hagi",
        "Gary I. Givental"
    ],
    "classifications": [
        "H04L63/1425",
        "G06F21/566",
        "G06N20/00",
        "H04L63/1416",
        "G06N20/10",
        "G06N20/20",
        "G06N3/042",
        "G06N3/044",
        "G06N3/045",
        "G06N3/049",
        "G06N3/088",
        "G06N3/126",
        "G06N5/01",
        "G06N5/022",
        "G06N5/025",
        "G06N5/041",
        "G06N5/048",
        "G06N7/01"
    ],
    "abstract": "An anomaly detection system configured to generate a plurality of tensors based on spatial attributes of a set of cybersecurity data and temporal attributes of the set of cybersecurity data. The set of cybersecurity data comprising numeric data and textual data collected from a plurality of computational sources. The anomaly detection system can provide the plurality of tensors to a Hierarchical Temporal Memory (HTM) network. The HTM network can be configured to generate respective HTM outputs for respective regions of the HTM network. The anomaly detection system can determine that at least one HTM output indicates an anomaly, convert the at least one HTM output to a notification, and provide the notification to a user interface.",
    "claims": "\n1. A computer-implemented method comprising:\ngenerating a plurality of tensors based on spatial attributes and temporal attributes of a set of cybersecurity data, wherein the set of cybersecurity data comprises numeric data and textual data, and wherein the set of cybersecurity data is collected from a plurality of computational sources;\nproviding the plurality of tensors to a Hierarchical Temporal Memory (HTM) network;\ndetermining that at least one HTM output indicates an anomaly;\nconverting the at least one HTM output to a notification; and\nproviding the notification to a user interface.\n2. The method according to claim 1, wherein the set of cybersecurity data comprises syslog data, firewall event log data, operating system log data, application log data, and device log data.\n3. The method according to claim 1, wherein the plurality of computational sources comprise a Security Information and Event Management (STEM) system, a Simple Network Management Protocol (SNMP) trap, and an Intrusion Detection and Prevention System (IDPS).\n4. The method according to claim 1, wherein generating a plurality of tensors further comprises:\nclassifying the set of cybersecurity data into a numeric data subset and a textual data subset;\ngenerating at least a first Vector Space Model (VSM) based on the numeric data subset;\ngenerating at least a second VSM based on the textual data subset;\nstoring textual associations between the first VSM and the textual data subset, wherein textual associations indicate a textual value for a respective value of a respective component of the first VSM; and\nstoring numeric associations between the second VSM and the numeric data subset, wherein numeric associations indicate a property attribute for a respective component of the second VSM.\n5. The method according to claim 4, wherein generating a plurality of tensors further comprises:\ngenerating respective tensors based on respective VSMs; and\ngenerating at least one sparse distributed representation (SDR) based on at least one tensor.\n6. The method according to claim 5, wherein providing the plurality of tensors to a Hierarchical Temporal Memory (HTM) network further comprises:\ninputting at least one SDR to a first region of a first layer of the HTM network;\ninputting an output of the first region of the first layer of the HTM network to a second region of a second layer of the HTM network, wherein the second layer comprises fewer nodes than the first layer; and\ngenerating a HTM output based on a set of active nodes of at least the second region of the second layer of the HTM network.\n7. The method according to claim 6, wherein the notification comprises textual output and numeric output, wherein converting the HTM output to a notification further comprises:\ngenerating textual output based, at least in part, on the HTM output and the textual associations; and\ngenerating numeric output based, at least in part, on the HTM output and the numeric associations.\n8. The method according to claim 1, the method further comprising:\nperforming natural language processing on a query received from a user interface;\nidentifying a relevant portion of the HTM network based on the query;\nperforming natural language processing on a second output from the relevant portion of the HTM network to generate an answer to the query; and\npresenting the answer to the user interface.\n9. The method according to claim 8, wherein the answer comprises textual data, numeric data, and a confidence value.\n10. A computer system comprising:\na processor;\na tangible, computer-readable memory for storing program instructions which, when executed by the processor, perform a method comprising:\ngenerating a plurality of tensors based on spatial attributes and temporal attributes of a set of cybersecurity data, wherein the set of cybersecurity data comprises numeric data and textual data, and wherein the set of cybersecurity data is collected from a plurality of computational sources;\nproviding the plurality of tensors to a Hierarchical Temporal Memory (HTM) network;\ndetermining that at least one HTM output indicates an anomaly;\nconverting the at least one HTM output to a notification; and\nproviding the notification to a user interface.\n11. The system according to claim 10, wherein the set of cybersecurity data comprises log data, and wherein the plurality of computational sources comprises a Security Information and Event Management (SIEM) system.\n12. The system according to claim 11, wherein generating a plurality of tensors further comprises:\nclassifying the set of cybersecurity data into a numeric data subset and a textual data subset;\ngenerating at least a first Vector Space Model (VSM) based on the numeric data subset;\ngenerating at least a second VSM based on the textual data subset;\nstoring textual associations between the first VSM and the textual data subset, wherein textual associations indicate a textual value for a respective value of a respective component of the first VSM;\nstoring numeric associations between the second VSM and the numeric data subset, wherein numeric associations indicate a property attribute for a respective component of the second VSM;\ngenerating respective tensors based on respective VSMs; and\ngenerating at least one sparse distributed representation (SDR) based on at least one tensor.\n13. The system according to claim 12, wherein providing the plurality of tensors to a Hierarchical Temporal Memory (HTM) network further comprises:\ninputting at least one SDR to a first region of a first layer of the HTM network;\ninputting an output of the first region of the first layer of the HTM network to a second region of a second layer of the HTM network, wherein the second layer comprises fewer nodes than the first layer; and\ngenerating a HTM output based on a set of active nodes of at least one region of the HTM network.\n14. The system according to claim 13, wherein the notification comprises textual output and numeric output, wherein converting the HTM output to a notification further comprises:\ngenerating textual output based, at least in part, on the HTM output and the textual associations; and\ngenerating numeric output based, at least in part, on the HTM output and the numeric associations.\n15. The system according to claim 11, the method further comprising:\nperforming natural language processing on a query received from a user interface;\nidentifying a relevant portion of the HTM network based on the query;\nperforming natural language processing on a second output from the relevant portion of the HTM network to generate an answer to the query; and\npresenting the answer to the user interface.\n16. A computer program product comprising a computer readable storage medium having program instructions embodied therewith, wherein the computer readable storage medium is not a transitory signal per se, the program instructions executable by a processor to cause the processor to perform a method comprising:\ngenerating a plurality of tensors based on spatial attributes and temporal attributes of a set of cybersecurity data, wherein the set of cybersecurity data comprises numeric data and textual data, and wherein the set of cybersecurity data is collected from a plurality of computational sources;\nproviding the plurality of tensors to a Hierarchical Temporal Memory (HTM) network;\ndetermining that at least one HTM output indicates an anomaly;\nconverting the HTM output to a notification; and\nproviding the notification to a user interface.\n17. The computer program product according to claim 16, wherein generating a plurality of tensors further comprises:\nclassifying the set of cybersecurity data into a numeric data subset and a textual data subset;\ngenerating at least a first Vector Space Model (VSM) based on the numeric data subset;\ngenerating at least a second VSM based on the textual data subset;\nstoring textual associations between the first VSM and the textual data subset, wherein textual associations indicate a textual value for a respective value of a respective component of the first VSM;\nstoring numeric associations between the second VSM and the numeric data subset, wherein numeric associations indicate a property attribute for a respective component of the second VSM;\ngenerating respective tensors based on respective VSMs; and\ngenerating at least one sparse distributed representation (SDR) based on at least one tensor.\n18. The computer program product according to claim 17, wherein providing the plurality of tensors to a Hierarchical Temporal Memory (HTM) network further comprises:\ninputting at least one SDR to a first region of a first layer of the HTM network;\ninputting an output of the first region of the first layer of the HTM network to a second region of a second layer of the HTM network, wherein the second layer comprises fewer nodes than the first layer; and\ngenerating an HTM output based on a set of active nodes of at least one region of the HTM network; and\nwherein the notification comprises textual output and numeric output, wherein converting the HTM output to a notification further comprises:\ngenerating textual output based, at least in part, on the HTM output and the textual associations; and\ngenerating numeric output based, at least in part, on the HTM output and the numeric associations.\n19. The computer program product according to claim 16, the method further comprising:\nperforming natural language processing on a query received from a user interface;\nidentifying a relevant portion of the HTM network based on the query;\nperforming natural language processing on a second output from the relevant portion of the HTM network to generate an answer to the query; and\npresenting the answer to the user interface.\n20. The computer program product according to claim 16, wherein the program instructions stored in the computer readable storage medium were downloaded over a network from a remote processing system.\n21. A system comprising:\na security information and event management (SIEM) system receiving security data and storing the security data for a plurality of devices in an information technology (IT) environment;\na hierarchical temporal memory (HTM) system comprising a HTM processor and a HTM memory;\na feature extraction system comprising a memory and a processor, wherein the memory stores instructions which, when executed by the processor, cause the processor to perform a method comprising:\nconverting the security data to a plurality of spatial-temporal multi-dimensional arrays, wherein associations between aspects of the plurality of spatial-temporal multi-dimensional arrays and the security data are stored in a database of associations;\nreceiving at least one output multi-dimensional array from the HTM system in response to inputting the plurality of spatial-temporal multi-dimensional arrays to the HTM system;\nreceiving a query from a user interface communicatively coupled to the feature extraction system;\ngenerating an answer based on the query, the at least one output multi-dimensional array, and the database of associations; and\npresenting the answer to the user interface.\n22. The system according to claim 21, wherein the HTM memory stores instructions, which, when executed by the HTM processor, cause the HTM processor to perform a method comprising:\ninputting at least one sparse distributed representation (SDR) into at least a first region of a first layer of a HTM network, wherein the at least one SDR is based, at least in part, on at least one of the plurality of spatial-temporal multi-dimensional arrays; and\nproviding at least one output multi-dimensional array to the feature extraction system, wherein the at least one output multi-dimensional array is based on active nodes in at least one region of at least one layer of the HTM network.\n23. The system according to claim 21, wherein the plurality of spatial-temporal multi-dimensional arrays are based on a plurality of vector space models (VSMs), wherein the plurality of VSMs are generated based on the security data, wherein at least a first VSM of the plurality of VSMs is based on textual data of the security data, and wherein at least a second VSM of the plurality of VSMs is based on numeric data of the security data.\n24. The system according to claim 21, wherein the HTM processor comprises a three-dimensional integrated circuit (3DIC).\n25. A computer-implemented method comprising:\nconverting, in a feature extraction system, security data to a plurality of spatial-temporal multi-dimensional arrays, wherein the security data is collected from, at least in part, a security information and event management (SIEM) system functioning in a cybersecurity environment communicatively coupling a plurality of computational devices;\nproviding the plurality of spatial-temporal multi-dimensional arrays to a three-dimensional integrated circuit (3DIC) executing a Hierarchical Temporal Memory (HTM) network;\nreceiving, at the feature extraction system and from the HTM network, at least one output multi-dimensional array;\nidentifying, using the feature extraction system, at least one anomaly based on the at least one output multi-dimensional array; and\nreconfiguring, by the feature extraction system, at least one aspect of the cybersecurity environment in response to identifying the at least one anomaly."
}