{
    "patent_link": "https://patents.google.com/patent/US5671363A/en",
    "patent_id": "US5671363A",
    "title": "Private stock option account control and exercise system",
    "abstract": "A data processing system for the management of stock option accounts for a plurality of participants. The system invokes one of several distinct option Plans that govern the transaction choices available to the participants. The governing option plans are defined by the sponsoring company in terms of grant, vest and expiration date for the option contracts. The system implements the designated Plans for multiple client companies providing several distinct modes for option exercise by the participant.",
    "inventors": [
        "John M. Cristofich",
        "Susan E. Warner"
    ],
    "assignee": "Bank of America Corp",
    "classifications": [
        "G06Q40/02",
        "G06Q40/04"
    ],
    "claims": "\n1. A system for the management of a plurality of distinct accounts corresponding to the provision of privately issued option contract rights to a group of individuals in accordance with pre-established plan criteria, comprising:\naddressable data storage means for nonvolatile storage of data in accounts segregated according to participant and client entries wherein participant data records include demographic and employment related information and specified accounts of granted, vested, and exercised options, of option holdings information for each of said accounts, of plan criteria, and of an axiomatic rule system at least in part defining said plan criteria and the exercise of said options;\nclient/participant communication means for accessing system management for entry of transaction requests and confirmation of stored information;\nsystem management processor means for accessing said storage means and receiving said client/participant transaction requests and processing automatic security transactions in accordance therewith; and\nbrokerage account means for accessing market price data on select securities and implementing said system-requested security transactions in accordance with said option holdings information and said axiomatic rule system.\n2. The system of claim 1 wherein said accounts are separately categorized by participant and sponsoring client company.\n3. The system of claim 1 wherein said processor means includes means for recording a participant selected target price for option exercise and means for tracking current market price for said option on an established exchange.\n4. The system of claim 3 wherein a transaction is automatically executed upon satisfaction of specified transaction criteria including minimum market price for a security underlying said option.\n5. The system of claim 4 wherein said transaction is either on a cash or cashless basis.\n6. A data processing method for the management of a plurality of separate accounts corresponding to individual option grants pursuant to a company-sponsored privately issued stock option benefit plan, comprising the steps of:\naccessing a stored database of participants, client companies, and option account plans wherein said client companies sponsor said plans and said plans delineate the accrued options for each participant account in accordance with an axiomatic rule system in said stored database, which axiomatic rule system at least in part defines said plan and the exercise of said option grants;\ncommunicating with said participants and clients and at least one established market for exercising accrued options that have vested and for transacting securities in accordance with said plan;\nupdating said database pursuant to both time- and event-driven information including confirmation of changes in the number, value, or expiration date of new, vested, and exercised options;\nexercising options in accordance with said axiomatic rule system and stored database information and pursuant to participant requests by either a cash, stock, or cashless exercise method wherein said exercise step includes confirmation that price variable MAR-- P(D) is greater than a participant target price TP(I) and that the price excess over the total transactions for a given account is sufficient to pay the fees for said total of the transactions.\n7. The method of claim 6 wherein said system automatically withholds portion of said exercise for tax purposes in accordance with pre-established tax withholding rates stored in said database.\n8. The method of claim 6 wherein said exercising step includes the accumulation of individual execution orders by security type for cumulative execution on an established exchange.\n9. The method of claim 8 wherein said accessing step is initiated on a time driven basis for incremental processing of plan, client and participant data files pursuant to recently entered data.\n10. The method of claim 9 wherein said updating step includes the time driven vesting of select options for participants.\n11. A data processing system for the management of plural accounts corresponding to the accrual of privately issued option rights in client securities in accordance with an option account governing plan comprising:\ndatabase means for storing plural account files corresponding to individual participants for option rights wherein said account files include biographic data on each of said participants, option right data for each of said participants, and an axiomatic rule system at least in part defining said plan and the exercise of said option rights;\ndata processing means for updating said account files pursuant to time driven events and participant input;\noption transaction processor means for receiving option exercise transaction requests from each of said participants and implementing a security transaction effecting said option rights in accordance with said plan and said axiomatic rule system and providing an output indicative of the status of said requested transaction; and\ntransaction report means for acknowledging said participant's transaction pursuant to said option transaction processor output on an event or time driven basis.\n12. The system of claim 11 wherein said database means includes communication means for direct access by participants and plan sponsors for confirming account file information.\n13. The system of claim 12 wherein said option transaction processor means includes means for confirming that a requested transaction will provide a return commensurate with a predetermined option price.\n14. The system of claim 13 wherein said option transaction processor means includes means for compiling multiple transaction requests into a single security transaction order on for implementation on an exchange.\n15. The system of claim 14 wherein said option transaction processor means provides at least two forms of option exercise mechanisms including a cash exercise and a cashless exercise.\n16. The system of claim 15 wherein said data processing means includes clock means to control and implement time driven modifications to said accounts in said database.\n17. A system for controlling the account and execution of options privately issued in accordance with a predefined plan and tradable or exercisable on a publicly accessible exchange, comprising:\nat least one database storing addressable and updatable data mappable onto a plurality of individual accounts and comprising information indicative of the identity of each of said accounts, option holdings information for each of said accounts, and an axiomatic rule system at least in part defining said plan and the exercise of said options,\nsaid option holdings information including the number of privately issued options each for vested and nonvested options, the vesting date for each nonvested option, the expiration date of each option, the exercise price for each option issued in accordance with said plan, and any cash holding in such account;\na first communication system for accessing market information including price information and date information from said exchange relating to said options, and for updating said option holdings information therewith;\na second communication system for receiving and storing individual-requested transaction information for an option in an account associated with said individual; and\na brokerage system for executing said individual-requested transaction in accordance with said axiomatic rule system, said option holdings information, and said market information.\n18. The system of claim 17, wherein said second communication system includes a direct telephone link and a menuing system controllable by individual-activated touch tones transmitted via said telephone link.\n19. The system of claim 18, wherein said first communications system operates and updates said option holdings information on a periodic basis.\n20. The system of claim 19, wherein said period basis is daily.\n21. The system of claim 17, wherein said axiomatic rules operate to remove, from said option holdings information, information relating to expired options.\n22. The system of claim 17, further comprising processing means for changing said option holdings information as a function of said market date information to indicate the vesting of an option.\n23. The system of claim 17, further comprising processing means for changing said option holdings information as a function of said market date information to indicate expiration of a vested option.\n24. The system of claim 17, wherein said brokerage system sums the transactions requested by participants for execution and bundles such transactions effective to execute a single transaction for such options.\n25. The system of claim 24, wherein said brokerage system executes at least two types of transactions selected from cash, stock, and cashless transactions.\n26. The system of claim 25, wherein said brokerage system sums the total of said at least two types of transactions and bundles for all participants requesting that options be exercised pursuant to one of said at least two types of transactions all of the transactions for all participants so requesting, and executing said bundle of option exercises as a single transaction pursuant to said requested transaction type.\n27. A data processing method for the management of a plurality of separate accounts corresponding to individual option grants pursuant to a company-sponsored, privately issued option benefit plan, said options for the purchase of securities, comprising the steps of:\nproviding an accessible database including data indicative of participants' identities, client companies, and option account plus, wherein said client companies sponsor said plans and said plan data delineates the accrued options for each participant account in accordance with an axiomatic rule system in said stored database, which axiomatic rule system at least in part defines said plan and the exercise of said option grants;\ncommunicating with and receiving communications from said participants, said clients, and at least one established market for exercising accrued options that have vested;\nupdating said database pursuant to both time- and event-driven information including confirmation of changes in the number, value, or expiration date of new, vested, and exercised options; and\nexercising options pursuant to participant requests and in accordance with said axiomatic rule system wherein said exercise step includes confirmation that the exercise price of each of said options requested to be exercised is not less than the price of said security associated therewith.\n28. The method of claim 27, wherein said option is exercised pursuant to a cash, stock, or cashless exercise method.\n29. The method of claim 27, wherein said confirmation includes verifying that a price for said security is greater than a participant target price associated with said option.\n30. The method of claim 29, wherein said exercise of options is performed only when the difference in price between said security and said target price is not less than a predetermined value.\n31. The method of claim 30, wherein the sum of each of said predetermined values for the price difference for each option exercised during a particularly transaction is not less than a predetermined value.\n32. The method of claim 31, wherein said predetermined value is equivalent to the sum of the transaction fees for all of the options exercised during a particular transaction.\n33. The method of claim 27, further comprising determining the present time.\n34. The method of claim 33, further comprising performing said method on a period basis as a function of the said present time.\n35. The method of claim 34, wherein said periodic basis is daily.\n36. A method for controlling the account and execution of options issued privately in accordance with a predefined plan and tradable or exercisable on a publicly accessible exchange, comprising:\nproviding at least one database storing addressable and updatable data mappable onto a plurality of individual accounts and comprising information indicative of the identity of each of said accounts, option holdings information for each of said accounts, and an axiomatic rule system at least in part defining said plan and the exercise of said options,\nsaid option holdings information including the number of privately issued options each for vested and nonvested options, the vesting date for each nonvested option, the expiration date of each option, the exercise price for each option issued in accordance with said plan, and any cash holding in such account;\naccessing market information including price information and date information from said exchange relating to said options;\nupdating said option holdings information based on said accessed market information;\nreceiving and storing individual-requested transaction information for an option in an account associated with said individual; and\nbrokering said individual-requested transaction in accordance with said axiomatic rule system, said option holdings information, and said market information.\n37. The method of claim 36, wherein said individual-requested transaction information includes receiving such information via a direct telephone link.\n38. The method of claim 37, further comprising providing said individual with access to a menuing system controllable said individual via individually-controlled much tones transmitted via said telephone link.\n39. The method of claim 36, wherein updating of said option holdings information is performed on a periodic basis.\n40. The method of claim 39, wherein said period basis is daily.\n41. The method of claim 36, further comprising defining said plan at least in part by a set of axiomatic rules operating to remove, from said option holdings information, information relating to expired options.\n42. The method of claim 41, further comprising modifying said set of axiomatic rules.\n43. The method of claim 36, further comprising changing said option holdings information as a function of said market date information indicative of the vesting of an option.\n44. The method of claim 36, further comprising changing said option holdings information as a function of said market date information indicative of the expiring of an option.\n45. The method of claim 36, further comprising receiving from said brokering the proceeds of said transaction and transferring same into said individual's account.\n46. The method of claim 45, further comprising withholding from said proceeds transferred into said individual's account an amount in accordance and as a function of said plan.\n47. The method of claim 36, further comprising calculating from said date information and said option holdings information whether any options in an individuals account vest on said date, and updating said options holding information when any such option vests.\n48. The method of claim 36, further comprising summing for more than one of said accounts the total options requested by each of said individuals to be exercised, and brokering said summed options in a single transaction.\n49. The method of claim 48, wherein said summing occurs over all of the participants in said plan.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4346442A",
        "US4674044A",
        "US4823265A",
        "US4953085A",
        "US5126936A",
        "US5132899A",
        "US5210687A",
        "US5227967A",
        "US5233514A",
        "US5262942A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5978779A",
        "US6012047A",
        "US6026381A",
        "US6026438A",
        "US6161098A",
        "WO2001001308A2",
        "US6173270B1",
        "EP1100036A1",
        "US6317728B1",
        "US20010056391A1",
        "US6338047B1",
        "US20020004759A1",
        "US20020013755A1",
        "US20020029177A1",
        "US20020032636A1",
        "US6360210B1",
        "US6363360B1",
        "US20020042771A1",
        "US6374231B1",
        "US20020046152A1",
        "US20020087373A1",
        "US20020091637A1",
        "US20020152153A1",
        "US6473807B1",
        "US20020194099A1",
        "US20030002084A1",
        "US6513019B2",
        "US6513020B1",
        "US20030023536A1",
        "US20030040995A1",
        "KR100375745B1",
        "US20030083902A1",
        "US20030105698A1",
        "US20030110122A1",
        "US20030110111A1",
        "US6601044B1",
        "US20030144944A1",
        "US20030229561A1",
        "US20040024671A1",
        "US20040024679A1",
        "US20040138979A1",
        "US20040148241A1",
        "US20040153390A1",
        "US6801199B1",
        "US20040254871A1",
        "US6892184B1",
        "US20050108149A1",
        "US20050165669A1",
        "US20050192875A1",
        "US20060015445A1",
        "US20060015364A1",
        "US6990467B1",
        "US20060047597A1",
        "US20060161682A1",
        "US20060210080A1",
        "US20070038523A1",
        "US20070038535A1",
        "US20070078745A1",
        "US7212996B1",
        "US7212993B1",
        "US20070136181A1",
        "US7313539B1",
        "US20080005013A1",
        "US20080033890A1",
        "US20080288418A1",
        "US7467109B1",
        "US7480631B1",
        "US7509279B2",
        "US7509286B1",
        "US20090112634A1",
        "US7536350B1",
        "US7542921B1",
        "US20090150282A1",
        "US7584134B2",
        "US7584133B2",
        "US7624068B1",
        "US7668772B1",
        "US7668771B1",
        "US20100063941A1",
        "US7680734B1",
        "US7693766B2",
        "US7707192B1",
        "US20100121758A1",
        "US7756896B1",
        "US7783543B2",
        "US7783542B2",
        "US7783544B2",
        "US7805343B1",
        "US20100332418A1",
        "US7890343B1",
        "US7895098B2",
        "US7962396B1",
        "US7962375B2",
        "US7974895B1",
        "US7996292B2",
        "US8032456B1",
        "US20110313908A1",
        "US8150766B1",
        "US8260705B1",
        "US8266042B2",
        "US8301550B2",
        "US8311939B1",
        "US8352342B1",
        "US8370236B1",
        "US8380621B1",
        "US8429006B1",
        "US8452702B1",
        "US8458089B1",
        "US8478637B1",
        "US8566456B2",
        "US8566128B2",
        "US8583545B1",
        "US8620771B2",
        "US8650114B2",
        "US8655689B1",
        "US8751391B2",
        "US8930260B2",
        "US8977621B1",
        "US9026472B2",
        "US9026471B2",
        "US9047634B2",
        "US9064258B2",
        "US9070150B2",
        "US9092813B2",
        "US9355352B1",
        "US9374370B1",
        "US10255634B2",
        "US10592989B2",
        "US10915523B1",
        "US10922363B1",
        "US10936687B1",
        "US10959090B1",
        "US11048765B1",
        "US11281664B1",
        "US11379473B1",
        "US11423018B1",
        "US11741090B1",
        "US11809506B1"
    ],
    "citedby_ftf": []
}