{
    "patent_id": "US-11520077-B2",
    "title": "Automated reservoir modeling using deep generative networks ",
    "assignee": "Exxonmobil Upstream Research Company",
    "publication_date": "2022-12-06",
    "patent_link": "https://patents.google.com/patent/US11520077B2/en",
    "inventors": [
        "Huseyin Denli",
        "Cody J. Macdonald",
        "Victoria M. SOM DE CERFF"
    ],
    "classifications": [
        "G01V1/28",
        "G01V99/005",
        "G01V1/303",
        "G01V1/50",
        "G06F17/18",
        "G06N20/20",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/08",
        "G01V2210/6652"
    ],
    "abstract": "A method for generating one or more reservoir models using machine learning is provided. Generating reservoir models is typically a time-intensive idiosyncratic process. However, machine learning may be used to generate one or more reservoir models that characterize the subsurface. The machine learning may use geological data, geological concepts, reservoir stratigraphic configurations, and one or more input geological models in order to generate the one or more reservoir models. As one example, a generative adversarial network (GAN) may be used as the machine learning methodology. The GAN includes two neural networks, including a generative network (which generates candidate reservoir models) and a discriminative network (which evaluates the candidate reservoir models), contest with each other in order to generate the reservoir models.",
    "claims": "\n1. A machine learning method for generating one or more geological models of a subsurface, the method comprising:\naccessing conditioning data for one stage of hydrocarbon management related to the subsurface, the one stage comprising one of an exploration stage or a development stage;\naccessing one or more geological concepts related to a target subsurface;\naccessing one or more input geological models of the subsurface;\ntraining a first iteration of a machine learning model using the conditioning data for the one stage of hydrocarbon management, the one or more geological concepts, and the one or more input geological models;\ngenerating, based on the first iteration of the machine learning model, one or more geological models;\nusing the one or more geological models generated based on the first iteration of the machine learning model for the one stage of hydrocarbon management;\naccessing conditioning data for a subsequent stage of hydrocarbon management related to the subsurface, the subsequent stage comprising a different and later stage to the one stage and comprising one of the development stage or a production stage, the conditioning data for the subsequent stage being different from the conditioning data for the one stage;\ntraining a second iteration of the machine learning model using the conditioning data for the subsequent stage of hydrocarbon management, wherein the training of the second iteration of the machine learning model is further dependent on one or both of the conditioning data for the one stage of hydrocarbon management used in the first iteration or the machine learning model trained in the first iteration;\ngenerating, based on the second iteration of the machine learning model, one or more geological models for the subsequent stage of hydrocarbon management; and\nusing the one or more geological models generated based on the second iteration of the machine learning model for the subsequent stage of hydrocarbon management.\n2. The method of claim 1, wherein the one or more input geological models of the subsurface comprise one or more input reservoir models of the subsurface; and\nwherein the conditioning data for at least one of the one stage of hydrocarbon management or the subsequent stage of hydrocarbon management comprises geophysical data including field seismic data or simulated seismic data.\n3. The method of claim 1, wherein the conditioning data for at least one of the one stage of hydrocarbon management or the subsequent stage of hydrocarbon management comprises one or more of a structural framework, an internal reservoir architecture, or petrophysical property maps.\n4. The method of claim 1, wherein the machine learning model trained in at least one of the first iteration or second iteration maps a fixed set of conditioning data for at least one of the one stage of hydrocarbon management or the subsequent stage of hydrocarbon management and at least one of varying noise or varying latent code to a plurality of reservoir models.\n5. The method of claim 4, wherein the machine learning model trained in at least one of the first iteration or second iteration comprises a generative adversarial network (GAN) including a generator and a discriminator.\n6. The method of claim 5, wherein the discriminator comprises a discriminator network model; and\nwherein the discriminator network model comprises a classifier network model.\n7. The method of claim 5, wherein the generator comprises a generator network model; and wherein the generator network model comprises a U-net model.\n8. The method of claim 5, wherein the generator comprises a generator network model; and\nwherein the generator network model comprises an autoencoder or variational autoencoder model including an encoder and a decoder.\n9. The method of claim 5, wherein the one or more geological concepts are input to the GAN.\n10. The method of claim 9, wherein the one or more input geological models of the subsurface comprise simulated reservoir models of the subsurface.\n11. The method of claim 9, further comprising accessing one or more reservoir stratigraphic configurations of a reservoir model;\nwherein training the machine learning model in at least one of the first iteration or second iteration is further performed based on the one or more reservoir stratigraphic configurations of the reservoir model; and\nwherein the machine learning model trained in at least one of the first iteration or second iteration learns to generate the one or more reservoir stratigraphic configurations of the reservoir model by varying values of noise or latent code variables.\n12. The method of claim 5, wherein the GAN uses stratigraphic sketches and corresponding seismic data or petrophysical data associated with seismic data as a training set.\n13. The method of claim 5, wherein the GAN uses computational stratigraphy to generate stratigraphic models and seismic simulations or petrophysical data associated with seismic data as a training set.\n14. The method of claim 1, wherein the conditioning data comprises geophysical data;\nwherein the machine learning model trained in at least one of the first iteration or second iteration generates a plurality of reservoir models based on the conditioning data for at least one of the one stage of hydrocarbon management or the subsequent stage of hydrocarbon management and the one or more geological concepts; and\nfurther comprising quantifying uncertainty of anticipated reservoir performance in the subsurface using the plurality of reservoir models.\n15. The method of claim 14, wherein quantifying uncertainty of anticipated reservoir performance comprises estimating one or more statistical distributions of target reservoir quantities including one or more of: net-to-gross; spatial continuity; distribution of dynamic properties affecting fluid flow conditions; or distribution of petrophysical properties.\n16. The method of claim 1, wherein using the one or more geological models based on the first iteration of the machine learning model or the second iteration of the machine learning model comprises modifying at least one of reservoir development, depletion, or management in the subsurface.\n17. The method of claim 16, wherein modifying at least one of reservoir development, depletion, or management comprises modifying a trajectory of a borehole in the sub surface.\n18. The method of claim 1, wherein using the one or more geological models based on the first iteration of the machine learning model or the second iteration of the machine learning model comprises causing a well to be drilled in the subsurface based upon the one or more geological models.\n19. The method of claim 1, wherein the one or more geological models based on the first iteration of the machine learning model or the second iteration of the machine learning model are generated for multiple stages of a life cycle of an oil and gas field including exploration, development and production.\n20. The method of claim 19, wherein the machine learning model trained in both the first iteration and the second iteration comprises a generative adversarial network (GAN) including a generator and a discriminator; and\nwherein the generator is iteratively updated or continually trained for multiple stages of the life cycle of an oil and gas field including the exploration stage, the development stage, and the production stage.\n21. The method of claim 19, wherein in the first iteration, a first set of geological data is used by machine learning in order to generate a first set of geological models;\nwherein in the second iteration, a second set of geological data is used by the machine learning in order to generate a second set of geological models;\nwherein the second set of geological data is different from the first set of geological data; and\nwherein the first set of geological models is different from the second set of geological models.\n22. The method of claim 1, wherein the conditioning data for at least one of the one stage of hydrocarbon management or the subsequent stage of hydrocarbon management comprises synthetically-generated conditioning data; and\nfurther comprising:\nmanipulating or augmenting the synthetically-generated conditioning data with structured noise; and\nusing the manipulated or augmented synthetically-generated conditioning data in training the machine learning model.\n23. The method of claim 22, wherein manipulating or augmenting the synthetically-generated conditioning data comprises using a style transfer approach in order to translate the synthetically-generated conditioning data into field data by manipulating a synthetic data style of the synthetically-generated conditioning data or by adding noise to the synthetically-generated conditioning data, the noise having a similar distribution as the field data.\n24. The method of claim 23, wherein the synthetically-generated conditioning data is generated using one or more simulators; and\nfurther comprising selecting the style transfer approach from a plurality of available style transfer approaches, wherein the selection of the style transfer approach is specific to a geological basin, a data acquisition type, or processing workflows in order to account for effects not modeled with the one or more simulators.\n25. The method of claim 1, wherein the machine learning model trained in the second iteration is based on the machine learning model trained in the first iteration.\n26. The method of claim 25, wherein training the second iteration of the machine learning model comprises fixing the machine learning model from the first iteration and expanding the machine learning model from the first iteration with an expanded part comprising additional layers trained with the conditioning data from the subsequent stage of hydrocarbon management.\n27. The method of claim 1, wherein training the second iteration of the machine learning model comprises retraining the machine learning model as a whole.\n28. The method of claim 27, wherein retraining the machine learning model as a whole uses the conditioning data for the one stage of hydrocarbon management and the conditioning data for the subsequent stage of hydrocarbon management.",
    "status": "Active",
    "citations_own": [
        "US5444819A",
        "EP0561492B1",
        "US5940777A",
        "US6374185B1",
        "US6438493B1",
        "US6662112B2",
        "US6735526B1",
        "US7844402B2",
        "US8055026B2",
        "US20130118736A1",
        "US20140278311A1",
        "US20150234070A1",
        "US9366772B2",
        "US9489769B2",
        "US9618839B2",
        "WO2017188858A1",
        "US20170364795A1",
        "US20180106917A1",
        "US20180120481A1",
        "CN108537742A",
        "US20180306940A1",
        "US20190064378A1",
        "US20190162868A1",
        "US20190169962A1",
        "US20190250294A1",
        "US20190302290A1",
        "US20190383985A1",
        "US20190391295A1"
    ],
    "citations_ftf": [
        "US10768325B2",
        "AU2018219304A1"
    ],
    "citedby_own": [
        "US20210125312A1",
        "US20210263185A1",
        "US20220098972A1",
        "US11630228B1",
        "US11740372B1",
        "US11775353B2"
    ],
    "citedby_ftf": [
        "US10127240B2",
        "CA3010531C",
        "US11568207B2",
        "WO2020123100A2",
        "WO2020185918A1",
        "JP7276757B2",
        "CN111274689B",
        "CN111402266A",
        "WO2021194467A1",
        "US11693140B2",
        "US11486230B2",
        "WO2021237327A1",
        "AU2020101108A4",
        "CN111796326B",
        "CN111738355B",
        "CN112083482B",
        "US20220067534A1",
        "US11720962B2",
        "CN112232325B",
        "WO2022140717A1",
        "US20220198721A1",
        "CN112800158B",
        "CA3215790A1",
        "US11531907B2",
        "US11436438B1",
        "CN113945974B",
        "US11774614B2",
        "CN113642772A",
        "CN113640879B",
        "CN113820741B",
        "WO2023055581A1",
        "WO2023102041A1",
        "US20230193731A1",
        "CN114491774B",
        "CN115421181B"
    ]
}