{
    "patent_link": "https://patents.google.com/patent/US6823204B2/en",
    "patent_id": "US6823204B2",
    "title": "Method of imaging the blood flow in a vascular tree",
    "abstract": "The invention relates to a method of imaging a vascular tree that yields additional information concerning the vascular tree. To this end, a sequence of clusters is determined from spatially coherent voxels in the three-dimensional image of the vascular tree, the sequence of said clusters corresponding to the flow direction of the blood or the contrast medium in said vascular tree.",
    "inventors": [
        "Michael Grass",
        "Holger Schmitt",
        "Volker Rasche"
    ],
    "assignee": "Koninklijke Philips NV",
    "classifications": [
        "A61B6/481",
        "A61B6/4014",
        "A61B6/504",
        "A61B6/507",
        "G06T17/00"
    ],
    "claims": "\n1. A method of imaging the blood flow in a vascular tree of an object (3) to be examined, which method comprising the steps of:\n2. A method as claimed in claim 1, wherein the clusters (C1, C2, C3, . . . ) are displayed on a display unit in such a manner that the sequence of clusters determined can be recognized.\n3. A method as claimed in claim 1, wherein prior to the determination of the clusters, the three-dimensional image is segmented in such a manner that essentially only the vascular system is reproduced in the image.\n4. A method of imaging the blood flow-in a vascular tree of an object to be examined, which method includes the steps of:\n5. A method as claimed in claim 4, in which the times of arrival of the sequence of clusters determined are subjected to median filtering for the purpose of modification.\n6. A method as claimed in claim 4, in which in the case of an overlapping projection of clusters in the X-ray projection images and multiple arrival of the contrast medium bolus in this projection, the times of arrival are assigned to the associated clusters in the three-dimensional image in dependence on the times of arrival determined each time for the respective neighboring clusters in the vascular tree.\n7. A method as claimed in claim 4, wherein speed information is derived from the times of arrival determined for the clusters of the vascular tree.\n8. A method as claimed in claim 4, wherein at least one series of X-ray projection images that reproduces the vascular system in different phases of a contrast medium inflow is formed from a fixed projection direction.\n9. A method as claimed in claim 8, wherein that the series of X-ray projection images is formed from a projection direction for which the surface area covered by the vascular tree has a maximum value.\n10. A n X-ray device comprising:\n11. An X-ray device as claimed in claim 10, wherein the imaging unit includes a first X-ray source (12) and a first X-ray detector (13) for acquiring a series of two-dimensional X-ray images from a first projection direction, and a second X-ray source (12′) and a second X-ray detector (13′) for the simultaneous acquisition of a series of two-dimensional X-ray images from a second projection direction that encloses an angle of preferably 90° relative to the first projection direction.\n12. An X-ray device comprising:\n13. A method of imaging blood flow in a vascular tree, the method comprising:\n14. The method as set forth in claim 13, wherein the assigning of a time of arrival includes:",
    "status": "Expired - Fee Related",
    "citations_own": [
        "EP0860696A2",
        "US6246784B1",
        "US20010031920A1",
        "US6442235B2",
        "US6480732B1",
        "US20020168618A1",
        "US6512807B1",
        "US6741880B1"
    ],
    "citations_ftf": [
        "US5303706A",
        "US5368033A"
    ],
    "citedby_own": [
        "US20060293579A1",
        "US20070206719A1",
        "US20100172472A1",
        "DE102009004576A1",
        "US20100189337A1",
        "US20100296713A1",
        "US20110037761A1",
        "US20110038517A1",
        "US20110085642A1",
        "US20110228997A1",
        "US8768031B2",
        "US8963919B2",
        "US9125611B2",
        "US9398675B2",
        "US9414799B2",
        "US10719980B2",
        "US11069054B2",
        "US11215711B2",
        "US11710309B2"
    ],
    "citedby_ftf": [
        "US7340026B2",
        "WO2005018457A1",
        "DE102004018499A1",
        "US7218702B2",
        "US7738626B2",
        "CN101156174B",
        "DE102005018327A1",
        "DE102005042328A1",
        "EP1960965A2",
        "US8105239B2",
        "DE102006025420B4",
        "DE102006025422B4",
        "JP4921882B2",
        "EP2088932B1",
        "DE102007024451B4",
        "DE102007037996A1",
        "CN101785027A",
        "DE102007044406A1",
        "DE102007046514A1",
        "US9788813B2",
        "US9282945B2",
        "JP5148315B2",
        "DE102008023053A1",
        "EP2320802B1",
        "JP5485373B2",
        "EP4235215A2",
        "EP3563768A3",
        "DE102011076855B4",
        "DE102011079532B4",
        "IN2014CN02088A",
        "TW201336478A",
        "KR20140107648A",
        "CN104135937B",
        "CN104203110B",
        "JP6270843B2",
        "EP2887879B1",
        "JP5596099B2",
        "WO2014160291A1",
        "US10089744B2",
        "US9883848B2",
        "DE102014210458B4",
        "EP3170454B1",
        "CN106794007B",
        "CN113729764A"
    ]
}