{
    "patent_link": "https://patents.google.com/patent/US20120124606A1/en",
    "patent_id": "US20120124606A1",
    "title": "Apparatus and methods for identifying and characterizing latency in a content delivery network",
    "abstract": "Methods and apparatus for identification and characterization of latency in a content delivery network. In one embodiment, interaction of users with content is recorded via the collection of a plurality of tuning records; the latency is then utilize to adjust the timing on the tuning records to account for lapses in time for sending these from between entities of the network and the user devices, and for processing occurring at the devices as required. The latency is determined by taking into account an experimentally or manufacturer-derived device specific latency component, and a network latency component. The network latency component is determined in one variant by sending a message to the device from the network requesting a current system time (or other response). Once the timing of the tuning records is adjusted, these tuning records may be relied upon as being accurate representations of subscriber interaction with content on a second-by-second basis. Accordingly, tuning records may be obtained and analyzed for content which lasts for very short periods of time (e.g. advertisements).",
    "inventors": [
        "Justin Tidwell",
        "Eduardo Samame",
        "Craig ENGEL"
    ],
    "assignee": "Spectrum Management Holding Co LLC",
    "classifications": [
        "H04L43/0864",
        "H04N21/25833",
        "H04L7/0054",
        "H04N21/2625",
        "H04N21/6587",
        "H04H20/12",
        "H04H60/33",
        "H04N21/20"
    ],
    "claims": "\n1. A method for providing data relating to interaction of a client device of a content distribution network with one or more portions of content provided over said network, said method comprising:\ndetermining a latency attributable to said device;\ndetermining a latency attributable to a path within said network which said content must take to be provided to said device;\nutilizing said latency attributable to said device and said latency attributable to said network path to determine a aggregate latency specific to said device;\ncollecting data relating to interaction of said device with said one or more portions of said content; and\naccounting for said aggregate latency with respect to said data.\n2. The method of claim 1, wherein said act of determining said latency attributable to said device comprises:\nreceiving data comprising said latency attributable to said device from a manufacturer of said device;\nstoring said data; and\nretrieving said data upon said collection of said data relating to said interaction of said device with said one or more portions of said content.\n3. The method of claim 1, wherein said act of determining a latency attributable to said network path comprises:\nsending a request for a current system time to said device at a first time;\nreceiving in response to said request a message from said device indicating a second time; and\ndetermining said latency attributable to said network path as being a portion of the difference between said first time and said second time.\n4. The method of claim 3, wherein said determination of said aggregate latency comprises applying a mathematical algorithm which takes into account said portion of said difference between said first time and said second time and said latency attributable to said device.\n5. The method of claim 1, wherein said accounting for said aggregate latency with respect to said data comprises adjusting time data associated with individual ones of said data relating to interaction of a plurality of devices with said one or more portions of said content to accurately represent a time at which said individual ones of said data were collected given said aggregate latency.\n6. The method of claim 1, wherein said data relating to interaction of said one of said devices with said one or more portions of said content comprises data received from said device and identifying at least one of:\na request to tune-in to one of said portions of said content;\na request to tune-out of one of said portions of said content; and\na request to tune-away from one of said portions of said content.\n7. The method of claim 1, wherein said data relating to interaction of said one of said device with said one or more portions of said content comprises data received from said device, and identifying a trick mode operation performed with respect to one of said one or more portions said content.\n8. The method of claim 1, wherein said network comprises a managed network, and said accounting for said aggregate latency with respect to said data is performed by a server maintained at a headend of said network by an operator of said network.\n9. A method for accounting for an asynchronization between an entity for providing content in a content delivery network and a plurality of devices for receiving said content therefrom, said asynchronization being unique for each of said plurality of devices, said method comprising:\ndetermining values for a latency attributable to respective ones of said plurality of devices, respectively;\ndetermining values for a latency attributable to respective network paths taken for the delivery of said content to each of said plurality of devices; and\nfor each of said plurality of devices, utilizing said latency attributable thereto, and said latency attributable to said respective one of said network paths, to determine composite latencies unique to each of said plurality of devices.\n10. A method for determining a system latency specific to an individual one of a plurality of devices in a content delivery network, said method comprising:\ncollecting a value for latency attributable to said individual one of said plurality of devices;\nsending a message requiring a response to said individual one of said plurality of devices at a first time;\nreceiving, in response to said message said response from said individual one of said plurality of devices, said response indicating a second time; and\napplying at least one algorithm to:\ndetermine a portion of the difference between said second and said first time attributable to a one-way traversal of said network to said individual one device; and\ncombine said portion of said difference with said value for latency attributable to said individual one of said plurality of devices to obtain a system latency for that individual one device.\n11. The method of claim 10, further comprising receiving a plurality of records relating to an interaction of said individual ones of said plurality of devices with one or more content elements.\n12. The method of claim 11, wherein said algorithm is further configured to apply said system latency to said plurality of records.\n13. The method of claim 12, wherein said one or more content elements comprise one or more advertisements.\n14. The method of claim 12, further comprising performing one or more tests to determine the validity of said plurality of records.\n15. The method of claim 12, further comprising filtering said plurality of records according to at least one criterion to generate a subset of said plurality of data, and transmitting said subset of said plurality of data to an entity outside of said content delivery network.\n16. The method of claim 10, wherein said message indicates said first time therein.\n17. Consumer premises equipment (CPE) for use in a content delivery network, said CPE comprising:\nat least one first interface configured to communicate with said content delivery network;\na storage apparatus; and\na digital processor, said digital processor configured to run at least one computer program thereon, said program being configured to, when executed:\ndetermine a measure of time which said CPE is out of synchronization to at least one entity of said network;\ncollect a plurality of records, each of said plurality of records indicating:\na time of collection of said record; and\na descriptor of an interaction of a user of said CPE with one or more content elements; and\nre-synchronize said collected plurality of records by adjusting said time of said collection for each of said records by said measure of time.\n18. The CPE of claim 17, wherein said computer program is further configured to anonymize said collected plurality of records to obfuscate an identity of said CPE and/or said user of said CPE.\n19. The CPE of claim 17, wherein said determination of said measure of time comprises receipt of information relating to said measure of time from at least one entity configured to:\nobtain a first value for latency within said CPE;\nobtain a second value for latency within said network in the delivery of content to said CPE; and\nderive a third value for said measure of time.\n20. The CPE of claim 19, wherein said at least one entity comprises a second computer program configured to run on said digital processor.\n21. The CPE of claim 19, wherein said at least one entity comprise an entity of said content delivery network in communication with said CPE via said at least one first interface.\n22. A network apparatus for determining amounts of time by which records collected by a user device must be adjusted to account for latency in a content delivery network, said network apparatus comprising:\nat least one first interface configured to communicate at least said user device;\na storage apparatus; and\na digital processor, said digital processor configured to run at least one computer program thereon which is configured to, when executed:\nobtain a first value representative of processing delay at said user device;\nderive a second value associated with a transmission delay between said network apparatus and said user device; and\nutilize said first and said second values to calculate a third value, said third value representing a unique amount of time individual ones of said records collected at said user device must be adjusted.\n23. The network apparatus of claim 22, wherein individual ones of said records collected at said user device comprise records which characterize user interaction with content at a particular time.\n24. The network apparatus of claim 23, wherein said content comprises content having a total duration less than or equal to one minute, and said adjustment of said individual ones of said records enables said records to accurately identify said particular time to within an accuracy of less than or equal to one (1) second.\n25. The network apparatus of claim 22, wherein said second time value is derived by:\nsending at a first time a Simple Network Management Protocol (SNMP) message to said user device;\nreceiving in response to said message, said response indicating a second time; and\ncalculating a one-way propagation delay based at least on said second and said first times.\n26. The network apparatus of claim 22, wherein said computer program is further configured to:\nsend said third value to said user device; and\nreceive from said user device one or more of said records, each of said records having been adjusted using said third value.\n27. The network apparatus of claim 22, wherein said computer program is further configured to:\nstore said third value at said storage apparatus;\nreceive said individual ones of said records collected at said user device; and\nadjust a time associated with said individual ones of said records collected at said user device by said third value.\n28. A method of obtaining data relating to content, comprising:\ndelivering content to a plurality of users of a network;\nobtaining data relating to interactions of said users with said delivered content; and\nadjusting said data so that it accurately reflects the timing of said interactions relative to delivery of said content.\n29. The method of claim 28, further comprising providing said subset to one or more consumers.\n30. The method of claim 29, wherein said content comprises and advertisement, and said at least one of said one or more consumers comprises an advertiser responsible for said advertisement.\n31. The method of claim 28, further comprising processing said data to identify a subset of said data having at least one attribute of interest.\n32. The method of claim 31, wherein said at least one attribute of interest comprises a common demographic of said users.",
    "status": "Active",
    "citations_own": [
        "US20030220100A1",
        "US20070280298A1",
        "US20080170551A1",
        "US20090086643A1",
        "US20100218231A1"
    ],
    "citations_ftf": [
        "US5988078A",
        "US6400996B1",
        "US7006881B1",
        "US7242988B1",
        "USRE38600E1",
        "US6463585B1",
        "US5659350A",
        "JPH06237451A",
        "CA2157600A1",
        "US5694546A",
        "US5719938A",
        "US20030213001A1",
        "US5758257A",
        "US6052145A",
        "US5818438A",
        "US5708961A",
        "US5897635A",
        "US6807676B1",
        "US5796423A",
        "US5862140A",
        "US6167432A",
        "US5841468A",
        "US6728269B1",
        "US6133910A",
        "US6523696B1",
        "WO1998028906A2",
        "IL119972A",
        "US6252634B1",
        "US6308328B1",
        "US6094676A",
        "US6259701B1",
        "US6029045A",
        "US6487721B1",
        "US6181697B1",
        "US6252547B1",
        "US6698020B1",
        "TW416224B",
        "US6226618B1",
        "US20020056125A1",
        "US20010004768A1",
        "US6608837B1",
        "US7099348B1",
        "US6697376B1",
        "US6091735A",
        "US20020123928A1",
        "US7185353B2",
        "US7039932B2",
        "US8266266B2",
        "US20030023983A1",
        "US6198744B1",
        "US7023868B2",
        "FR2792788B1",
        "US6460182B1",
        "US7174127B2",
        "US7779439B2",
        "US7065779B1",
        "CA2393824C",
        "WO2001052173A1",
        "CN1194545C",
        "US7149772B1",
        "US6944150B1",
        "US6519062B1",
        "US20020032754A1",
        "US20040148625A1",
        "US7768546B1",
        "US7404084B2",
        "US7690020B2",
        "US7370364B2",
        "US7170905B1",
        "US7085260B2",
        "AU2001288670A1",
        "US7689510B2",
        "US7068639B1",
        "US7039048B1",
        "US8122236B2",
        "US6788775B1",
        "US20020078444A1",
        "US20020087976A1",
        "GB0101338D0",
        "WO2002057917A2",
        "US7228416B2",
        "US20030028888A1",
        "US20020133513A1",
        "US20020144260A1",
        "US20040250273A1",
        "US20020188744A1",
        "US7003670B2",
        "US7392546B2",
        "FI20011342A0",
        "US7085287B1",
        "US7065213B2",
        "US7188085B2",
        "US6920185B2",
        "US7362707B2",
        "JP4191397B2",
        "US8713623B2",
        "US7009972B2",
        "US7054902B2",
        "US20090282444A1",
        "EP1452050A4",
        "US6931378B2",
        "US6993596B2",
        "US7027460B2",
        "US20030200548A1",
        "US6694145B2",
        "US20030126611A1",
        "US20030149975A1",
        "CN100592827C",
        "US7221935B2",
        "DE60334446D1",
        "FR2836766B1",
        "US20060149624A1",
        "US20050034171A1",
        "US8443383B2",
        "US7908626B2",
        "US7941817B2",
        "US20030225777A1",
        "US7444655B2",
        "CA2489713A1",
        "CN1217543C",
        "US7860975B2",
        "US20040133923A1",
        "US7551610B2",
        "US20040045035A1",
        "US20040045037A1",
        "EP1576839B1",
        "US6788676B2",
        "US7254608B2",
        "WO2004045123A1",
        "AU2003300948A1",
        "US7330483B1",
        "US20040137918A1",
        "US7376386B2",
        "GB0303176D0",
        "US7873660B1",
        "US20040181811A1",
        "US6973171B2",
        "US20040226043A1",
        "US8266659B2",
        "US7437769B2",
        "US20050022247A1",
        "US7457520B2",
        "US7802295B2",
        "US7213036B2",
        "US20050049886A1",
        "WO2005022892A2",
        "US7500235B2",
        "US8214256B2",
        "US20050086334A1",
        "US8302111B2",
        "US20050125824A1",
        "US9213538B1",
        "US8078669B2",
        "WO2005079501A2",
        "US20050187823A1",
        "US8863205B2",
        "US20050216933A1",
        "US7460151B2",
        "WO2005099333A2",
        "CA2933668C",
        "US20060080702A1",
        "JP4291213B2",
        "WO2005125214A2",
        "US8843978B2",
        "US8266429B2",
        "US8312267B2",
        "US20060021004A1",
        "KR100651894B1",
        "US7630499B2",
        "US7174385B2",
        "US9197857B2",
        "US20060074875A1",
        "US20060095940A1",
        "US20060117354A1",
        "US7486869B2",
        "US7421244B2",
        "US20060130099A1",
        "US7242960B2",
        "US9723267B2",
        "US8522293B2",
        "US7519181B2",
        "US8015306B2",
        "KR20060082353A",
        "US20060293954A1",
        "US7653920B2",
        "US7567565B2",
        "US7602820B2",
        "US20060209799A1",
        "US7954128B2",
        "US7852831B2",
        "US7549051B2",
        "US8028322B2",
        "FI117735B",
        "US20060225118A1",
        "US7930723B2",
        "US20060259927A1",
        "US20060291506A1",
        "US20070019645A1",
        "US8181262B2",
        "US20070022459A1",
        "US9286388B2",
        "US20070055984A1",
        "US20070049245A1",
        "US8646102B2",
        "US7567983B2",
        "US8582584B2",
        "US20070094691A1",
        "US7889765B2",
        "US8566887B2",
        "US7592912B2",
        "US7693171B2",
        "US7865730B2",
        "US8011012B2",
        "US8170065B2",
        "US20070219908A1",
        "US20070209059A1",
        "US8347341B2",
        "US8707375B2",
        "US20070261116A1",
        "US20070245376A1",
        "US9386327B2",
        "TWI313389B",
        "JP4551369B2",
        "CN101110759A",
        "JP5205380B2",
        "US20080066112A1",
        "US8943218B2",
        "US20080091807A1",
        "US8520850B2",
        "US8732854B2",
        "US20080120667A1",
        "US20080133551A1",
        "US8219134B2",
        "MX2009006573A",
        "US8438603B2",
        "US20080162353A1",
        "US20080172287A1",
        "US8621540B2",
        "US8352980B2",
        "US20080209489A1",
        "US7894370B2",
        "US7849490B2",
        "US20080235746A1",
        "US20080279534A1",
        "US9398346B2",
        "US20080306903A1",
        "KR101370318B1",
        "US7954131B2",
        "US7770200B2",
        "US20090083811A1",
        "US8099757B2",
        "US20090100493A1",
        "US8015192B2",
        "US20090150926A1",
        "US8938747B2",
        "US20090172776A1",
        "EP2081362B1",
        "US8401022B2",
        "US8639630B2",
        "US9743142B2",
        "US8813143B2",
        "US8831032B2",
        "JP2009211632A",
        "US7890599B2",
        "CA2659698C",
        "US8468572B2",
        "US20090293101A1",
        "US20100027560A1",
        "KR101247879B1",
        "US9911457B2",
        "US20100083329A1",
        "JP5325974B2",
        "US20100125658A1",
        "US8341242B2",
        "US9357247B2",
        "US20100138900A1",
        "US8185477B2",
        "US20110173045A1",
        "US9003512B2",
        "US8726310B2",
        "US20100211982A1",
        "US9215423B2",
        "US8370509B2",
        "CA3008502C",
        "US9507870B2",
        "US9602864B2",
        "US8244909B1",
        "US8813124B2",
        "US8935721B2",
        "US9178634B2",
        "US8914354B2",
        "US9027062B2",
        "US8396055B2",
        "US20110099017A1",
        "US10264029B2",
        "US9635421B2",
        "US20110126018A1",
        "US9519728B2",
        "US20110178943A1",
        "US9342661B2",
        "US8701138B2",
        "US8427958B2",
        "US9204193B2",
        "US8484511B2",
        "US9906838B2",
        "US8352620B2",
        "US20120079518A1",
        "US8930979B2"
    ],
    "citedby_own": [
        "US20130100859A1",
        "US20130144969A1",
        "US20130173822A1",
        "US8789083B1",
        "US8806518B2",
        "US20140282793A1",
        "US20140359036A1",
        "US20140358925A1",
        "US8930979B2",
        "US20150012646A1",
        "US9003436B2",
        "US9137558B2",
        "US20150319405A1",
        "US20160028604A1",
        "US20160028603A1",
        "US20160163007A1",
        "US9385878B1",
        "US9432708B1",
        "US9519728B2",
        "US9531760B2",
        "US9563532B1",
        "US9571826B1",
        "US9621939B2",
        "US9635421B2",
        "US9686189B2",
        "US20170329732A1",
        "US9883223B2",
        "US9906838B2",
        "US10028025B2",
        "US10051304B2",
        "US10116676B2",
        "US10129592B2",
        "US10136172B2",
        "US10148623B2",
        "US10178435B1",
        "US10250932B2",
        "US10278008B2",
        "US10313755B2",
        "US10339281B2",
        "US10404758B2",
        "US10586023B2",
        "US10602231B2",
        "US10652607B2",
        "US10863238B2",
        "US10887647B2",
        "US10945025B1",
        "US10958629B2",
        "US11032518B2",
        "US11076189B2",
        "US11159851B2",
        "US11212593B2",
        "US11228817B2",
        "US11381549B2",
        "US11552999B2",
        "US11792462B2",
        "US11812116B2"
    ],
    "citedby_ftf": [
        "US20150271541A1",
        "US10135890B2",
        "US10375452B2",
        "US10687115B2",
        "US10652594B2",
        "US11109290B2",
        "US10826808B2",
        "US10768004B2",
        "US10797981B2",
        "US11233717B2"
    ]
}