{
    "patent_id": "US-10863927-B2",
    "title": "Identifying fall risk using machine learning algorithms ",
    "assignee": "Zibrio Inc.",
    "publication_date": "2020-12-15",
    "patent_link": "https://patents.google.com/patent/US10863927B2/en",
    "inventors": [
        "Katharine Forth",
        "Erez Lieberman Aiden"
    ],
    "classifications": [
        "A61B5/1117",
        "A61B5/1036",
        "A61B5/4023",
        "A61B5/7267",
        "A61B5/7275",
        "G06N20/00",
        "G06N3/08",
        "G06N7/005",
        "G06N7/01",
        "G16H20/30",
        "G16H50/20",
        "G16H50/30",
        "A61B2503/08",
        "A61B2562/0252",
        "A61B5/0022",
        "A61B5/1116",
        "A61B5/6887",
        "G16H20/10"
    ],
    "abstract": "A person's fall risk may be determined based on machine learning algorithms. The fall risk information can be used to notify the person and/or a third party monitoring person (e.g. doctor, physical therapist, personal trainer, etc.) of the person's fall risk. This information may be used to monitor and track changes in fall risk that may be impacted by changes in health status, lifestyle behaviors or medical treatment. Furthermore, the fall risk classification may help individuals be more careful on the days they are more at risk for falling. The fall risk may be estimated using machine learning algorithms that process data from load sensors by computing basic and advanced punctuated equilibrium model (PEM) stability metrics.",
    "claims": "\n1. A method, comprising:\nreceiving, by a processor, a plurality of load data points over a period of time from at least one load detecting module;\ndetermining a plurality of posture states based, at least in part, on the plurality of load data points by applying a machine learning algorithm to the plurality of load data points;\ncalculating one or more base punctuated equilibrium model (PEM) stability metrics based, at least in part, on the plurality of posture states, wherein the base punctuated equilibrium model (PEM) stability metrics comprise metrics corresponding to a presence of a plurality of postural states;\ncalculating one or more advanced punctuated equilibrium model (PEM) stability metrics based, at least in part, on the plurality of posture states, wherein the advanced punctuated equilibrium model (PEM) stability metrics comprise metrics corresponding to a relationship between the plurality of postural states; and\ndetermining a balance score based, at least in part, on the one or more base punctuated equilibrium model (PEM) stability metrics and on the one or more advanced punctuated equilibrium model (PEM) stability metrics.\n2. The method of claim 1, wherein the machine learning algorithm comprises a Hidden Markov Model (HMM), and the HMM classifies static and dynamic postural states based on the plurality of load data points.\n3. The method of claim 1, wherein the step of determining the balance score comprises applying a second machine learning algorithm to the one or more base PEM stability metrics and the one or more advanced PEM stability metrics.\n4. The method of claim 3, wherein the second machine learning algorithm comprises a neural network, wherein the neural network is trained with training data from individuals with a known fall history.\n5. The method of claim 1, wherein the step of determining the balance score comprises computing basic postural stability metrics from an inverted pendulum model (IPM) using an artificial intelligence technique, and wherein the determined balance score is based, at least in part, on the basic postural stability metrics.\n6. The method of claim 1, further comprising calculating at least one basic non-PEM metric based on the plurality of load data points, and wherein determining the balance score comprises linearly integrating weighted metrics of the one or more base PEM stability metrics, the one or more advanced PEM stability metrics, and the at least one basic non-PEM metric.\n7. The method of claim 6, wherein the at least one basic non-PEM metric comprises at least one of peak mediolateral sway, peak anterior-posterior sway, standard deviation of mediolateral sway, standard deviation of anterior-posterior sway, mean speed, fraction of trial above a predetermined speed, radius of a 95% sway ellipse, radius of a 95% sway circle, and root mean square (RMS) speed.\n8. The method of claim 1, wherein the one or more base PEM stability metrics comprise at least one of a number of equilibria, a dwell time in an equilibrium, and a size of each equilibrium, wherein the advanced PEM stability metrics comprise at least one of a time to equilibrium, an equilibrium distance, an equilibrium overlap, a percent equilibrium, a mean equilibria duration, or directional equilibria.\n9. The method of claim 1, further comprising classifying a fall risk from the balance score, wherein the fall risk classification is based on classification thresholds.\n10. The method of claim 1, further comprising collecting historical data for an individual, wherein the balance score is determined based, at least in part, on the historical data.\n11. The method of claim 10, wherein the step of collecting historical data comprises collecting at least one of clinical records, exercise, lifestyle inputs, weight, body fat composition, body mass index, level of hydration, medication consumption, alcohol consumption, sleep, steps per day, exercise, time spent sitting, or strength.\n12. The method of claim 1, wherein the step of computing the balance score comprises determining a postural state at a point in time based on at least the plurality of postural states and a probability of transitioning between at least one of the plurality of postural states and another postural state, wherein the postural state is at least one of a static postural state or a dynamic postural state.\n13. A system for determining postural stability and fall risk of a person, comprising:\nat least one load detecting module configured to acquire a plurality of load data points; and\na data analysis module configured to analyze the plurality of load data points received from the at least one load detecting module, wherein the data analysis module is configured to perform steps comprising:\ndetermining a plurality of posture states based, at least in part, on the plurality of load data points by applying a machine learning algorithm to the plurality of load data points;\ncalculating one or more base punctuated equilibrium model (PEM) stability metrics based, at least in part, on the plurality of posture states, wherein the base punctuated equilibrium model (PEM) stability metrics comprise metrics corresponding to a presence of a plurality of postural states;\ncalculating one or more advanced punctuated equilibrium model (PEM) stability metrics based, at least in part, on the plurality of posture states, wherein the advanced punctuated equilibrium model (PEM) stability metrics comprise metrics corresponding to a relationship between the plurality of postural states; and\ndetermining a balance score based, at least in part, on the one or more base punctuated equilibrium model (PEM) stability metrics and on the one or more advanced punctuated equilibrium model (PEM) stability metrics.\n14. The system of claim 13, further comprising a display module coupled to the data analysis module and configured to display results from the data analysis module comprising at least an indication of the fall risk.\n15. The system of claim 13, wherein the analysis module is configured to apply a Hidden Markov Model (HMM) to the plurality of load data points to classify static and dynamic postural states for the plurality of postural states.\n16. The system of claim 13, wherein the step of determining the balance score comprises applying a second machine learning algorithm to the one or more base PEM stability metrics and the one or more advanced PEM stability metrics.\n17. The system of claim 16, wherein the second machine learning algorithm comprises a neural network, wherein the neural network is trained with training data from individuals with a known fall history.\n18. The system of claim 13, wherein the analysis module is configured to determine the balance score by computing basic postural stability metrics from an inverted pendulum model (IPM) using an artificial intelligence technique, and wherein the determined balance score is based, at least in part, on the basic postural stability metrics.\n19. The system of claim 13, wherein the analysis module is further configured to collect historical data for an individual, wherein the balance score is determined based, at least in part, on the historical data.\n20. The system of claim 19, wherein the analysis module is configured to determine the balance risk based on historical data comprising at least one of clinical records, exercise, lifestyle inputs, weight, body fat composition, body mass index, level of hydration, medication consumption, alcohol consumption, sleep, steps per day, exercise, time spent sitting, or strength.",
    "status": "Active",
    "citations_own": [
        "US4738269A",
        "US5052406A",
        "US5388591A",
        "US5627327A",
        "US5830158A",
        "US5919149A",
        "US5987982A",
        "JP2000125590A",
        "US6063046A",
        "US20010032059A1",
        "US6389883B1",
        "WO2007102708A1",
        "JP2008504080A",
        "WO2008059418A1",
        "US20090137933A1",
        "US7612681B2",
        "US7682308B2",
        "US20110152727A1",
        "US20110166488A1",
        "US8152744B2",
        "US20120095722A1",
        "US20120119904A1",
        "US8206325B1",
        "US20120253233A1",
        "US8405510B2",
        "US8529448B2",
        "US20130246088A1",
        "US20140024972A1",
        "US8773256B2",
        "WO2014158698A1",
        "US20140330171A1",
        "WO2014210344A1",
        "WO2015003211A1"
    ],
    "citations_ftf": [
        "JP2961706B2",
        "US20140180172A1"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US20140142442A1",
        "US10692011B2",
        "CN110313036A",
        "SE542317C2",
        "WO2019051481A1",
        "FR3073728A1",
        "US11213224B2",
        "KR20190115978A",
        "US11504071B2",
        "US11521740B2",
        "CN108898793A",
        "US11488724B2",
        "US20210125728A1",
        "EP3588458A1",
        "US20210321953A1",
        "FR3086858B1",
        "KR102284350B1",
        "US11064911B2",
        "WO2020124022A2",
        "US11638563B2",
        "US10891843B2",
        "US11183304B2",
        "EP3920797A4",
        "US20200289889A1",
        "US11541274B2",
        "US11113943B2",
        "US11433276B2",
        "US11801423B2",
        "KR102260470B1",
        "KR102250938B1",
        "KR102269535B1",
        "CN112151172A",
        "CN110413601B",
        "US11701548B2",
        "US11282608B2",
        "US20210127974A1",
        "US20210134412A1",
        "US11317975B2",
        "US11515028B2",
        "US20210134432A1",
        "US11515021B2",
        "US20210134458A1",
        "US20210128080A1",
        "US11139060B2",
        "US11325005B2",
        "US11270795B2",
        "US11282599B2",
        "US20210134463A1",
        "US20210142893A1",
        "US11756666B2",
        "US20210134425A1",
        "US11337648B2",
        "US11282604B2",
        "USD933497S1",
        "USD936650S1",
        "USD934164S1",
        "WO2021100883A1",
        "CN114269243A",
        "CN111403039A",
        "CN111358471B",
        "CN111481193B",
        "US11687806B2",
        "CN112331321A",
        "FR3118695A1",
        "CA3209555A1",
        "CN113589932A",
        "WO2023047558A1",
        "KR102585275B1",
        "WO2023091946A1",
        "TWI809612B",
        "WO2023127013A1",
        "WO2023127008A1",
        "WO2023129254A1",
        "WO2023136433A1",
        "TWI809686B",
        "WO2023183870A1"
    ]
}