{
    "patent_link": "https://patents.google.com/patent/US20020038282A1/en",
    "patent_id": "US20020038282A1",
    "title": "Buyer-side auction dynamic pricing agent, system, method and computer program product",
    "abstract": "The present invention sets forth a system, method, and computer program product for automating an interaction between a buyer and an electronic, variable, dynamic pricing online auction service. The method can include receiving a registration of a buyer at an Internet enabled buyer bidding site, a portfolio, and account information. The method can also receive entered information about financial transaction instruments, contact information, and product preferences in an auction profile. The method can receive a search query for a desired product from product auctions of a plurality of auction sites and can use a search agent or a meta-search agent, and can provide returned auctions, including retrieving and presenting current status of product auctions. The method can receive a selection of returned auctions to store in the portfolio for tracking by scan agents and for bidding by bid proxies. The method can receive selections of product auctions of the returned auctions and place the product auctions into the portfolio for use by a cascaded bid proxy. The method can provide auction monitoring by scan agents of temporal progression of product auctions, and can notify someone via a messaging center of any changes in relevant aspects of the status that could prevent an initial bid from being placed by a bid proxy. The method can enable activation of bid proxies as an auction nears completion to begin placing bids until the auction is won or lost by auction closing and can confirm a counter-offer has not out-bid. The method can compute and execute another higher bid if a counter-offer has been made and accepted, higher than the most recent bid detected",
    "inventors": [
        "Rob Montgomery"
    ],
    "assignee": "LIFEPROXY LLC",
    "classifications": [
        "G06Q30/08",
        "G06Q40/04"
    ],
    "claims": "\n1. A method for automating an interaction between a buyer and an electronic, variable, dynamic pricing online auction service comprising of the steps of:\na. receiving a registration of a buyer at an Internet, web-enabled, buyer bidding application site (site) by creating logon credentials that are used to authenticate and authorize the buyer's access to the site, a portfolio of the buyer, and account information of the buyer,\nwherein the logon credentials are provided by an independent 3rd party through a logon agent using at least one of proxied identification and digital certificates;\nb. receiving entered information about financial transaction instruments of the buyer, contact information including at least one of a telephone number, an email address, and a physical mail address, and product preferences into an auction profile of the buyer;\nc. receiving a search query from the buyer for a desired product from the product auctions of a plurality of auction sites including at least one of keywords, model identification, brand identification, synonyms, and unique identification, using at least one of a search agent and a meta-search agent, and providing returned auctions, including retrieving current status of the product auctions and presenting the current status to the buyer;\nreceiving a selection of one or more of the returned auctions to store in the portfolio of the buyer for tracking by one or more scan agents and for bidding by one or more bid proxies;\nd. receiving selections of a plurality of product auctions of the returned auctions and placing the plurality of product auctions into the portfolio for use by a cascaded bid proxy;\ne. providing monitoring by the one or more scan agents of temporal progression of the plurality of product auctions, and notifying the Buyer via a messaging center of any changes in relevant aspects of the current status of any of the plurality of product auctions that would prevent an initial bid from being placed by the bid proxy;\nf. enabling activation of the one or more bid proxies as any completing auction that nears completion of the plurality of product auctions, to begin placing one or more bids until the completing auction is either won or lost by time of auction closing, including enabling interaction between the scan agent and the bid proxy to place the bid of the buyer as close to the time of auction closing as possible and to confirm that a counter-offer has not out-bid a most recent bid of the Buyer;\ng. computing and executing another valid higher bid that is within the bid parameters, if the counter-offer has been made and accepted by the auction site that is higher than the most recent bid detected by the scan agent.\n2. A method for automating a Buyer's online, electronic search agent of specific electronic auctions on a targeted auction site comprising:\na. providing a programmable search agent, from a server, that searches auction catalogs of a plurality of auction sites and identifies correlations between\nproduct parameters of a Buyer that can be at least one of entered and stored, and can include at least one of keywords, product classifications, and price ranges, and\nproducts that are listed for sale through dynamic price competitive bidding using a number of electronic auction techniques including at least one of a Dutch, Yankee, and Reverse auction techniques.\n3. The method according to claim 2 further comprising:\nb. providing additional programmable search agents searching said plurality of auction sites simultaneously for one or more products; and\nc. returning a found set of said one or more products for further review and selection by a Buyer.\n4. A method for executing one or more programmed bid proxies that are controlled by bid parameters comprising the steps of:\na. retrieving, using a scan agent, the current auction status within a time to auction close window (TACW) wherein said TACW spans a range of time beginning at a time calculated by subtracting an absolute time to start proxied bidding from an auction end time, and ending with a time of the auction end time, wherein the TACW defines a period of time when a scan agent and a bid proxy work in tandem to place as many bids as necessary to win an auction;\nb. determining, by a bid proxy, if parameters of the current auction status fall within a range of acceptable auction status parameters;\nc. computing, using the bid proxy, a next valid price by adding a minimum valid price increment to a current auction price to compute an offer price, if the current auction price is below a maximum price, using the parameters of the current auction status;\nd. activating a bid proxy, and placing a bid in accordance with an auction site specific protocol, if the offer price is below the maximum price in the acceptable auction status parameters, wherein the auction site specific protocol varies from site to site, and a basic protocol involves at least one of entering the offer price, and authenticating as the Buyer so the offer price can be correlated with an account of the Buyer on the auction site and entered on behalf of the Buyer;\ne. retrieving the current auction status, using the scan agent, to verify that a latest bid of the Buyer has been accepted by the auction site;\nf. repeating steps (b) through (e) until auction end, if the current auction status indicates that the offer price of the Buyer has been rejected or outbid by another bidder; and\ng. scanning the auction, at the auction end, to determine win/loss status of the auction and storing the win/loss status in portfolio of the Buyer for later reporting to the Buyer through a messaging system.\n5. The method of claim 4, wherein step (a) comprises:\n1. computing the TACW based on a value derived from a data warehouse of the site, wherein the value derived is computed based on a minimum absolute time that has been logged for prior successful auctions for a given auction site, wherein the minimum absolute time is a time till close (TTC) value; and\n2. computing the TTC value using probability analysis and auction site telemetry information computed based on recent response times and network latencies as determined by the scan agent.\n1. computing the TACW based on a value derived from a data warehouse of the site, wherein the value derived is computed based on a minimum absolute time that has been logged for prior successful auctions for a given auction site, wherein the minimum absolute time is a time till close (TTC) value; and\n2. computing the TTC value using probability analysis and auction site telemetry information computed based on recent response times and network latencies as determined by the scan agent.\n6. A method for providing cascaded bidding comprising:\na. executing a series of cascaded bids for an identical product in temporally sequential auctions according to a programmed set of bid parameters, wherein the bid parameters comprise at least one of the following types:\na programmed bid value limit for one or more units of product;\nan algorithmically calculated bid value limit based on prevailing market prices for similar or identical products monitored by agents and stored in a data warehouse.\n7. The method according to claim 1, wherein step (e) comprises:\n1. notifying the Buyer when a current price of a targeted auction exceeds programmed bid parameters of the bid proxy, comprising at least one of:\na. examining with an internal scan agent, bid information stored in the portfolio of the Buyer; and\nb. sending information to the Buyer using at least one of wired and wireless messaging technologies including at least one of an email, a page, a text page, an instant message, and an other communication, if a programmed bid with invalid bid parameters or other important information is detected.\n1. notifying the Buyer when a current price of a targeted auction exceeds programmed bid parameters of the bid proxy, comprising at least one of:\na. examining with an internal scan agent, bid information stored in the portfolio of the Buyer; and\nb. sending information to the Buyer using at least one of wired and wireless messaging technologies including at least one of an email, a page, a text page, an instant message, and an other communication, if a programmed bid with invalid bid parameters or other important information is detected.\n8. The method according to claim 1, wherein step (e) comprises:\n1. notifying the Buyer when an auction has been won using at least one of a bid proxy of the Buyer and a programmed bid,\nwherein information is sent to the Buyer using at least one of wired and wireless messaging technologies including at least one of\nan email,\na text page,\nan instant message,\na communication, and\na hypertext link to bid information stored in the portfolio of the Buyer.\n1. notifying the Buyer when an auction has been won using at least one of a bid proxy of the Buyer and a programmed bid,\n9. A method for scanning online auctions using a scan agent, comprising:\na. scanning web pages of a targeted auction site and extracting relevant auction status information including at least one of an open, a close, a maximum bid, a minimum valid bid, a last bidder, and other auction parameters and information using a scan agent that can be used to compute a valid Buyer bid, comprising:\n1. retrieving one or more programmed bids, using a scan agent, from one or more portfolios of one or more buyers;\n2. extracting auction site identification from programmed bid information;\n3. activating the appropriate scan agent based on the auction site identification and domain information of an auction site;\n4. retrieving using the scan agent the latest auction site characterization information available for that auction site;\n5. retrieving, using the scan agent, auction information from the auction site by at least one of navigating auction information pages of the auction site, and through using an application programming interface (API) that enables programmatic retrieval of the auction information;\n6. the current auction parameters are retrieved, analyzed and stored in entry for the auction in the portfolio of the Buyer; and\n7. performing further analysis by at least one of one or more site agents and processes.\n1. retrieving one or more programmed bids, using a scan agent, from one or more portfolios of one or more buyers;\n2. extracting auction site identification from programmed bid information;\n3. activating the appropriate scan agent based on the auction site identification and domain information of an auction site;\n4. retrieving using the scan agent the latest auction site characterization information available for that auction site;\n5. retrieving, using the scan agent, auction information from the auction site by at least one of navigating auction information pages of the auction site, and through using an application programming interface (API) that enables programmatic retrieval of the auction information;\n6. the current auction parameters are retrieved, analyzed and stored in entry for the auction in the portfolio of the Buyer; and\n7. performing further analysis by at least one of one or more site agents and processes.\n10. The method according to claim 9, further comprising:\nb. scanning status pages of the auction site to track progress and status of a targeted auction prior auction close, the method comprising of the steps of:\n1. scanning, using the scan agent, all portfolios of all Buyers for all active auctions in each of the individual portfolios of the Buyers;\n2. scanning slowly of the auctions listed in the each of the individual portfolios is performed for those auctions with TTC values that exceed a slow/fast scan threshold (SFST) value, wherein a slow/fast scan window (SFSW) is computed by subtracting the SFST value from each individual auction end time;\n3. evaluating auction status information from those auctions that are before the start of the SFSW to determine if the Buyer's bid parameters for a given auction are no longer valid, including messaging the reason for non-validity to the Buyer using the messaging system, if the bid parameters are no longer valid for a given auction;\n4. changing status of programmed bid from slow scan to fast scan, if the scan agent determines that a given auction falls within the SFSW;\n5. scanning more frequently a programmed bid in fast scan mode in order to determine the current response time or latency of the auction site based on prevailing network traffic conditions; and\n6. transitioning the programmed bid into active bid mode, if a bid is within the TACW, and execution of a bid proxy programmed bid that is controlled by bid parameters can be performed.\n1. scanning, using the scan agent, all portfolios of all Buyers for all active auctions in each of the individual portfolios of the Buyers;\n2. scanning slowly of the auctions listed in the each of the individual portfolios is performed for those auctions with TTC values that exceed a slow/fast scan threshold (SFST) value, wherein a slow/fast scan window (SFSW) is computed by subtracting the SFST value from each individual auction end time;\n3. evaluating auction status information from those auctions that are before the start of the SFSW to determine if the Buyer's bid parameters for a given auction are no longer valid, including messaging the reason for non-validity to the Buyer using the messaging system, if the bid parameters are no longer valid for a given auction;\n4. changing status of programmed bid from slow scan to fast scan, if the scan agent determines that a given auction falls within the SFSW;\n5. scanning more frequently a programmed bid in fast scan mode in order to determine the current response time or latency of the auction site based on prevailing network traffic conditions; and\n6. transitioning the programmed bid into active bid mode, if a bid is within the TACW, and execution of a bid proxy programmed bid that is controlled by bid parameters can be performed.\n11. The method according to claim 9, further comprising:\nb. distributing one or more scan agents to distributed network nodes including at least one of a server, a workstation, and a peer device) and executing the scanning process (“peer scan agent”) from that node in response to high loading conditions on the master node or counter-measures enabled by the auction site, a method comprising the steps of:\n1. distributing and activating on peer servers a copy of the agents involved in the bidding process, if at least one of the scan agent, and any other agent, detects the agent cannot access the auction site because the agent is not receiving a response to inquiries including at least one of a Post and a Get, wherein the peer servers are previously configured as support servers to the site and information about the peer servers is stored in a directory on a master node at the site;\n2. distributing, by the master node, bid proxies of auctions from the portfolio of the Buyer and bid parameters to the designated peer server now assigned the task of bidding on a given auction by the master node;\n3. executing on the peer server the auction bid proxy as would the master node without control from the master node; and\n4. returning to the master node subsequent to auction end, and logging into the portfolio, the resulting win/loss/failed status of the auction.\n1. distributing and activating on peer servers a copy of the agents involved in the bidding process, if at least one of the scan agent, and any other agent, detects the agent cannot access the auction site because the agent is not receiving a response to inquiries including at least one of a Post and a Get, wherein the peer servers are previously configured as support servers to the site and information about the peer servers is stored in a directory on a master node at the site;\n2. distributing, by the master node, bid proxies of auctions from the portfolio of the Buyer and bid parameters to the designated peer server now assigned the task of bidding on a given auction by the master node;\n3. executing on the peer server the auction bid proxy as would the master node without control from the master node; and\n4. returning to the master node subsequent to auction end, and logging into the portfolio, the resulting win/loss/failed status of the auction.\n12. The method according to claim 11, wherein step (2) comprises:\ni. distributing of the bid proxies to distributed network nodes including at least one of a server, a workstation, and a peer device, and executing a peer bid proxy process initiated from a node responsive to at least one of high loading conditions on another node, and counter-measures enacted by the auction site.\n13. A method for adapting to changes in auction site layout and relevant auction site information, comprising:\na. adapting to changes within a plurality of web pages of an auction site and changes across the plurality of web pages, so that one or more scan agents and one or more bid proxies intelligently adapt to format and data type changes in the web pages of the auction site comprising:\n1. alerting by the scan agent of an intelligent process known as the information extractor when old information that is expected to be found on a new page is not found;\n2. examining a new page layout by the information extractor and comparing the new page layout data to a stored copy of the old page layout of a known navigable page to determine if the old information is located elsewhere on the new page;\n3. modifying the parameters of the scan agent by the information extractor to identify where the old information is now located on the new page, if the old information is found in another location in the new page layout than it was in the old page layout;\n4. stepping through one or more previous pages in navigation of pages of the auction site, by the information extractor, and scanning new links to see if the old information has been moved to another page, if the old information is not found in the new page layout;\n5. modifying parameters of the scan agent, by the information extractor, to identify the new location of the old information, if the old information is found; and\n6. sending an alert to an administrator for the page and resulting navigation path to be retrained by the administrator using at least one of a neural net engine controlling the scan agent and another intelligent engine reprogramming mechanism, if the old information is not found.\n1. alerting by the scan agent of an intelligent process known as the information extractor when old information that is expected to be found on a new page is not found;\n2. examining a new page layout by the information extractor and comparing the new page layout data to a stored copy of the old page layout of a known navigable page to determine if the old information is located elsewhere on the new page;\n3. modifying the parameters of the scan agent by the information extractor to identify where the old information is now located on the new page, if the old information is found in another location in the new page layout than it was in the old page layout;\n4. stepping through one or more previous pages in navigation of pages of the auction site, by the information extractor, and scanning new links to see if the old information has been moved to another page, if the old information is not found in the new page layout;\n5. modifying parameters of the scan agent, by the information extractor, to identify the new location of the old information, if the old information is found; and\n6. sending an alert to an administrator for the page and resulting navigation path to be retrained by the administrator using at least one of a neural net engine controlling the scan agent and another intelligent engine reprogramming mechanism, if the old information is not found.\n14. The method according to claim 1, further comprising:\nh. managing at least one of payment instruments, payment devices, contact, and financial status, of the Buyer through an online, personalizable buyer profile account comprising:\n1. presenting registration screens to the Buyer for the collection of contact information including at least one of an email, a physical mail address, a telephone number, a pager, and an alternative contact information, and financial instrument information;\n2. creating an account information record in a database of the information and linking the account information record to any activated auction portfolios of the buyer; and\n3. providing access for the Buyer to the account information record and modifying the account information record as needed subsequent to buyer authentication.\n1. presenting registration screens to the Buyer for the collection of contact information including at least one of an email, a physical mail address, a telephone number, a pager, and an alternative contact information, and financial instrument information;\n2. creating an account information record in a database of the information and linking the account information record to any activated auction portfolios of the buyer; and\n3. providing access for the Buyer to the account information record and modifying the account information record as needed subsequent to buyer authentication.\n15. The method of claim 1, further comprising:\nh. accelerating the performance of a bid proxy by using network telemetry and statistical algorithms to improve the win probability of the bid, comprising:\n1. testing, using a telemetry agent, the response time of an auction site to periodically ascertain temporal latency for various types of queries and commands;\n2. optimizing balance between when to place an initial bid and keeping winning price as low as possible, using information on the response time obtained during response time testing, wherein response time information is stored in an updateable profile for each auction site and is used by the bid proxy, and wherein the telemetry information collected comprises a screen type, and a transaction type including at least one of a query for auction status and a bid command, and a time span from a query to a response.\n1. testing, using a telemetry agent, the response time of an auction site to periodically ascertain temporal latency for various types of queries and commands;\n2. optimizing balance between when to place an initial bid and keeping winning price as low as possible, using information on the response time obtained during response time testing, wherein response time information is stored in an updateable profile for each auction site and is used by the bid proxy, and wherein the telemetry information collected comprises a screen type, and a transaction type including at least one of a query for auction status and a bid command, and a time span from a query to a response.\n16. The method according to claim 1, further comprising:\nh. receiving one or more persistent search agents that are programmed, persistent and operative to search one or more auction sites for product auctions of a desired product and providing returned auctions that a bid proxy can execute using at least one of a directed programmed bid, and an algorithmically calculated bid, wherein the one or more persistent search agents periodically search a list of a plurality of auction sites for product auctions that correlate with preference information stored in the profile of a buyer, comprising:\n1. creating entries by the Buyer for each kind of product of which the Buyer desires to be notified if a product containing this description becomes available for bidding on any and all auction sites;\n2. periodically searching, using the one or more persistent search agents, search services of the plurality of auction sites to see if a matching product can be found in lists of products being auctioned; and\n3. sending, to the Buyer, a link to a found product using the message center, if any matches are found; and\ni. receiving at least one of\ndefinitions of programmed bidding parameters of the directed programmed bid to the bid proxy, and\nauthorization of the bid proxy to algorithmically compute a lowest market price based on reviewing prevailing market prices for similar products as determined by information stored in a data warehouse.\n1. creating entries by the Buyer for each kind of product of which the Buyer desires to be notified if a product containing this description becomes available for bidding on any and all auction sites;\n2. periodically searching, using the one or more persistent search agents, search services of the plurality of auction sites to see if a matching product can be found in lists of products being auctioned; and\n3. sending, to the Buyer, a link to a found product using the message center, if any matches are found; and\ni. receiving at least one of\ndefinitions of programmed bidding parameters of the directed programmed bid to the bid proxy, and\nauthorization of the bid proxy to algorithmically compute a lowest market price based on reviewing prevailing market prices for similar products as determined by information stored in a data warehouse.\n17. The method according to claim 1, further comprising:\nh. storing product preferences of the Buyer for products, including preference information that can be used by at least one of a persistent search agent, and a bid proxy operating under at least one of directed programmed bidding, and algorithmically calculated bidding parameters.",
    "status": "Active",
    "citations_own": [
        "US5600632A",
        "US5794219A",
        "US20010034696A1",
        "US20010056396A1",
        "US20020042769A1",
        "US6408283B1",
        "US20020082971A1",
        "US6415270B1",
        "US20020147675A1",
        "US6496855B1",
        "US6520409B1",
        "US20030093357A1",
        "US20030130927A1",
        "US6598028B1",
        "US20030233316A1",
        "US6718312B1",
        "US20040088241A1",
        "US6813612B1",
        "US6839690B1",
        "US20050010520A1",
        "US6871190B1",
        "US6871191B1",
        "US20050091140A1",
        "US20050209952A1",
        "US20050228745A1",
        "US20050234798A1",
        "US6963854B1",
        "US20050262009A1",
        "US20060074792A1",
        "US7047210B1",
        "US7099841B1"
    ],
    "citations_ftf": [
        "US5255309A",
        "JPH0743748B2",
        "US5508731A",
        "US5191410A",
        "US5247347A",
        "WO1994005117A1",
        "US5440623A",
        "US5533108A",
        "JPH08161412A",
        "US5740240A",
        "US5845265A",
        "US7937312B1",
        "US5905975A",
        "US5835896A",
        "US5774873A",
        "US5890138A",
        "US20070299682A1",
        "US6161099A",
        "US6012045A",
        "US6415269B1",
        "US20010051910A1",
        "US6058417A",
        "US6677858B1",
        "US7177832B1",
        "US6549904B1",
        "US6892186B1",
        "US7085740B1",
        "US20020013763A1",
        "US7328185B1",
        "US6665649B1",
        "CA2300751A1",
        "US7289967B1",
        "US20010034697A1",
        "US20070055578A1",
        "US20020049664A1",
        "US20020062276A1",
        "US20020069156A1",
        "DE10043860A1",
        "US6371855B1",
        "US7249180B2",
        "GB0025570D0",
        "US8036949B2",
        "US20020116320A1",
        "US7203662B2",
        "US20030023499A1",
        "GB0204429D0",
        "US7475034B2",
        "US7472076B2",
        "US20040044614A1",
        "US20030229564A1",
        "US20040110552A1",
        "US7921052B2",
        "CN1836248A",
        "US7315832B2",
        "WO2005048058A2",
        "US7428501B2",
        "US20070244762A1",
        "US7457769B2",
        "US7895087B1",
        "US20060047572A1",
        "US20060047568A1",
        "US20060136325A1",
        "US20060136322A1",
        "US20060136324A1",
        "CN102576436A"
    ],
    "citedby_own": [
        "US20020065760A1",
        "US20020072968A1",
        "US20020147675A1",
        "US20020188545A1",
        "GB2389676A",
        "US20040015397A1",
        "US20040044571A1",
        "WO2004042525A2",
        "US20040204967A1",
        "US20050049938A1",
        "US20050096979A1",
        "US20050096980A1",
        "US20050101625A1",
        "US20050131764A1",
        "US20050144069A1",
        "US20050160026A1",
        "US20050222900A1",
        "US20050251399A1",
        "US20050267799A1",
        "US20060031080A1",
        "US20060039365A1",
        "US20060050700A1",
        "US20060095365A1",
        "US20060120375A1",
        "US20060168054A1",
        "US20060200445A1",
        "US20060206310A1",
        "US20060203750A1",
        "US20060218624A1",
        "US20060287913A1",
        "US20070011104A1",
        "US20070011050A1",
        "US20070073696A1",
        "US20070078720A1",
        "US20070129075A1",
        "US20070133034A1",
        "US20070136337A1",
        "US20070136443A1",
        "US20070143266A1",
        "US20070156757A1",
        "US20070162379A1",
        "US20070162342A1",
        "US20070165597A1",
        "US20070165629A1",
        "US20070198355A1",
        "US20070204010A1",
        "US20070239533A1",
        "US20070244804A1",
        "US20070268707A1",
        "US20070276747A1",
        "US20070288488A1",
        "US20070300152A1",
        "US20080033956A1",
        "US20080046315A1",
        "US20080114671A1",
        "US20080275790A1",
        "US20080307220A1",
        "US20080306853A1",
        "US20090006996A1",
        "US20090030813A1",
        "US20090088150A1",
        "US20090086681A1",
        "US7533090B2",
        "US20090296606A1",
        "US7639898B1",
        "US20100070379A1",
        "US7697791B1",
        "US7702560B1",
        "US7725502B1",
        "US7730082B2",
        "US7757080B1",
        "US20100312695A1",
        "US20100312902A1",
        "US20100332384A1",
        "US20110093376A1",
        "US7953655B1",
        "US7996753B1",
        "US20110202610A1",
        "US8023927B1",
        "US20110231917A1",
        "US20110238862A1",
        "US8050970B2",
        "US8065611B1",
        "US8087068B1",
        "US8185830B2",
        "US8266016B2",
        "CN102831545A",
        "US8352563B2",
        "US8407314B2",
        "US8446900B2",
        "US20130144857A1",
        "US8468010B2",
        "US8478890B2",
        "US8611540B2",
        "US8668146B1",
        "US8684265B1",
        "US8694587B2",
        "US8725895B2",
        "US8743781B2",
        "US8762280B1",
        "US8763901B1",
        "US20140258110A1",
        "US8892646B2",
        "US20140344094A1",
        "US20140370973A1",
        "US8954861B1",
        "US9027032B2",
        "US9092792B2",
        "US9191416B2",
        "US9357016B2",
        "US9704174B1",
        "US20180096427A1",
        "US20180137569A1",
        "US10062062B1",
        "US10091025B2",
        "US20190080023A1",
        "US10355882B2",
        "US10475082B2",
        "US10542121B2",
        "US10606960B2",
        "US10789632B2",
        "US11409812B1"
    ],
    "citedby_ftf": [
        "US6924781B1",
        "US20030101054A1",
        "US20050263903A1",
        "DE602004032172D1",
        "US7917414B2",
        "US20070005482A1",
        "US8781942B2",
        "US20130054317A1",
        "US20070174188A1",
        "US20070192126A1",
        "US20090112997A1",
        "US8457013B2",
        "US8234507B2",
        "US10191982B1",
        "US9607324B1",
        "US20100257058A1",
        "US20110112901A1",
        "US9836768B2",
        "US10068266B2",
        "US9280541B2",
        "WO2015050585A1",
        "TWI602119B",
        "US10643178B1",
        "US20210027348A1",
        "US11663252B2"
    ]
}