{
    "patent_link": "https://patents.google.com/patent/US4843568A/en",
    "patent_id": "US4843568A",
    "title": "Real time perception of and response to the actions of an unencumbered participant/user",
    "abstract": "Apparatus and method for using an image of the human body to control real time computer events wherein data regarding a participant are acquired through any means of imaging without marking the participant or requiring that he or she use or wear a stimulus source, sensing device or special clothing. Perception and feature analysis are carried out by specialized circuitry and computer software, and response to perception is expressed using any device controllable by a computer. Participants generally are unaware of processing delays between action and reaction, and their perception of an event is similar to dealing with a human being or animate creature. Perception and response occur in real time with action and reaction closely coupled.",
    "inventors": [
        "Myron W. Krueger",
        "Katrin Hinrichsen",
        "Thomas S. Gionfriddo"
    ],
    "assignee": "Individual",
    "classifications": [
        "G06F3/011",
        "G06F3/033",
        "G06F3/042",
        "G06T7/00",
        "G09B21/00",
        "A63F2300/1093",
        "A63F2300/69"
    ],
    "claims": "\n1. A device for perceiving, processing and responding in real time to a demonstrative behavior of at least one unmarked participant, said device comprising:\nmeans spaced from at least one unmarked participant for distinguishing the participant from a background;\nmeans for imaging each distinguished participant and providing an image thereof;\nmeans for digitizing said image provided by said means for imaging;\nmeans connected to said means for digitizing for ascertaining features of the digitized image;\nmeans connected to said means for ascertaining for identifying at least one characteristic of at least one of said ascertained features, each of the identified characteristics being a selected one of a location and a movement of a respective ascertained feature, said means for identifying providing a control parameter in response to the at least one identified characteristic;\nmeans responsive to said control parameter for processing said ascertained features of said digitized image to provide a signal indicative of a demonstrative behavior of said participant; and\nmeans for responding in real time to said signal indicative of a demonstrative behavior of said participant.\n2. The device as defined in claim 1, wherein the means for imaging includes a video camera.\n3. The device as defined in claim 1, wherein the means for processing includes control means for controlling said means for ascertaining features of said digitized image.\n4. The device as defined in claim 1, wherein the means for digitizing includes an analog to digital convertor receiving said image from said means for imaging, means for digitally thresholding an output of said analog to digital convertor with hysteresis, and means for filtering a digital noise from an output of said means for digitally thresholding.\n5. The device as defined in claim 1, wherein said digitized image includes boundary information corresponding to a boundary between the distinguished participant and said background, and the means for imaging and the means for ascertaining are constituted in part by multiple processor means for operating in parallel, said multiple processor means including means for extracting various types of information from said boundary information in said digitized image.\n6. The device as defined in claim 5, wherein said at least one unmarked participant includes a left-most participant and a right-most participant and said means for imaging produces a plurality of horizontal scan lines, and wherein the means for ascertaining includes means for performing an analysis of said left-most and said right-most participant as distinguished from said background on each said horizontal scan line.\n7. The device as defined in claim 1, wherein said at least one unmarked participant includes a left-most participant and a right-most participant and said means for imaging produces a plurality of horizontal scan lines, and wherein said means for ascertaining includes a micro-coded hardware processor means having means for extracting information from a boundary between said background and said left-most and right-most participants on each said horizontal scan line.\n8. The device as defined in claim 1, wherein the means for ascertaining includes means for performing a directed search in a bit-map image for a participant versus background transition and means for capturing and storing said bit-map image from said digitized image.\n9. The device as defined in claim 1, wherein the means for ascertaining includes hardware processor means for capturing a bit-map image from said digitized image and means for extracting requested participant versus background transition points from said bit-map image.\n10. The device as defined in claim 1, wherein the means for ascertaining includes means for tracing an image contour of said digitized image and means for detecting features of various size by point to point measurements along said image contour.\n11. The device as defined in claim 1, wherein the means for ascertaining includes micro-coded hardware processor means including means for capturing a bit-map image from said digitized image, means for tracing contours of said participant in an image area in said bit-map image, and means for finding features of a specified size along said contours.\n12. The device as defined in claim 1, wherein said means for ascertaining includes dedicated hardware means for detecting a finger feature of said participant.\n13. The device as defined in claim 1, wherein said means for imaging includes a plurality of means for vision processing adapted to accumulate data and the means for ascertaining includes means for processing data accumulated by said plurality of means for vision processing.\n14. The device as defined in claim 1, wherein the means for identifying includes means for controlling predetermined perception parameters and has means for processing said perception parameters.\n15. The device as defined in claim 1, wherein the means for identifying includes means for controlling a parameter and means responsive to said parameter for placing said device in a selected one of an alternative interactive mode and an alternative interactive function.\n16. The device as defined in claim 1, wherein said means for responding includes means for color graphics display.\n17. The device as defined in claim 1, wherein the means for responding includes means for generating a video image of said participant, means for creating and displaying graphic objects, and means for real time interaction of said participant's video image with said graphic objects.\n18. The device as defined in claim 1, wherein the means for responding includes means for projecting an image of said participant, means for projecting a controllable graphic object and means for real time replacement of said participant's projected image by said controllable graphic object.\n19. A device as defined in claim 1, wherein the means for responding includes means for synthesizing sound.\n20. A process for controlling a device adapted to perform a plurality of operations to perceive, process and respond in real time to a plurality of demonstrative behaviors of at least one unmarked participant, said process comprising:\nassociating each of a plurality of demonstrative behaviors of at least one unmarked participant with a respective operation of said device;\ngenerating low level code associated with said operations, said low level code including at least one independent primitive module;\ncontrolling a plurality of special purpose processors of said device in accordance with said low level code; and\nsequencing the control of said special purpose processors in accordance with a performed sequence of said demonstrative behaviors so as to realize real time performance of a corresponding sequence of said operations.\n21. A device for representing graphically, in real time, at least one unmarked participant in a demonstrative activity associated with said participant, said device comprising:\nmeans for obtaining a contrasting image of said unmarked participant;\nmeans for digitizing said contrasting image to provide a digitized image;\nmeans for timing control of said means for obtaining said contrasting image;\nmeans for ascertaining features of said digitized image;\nmeans connected to said means for timing control for storing ascertained features of said digitized image and for processing said stored ascertained features of said digitized image;\nmeans for identifying at least one characteristic of at least one of said ascertained features, each of the identified characteristics being a selected one of a location and a movement of a respective ascertained feature of said digitized image;\nmeans responsive to said means for identifying for controlling said means for storing and for processing so as to provide information indicative of a demonstrative activity of said participant; and\nmeans responsive to said information for updating a selected one of a graphic and a manipulatable image representation, in real time, of a demonstrative behavior of said participant.\n22. The device as defined in claim 21, wherein the means for updating includes means for representing said participant graphically conjointly with a simultaneous image of said participant and is constituted in part by said means for obtaining a contrasting image of said participant.\n23. The device as defined in claim 22, wherein said means for updating includes means for providing a simultaneous digitized image representation.\n24. The device as defined in claim 22, wherein said means for updating includes means for providing a simultaneous video image representation.\n25. The device as defined in claim 21, wherein the means for updating includes means for representing said participant graphically and means for obtaining synthesized sound, said means for obtaining synthesized sound being connected to said means for storing and processing said digitized image.\n26. The device as defined in claim 21, wherein the means for updating includes means for representing graphically, in real time, said unmarked participant conjointly and simultaneously with a representation of a pre-selected environment for said participant.\n27. The device as defined in claim 26, wherein the pre-selected environment is a graphic environment.\n28. The device as defined in claim 27, wherein the pre-selected environment is a fractal graphic environment.\n29. The device as defined in claim 26, wherein the pre-selected environment is a synthesized sound environment.\n30. The device as defined in claim 26, wherein the pre-selected environment is a synthesized color environment.\n31. The device as defined in claim 26, wherein the pre-selected environment is a synthesized sound and color environment.\n32. The device as defined in claim 21, wherein said at least one participant is represented graphically on screen means.\n33. The device as defined in claim 21, wherein the means for updating further includes means for special effect processing.\n34. A method for perceiving, processing and responding, in real time, to a demonstrative behavior of at least one unmarked participant, the method comprising the steps of:\nimaging said unmarked participant to obtain an analog image of the same;\nconverting said image from analog to digital form to obtain a digitized form of said image;\nfirst processing said digitized form of said image to obtain desired features from said digitized form of said image;\nstoring said obtained desired features;\nsynchronizing said first processing and storing by establishing at least one characteristic of said desired features for identification and comparison with said stored desired features, each of the characteristics being a selected one of a location and a movement of a respective feature;\nfurther processing, in real time, said stored desired features and said at least one characteristic to provide processed features; and\nprojecting, in an imaged environment, a processed image of said processed features, in real time.\n35. The method as defined in claim 34, wherein the environment in which said processed image is projected is a graphic environment.\n36. The method as defined in claim 34, wherein said processed image is projected with said processed features as graphic features.\n37. The method as defined in claim 34, wherein said processed image is projected with said processed features as color.\n38. The method as defined in claim 34, wherein said processed image is projected with said processed features as sound.\n39. The method as defined in claim 34, wherein the further processing includes obtaining vision processor features; storing the obtained vision processor features; graphically processing said at least one characteristic with the stored vision processor features; adding graphic effects to the graphically processed vision processor features and using the result for further processing, in real time, said at least one characteristic.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US3846826A",
        "US4163941A",
        "US4232334A",
        "US4276570A",
        "US4361830A",
        "US4375674A",
        "US4400724A",
        "US4405940A",
        "US4533944A",
        "US4539585A",
        "US4561017A",
        "US4670781A",
        "US4703347A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4998209A",
        "EP0477910A2",
        "US5107746A",
        "EP0535988A2",
        "DE4201934A1",
        "EP0554492A1",
        "US5255211A",
        "EP0571702A2",
        "US5517210A",
        "US5534917A",
        "WO1996021994A1",
        "US5563988A",
        "US5581276A",
        "US5588139A",
        "DE19612949C1",
        "US5677700A",
        "US5821922A",
        "WO1999007153A1",
        "DE19750441A1",
        "US5913727A",
        "US5933529A",
        "US5953686A",
        "US5960099A",
        "EP0947948A2",
        "US6002808A",
        "US6031934A",
        "US6046722A",
        "US6061177A",
        "US6072494A",
        "US6075895A",
        "US6078305A",
        "US6101289A",
        "US6118459A",
        "US6130677A",
        "US6147716A",
        "US6151564A",
        "US6157385A",
        "US6167353A",
        "US6175610B1",
        "US6182125B1",
        "US6222465B1",
        "US6262711B1",
        "US6281878B1",
        "DE10007891A1",
        "US6292714B1",
        "WO2001093006A1",
        "US6353764B1",
        "US6356255B1",
        "US6359612B1",
        "US6359601B1",
        "US20020036617A1",
        "US6384819B1",
        "US20020071277A1",
        "US6411744B1",
        "US20020090985A1",
        "US20020186221A1",
        "US20030024375A1",
        "US6532022B1",
        "US20030062675A1",
        "US6545706B1",
        "US20030076293A1",
        "US6563520B1",
        "US20030100965A1",
        "US20030137486A1",
        "US20030148811A1",
        "US20030190954A1",
        "US6650318B1",
        "US20040017473A1",
        "US6731284B1",
        "US6738066B1",
        "US20040095315A1",
        "US6747666B2",
        "US6775835B1",
        "US6778150B1",
        "US6795068B1",
        "US20040183775A1",
        "US20040193413A1",
        "US20040210651A1",
        "US20040207732A1",
        "US20040239670A1",
        "US20050086126A1",
        "US20050086329A1",
        "US20050089194A1",
        "US20050090312A1",
        "US20050110964A1",
        "US20050124654A1",
        "US20050157204A1",
        "US20050162381A1",
        "US20050187017A1",
        "US6940486B2",
        "US20050195112A1",
        "US20050215319A1",
        "US20050215337A1",
        "US20060007141A1",
        "US20060036944A1",
        "EP1640928A2",
        "US20060101349A1",
        "US20060136246A1",
        "US20060139314A1",
        "US7071914B1",
        "US20060187199A1",
        "US20060187196A1",
        "US7098891B1",
        "US20060202953A1",
        "US20060256081A1",
        "US20060277571A1",
        "US20060282873A1",
        "US20060287087A1",
        "WO2006136738A2",
        "US20060288842A1",
        "US7157638B1",
        "US20070021199A1",
        "US20070021207A1",
        "US20070035563A1",
        "US20070060350A1",
        "US20070061851A1",
        "US20070076729A1",
        "US20070098250A1",
        "US20070117625A1",
        "US20070150552A1",
        "US20070196031A1",
        "US20070216894A1",
        "US20070298882A1",
        "US20080013826A1",
        "US20080028325A1",
        "WO2008014826A1",
        "US20080036732A1",
        "US20080046555A1",
        "US20080043106A1",
        "US20080062123A1",
        "US20080080789A1",
        "US20080096657A1",
        "US20080106746A1",
        "US20080119286A1",
        "USRE40368E1",
        "US20080220867A1",
        "US20080240502A1",
        "US20080244468A1",
        "US20080261693A1",
        "US20080267451A1",
        "US20080298376A1",
        "WO2008156437A1",
        "US20090077504A1",
        "US20090096783A1",
        "US20090103780A1",
        "US20090116742A1",
        "US20090115721A1",
        "US20090124165A1",
        "US20090122146A1",
        "US20090144424A1",
        "US20090158220A1",
        "US20090166684A1",
        "US20090195539A1",
        "US20090213072A1",
        "US20090219253A1",
        "US20090233769A1",
        "US20090231278A1",
        "US20090235295A1",
        "US20090251685A1",
        "US20090268945A1",
        "US20090278915A1",
        "US20090280909A1",
        "US7623115B2",
        "US20090305789A1",
        "US20090316923A1",
        "US20090316952A1",
        "US20100009733A1",
        "US20100007717A1",
        "US20100020078A1",
        "US20100033427A1",
        "US20100039500A1",
        "US20100042727A1",
        "US20100048301A1",
        "US20100050133A1",
        "US20100053304A1",
        "US20100060576A1",
        "US20100060570A1",
        "US20100060613A1",
        "US20100066676A1",
        "US20100077087A1",
        "US20100105480A1",
        "US20100118123A1",
        "US20100122174A1",
        "US20100134612A1",
        "US20100144436A1",
        "US20100150404A1",
        "US20100149341A1",
        "US20100171813A1",
        "US20100173710A1",
        "US20100177164A1",
        "US7760248B2",
        "US20100190610A1",
        "US20100194872A1",
        "US20100197391A1",
        "US20100197395A1",
        "US20100197392A1",
        "US20100199221A1",
        "US20100199229A1",
        "US20100195869A1",
        "US20100197399A1",
        "US20100197390A1",
        "US20100199228A1",
        "US20100194762A1",
        "US20100197400A1",
        "US20100197393A1",
        "US20100201811A1",
        "US20100209007A1",
        "US20100216552A1",
        "US20100214214A1",
        "US20100223347A1",
        "US20100228600A1",
        "US20100225746A1",
        "US20100231512A1",
        "US20100238182A1",
        "US20100250385A1",
        "US20100261520A1",
        "US20100265316A1",
        "US7827488B2",
        "US20100277411A1",
        "US20100277489A1",
        "US20100277470A1",
        "US20100281436A1",
        "US20100281438A1",
        "US20100281432A1",
        "US20100278393A1",
        "US20100278431A1",
        "US20100281439A1",
        "US20100285879A1",
        "US20100285883A1",
        "US20100290636A1",
        "US20100290698A1",
        "US20100295771A1",
        "US20100302247A1",
        "US20100304868A1",
        "US20100306712A1",
        "US20100302145A1",
        "US20100302395A1",
        "US20100302138A1",
        "US20100303291A1",
        "US20100304813A1",
        "US20100306715A1",
        "US20100306716A1",
        "US20100302365A1",
        "US20100303289A1",
        "US20100306714A1",
        "US20100303297A1",
        "US20100303290A1",
        "US20100306713A1",
        "US20100302378A1",
        "US20110004329A1",
        "US20110007142A1",
        "US20110007079A1",
        "US20110014983A1",
        "US20110012716A1",
        "US7874917B2",
        "US20110025689A1",
        "US20110025827A1",
        "US7883415B2",
        "US20110035501A1",
        "US20110050885A1",
        "US20110055846A1",
        "US20110062309A1",
        "US20110064402A1",
        "US20110069870A1",
        "US20110069841A1",
        "US20110069221A1",
        "US20110075921A1",
        "US20110083108A1",
        "US20110079714A1",
        "US20110085705A1",
        "US20110093820A1",
        "US20110099476A1",
        "US20110096182A1",
        "US20110102438A1",
        "US20110109617A1",
        "US20110119640A1",
        "US20110118021A1",
        "US20110115157A1",
        "US7953112B2",
        "US20110134114A1",
        "US20110154266A1",
        "US20110151974A1",
        "US20110151970A1",
        "US20110158508A1",
        "US20110159813A1",
        "US20110159959A1",
        "US20110159814A1",
        "US20110173574A1",
        "US20110173204A1",
        "US20110169726A1",
        "US20110175809A1",
        "US20110184735A1",
        "US20110182481A1",
        "US20110190055A1",
        "US20110187878A1",
        "US20110188027A1",
        "US20110187819A1",
        "US20110188028A1",
        "US20110187826A1",
        "US20110187820A1",
        "US20110193939A1",
        "US20110197161A1",
        "US20110199302A1",
        "US20110199291A1",
        "US20110205147A1",
        "US20110211044A1",
        "US20110210915A1",
        "US8014825B2",
        "US20110216965A1",
        "US20110216976A1",
        "US20110221755A1",
        "US20110228976A1",
        "US20110228251A1",
        "US20110234589A1",
        "US20110234756A1",
        "US20110237324A1",
        "US20110234481A1",
        "US20110234490A1",
        "US8035629B2",
        "US8081822B1",
        "US8098277B1",
        "US8199108B2",
        "US8204272B2",
        "US8210943B1",
        "US8243089B2",
        "US8259163B2",
        "US8269691B2",
        "US8284310B2",
        "US8282485B1",
        "US8284847B2",
        "US8289325B2",
        "US8296422B2",
        "US8296151B2",
        "US8310656B2",
        "US8320621B2",
        "US8325909B2",
        "US8330822B2",
        "US8342963B2",
        "US8351651B2",
        "US8363212B2",
        "US8368753B2",
        "US20130033614A1",
        "US8374423B2",
        "US8379919B2",
        "US8381108B2",
        "US8384668B2",
        "US8385596B2",
        "US8401242B2",
        "US8401225B2",
        "US8407725B2",
        "US8408706B2",
        "US8411948B2",
        "US20130084982A1",
        "US8416187B2",
        "US8419541B2",
        "US8437506B2",
        "US8439733B2",
        "US8448056B2",
        "US8444464B2",
        "US8449360B2",
        "US8457353B2",
        "US8465366B2",
        "US20130162532A1",
        "US8475275B2",
        "US8488888B2",
        "US8498481B2",
        "US8497838B2",
        "US8503494B2",
        "US8502816B2",
        "US8509545B2",
        "US8509137B2",
        "US8526734B2",
        "US8527657B2",
        "US8542910B2",
        "US8547401B2",
        "US8548270B2",
        "US8553934B2",
        "US8550908B2",
        "US8558873B2",
        "US8571263B2",
        "US8587583B2",
        "US8592739B2",
        "US8595218B2",
        "US8597142B2",
        "US8605763B2",
        "US8608535B2",
        "US8613666B2",
        "US8620113B2",
        "US8618405B2",
        "US8620069B1",
        "US8630457B2",
        "US8635637B2",
        "US8654198B2",
        "US8659546B2",
        "US8667519B2",
        "US8670029B2",
        "US8675981B2",
        "US8681255B2",
        "US8678896B2",
        "US20140086449A1",
        "US8686269B2",
        "US8686939B2",
        "US8693724B2",
        "US20140098116A1",
        "US8702485B2",
        "US8702507B2",
        "US8704822B2",
        "USRE44855E1",
        "US8702515B2",
        "US8708821B2",
        "US8724906B2",
        "US8724887B2",
        "US8730354B2",
        "US8751215B2",
        "US8749557B2",
        "US8762894B2",
        "US8758136B2",
        "US8761412B2",
        "US8760395B2",
        "US8782567B2",
        "US8786730B2",
        "US8788973B2",
        "US8797260B2",
        "US8806352B2",
        "US8803800B2",
        "US8803952B2",
        "US8803888B2",
        "US8811938B2",
        "US8818002B2",
        "US8824749B2",
        "US8821276B2",
        "US8826147B2",
        "US20140253429A1",
        "US8840470B2",
        "US8854426B2",
        "US8867820B2",
        "US8866889B2",
        "US8874575B2",
        "US8875011B2",
        "US20140325459A1",
        "US8879831B2",
        "US8884968B2",
        "US8885890B2",
        "US8882310B2",
        "US8888331B2",
        "US8892495B2",
        "US8897491B2",
        "US8898687B2",
        "US8914735B2",
        "US8918724B2",
        "US8918721B2",
        "US8918723B2",
        "US8918722B2",
        "US8920241B2",
        "US8924859B2",
        "US8929612B2",
        "US8942917B2",
        "US8959541B2",
        "US8963829B2",
        "US8971612B2",
        "US8968091B2",
        "US8982151B2",
        "US8990677B2",
        "US8988508B2",
        "US8994718B2",
        "US9001118B2",
        "US9008355B2",
        "US9013489B2",
        "US9024166B2",
        "US9030528B2",
        "US9054764B2",
        "US9052746B2",
        "US9066087B2",
        "US9069381B2",
        "US9067136B2",
        "US9075434B2",
        "US9092657B2",
        "US9098873B2",
        "US9098110B2",
        "US9098931B2",
        "US9100685B2",
        "US9117281B2",
        "US9123316B2",
        "US9123255B2",
        "US9131136B2",
        "US9128519B1",
        "US9137463B2",
        "US9135516B2",
        "US9143699B2",
        "US9159165B2",
        "US9157790B2",
        "US9171264B2",
        "US9177387B2",
        "US9182814B2",
        "US9183683B2",
        "US9189211B1",
        "US9195305B2",
        "US9208571B2",
        "US9210401B2",
        "US9224129B2",
        "US9247238B2",
        "US9251590B2",
        "US9256282B2",
        "US9262673B2",
        "US9259643B2",
        "US9264785B2",
        "US9274606B2",
        "US9298287B2",
        "US9313376B1",
        "US9317128B2",
        "US9330366B2",
        "US9330324B2",
        "US9342139B2",
        "US9342817B2",
        "US9349040B2",
        "US9358456B1",
        "US9360993B2",
        "US9384329B2",
        "US9443310B2",
        "US9442186B2",
        "US9446319B2",
        "US9448712B2",
        "US9462253B2",
        "US9470778B2",
        "EP3082017A1",
        "US9474968B2",
        "US9484065B2",
        "US9495013B2",
        "US9495228B2",
        "US9508385B2",
        "US9535563B2",
        "US9551914B2",
        "US9557836B2",
        "US9557574B2",
        "US20170039867A1",
        "US9573056B2",
        "US9594430B2",
        "US9597587B2",
        "US9619132B2",
        "US9646340B2",
        "US9674563B2",
        "US9682319B2",
        "US9684380B2",
        "US9696427B2",
        "US9720089B2",
        "US9724600B2",
        "US9740922B2",
        "US9740293B2",
        "US9769459B2",
        "US9779131B2",
        "US9789392B1",
        "US9814977B2",
        "US9823747B2",
        "US9823339B2",
        "US9821224B2",
        "US9829984B2",
        "US9832441B2",
        "US9836590B2",
        "US9836118B2",
        "US9848106B2",
        "US9857470B2",
        "US9933852B2",
        "US9940553B2",
        "US9953213B2",
        "US9952673B2",
        "US9971491B2",
        "US9981193B2",
        "US9990046B2",
        "US10085072B2",
        "US20180321757A1",
        "US10126820B1",
        "US10192139B2",
        "US10212396B2",
        "US10234545B2",
        "US10257932B2",
        "US10279254B2",
        "US10296587B2",
        "USRE47420E1",
        "US10357714B2",
        "US10402485B2",
        "US10412280B2",
        "US10462452B2",
        "US10529302B2",
        "US10551474B2",
        "US10585957B2",
        "US10642364B2",
        "US10642934B2",
        "US10672221B2",
        "US10671841B2",
        "US10726861B2",
        "US10786736B2",
        "US10796494B2",
        "US10824238B2",
        "US10878009B2",
        "USRE48417E1",
        "US10990454B2",
        "US11103787B1",
        "US11153472B2",
        "US11611595B2"
    ],
    "citedby_ftf": []
}