{
    "patent_id": "US-11564623-B2",
    "title": "Food intake monitor ",
    "assignee": "The Board Of Trustees Of The University Of Alabama",
    "publication_date": "2023-01-31",
    "patent_link": "https://patents.google.com/patent/US11564623B2/en",
    "inventors": [
        "Edward Sazonov",
        "Muhammad Farooq"
    ],
    "classifications": [
        "A61B5/4866",
        "A61B5/002",
        "A61B5/036",
        "A61B5/1118",
        "A61B5/12",
        "A61B5/4542",
        "A61B5/6803",
        "A61B5/6817",
        "A61B5/7246",
        "A61B5/7264",
        "A61B5/7278",
        "A61B7/001",
        "A61B90/361",
        "G06N3/08",
        "G06N7/005",
        "G06N7/01",
        "G09B19/0092",
        "G09B5/06",
        "G16H20/60",
        "G16H40/63",
        "A61B2562/0204",
        "A61B2562/0219",
        "A61B2562/0247",
        "A61B2562/168",
        "A61B5/1123",
        "A61B5/486",
        "A61B5/7285",
        "A61B5/742",
        "G06N5/003",
        "G06N5/01",
        "G06N5/048",
        "H04R3/002"
    ],
    "abstract": "Systems and methods for monitoring food intake include an air pressure sensor for detecting ear canal deformation, according to some implementations. For example, the air pressure sensor detects a change in air pressure in the ear canal resulting from mandible movement. Other implementations include systems and methods for monitoring food intake that include a temporalis muscle activity sensor for detecting temporalis muscle activity, wherein at least a portion of the temporalis muscle activity sensor is coupled adjacent a temple portion of eyeglasses and disposed between the temple tip and the frame end piece. The temporalis muscle activity sensor may include an accelerometer, for example, for detecting movement of the temple portion due to mandibular movement from chewing.",
    "claims": "\n1. A computer-implemented method for monitoring food intake, comprising:\nusing a sensor to measure temporalis muscle activity;\ntransmitting sensor data to a computer;\nusing the computer to execute computer-implemented instructions that determine whether the temporalis muscle activity is associated with food intake by performing steps comprising:\ndividing the sensor data into epochs of a selected duration;\ncomputing a feature set for each epoch, wherein the respective feature sets comprise Fourier Transforms of the sensor data in each epoch;\nusing a respective feature set, computing power spectral density coefficients for each epoch;\ncompiling a predictor vector for each epoch with the power spectral density coefficients;\nusing the respective predictor vectors as inputs to a multi-layer perception artificial neural network to classify the epochs as containing a swallow or not.\n2. The computer-implemented method of claim 1, further including using another sensor to measure body motion, and determining whether the temporalis muscle activity and the body motion are associated with food intake.\n3. The computer-implemented method of claim 2, further including measuring hand motion, and determining whether the temporalis muscle activity, the body motion, and the hand motion are associated with food intake.\n4. The computer-implemented method of claim 1, further including taking images of food.\n5. The computer-implemented method of claim 1, further including using machine learning techniques to learn food intake patterns.\n6. The computer-implemented method of claim 1, wherein using the sensor comprises using an accelerometer to measure temporalis muscle activity.\n7. The computer-implemented method of claim 1, further including notifying a user of the amount of food intake the user has consumed over a given period of time.\n8. The computer-implemented method of claim 1, wherein using the sensor comprises using a piezoelectric sensor positioned below an outer ear of a wearer.\n9. The computer-implemented method of claim 1, wherein using the sensor comprises using at least one of a microphone, an accelerometer, or an air pressure sensor.\n10. A system for monitoring food intake, comprising:\na sensor to measure temporalis muscle activity of a subject;\na computer receiving sensor data transmitted from the sensor;\ncomputer-implemented instructions stored on the computer that, when executed, determine whether the temporalis muscle activity is associated with food intake by performing steps comprising:\ndividing the sensor data into epochs of a selected duration;\ncomputing a feature set for each epoch, wherein the respective feature sets comprise Fourier Transforms of the sensor data in each epoch;\nusing a respective feature set, computing power spectral density coefficients for each epoch;\ncompiling a predictor vector for each epoch with the power spectral density coefficients; and\nusing the respective predictor vectors as inputs to a multi-layer perception artificial neural network to classify the epochs as containing a swallow or not.\n11. The system according to claim 10, wherein the sensor comprises an air pressure sensor implemented within an ear bud configured for inserting into an ear canal of the subject and measuring air pressure changes of the ear canal as indicative of chewing.\n12. The system according to claim 11, wherein the ear bud allows for delivery of sound into the ear of the subject when the ear bud is inserted into the ear canal of the subject.\n13. The system according to claim 10, further comprising training data for use with the multi-layer perception artificial neural network, wherein the training data comprises user push button control data collected by the subject during food intake.\n14. The system according to claim 10, further comprising at least one of a piezoelectric sensor attached to the subject to detect jaw movement, an accelerometer to detect body motion indicative of food intake, a microphone to detect sounds associated with food intake, a camera to take pictures of food, or a hand gesture sensor to detect hand motions indicative of food intake.\n15. The system according to claim 10, further comprising a hand gesture sensor that measures proximity of the subject's hand to the subject's mouth during food intake.\n16. The system according to claim 15, wherein the sensor data is compiled into a jaw sensor signal JM(t) and hand gesture sensor data is compiled into a digital signal HG(t) indicating hand to mouth gestures, and the computer fuses the jaw sensor signal JM(t) and the digital signal HG(t) by calculating the product of the respective absolute values of the jaw sensor signal JM(t) and the digital signal HG(t) to form a function SF(t) for each respective epoch.\n17. The system according to claim 16, wherein the function SF(t) is used to identify food intake during epochs with a mean absolute value of SF(t) that is higher than a threshold value.\n18. The system according to claim 17, further comprising a self-reported signal PB(t) of food intake used to train the multi-layer perception artificial neural network.\n19. The system according to claim 18, wherein the self-reported signal PB(t) comprises push button data gathered by the subject during confirmed instances of food intake.\n20. The system according to claim 10, further comprising additional computer implemented instructions that when executed notify a user of the amount of food intake the user has consumed over a given period of time.",
    "status": "Active",
    "citations_own": [
        "US5263491A",
        "US6135950A",
        "US20020022774A1",
        "US6647368B2",
        "US6735477B2",
        "US20050017602A1",
        "US20060064037A1",
        "WO2008023374A2",
        "US20090012433A1",
        "US20100194573A1",
        "US20110276312A1",
        "US20130267794A1",
        "US8696616B2",
        "US20140275748A1",
        "US20140294193A1",
        "US20140347265A1",
        "US20150157255A1",
        "US20160012749A1",
        "US20160073953A1",
        "US20160132642A1",
        "US20160148535A1",
        "US9554722B2",
        "US10102342B1",
        "US20180353122A1",
        "US20190272845A1",
        "US10736566B2"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "US20210249116A1",
        "WO2017132690A1",
        "WO2018136893A1",
        "US10736566B2",
        "US20180232498A1",
        "WO2018204511A1",
        "US10952669B2",
        "US11442160B2",
        "US11517252B2",
        "US10636437B2",
        "US11645093B2",
        "US10659866B2",
        "JP6810726B2",
        "US11699094B2",
        "CN110062183A",
        "ES2827598B2",
        "US20230052134A1",
        "US11750706B1",
        "US11553313B2",
        "US20230301580A1",
        "JP7251804B2",
        "WO2022173558A1",
        "US11662804B2",
        "US11270796B1",
        "US20220415499A1",
        "CN113456028A",
        "CN113592183B",
        "DE102021210223A1",
        "FR3129583A1",
        "WO2023099429A1",
        "EP4230114A1"
    ]
}