{
    "patent_id": "US-10956834-B2",
    "title": "Tool for machine-learning data analysis ",
    "assignee": "Splunk Inc.",
    "publication_date": "2021-03-23",
    "patent_link": "https://patents.google.com/patent/US10956834B2/en",
    "inventors": [
        "Manish Sainani",
        "Sergey SLEPIAN",
        "Iman MAKAREMI",
        "Adam Jamison Oliner",
        "Jacob Leverich",
        "Di Lu"
    ],
    "classifications": [
        "G06N20/00",
        "G06N5/025",
        "H04L41/16",
        "H04L41/20",
        "H04L41/22"
    ],
    "abstract": "Disclosed herein is a computer-implemented tool that facilitates data analysis by use of machine learning (ML) techniques. The tool cooperates with a data intake and query system and provides a graphical user interface (GUI) that enables a user to train and apply a variety of different ML models on user-selected datasets of stored machine data. The tool can provide active guidance to the user, to help the user choose data analysis paths that are likely to produce useful results and to avoid data analysis paths that are less likely to produce useful results.",
    "claims": "\n1. A method comprising:\ngenerating, by a computer system, a graphical user interface that enables a user of a processing device to:\nindicate a machine learning (ML) model to be trained,\nspecify a first dataset of timestamped machine data events;\ninvoke training of the ML model based on the first dataset, such that a result of the training is a trained ML model, and\ninvoke application of the trained ML model to a second dataset of timestamped machine data events; and\ncausing, by the computer system and based on the first dataset, generation of an indication to the user, of\na suggested data field of the first dataset upon which to base training of the ML model, and\na suggested type of ML analysis to apply.\n2. The method of claim 1, further comprising:\nreceiving user inputs from the user via the graphical user interface; and\nin response to the user inputs, executing a process that includes at least one of:\ntraining the selected ML model on the first dataset based on the user inputs,\ndisplaying the result of the training, or\napplying the selected ML model to the second dataset based on the user inputs; and\noutputting to the user a result of the process, via the graphical user interface.\n3. The method of claim 1, wherein generating the graphical user interface comprises providing a plurality of user input fields to receive user inputs that specify particular data fields of the first dataset, for training the selected ML model.\n4. The method of claim 1, wherein generating the graphical user interface comprises providing a plurality of user input fields to receive user inputs that specify particular data fields for applying the selected ML model.\n5. The method of claim 1, wherein the graphical user interface provides an indication to the user of a plurality of selectable ML models and enables the user to select the ML model to be trained from among the plurality of selectable ML models.\n6. The method of claim 1, wherein the graphical user interface enables the user to view data indicative of the trained ML model.\n7. The method of claim 1, wherein the graphical user interface enables the user to view a result of applying the trained ML model to the second dataset.\n8. The method of claim 1, wherein generating the graphical user interface comprises:\nproviding a user input field for receiving user input that specifies a particular data field of the first dataset, based on which the selected ML model is to be trained;\nidentifying a subset of data fields in the first dataset as satisfying a predetermined criterion for relevance to the selected ML model; and\nsuggesting to the user the identified subset of the data fields of the first dataset, for possible selection by the user in the user input field.\n9. The method of claim 1, wherein generating the graphical user interface comprises:\nproviding a user input field for receiving user input that specifies at least one of:\na particular data field of the first dataset, based on which the selected ML model is to be trained; or\na particular data field of a second dataset, for applying the selected ML model; and\nsuggesting to the user a subset of data fields of the first dataset or a subset of the data fields of the second dataset, for possible selection by the user in the user input fields.\n10. The method of claim 1, wherein the first dataset comprises a plurality of data fields, the method further comprising:\nidentifying a subset of the data fields in the first dataset as satisfying a predetermined criterion for relevance to the selected ML model.\n11. The method of claim 1, wherein the first dataset comprises a plurality of data fields, the method further comprising:\nidentifying a subset of the data fields in the first dataset as satisfying a predetermined criterion for relevance to the selected ML model;\nwherein generating the graphical user interface comprises:\nproviding a plurality of user input fields to receive user input specifying fields to use in training the ML model; and\nindicating to the user the subset of the data fields in the first dataset identified as satisfying the predetermined criterion for relevance, in relation to at least one of the user input fields.\n12. The method of claim 1, wherein the first dataset comprises a plurality of data fields, the method further comprising:\nidentifying a subset of the data fields in the first dataset as satisfying a predetermined criterion for relevance to the selected ML model;\nreceiving user inputs at the plurality of user input fields, the user inputs indicating user selections of data fields in the first dataset that are to be used to train the ML model; and\ntraining the ML on the first dataset based on the user selections.\n13. The method of claim 1, wherein the first dataset comprises a plurality of data fields, the method further comprising:\nidentifying a subset of the data fields in the first dataset as satisfying a predetermined criterion for relevance to the selected ML model; and\nwherein identifying the subset of the data fields in the first dataset as satisfying the predetermined criterion for relevance to the selected ML model comprises executing a heuristic or a statistical method on the data fields in the first dataset to identify the subset of data fields.\n14. The method of claim 1, wherein the first dataset comprises a plurality of data fields, the method further comprising:\nidentifying a subset of the data fields in the first dataset as satisfying a predetermined criterion for relevance to the selected ML model, by:\nidentifying a type of data upon which the selected ML model is designed to operate; and\nidentifying fields in the first dataset that are of said type, as the subset of the data fields in the first dataset.\n15. The method of claim 1, wherein the first dataset includes a plurality of existing data fields, each having one or more corresponding data values;\nthe method further comprising:\napplying a transformation to data values of a plurality of data fields of the first dataset, to produce new data values;\ntraining the selected ML model based on the transformed data values; and\nidentifying a data field to suggest to the user, for possible selection by the user, based on a result of the training the selected ML model in relation to a predetermined quality criterion.\n16. The method of claim 1, wherein the first dataset includes a plurality of existing data fields, each having one or more corresponding data values;\nthe method further comprising:\napplying a transformation to the data values of at least one of the existing data fields of the first dataset, to produce a plurality of new data values associated with at least one new data field;\ntraining the selected ML model based on the new data values; and\nidentifying one of the existing data fields, for possible selection by the user, based on a result of the training the selected ML model;\nindicating the identified existing data field to the user as the suggested data field.\n17. The method of claim 1, wherein the first dataset includes a plurality of existing data fields, each having one or more corresponding data values;\nthe method further comprising:\napplying a transformation to the data values of at least one of the existing data fields of the first dataset, to produce a plurality of new data values associated with at least one new data field;\ntraining the selected ML model based on the new data values; and\nidentifying one of the new data fields to suggest to the user, for possible selection by the user, based on a result of the training the selected ML model;\nindicating the identified new data field to the user as the suggested data field.\n18. The method of claim 1, further comprising:\nstoring a plurality of query templates, each corresponding to a different one of a plurality of types of data analysis.\n19. The method of claim 1, further comprising:\nstoring a plurality of query templates, each corresponding to a different one of a plurality of types of data analysis;\nwherein each of the query templates corresponds to a different type of data analysis, selectable by the user, for application to the result of training the ML model.\n20. The method of claim 1, further comprising:\nstoring a plurality of query templates, each corresponding to a different one of a plurality of types of data analysis;\nreceiving, via the graphical user interface, first user inputs directed to a plurality of user input fields, the first user inputs identifying metadata of the first dataset;\nreceiving, via the graphical user interface, a user-initiated request to invoke training of the ML model using the identified metadata; and\ngenerating a plurality of analysis queries related to the first dataset, by combining the metadata of the first dataset with each of the query templates, wherein each of the analysis queries can be executed to perform a different data analysis on the result of training the ML model on the first dataset.\n21. The method of claim 1, further comprising:\nstoring a plurality of query templates, each corresponding to a different one of a plurality of types of data analysis;\nreceiving, via the graphical user interface, first user inputs directed to a plurality of user input fields, the first user inputs identifying metadata of the first dataset;\nreceiving, via the graphical user interface, a user-initiated request to invoke training of the ML model using the identified metadata; and\ngenerating a plurality of analysis queries related to the first dataset automatically in response to the user-initiated request to invoke training of the ML model, by combining the metadata of the first dataset with each of the query templates, wherein each of the analysis queries can be executed to perform a different data analysis on the result of training the ML model on the first dataset.\n22. The method of claim 1, further comprising:\nstoring a plurality of query templates, each corresponding to a different one of a plurality of types of data analysis;\nreceiving, via the graphical user interface, first user inputs directed to a plurality of user input fields, the first user inputs specifying data fields in the first dataset;\nreceiving, via the graphical user interface, a user-initiated request to invoke training of the ML model using the specified data fields; and\ngenerating a plurality of analysis queries related to the first dataset, by combining the specified data fields of the first dataset with each of the query templates, wherein each of the analysis queries can be executed to perform a different data analysis on the result of training the ML model on the first dataset.\n23. The method of claim 1, further comprising:\nstoring a plurality of query templates, each corresponding to a different one of a plurality of types of data analysis, each of the query templates including a plurality of variables;\nreceiving, via the graphical user interface, first user inputs directed to a plurality of user input fields, the first user inputs specifying data fields in the first dataset;\nreceiving, via the graphical user interface, a user-initiated request to invoke training of the ML model using the specified data fields; and\ngenerating a plurality of analysis queries related to the first dataset, by replacing the variables in each of the query templates with appropriate ones of the data fields specified by the first user inputs, wherein each of the analysis queries can be executed to perform a different data analysis on the result of training the ML model on the first dataset.\n24. The method of claim 1, further comprising:\nstoring a plurality of query templates, each corresponding to a different one of a plurality of analysis types;\nreceiving, via the graphical user interface, first user inputs directed to a plurality of user input fields, the first user inputs identifying metadata of the first dataset;\nreceiving, via the graphical user interface, a user-initiated request to invoke training of the ML model using the identified metadata; and\ngenerating a plurality of analysis queries related to the first dataset, by combining the metadata of the first dataset with each of the query templates, wherein each of the analysis queries can be executed to perform a different analysis on the result of training the ML model on the first dataset;\ndisplaying, in the graphical user interface, a plurality of analysis identifiers, each associated with a different one of the analysis queries;\nreceiving second user input selecting one of the analysis identifiers;\nin response to the second user input, executing the analysis query corresponding to the selected analysis identifier to perform a corresponding data analysis; and\ndisplaying to the user, via the graphical user interface, a result of executing the analysis query.\n25. The method of claim 1, further comprising:\nstoring a plurality of query templates, each corresponding to a different one of a plurality of analysis types, each of the query templates including a plurality of variables;\nreceiving, via the graphical user interface, first user inputs directed to a plurality of user input fields, the first user inputs identifying metadata of the first dataset;\nreceiving, via the graphical user interface, a user-initiated request to invoke training of the ML model using the identified metadata;\ngenerating a plurality of analysis queries related to the first dataset, by replacing the variables in each of the query templates with appropriate ones of data fields specified by the first user inputs, wherein each of the analysis queries can be executed to perform a different analysis on the result of training the ML model on the first dataset;\ndisplaying, in the graphical user interface, a plurality of analysis identifiers, each associated with a different one of the analysis queries;\nreceiving second user input selecting one of the analysis identifiers;\nin response to the second user input, executing the analysis query corresponding to the selected analysis identifier; and\ndisplaying to the user, via the graphical user interface, a result of executing the analysis query.\n26. The method of claim 1, wherein generating the graphical user interface comprises:\nproviding a plurality of user input fields to receive user inputs that specify at least one of:\nparticular data fields for training the selected ML model on the first dataset; or\nparticular data fields for applying the selected ML model to a second dataset; and\nidentifying data fields that satisfy a predetermined criterion for relevance to the selected ML model, for selection by the user; and\nindicating to the user the identified data fields that satisfy the predetermined criterion for relevance to the selected ML model, for possible selection by the user in the user input fields;\nthe method further comprising:\nstoring a plurality of query templates, each corresponding to a different one of a plurality of analysis types, wherein each of the query templates corresponds to a different type of analysis, selectable by the user, for application to the result of training the ML model;\nreceiving, via the graphical user interface, the user inputs directed to the user input fields, the user inputs specifying metadata of the first dataset;\nreceiving, via the graphical user interface, a user-initiated request to invoke training of the ML model using the identified data fields; and\ngenerating a plurality of analysis queries related to the first dataset in response to the user-initiated request to invoke training of the ML model, by combining the metadata of the first dataset with each of the query templates, wherein each of the analysis queries can be executed to perform a different analysis on the result of training the ML model on the first dataset.\n27. The method of claim 1, further comprising:\nacquiring machine data from a plurality of machine data sources;\nparsing the acquired machine data into a plurality of machine data events;\nassociating a timestamp for each of the machine data events to produce timestamped machine data events; and\nusing an indexer to index the timestamped machine data events.\n28. The method of claim 1, further comprising:\nacquiring machine data from a plurality of machine data sources;\nparsing the acquired machine data into a plurality of machine data events;\nassociating a timestamp for each of the machine data events to produce timestamped machine data events;\nusing an indexer to index the timestamped machine data events;\nretrieving at least a subset of the timestamped machine data events from the data store in response to a search query specified by the user through the graphical user interface; and\ndisplaying the retrieved at least a subset of the timestamped machine data events to the user via the graphical user interface.\n29. A computer system comprising:\na communication device through which to communicate on a computer network; and\nat least one processor operatively coupled to the communication device and configured to execute operations including\ngenerating a graphical user interface that enables a user of a processing device to:\nindicate a machine learning (ML) model to be trained,\nspecify a first dataset of timestamped machine data events;\ninvoke training of the ML model based on the first dataset, such that a result of the training is a trained ML model, and\ninvoke application of the trained ML model to a second dataset of timestamped machine data events; and\ncausing generation, based on the first dataset, of an indication to the user, of\na suggested data field of the first dataset upon which to base training of the ML model, and\na suggested type of ML analysis to apply.\n30. A non-transitory machine-readable storage medium for use in a processing system, the non-transitory machine-readable storage medium storing instructions, an execution of which in the processing system causes the processing system to perform operations comprising:\ngenerating a graphical user interface that enables a user of a processing device to:\nindicate a machine learning (ML) model to be trained,\nspecify a first dataset of timestamped machine data events;\ninvoke training of the ML model based on the first dataset, such that a result of the training is a trained ML model, and\ninvoke application of the trained ML model to a second dataset of timestamped machine data events; and\ncausing generation, based on the first dataset, of an indication to the user, of\na suggested data field of the first dataset upon which to base training of the ML model, and\na suggested type of ML analysis to apply."
}