{
    "patent_link": "https://patents.google.com/patent/US6327274B1/en",
    "patent_id": "US6327274B1",
    "title": "Method for estimating relative skew between clocks in packet networks",
    "abstract": "A method, a system, and an article of manufacture for measuring a relative skew between clocks in a packet based communication network. The method utilizes the timestamps available in packets sent from a sender to a receiver, as well as the times at which the receiver receives such packets. Such timestamps can be incorporated in packets, or in a separate protocol.",
    "inventors": [
        "Rayadurgam Ravikanth"
    ],
    "assignee": "Nokia Oyj",
    "classifications": [],
    "claims": "\n1. A method for determining a clock skew between at least a first and second clocks in a network, comprising:\n2. The method of claim 1, wherein the network is a packet based communication network.\n3. The method of claim 1, wherein time recordings by the first and second clocks are relative to a global clock.\n4. A system of determining a clock skew between at least a first and second clocks in a network, comprising:\n5. The system of claim 4, wherein the network is a packet based communication network.\n6. The system of claim 4, wherein the time recordings by the first and second clocks are relative to a global clock.\n7. An article of manufacture for a computer-based data processing system, the article of manufacture comprising a computer readable medium having instructions for causing a computer to perform a method for determining a clock skew between at least a first and second clocks in a network, comprising:\n8. The article of claim 7, wherein the network is a packet based communication network.\n9. The article of manufacture of claim 7, wherein time recordings by the first and second clocks are relative to a global clock.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US5602992A",
        "US5822381A",
        "US5918040A",
        "US5966387A",
        "US5991307A",
        "US6073246A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20010030978A1",
        "US20010046289A1",
        "US20020120416A1",
        "US6477659B1",
        "US20020176525A1",
        "US20030018442A1",
        "US6574244B1",
        "US6598172B1",
        "US20030200338A1",
        "US6661811B1",
        "US6661810B1",
        "US6687752B1",
        "US20040062278A1",
        "US20040139375A1",
        "US20040153315A1",
        "US20040162684A1",
        "US6859460B1",
        "US20050265500A1",
        "US20050271071A1",
        "US7012982B1",
        "US20060059270A1",
        "US20060056403A1",
        "US7085268B2",
        "US20070116057A1",
        "US20070297459A1",
        "US20080270800A1",
        "US7448061B2",
        "US20090003379A1",
        "US20090041020A1",
        "JP2009150872A",
        "US20090307610A1",
        "US20100027567A1",
        "US7864816B1",
        "US20110044203A1",
        "US7948906B1",
        "US20130120652A1",
        "US20130173950A1",
        "WO2014037684A1",
        "WO2014037685A1",
        "US8719452B1",
        "US8873589B2",
        "US8959381B2",
        "US20150109953A1",
        "US9602366B1",
        "US10142088B2"
    ],
    "citedby_ftf": [
        "SE0004839D0",
        "GB2394628B",
        "GB2399263A",
        "US7415044B2",
        "US7970020B2",
        "FI122945B"
    ]
}