{
    "patent_id": "US-11593416-B2",
    "title": "System and method for automated multi-dimensional network management ",
    "assignee": "Mammoth Medical, Llc",
    "publication_date": "2023-02-28",
    "patent_link": "https://patents.google.com/patent/US11593416B2/en",
    "inventors": [
        "Tobias Moeller-Bertram",
        "Christopher A. McDonald"
    ],
    "classifications": [
        "G06F16/337",
        "A61B5/4848",
        "A61B5/7264",
        "G06F15/76",
        "G06F18/2113",
        "G06F18/213",
        "G06F9/30036",
        "G06K9/623",
        "G06K9/6232",
        "G06N20/00",
        "G06N5/022",
        "H04L41/16",
        "H04L41/5054",
        "H04L63/1433",
        "A61B5/0022",
        "A61B5/022",
        "H04L67/02",
        "H04L67/306",
        "H04L67/52",
        "H04L67/535"
    ],
    "abstract": "Systems, methods, and devices for automated provisioning are disclosed herein. The system can include a memory including a user profile database having n-dimension attributes of a user. The system can include a user device and a source device. The system can include a server that can: generate and store a user profile in the user profile database and generate and store a characterization vector from the user profile. The server can identify a service for provisioning, receive updates to at least some of the attributes of the first user, and trigger regeneration of the characterization vector from the received inputs. The server can: regenerate the characterization vector, determine an efficacy of the provisioned services, and automatically identify a second service for provisioning for a second user based on the efficacy of the provisioned services to the first user.",
    "claims": "\n1. A method for automated characterization-vector based prediction, the method comprising:\ngenerating at a first time a characterization vector from n-dimension attributes of a first patient identified in a patient profile, the characterization vector characterizing a first patient state;\nidentifying a data insufficiency based on missing data in an electronic health records (EHR) database, wherein the data insufficiency prevents at least one of: complete determination of a current state of a first user; complete generation of a risk profile; or complete identification of a remediation;\nprovisioning a medical service corresponding to the missing data, the medical service selected to resolve the data insufficiency;\nreceiving from the provisioned medical service inputs indicating updates to at least one of the n-dimension attributes of the first patient;\ndetermining a resolution of the data insufficiency based on the received inputs;\nregenerating at a second time the characterization vector from the n-dimension attributes of the first patient with a first Artificial Intelligence (“AI”) machine-learning model, the regenerated characterization vector charcterizing a second patient state;\ngenerating a discrepancy vector characterizing a difference between the regenerated characterization vector and the characterization vector;\ndetermining an efficacy of the provisioned medical service based on the discrepancy vector; and\nautomatically identifying a second medical service for provisioning for a second patient based on the efficacy of the provisioned medical service to the first patient.\n2. The method of claim 1, wherein the medical service comprises a digital component and a non-digital component for provisioning to the first patient.\n3. The method of claim 2, further comprising automatically delivering the digital component of the medical service for provisioning.\n4. The method of claim 3, further comprising:\nreceiving a patient input from a patient device implemented with a processor and a medical provider input from a provider device implemented with a processor;\nidentifying a first portion of the patient input as a first variable and a second portion of the patient input as a second variable; and\ngenerating and storing the patient profile in a user profile database, wherein the patient profile identifies n-dimension attributes of a first patient.\n5. The method of claim 4, wherein the digital component of the medical service for provisioning is automatically delivered subsequent to automated determination of fulfillment of at least one delivery criteria.\n6. The method of claim 5, wherein the determination of fulfillment of the at least one delivery criteria is made based on data contained in a data stream received from a messaging bus, wherein the data contained in the data stream corresponds to the second variable.\n7. The method of claim 6, further comprising:\nupon determining resolution of the data insufficiency, identifying a second medical service comprising a second remediation to mitigate a likelihood of an adverse outcome; and\nproviding the second medical service to the first patient via the patient device.\n8. The method of claim 7, further comprising:\nidentifying a first remediation to mitigate the likelihood of an adverse medical outcome identified based on the first patient state of the first patient in the patient profile, wherein the remediation is identified from a multi-dimensional network comprising a plurality of nodes linked by a plurality of edges, at least some of the nodes corresponding to a user state, a user characteristic, and a remediation, and\nwherein the data insufficiency prevents identification of the first remediation.\n9. The method of claim 1, wherein the first patient state comprises at least one of: a physical state; and a mental state.\n10. An automated multi-dimensional network management system comprising:\na memory comprising: an electronic health records (EHR) database comprising a plurality of patient profiles; and a network database comprising a plurality of nodes linked by a plurality of edges, at least some of the nodes corresponding to a user state, and a user characteristic; and\nat least one processor configured to:\ngenerate at a first time a characterization vector from n-dimension attributes of a first patient identified in a patient profile, the characterization vector characterizing a first patient state;\nidentify a data insufficiency based on missing data in an electronic health records (EHR) database, wherein the data insufficiency prevents at least one of: complete determination of a current state of a first user; complete generation of a risk profile; or complete identification of a remediation;\nprovision a medical service corresponding to the missing data, the medical service selected to resolve the data insufficiency;\nreceive from the provisioned medical service inputs indicating updates to at least one of the n-dimension attributes of the first patient;\ndetermine a resolution of the data insufficiency based on the received inputs;\nregenerate at a second time the characterization vector from the n-dimension attributes of the first patient with a first Artificial Intelligence (“AI”) machine-learning model, the regenerated characterization vector charcterizing a second patient state;\ngenerate a discrepancy vector characterizing a difference between the regenerated characterization vector and the characterization vector;\ndetermine an efficacy of the provisioned medical service based on the discrepancy vector; and\nautomatically identify a second medical service for provisioning for a second patient based on the efficacy of the provisioned medical service to the first patient.\n11. The system of claim 10, wherein the medical service comprises a digital component and a non-digital component for provisioning to the first patient.\n12. The system of claim 11, wherein the at least one processor is further configured to automatically deliver the digital component of the medical service for provisioning.\n13. The system of claim 12, wherein the at least one processor is further configured to:\nreceive a patient input from a patient device implemented and a medical provider input from a provider device;\nidentify a first portion of the patient input as a first variable and a second portion of the patient input as a second variable; and\ngenerate and store the patient profile in a user profile database, wherein the patient profile identifies n-dimension attributes of a first patient.\n14. The system of claim 13, wherein the digital component of the medical service for provisioning is automatically delivered subsequent to automated determination of fulfillment of at least one delivery criteria.\n15. The system of claim 14, wherein the determination of fulfillment of the at least one delivery criteria is made based on data contained in a data stream received from a messaging bus, wherein the data contained in the data stream corresponds to the second variable.\n16. The system of claim 15, wherein the processor is further configured to:\nupon determining resolution of the data insufficiency, identify a second medical service comprising a second remediation to mitigate a likelihood of an adverse outcome; and\nprovide the second medical service to the first patient via the patient device.\n17. The system of claim 16, wherein the processor is further configured to:\nidentify a first remediation to mitigate a likelihood of an adverse medical outcome identified based on the first patient state of the first patient in the patient profile, wherein the remediation is identified from the network database, and\nwherein the data insufficiency prevents identification of the first remediation.\n18. The system of claim 17, wherein the first patient state comprises at least one of: a physical state; and a mental state.",
    "status": "Active",
    "citations_own": [
        "US20030174122A1",
        "US20060154642A1",
        "US20070094188A1",
        "US20070118399A1",
        "US20070203996A1",
        "US20100030418A1",
        "US7689682B1",
        "US7925519B2",
        "US20120078062A1",
        "US20130018954A1",
        "US8504386B2",
        "US8612251B2",
        "US20140095201A1",
        "US20140164017A1",
        "US8781859B2",
        "US8799023B2",
        "US20150112710A1",
        "US20150356250A1",
        "US20160063212A1",
        "US20160117484A1",
        "US9501624B2",
        "US20160350721A1",
        "US20170030898A1",
        "US20170103181A1",
        "US20170132367A1",
        "US20170169715A1",
        "US20170199189A1",
        "US20170262445A1",
        "US9800506B2",
        "US20170308981A1",
        "US20170315825A1",
        "US9886547B2",
        "US9898513B2",
        "US9977867B2",
        "US20190005194A1",
        "US10353937B2",
        "US20210174800A1"
    ],
    "citations_ftf": [
        "US8976929B2",
        "WO2014205128A1",
        "WO2016144914A1",
        "JP7182554B2",
        "US20200066412A1"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US10678244B2",
        "US10353937B2",
        "US11157441B2",
        "US11409692B2",
        "US10671349B2",
        "US11614952B2",
        "US11138568B2",
        "US10733668B2",
        "US11561791B2",
        "US11215999B2",
        "US11636333B2",
        "US11562231B2",
        "US11196678B2",
        "US10275331B1",
        "US10282248B1",
        "US11537811B2",
        "US11610117B2",
        "US10997461B2",
        "US11567514B2",
        "US10956755B2",
        "US11115268B2",
        "US11568351B2",
        "WO2020257356A2",
        "US11537997B2",
        "US20210043292A1",
        "US11089112B2",
        "US10686645B1",
        "US10866872B1",
        "US11797820B2",
        "US11748128B2",
        "US11012326B1",
        "US10877867B1",
        "US11501386B2",
        "US11108844B1",
        "US20220148172A1",
        "US20220199212A1",
        "CN113254241B"
    ]
}