{
    "patent_id": "US-11635995-B2",
    "title": "Systems and methods for orchestrating microservice containers interconnected via a service mesh in a multi-cloud environment based on a reinforcement learning policy ",
    "assignee": "Cisco Technology, Inc.",
    "publication_date": "2023-04-25",
    "patent_link": "https://patents.google.com/patent/US11635995B2/en",
    "inventors": [
        "Rohit Bahl",
        "Paul Clyde Sherrill",
        "Stephen Joseph Williams"
    ],
    "classifications": [
        "G06F9/5072",
        "G06F9/3877",
        "H04L67/1031",
        "H04L67/1036",
        "H04L67/34",
        "G06F9/45558",
        "G06N20/00",
        "G06N3/006",
        "G06N7/01"
    ],
    "abstract": "A multi-cloud service mesh orchestration platform can receive a request to deploy an application as a service mesh application. The platform can tag the application with governance information (e.g., TCO, SLA, provisioning, deployment, and operational criteria). The platform can partition the application into its constituent components, and tag each component with individual governance information. For first time steps, the platform can select and perform a first set of actions for deploying each component to obtain individual rewards, state transitions, and expected returns. The platform can determine a reinforcement learning policy for each component that maximizes a total reward for the application based on the individual rewards, state transitions, and expected returns of each first set of actions selected and performed for each component. For second time steps, the platform can select and perform a second set of actions for each component based on the reinforcement learning policy for the component.",
    "claims": "\n1. A computer-implemented method performed by a multi-cloud service mesh orchestration platform, the method comprising:\nreceiving a request to deploy an application as a service mesh application;\ninstantiating the service mesh application in response to the request;\ntagging the service mesh application with governance information including criteria governing how to provision computing resources from multiple Cloud Service Provider (CSP) networks for deploying and operating the service mesh application;\npartitioning the service mesh application into constituent microservice containers, wherein each respective microservice container includes a computing environment;\ntagging each microservice container with individual governance information derived from the governance information for the service mesh application;\ndetermining configuration information for sidecar proxies, wherein the sidecar proxies control routing between the constituent microservice containers based at least in part on the respective individual governance information of the respective microservice container;\nfor each time step within a first time period, selecting and performing a first set of actions for deploying each microservice container using a reserved computing instance of a first CSP network of the multiple CSP networks to obtain one or more individual rewards, state transitions, and expected returns, wherein at the first time period the reserved computing instance meets one or more criteria of the governance information better than an unreserved computing instance;\ndetermining a reinforcement learning policy for each microservice container that maximizes a total reward for the service mesh application based on the one or more individual rewards, state transitions, and expected returns of each first set of actions selected and performed for each microservice container for each time step within the first time period; and\nfor each time step within a second time period, selecting and performing a second set of actions for each microservice container based on the reinforcement learning policy for the microservice container that maximize the total reward, wherein at least one of the second set of actions migrates a microservice container of the constituent microservice containers to the unreserved computing instance of a second CSP network of the multiple CSP networks when the unreserved computing instance meets the one or more criteria of the governance information better than the reserved computing instance.\n2. The computer-implemented method of claim 1, further comprising:\nobtaining one or more second individual rewards, state transitions, and expected returns of each second set of actions selected and performed for each microservice container for each time step within the second time period;\ndetermining an updated reinforcement learning policy that maximizes the total reward for the service mesh application based on the one or more second individual rewards, state transitions, and expected returns of each second set of actions selected and performed for each microservice container for each time step within the second time period; and\nfor each time step within a third time period, selecting and performing a third set of actions for each microservice container based on the updated reinforcement learning policy for the microservice container.\n3. The computer-implemented method of claim 1, wherein the second set of actions includes terminating or hibernating the reserved compute instance when the second set of actions includes migrating the microservice container using the unreserved compute instance.\n4. The computer-implemented method of claim 1, wherein the reserved compute instance and the unreserved compute instance are located within a same CSP network.\n5. The computer-implemented method of claim 1, further comprising:\ndeploying a first microservice container of the service mesh application using a first compute instance provisioned from the first CSP network and a second microservice container of the service mesh application using a second compute instance provisioned from the second CSP network.\n6. The computer-implemented method of claim 1, further comprising:\ndeploying a first instance of a first microservice container of the service mesh application using a first compute instance provisioned from the first CSP network and a second instance of the first microservice container using a second compute instance provisioned from the second CSP network.\n7. The computer-implemented method of claim 1, wherein the governance information includes criteria to minimize a Total Cost of Ownership (TCO) for the service mesh application.\n8. The computer-implemented method of claim 1, wherein the governance information includes criteria to maximize one or more performance metrics or a capacity of the service mesh application.\n9. The computer-implemented method of claim 1, wherein the governance information includes criteria to maintain specified load levels across the multiple CSP networks.\n10. A multi-cloud service mesh orchestration platform system, comprising:\none or more processors; and\nmemory including instructions that, when executed by the one or more processors, cause the multi-cloud service mesh orchestration platform system to:\nreceive a request to deploy an application as a service mesh application;\ninstantiate the service mesh application in response to the request;\ntag the service mesh application with governance information including criteria governing how to provision computing resources from multiple Cloud Service Provider (CSP) networks for deploying and operating the service mesh application;\npartition the service mesh application into constituent microservice containers wherein each respective microservice container includes a computing environment; tag each microservice container with individual governance information derived from the governance information for the service mesh application;\ndetermining configuration information for sidecar proxies, wherein the sidecar proxies control routing between the constituent microservice containers based at least in part on the respective individual governance information of the respective microservice container;\nfor each time step within a first time period, select and perform a first set of actions for deploying each microservice container using a reserved computing instance of a first CSP network of the multiple CSP networks to obtain one or more individual rewards, state transitions, and expected returns, wherein at the first time period the reserved computing instance meets one or more criteria of the governance information better than an unreserved computing instance;\ndetermine a reinforcement learning policy for each microservice container that maximizes a total reward for the service mesh application based on the one or more individual rewards, state transitions, and expected returns of each first set of actions selected and performed for each microservice container for each time step within the first time period; and\nfor each time step within a second time period, select and perform a second set of actions for each microservice container based on the reinforcement learning policy for the microservice container that maximize the total reward, wherein at least one of the second set of actions migrates a microservice container of the constituent microservice containers to the unreserved computing instance of a second CSP network of the multiple CSP networks when the unreserved computing instance meets the one or more criteria of the governance information better than the reserved computing instance.\n11. The multi-cloud service mesh orchestration platform system of claim 10, further comprising further instructions that, when executed by the one or more processors, further cause the system to:\nobtain one or more second individual rewards, state transitions, and expected returns of each second set of actions selected and performed for each microservice container for each time step within the second time period;\ndetermine an updated reinforcement learning policy that maximizes the total reward for the service mesh application based on the one or more second individual rewards, state transitions, and expected returns of each second set of actions selected and performed for each microservice container for each time step within the second time period; and\nfor each time step within a third time period, select and perform a third set of actions for each microservice container based on the updated reinforcement learning policy for the microservice container.\n12. The multi-cloud service mesh orchestration platform system of claim 11, further comprising further instructions that, when executed by the one or more processors, further cause the system to:\nterminate or hibernate the reserved compute instance when the second set of actions includes migrating the microservice container using the unreserved compute instance.\n13. The multi-cloud service mesh orchestration platform system of claim 10, wherein the reserved compute instance and the unreserved compute instance are located within a same CSP network.\n14. A non-transitory computer-readable storage medium including instructions that, upon being executed by one or more processors of a multi-cloud service mesh orchestration platform system, cause the multi-cloud service mesh orchestration platform system to:\nreceive a request to deploy an application as a service mesh application;\ninstantiate the service mesh application in response to the request;\ntag the service mesh application with governance information including criteria governing how to provision computing resources from multiple Cloud Service Provider (CSP) networks for the service mesh application;\npartition the service mesh application into constituent microservice containers wherein each respective microservice container includes a computing environment;\ntag each microservice container with individual governance information derived from the governance information for the service mesh application;\ndetermining configuration information for sidecar proxies, wherein the sidecar proxies control routing between the constituent microservice containers based at least in part on the respective individual governance information of the respective microservice container;\nfor each time step within a first time period, select and perform a first set of action for deploying each microservice container using a reserved computing instance of a first CSP network of the multiple CSP networks to obtain one or more individual rewards, state transitions, and expected returns, wherein at the first time period the reserved computing instance meets one or more criteria of the governance information better than an unreserved computing instance;\ndetermine a reinforcement learning policy for each microservice container that maximizes a total reward for the service mesh application based on the one or more individual rewards, state transitions, and expected returns of each first set of actions selected and performed for each microservice container for each time step within the first time period; and\nfor each time step within a second time period, select and perform a second set of actions for each microservice container based on the reinforcement learning policy for the microservice container that maximize the total reward, wherein at least one of the second set of actions migrates a microservice container of the constituent microservice containers to the unreserved computing instance of a second CSP network of the multiple CSP networks when the unreserved computing instance meets the one or more criteria of the governance information better than the reserved computing instance.\n15. The non-transitory computer-readable storage medium of claim 14, further comprising further instructions that, when executed by the one or more processors, further cause the multi-cloud service mesh orchestration platform system to:\ndeploy a first microservice container of the service mesh application using a first compute instance provisioned from the first CSP network and a second microservice container of the service mesh application using a second compute instance provisioned from the second CSP network.\n16. The non-transitory computer-readable storage medium of claim 14, further comprising further instructions that, when executed by the one or more processors, further cause the multi-cloud service mesh orchestration platform system to:\ndeploy a first instance of a first microservice container of the service mesh application using a first compute instance provisioned from the first CSP network and a second instance of the first microservice container using a second compute instance provisioned from the second CSP network.\n17. The non-transitory computer-readable storage medium of claim 14, wherein the governance information includes criteria to minimize a Total Cost of Ownership (TCO) for the service mesh application.\n18. The non-transitory computer-readable storage medium of claim 14, wherein the governance information includes criteria to maximize one or more performance metrics or a capacity of the service mesh application.",
    "status": "Active",
    "citations_own": [
        "US9015324B2",
        "US20150215173A1",
        "US20160087885A1",
        "US20160219101A1",
        "US20170031955A1",
        "US20180019948A1",
        "US10027768B2",
        "US10057139B2",
        "WO2019025944A1",
        "US20190245757A1",
        "US20190356693A1",
        "US20200125545A1",
        "US20200249998A1",
        "US20200404076A1",
        "US20210255251A1",
        "US11134013B1",
        "US11457080B1"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "US11582291B2",
        "US11422859B2",
        "US11444925B1",
        "US11240345B2",
        "US11373108B2",
        "US11528194B2",
        "US11740884B2",
        "US11153375B2",
        "EP3832464A1",
        "US11323512B2",
        "US11733986B2",
        "US11722356B2",
        "US11630685B2",
        "JP7241713B2",
        "US20210349764A1",
        "US11595350B2",
        "US11595306B2",
        "US11429464B2",
        "US11757982B2",
        "US11019023B1",
        "US11212344B1",
        "US11799859B2",
        "US11405451B2",
        "US11570110B2",
        "US20220150317A1",
        "US11196665B1",
        "US20220158980A1",
        "EP4272397A1",
        "EP4044496A1",
        "US20220278927A1",
        "US20220279420A1",
        "US11579945B2",
        "CN112988223B",
        "WO2022235651A1",
        "US11797282B2",
        "US11349727B1",
        "US20220385488A1",
        "US11689505B2",
        "US20230028922A1",
        "US11755301B2",
        "EP4141664A1",
        "US20230073891A1",
        "WO2023048609A1",
        "US11601393B1",
        "CN114205280B",
        "US11606245B1",
        "CN114338504B",
        "CN114756357B",
        "US11645105B1",
        "CN116192863A"
    ]
}