{
    "patent_link": "https://patents.google.com/patent/US20020118869A1/en",
    "patent_id": "US20020118869A1",
    "title": "Method and apparatus for displaying images of tubular structures",
    "abstract": "A method and an apparatus for displaying a structure of a vessel are disclosed. In one embodiment, the method includes identifying a centerline of the vessel within a portion of the vessel that includes the structure, identifying a contour of the vessel within a cross-sectional plane that is normal to a selected point along the centerline, measuring lengths of a plurality of segments that pass across the contour through the selected point, selecting one of the plurality of segments, and displaying an imaging plane defined by the selected one segment and an axis that is tangent to the centerline at the point. In another embodiment, the method includes determining a centerline of a tubular structure, selecting a section of the centerline, determining a plane that minimizes the distance to the selected section, and displaying the plane.",
    "inventors": [
        "Jerome Knoplioch",
        "Fabienne Betting",
        "Gilles Moris"
    ],
    "assignee": "GE Medical Systems Global Technology Co LLC",
    "classifications": [
        "G06T19/00",
        "G06T7/60",
        "G06T2219/008",
        "Y10S600/92"
    ],
    "claims": "\n1. A method of displaying a structure of a vessel, the method comprising:\nidentifying a centerline of the vessel within at least a portion of the vessel that includes the structure;\nidentifying a contour of the vessel within a cross-sectional plane that is normal to a selected point along the centerline;\nmeasuring lengths of a plurality of segments that pass across the contour through the selected point;\nselecting one of the plurality of segments; and\nat least one of\ndisplaying at least a part of an imaging plane defined by the selected one segment and an axis that is tangent to the centerline at the point, wherein the imaging plane shows the structure of the vessel, and\nperforming an image acquisition in relation to the imaging plane.\n2. The method of claim 1, wherein the performing of the image acquisition includes performing at least one of an x-ray acquisition using a perpendicular to the imaging plane as a line of sight and the selected point as a target, and an MR acquisition.\n3. The method of claim 2, wherein the performing of the MR acquisition includes performing a slice acquisition wherein a slice location is included in at least one of the imaging plane and another plane that is translated from the imaging plane.\n4. The method of claim 1, wherein the structure is one of a stenosis and an aneurysm, and the vessel is at least one of a blood vessel, a lymph vessel, an airway and a duct.\n5. The method of claim 4 wherein, when the structure is a stenosis, the selected one segment is a shortest segment of the plurality of segments and, when the structure is an aneurysm, the selected one segment is a longest segment of the plurality of segments.\n6. The method of claim 1, wherein the centerline is identified by at least one of calculating the centerline from a plurality of centerline points specified by a user, and identifying the portion of the vessel and then determining its axes of inertia.\n7. The method of claim 1, wherein the centerline is identified by at least one of an automated method and a manual method, and wherein the plurality of segments vary from one another in their position by a selected angle.\n8. The method of claim 1, further comprising iteratively selecting the selected point, and repeatedly displaying imaging planes associated with the respective iteratively selected points.\n9. The method of claim 1, further comprising one of: saving at least a portion of one of the displayed imaging plane and the acquired image in a storage device; and printing at least a portion of one of the displayed imaging plane and the acquired image by way of a printing device.\n10. The method of claim 1, wherein the displaying of the at least one part of the imaging plane is the projection displaying of any part of a volume defined by the imaging plane a specified distance to the imaging plane.\n11. An apparatus for displaying a portion of a tubular vessel, the apparatus comprising:\nmeans for selecting at least one point along a centerline of the vessel proximate the portion;\nmeans for identifying an imaging plane based upon the selected at least one point; and\nat least one of means for displaying at least a part of the imaging plane, and means for acquiring an image in relation to the imaging plane.\n12. The apparatus of claim 11, wherein at least one of:\nthe selected at least one point includes a single point, and the means for identifying the imaging plane determines a local axis of the centerline that is tangent to the centerline at the single point, determines a cross-sectional plane that is perpendicular to the centerline at the single point, determines a contour of the vessel in the cross-sectional plane, determines a diameter segment passing across the contour and through the single point that best exhibits a particular characteristic, and identifies the imaging plane as a plane defined by the local axis and the diameter segment; and\nthe selected at least one point includes a plurality of points, and the means for identifying the imaging plane determines the imaging plane as the plane that most closely depicts a selected section determined by the plurality of points.\n13. The apparatus of claim 11, wherein the means for displaying is capable of displaying one of a portion of the imaging plane and a portion of a volume defined by the imaging plane and a specified distance perpendicular to the imaging plane, wherein when the portion of the volume is displayed, it is displayed in a projection display format; and\nwherein the means for acquiring is capable of performing one of an x-ray acquisition using a perpendicular to the imaging plane as a line of sight, and a slice acquisition using an MR system, wherein a slice location for the slice acquisition is included in at least one of the imaging plane and another plane that is translated from the imaging plane.\n14. A method of displaying a structure of a vessel, the method comprising:\ndetermining a centerline of a tubular structure;\nselecting a section of the centerline;\ndetermining a plane that minimizes the distance to the selected section; and\nat least one of\ndisplaying at least a part of the plane, and\nperforming an image acquisition in relation to the plane.\n15. The method of claim 14, wherein the displaying of the part of the plane is projection displaying of a volume defined by a surface, wherein a portion of the surface is a specified distance from the plane.\n16. The method of claim 15, further comprising saving at least a portion of one of the displayed imaging plane, the volume, and an acquired image in a storage device, and then repeating the selecting of a section, determining of a plane, and at least one of displaying and performing with respect to an additional section of the centerline.\n17. The method of claim 14, wherein the selecting of the section includes selecting a plurality of points along the centerline, wherein the plurality of points define a polygon and the section is defined as the segment of the centerline between a pair of endpoints of the plurality of points.\n18. The method of claim 17, wherein a least square distance method is employed to determine the plane that minimizes the distance to the selected section by determining the plane that minimizes the distances to the plurality of points.\n19. The method of claim 14, wherein at least one of an automated method and a manual method is employed to determine the centerline, and further comprising iteratively selecting center points of the section.\n20. The method of claim 14, wherein the performing of the image acquisition includes at least one of\nperforming an x-ray acquisition using a perpendicular to the plane as a line of sight and using a middle point of the selected section as a target; and\nperforming a slice acquisition using an MR system, wherein a slice location is included in at least one of the plane and another plane that is translated from the plane.",
    "status": "Expired - Lifetime",
    "citations_own": [],
    "citations_ftf": [
        "US5495852A",
        "US6151404A",
        "US6331116B1",
        "US5891030A",
        "JP4030660B2"
    ],
    "citedby_own": [
        "US20050277831A1",
        "WO2006126150A2",
        "US20070120845A1",
        "CN100343857C",
        "US20080094389A1",
        "US20080177186A1",
        "US20080253630A1",
        "US20090079738A1",
        "US20090086912A1",
        "US20090297010A1",
        "EP2157905A1",
        "US20100055657A1",
        "US20100067753A1",
        "US20110228997A1",
        "US20120051606A1",
        "US8135185B2",
        "US20120093278A1",
        "US20130266184A1",
        "CN103565455A",
        "RU2549141C2",
        "CN104766322A",
        "US20160022371A1",
        "DE102006055173B4",
        "US9706925B2",
        "JP2017176380A",
        "US9861337B2",
        "US10354050B2",
        "US10758212B2",
        "US11107587B2",
        "US11215711B2",
        "US11710309B2"
    ],
    "citedby_ftf": [
        "US7034831B2",
        "US6959104B2",
        "US6909801B2",
        "US6917710B2",
        "US6950552B2",
        "US7127100B2",
        "US8221322B2",
        "GB2391625A",
        "US7819806B2",
        "US8221321B2",
        "DE10233668A1",
        "US6905468B2",
        "US7471814B2",
        "US7170517B2",
        "JP3968003B2",
        "FR2848809B1",
        "US7639855B2",
        "WO2005011501A1",
        "US20060103678A1",
        "US7783097B2",
        "US7940970B2",
        "US7983459B2",
        "US7873194B2",
        "US7940977B2",
        "US7860283B2",
        "US11197651B2",
        "US10716528B2",
        "US11064964B2",
        "JP5639764B2",
        "US9629571B2",
        "US8542900B2",
        "WO2009153794A1",
        "WO2012176191A1",
        "US9375164B2",
        "US9968256B2",
        "US8167803B2",
        "JP4388104B2",
        "DE102008009190A1",
        "DE102008025535B4",
        "JP4671204B2",
        "JP5658151B2",
        "US10362962B2",
        "US9095313B2",
        "US9974509B2",
        "US8855744B2",
        "US9101286B2",
        "US9144394B2",
        "US11064903B2",
        "JP5399225B2",
        "DE102009006636B4",
        "DE102009006765B4",
        "DE102009032257B4",
        "EP2309450B1",
        "JP5931508B2",
        "EP2863802B1"
    ]
}