{
    "patent_link": "https://patents.google.com/patent/US4493021A/en",
    "patent_id": "US4493021A",
    "title": "Multicomputer communication system",
    "abstract": "A local area network is provided for a plurality of autonomous computers (10) which operate at different rates and under different protocols coupled by network bus adapters (12) to a global bus (14). A host computer (HC) divides a message file to be transmitted into blocks, each with a header that includes a data type identifier and a trailer. The associated network bus adapter (NBA) then divides the data into packets, each with a header to which a transport header and trailer is added with frame type code which specifies one of three modes of addressing in the transmission of data, namely a physical address mode for computer to computer transmission using two bytes for source and destination addresses, a logical address mode and a data type mode. In the logical address mode, one of the two addressing bytes contains a logical channel number (LCN) established between the transmitting and one or more receiving computers. In the data type mode, one of the addressing bytes contains a code identifying the type of data. Every NBA initialized to accept specified types of data will automatically accept all data of the types it is conditioned to accept. Protocol handling is carried out by a module in each NBA.",
    "inventors": [
        "Anil K. Agrawal",
        "Philip G. Mullen",
        "Vivatvong V. Vadakan"
    ],
    "assignee": "National Aeronautics and Space Administration NASA",
    "classifications": [
        "H04L12/18",
        "H04L69/00"
    ],
    "claims": "\n1. In apparatus for communication between a plurality of autonomous computers operated in a local area network using multimode addressing, each computer being connected to a single bus by a separate assigned network bus adapter, each adapter having a stored address code for each type of data it is to receive, each adapter comprising a data processing means programmed for carrying out all data handling and communication of its host computer with the bus, said processing means including means for data buffering, such that computers operating at different speeds in accordance with its protocol can send data to each other at their maximum speeds, an interface connecting said host computer to said processing means, protocol handling means connected to said data processing means for modifying the data handling protocol of the data being transmitted by said data processing means to a standard protocol and the data being received by said data processing means to the protocol of the host computer, means coupled to said protocol handling means for driving onto said bus data to be transmitted and for receiving data on said bus, and microprogrammed sequencing means for coordinating operation of said processing means, said protocol handling means and said transmitting and receiving means, whereby each adapter is a self-contained, autonomous unit for the protocol handling and network management of the data communications between any two or more computers wherein data transmitted is divided into packets by said processing means of the adapter assigned to the transmitting computer, an improvement comprising\nsaid processing means providing each packet with a first uniquely encoded field,\neach adapter provided with means responsive to said first uniquely encoded field for identifying the address code being used by each packet,\nsaid processing means providing each packet with a second uniquely encoded field\nsaid protocol handling means having means responsive to said second uniquely encoded field for identifying a mode selected from the group consisting of a first mode, a second mode and a third mode,\nsaid protocol handling means having means responsive to said first mode for identifying said second uniquely encoded field as a physical destination address code identifying one or more of the computers for an information frame specified by said first encoded field,\nsaid protocol handling means having means responsive to said second mode for identifying said second uniquely encoded field as a logical channel number, LCN, pre-established between two or more computers, and means responsive to said identification for establishing a logical channel number with said two or more computers and allowing communication therebetween without physical destination addressing,\nsaid two or more computers being able to communicate after establishment of said logical channel number using said logical channel number as an address to which said two or more computers respond without physical destination addressing for a broadcast of information to said two or more computers specified by said first encoded field,\nsaid protocol handling means having means responsive to said third mode for identifying said second uniquely encoded field as a data type identification code, and means responsive to said identification for permitting transmission of different types of data onto said bus without physical destination addresses and for permitting one or more computes to selectively receive data according to the type of data, thereby providing for a broadcast of data by type as specified by said first uniquely encoded field,\nwhereby data transmitted onto said bus is selectively accepted by different computers according to said first and second uniquely encoded field.\n2. Apparatus as defined in claim 1 including means for storing codes and means for decoding said second unique field by comparison of said second unique field with all stored codes simultaneously in search of a match.\n3. Apparatus as defined in claim 2 wherein said storing and decoding means is comprised of a content addressable memory addressed by said second uniquely encoded field.\n4. Apparatus as defined in claim 1 wherein said second uniquely encoded field is comprised of two bytes, and these two bytes specify a physical destination address and source address or a logical channel number.\n5. Apparatus as defined in claim 1 wherein said data processing means is comprised of two microprocessors, each with a local memory, and each sharing a common memory, one microprocessor being coupled to a host computer by said interface and the other microprocessor being coupled to said protocol handling means, said one microprocessor having means for receiving data from or transferring data to said host computer through said host interface at one rate, said other microprocessor receiving data from or transferring data to said network bus at a predetermined rate independent of said one rate through said protocol handling means, and said two microprocessors receiving data from or transferring data to one another through said common memory.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US3480914A",
        "US3699529A",
        "US4032899A",
        "US4038644A",
        "US4047162A",
        "US4063220A",
        "US4200930A",
        "US4219873A",
        "US4223380A",
        "US4228496A",
        "US4253144A",
        "US4271465A",
        "US4281380A",
        "US4335426A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4608689A",
        "US4646232A",
        "US4688170A",
        "US4709347A",
        "US4744023A",
        "US4750109A",
        "US4769771A",
        "US4771286A",
        "US4777591A",
        "US4787028A",
        "US4831518A",
        "EP0321203A2",
        "US4851997A",
        "US4858112A",
        "US4868738A",
        "US4882674A",
        "US4885689A",
        "US4896261A",
        "US4905145A",
        "US4916694A",
        "US4954966A",
        "US5003465A",
        "EP0420492A2",
        "US5023891A",
        "US5023780A",
        "US5025414A",
        "US5041963A",
        "US5046066A",
        "US5046041A",
        "US5077655A",
        "US5086426A",
        "US5101478A",
        "US5124943A",
        "US5129065A",
        "EP0512881A1",
        "US5165022A",
        "US5175817A",
        "US5206934A",
        "US5230067A",
        "US5237676A",
        "US5245703A",
        "US5251313A",
        "US5257384A",
        "US5265239A",
        "US5299314A",
        "US5303343A",
        "US5321840A",
        "US5363121A",
        "US5378067A",
        "EP0634879A2",
        "US5390316A",
        "WO1995006384A1",
        "US5452433A",
        "US5465331A",
        "US5471623A",
        "US5487152A",
        "US5533203A",
        "WO1996022641A2",
        "US5572572A",
        "US5586263A",
        "US5588122A",
        "US5590285A",
        "US5590313A",
        "WO1997033230A1",
        "US5699350A",
        "US5710889A",
        "US5774673A",
        "US5796832A",
        "US5802281A",
        "US5809263A",
        "US5815516A",
        "FR2766938A1",
        "US5870724A",
        "US5872919A",
        "US5943481A",
        "US5944804A",
        "US5987532A",
        "US5991520A",
        "US6098133A",
        "US6167471A",
        "US6233637B1",
        "US6240458B1",
        "US6239664B1",
        "US6289012B1",
        "US6292844B1",
        "US6304570B1",
        "US6310892B1",
        "US6389029B1",
        "US20020097720A1",
        "US6453438B1",
        "US6487620B1",
        "US6504851B1",
        "US6523108B1",
        "US20030046402A1",
        "US6556583B1",
        "US20030120664A1",
        "US6625652B1",
        "US6631435B1",
        "US20030223374A1",
        "DE10233436A1",
        "US20040054822A1",
        "US6721859B1",
        "US20040085984A1",
        "US20040093534A1",
        "US20040114567A1",
        "US20040264940A1",
        "US6847648B1",
        "US20050033938A1",
        "US6859846B2",
        "US6873627B1",
        "US6904475B1",
        "US20050184994A1",
        "US20050251298A1",
        "US20050259536A1",
        "US6993646B2",
        "US20060109794A1",
        "USRE39454E1",
        "US7191250B1",
        "US20070064492A1",
        "US20070140290A1",
        "US20070174452A1",
        "US20080002735A1",
        "US20090067450A1",
        "US20090177980A1",
        "US7577782B2",
        "US20090307517A1",
        "US20090309360A1",
        "US7720821B1",
        "US20120216242A1",
        "US8625427B1",
        "US9990505B2"
    ],
    "citedby_ftf": []
}