{
    "patent_id": "US-10839159-B2",
    "title": "Named entity normalization in a spoken dialog system ",
    "assignee": "Apple Inc.",
    "publication_date": "2020-11-17",
    "patent_link": "https://patents.google.com/patent/US10839159B2/en",
    "inventors": [
        "Xiao Yang",
        "Deepak MURALIDHARAN",
        "Justine KAO",
        "Lin Li",
        "Mubarak Ali SEYED IBRAHIM",
        "John G. KEESLING",
        "AtishKumar KOTHARI",
        "Yingjie ZHENG"
    ],
    "classifications": [
        "G10L15/22",
        "G06F16/909",
        "G06F40/295",
        "G06F40/30",
        "G06N20/00",
        "G06N3/006",
        "G06N3/08",
        "G06N5/022",
        "G06N5/048",
        "G06N7/01",
        "G10L15/1822",
        "H04L51/02",
        "G10L2015/225",
        "G10L2015/228"
    ],
    "abstract": "Systems and processes for processing natural language input are described. An example process for processing natural language input includes receiving a natural language input and determining a domain corresponding to the natural language input. The example process further includes, in accordance with determining the domain corresponding to the natural language input, determining, based on the natural language input, a first value for a first property of the domain and determining, based on a named entity model and the natural language input, a second value for the first property of the domain, where the second value defines a parameter for a task corresponding to the natural language input. The example process further includes performing the task based on the parameter and providing a result based on the performed task.",
    "claims": "\n1. A non-transitory computer-readable storage medium storing one or more programs, the one or more programs comprising instructions, which when executed by one or more processors of a first electronic device, cause the first electronic device to:\nreceive a natural language input;\ndetermine a domain corresponding to the natural language input;\nin accordance with determining the domain corresponding to the natural language input:\ndetermine, based on the natural language input, a first value for a first property of the domain;\ndetermine that the first value comprises an inaccurate representation of a named entity;\nin accordance with determining that the first value comprises the inaccurate representation of the named entity, determine, based on a named entity model and the natural language input, a second value for the first property of the domain, wherein the second value defines a parameter for a task corresponding to the natural language input;\nperform the task based on the parameter; and\nprovide a result based on the performed task.\n2. The non-transitory computer-readable storage medium of claim 1, wherein the domain corresponding to the natural language input comprises a media domain.\n3. The non-transitory computer-readable storage medium of claim 1, wherein performing the task includes searching for a first media item.\n4. The non-transitory computer-readable storage medium of claim 1, wherein performing the task includes searching for a first location.\n5. The non-transitory computer-readable storage medium of claim 1, wherein the one or more programs further comprise instructions, which when executed by the one or more processors of the first electronic device, cause the first electronic device to:\nreplace the first value with the second value.\n6. The non-transitory computer-readable storage medium of claim 1, wherein the first value represents the named entity and the second value represents the named entity.\n7. The non-transitory computer-readable storage medium of claim 6, wherein the named entity comprises at least one of: a media item, a person, a location, and an application.\n8. The non-transitory computer-readable storage medium of claim 1, wherein the named entity model associates a set of one or more values with the second value, the set of one or more values including the first value.\n9. The non-transitory computer-readable storage medium of claim 1, wherein the named entity model comprises a plurality of mappings, wherein each mapping of the plurality of mappings associates a respective representation of a respective named entity to a correct representation of the respective named entity.\n10. The non-transitory computer-readable storage medium of claim 9, wherein each mapping of the plurality of mappings satisfies one or more predetermined rules, each of the one or more predetermined rules specifying a condition for the respective representation of the respective named entity.\n11. The non-transitory computer-readable storage medium of claim 1, wherein the named entity model comprises a machine learned model.\n12. The non-transitory computer-readable storage medium of claim 11, wherein determining the second value for the first property of the domain includes:\ndetermining, using the machine learned model and the first value, a plurality of values for the first property of the domain, wherein each value of the plurality of values is associated with a respective ranking; and\nidentifying, from the plurality of values, the second value based on the respective ranking associated with the second value.\n13. The non-transitory computer-readable storage medium of claim 12, wherein the respective ranking associated with each value of the plurality of values is determined using a knowledge base.\n14. The non-transitory computer-readable storage medium of claim 12, wherein the respective ranking associated with each value of the plurality of values is determined based on context data associated with the first value.\n15. The non-transitory computer-readable storage medium of claim 1, wherein determining that the first value comprises the inaccurate representation of the named entity includes determining that the named entity model includes a mapping associating the first value with a third value.\n16. The non-transitory computer-readable storage medium of claim 1, wherein determining that the first value comprises the inaccurate representation of the named entity includes:\ndetermining, using the named entity model, a mapping associating the first value with a third value, the mapping being associated with a confidence score; and\ndetermining that the confidence score exceeds a threshold.\n17. An electronic device, comprising:\none or more processors;\na memory; and\none or more programs, wherein the one or more programs are stored in the memory and configured to be executed by the one or more processors, the one or more programs including instructions for:\nreceiving a natural language input;\ndetermining a domain corresponding to the natural language input;\nin accordance with determining the domain corresponding to the natural language input:\ndetermining, based on the natural language input, a first value for a first property of the domain;\ndetermining that the first value comprises an inaccurate representation of a named entity;\nin accordance with determining that the first value comprises the inaccurate representation of the named entity, determining, based on a named entity model and the natural language input a second value for the first property of the domain, wherein the second value defines a parameter for a task corresponding to the natural language input;\nperforming the task based on the parameter; and\nproviding a result based on the performed task.\n18. A method for processing natural language requests, the method comprising:\nat an electronic device with one or more processors and memory:\nreceiving a natural language input;\ndetermining a domain corresponding to the natural language input;\nin accordance with determining the domain corresponding to the natural language input:\ndetermining, based on the natural language input, a first value for a first property of the domain;\ndetermining that the first value comprises an inaccurate representation of a named entity;\nin accordance with determining that the first value comprises the inaccurate representation of the named entity, determining, based on a named entity model and the natural language input, a second value for the first property of the domain, wherein the second value defines a parameter for a task corresponding to the natural language input;\nperforming the task based on the parameter; and\nproviding a result based on the performed task.\n19. The electronic device of claim 17, wherein the domain corresponding to the natural language input comprises a media domain.\n20. The electronic device of claim 17, wherein performing the task includes searching for a first media item.\n21. The electronic device of claim 17, wherein performing the task includes searching for a first location.\n22. The electronic device of claim 17, the one or more programs further including instructions for:\nreplacing the first value with the second value.\n23. The electronic device of claim 17, wherein the first value represents the named entity and the second value represents the named entity.\n24. The electronic device of claim 23, wherein the named entity comprises at least one of:\na media item, a person, a location, and an application.\n25. The electronic device of claim 17, wherein the named entity model associates a set of one or more values with the second value, the set of one or more values including the first value.\n26. The electronic device of claim 17, wherein the named entity model comprises a plurality of mappings, wherein each mapping of the plurality of mappings associates a respective representation of a respective named entity to a correct representation of the respective named entity.\n27. The electronic device of claim 26, wherein each mapping of the plurality of mappings satisfies one or more predetermined rules, each of the one or more predetermined rules specifying a condition for the respective representation of the respective named entity.\n28. The electronic device of claim 17, wherein the named entity model comprises a machine learned model.\n29. The electronic device of claim 28, wherein determining the second value for the first property of the domain includes:\ndetermining, using the machine learned model and the first value, a plurality of values for the first property of the domain, wherein each value of the plurality of values is associated with a respective ranking; and\nidentifying, from the plurality of values, the second value based on the respective ranking associated with the second value.\n30. The electronic device of claim 29, wherein the respective ranking associated with each value of the plurality of values is determined using a knowledge base.\n31. The electronic device of claim 29, wherein the respective ranking associated with each value of the plurality of values is determined based on context data associated with the first value.\n32. The electronic device of claim 17, wherein determining that the first value comprises the inaccurate representation of the named entity includes determining that the named entity model includes a mapping associating the first value with a third value.\n33. The electronic device of claim 17, wherein determining that the first value comprises the inaccurate representation of the named entity includes:\ndetermining, using the named entity model, a mapping associating the first value with a third value, the mapping being associated with a confidence score; and\ndetermining that the confidence score exceeds a threshold.\n34. The method of claim 18, wherein the domain corresponding to the natural language input comprises a media domain.\n35. The method of claim 18, wherein performing the task includes searching for a first media item.\n36. The method of claim 18, wherein performing the task includes searching for a first location.\n37. The method of claim 18, further comprising:\nreplacing the first value with the second value.\n38. The method of claim 18, wherein the first value represents the named entity and the second value represents the named entity.\n39. The method of claim 38, wherein the named entity comprises at least one of: a media item, a person, a location, and an application.\n40. The method of claim 18, wherein the named entity model associates a set of one or more values with the second value, the set of one or more values including the first value.\n41. The method of claim 18, wherein the named entity model comprises a plurality of mappings, wherein each mapping of the plurality of mappings associates a respective representation of a respective named entity to a correct representation of the respective named entity.\n42. The method of claim 41, wherein each mapping of the plurality of mappings satisfies one or more predetermined rules, each of the one or more predetermined rules specifying a condition for the respective representation of the respective named entity.\n43. The method of claim 18, wherein the named entity model comprises a machine learned model.\n44. The method of claim 43, wherein determining the second value for the first property of the domain includes:\ndetermining, using the machine learned model and the first value, a plurality of values for the first property of the domain, wherein each value of the plurality of values is associated with a respective ranking; and\nidentifying, from the plurality of values, the second value based on the respective ranking associated with the second value.\n45. The method of claim 44, wherein the respective ranking associated with each value of the plurality of values is determined using a knowledge base.\n46. The method of claim 44, wherein the respective ranking associated with each value of the plurality of values is determined based on context data associated with the first value.\n47. The method of claim 18, wherein determining that the first value comprises the inaccurate representation of the named entity includes determining that the named entity model includes a mapping associating the first value with a third value.\n48. The method of claim 18, wherein determining that the first value comprises the inaccurate representation of the named entity includes:\ndetermining, using the named entity model, a mapping associating the first value with a third value, the mapping being associated with a confidence score; and\ndetermining that the confidence score exceeds a threshold."
}