{
    "patent_id": "US-11061398-B2",
    "title": "Machine-learning systems and techniques to optimize teleoperation and/or planner decisions ",
    "assignee": "Zoox, Inc.",
    "publication_date": "2021-07-13",
    "patent_link": "https://patents.google.com/patent/US11061398B2/en",
    "inventors": [
        "Jesse Sol Levinson",
        "Gabriel Thurston Sibley",
        "Ashutosh Gajanan Rege"
    ],
    "classifications": [
        "G06N20/00",
        "B60Q1/50",
        "B60Q1/503",
        "B60Q1/507",
        "B60Q1/508",
        "G01S17/86",
        "G01S17/87",
        "G01S17/931",
        "G01S7/4972",
        "G05D1/0022",
        "G05D1/0027",
        "G05D1/0088",
        "G06N7/005",
        "G06N7/01",
        "G06Q10/00",
        "G06Q10/06",
        "G08G1/005",
        "G08G1/165",
        "G08G1/166",
        "G08G1/202",
        "H04L41/0816",
        "H04L67/10",
        "H04L67/12",
        "B60Q1/28",
        "B60Q1/30",
        "B60Q1/549",
        "B60Q2400/40",
        "G01S13/865",
        "G01S13/867",
        "G01S13/87",
        "G01S2013/9316",
        "G01S2013/9322",
        "G05D2201/0212",
        "G05D2201/0213",
        "H04L41/16"
    ],
    "abstract": "A system, an apparatus or a process may be configured to implement an application that applies artificial intelligence and/or machine-learning techniques to predict an optimal course of action (or a subset of courses of action) for an autonomous vehicle system (e.g., one or more of a planner of an autonomous vehicle, a simulator, or a teleoperator) to undertake based on suboptimal autonomous vehicle performance and/or changes in detected sensor data (e.g., new buildings, landmarks, potholes, etc.). The application may determine a subset of trajectories based on a number of decisions and interactions when resolving an anomaly due to an event or condition. The application may use aggregated sensor data from multiple autonomous vehicles to assist in identifying events or conditions that might affect travel (e.g., using semantic scene classification). An optimal subset of trajectories may be formed based on recommendations responsive to semantic changes (e.g., road construction).",
    "claims": "\n1. A method comprising:\nreceiving sensor data from an autonomous vehicle;\ndetermining, based at least in part on at least one of the sensor data, an event in a region of an environment through which the autonomous vehicle has traversed, the event associated with event data;\nreceiving a teleoperator interaction associated with the event, the teleoperator interaction associated with a communication transmitted to the autonomous vehicle and configured to cause the autonomous vehicle to perform an action; and\ntraining, based at least in part on the teleoperator interaction and the event, a machine-learning (ML) model to output a recommended action based at least in part on at least one of the sensor data or the event data.\n2. The method of claim 1, further comprising\nreceiving additional sensor data from at least one of the autonomous vehicle or an additional vehicle;\ndetermining, based at least in part on the additional sensor data, an additional event, the additional event comprising additional event data;\ndetermining, by the ML model and based at least in part on at least one of the additional sensor data or the additional event data, a first recommended action; and\ncausing the first recommended action to be displayed via a display.\n3. The method of claim 2, further comprising:\nsimulating, based at least in part on at least one of map data, the additional sensor data, or the additional event, a result of implementing the first recommended action at a vehicle; and\ncausing an alert or an affirmation to be displayed via the display, based at least in part on the result.\n4. The method of claim 2, further comprising determining a second recommended action based at least in part on a simulation.\n5. The method of claim 4, further comprising causing at least one of the first recommended action or the second recommended action to be displayed via the display.\n6. The method of claim 1, wherein the recommended action comprises a candidate trajectory, candidate path, a region to include or exclude from path or trajectory determination, a modification to a rule, or identification of an additional or alternate event.\n7. A system comprising:\none or more processors;\nmemory having stored thereon processor-executable instructions that, when executed by the one or more processors, cause the system to perform operations comprising:\nreceiving sensor data from an autonomous vehicle;\ndetermining, based at least in part on at least one of the sensor data, an event in a region of an environment;\nreceiving a teleoperator interaction associated with the event, the teleoperator interaction associated with a communication transmitted to the autonomous vehicle; and\ntraining, based at least in part on the teleoperator interaction and the event, a machine-learning (ML) model to output a recommended action.\n8. The system of claim 7, wherein the operations further comprise:\nreceiving additional sensor data from at least one of the autonomous vehicle or an additional vehicle;\ndetermining, based at least in part on the additional sensor data, an additional event;\ndetermining, by the ML model and based at least in part on at least one of the additional sensor data or additional event data associated with the additional event, a recommended action; and\ncausing the first recommended action to be displayed via a display.\n9. The system of claim 8, wherein the operations further comprise determining a confidence level associated with the recommended action.\n10. The system of claim 8, wherein the operations further comprise:\nsimulating, based at least in part on at least one of map data, the additional sensor data, or the additional event data, a result of controlling the autonomous vehicle or additional autonomous vehicle in accordance with the recommended action; and\ncausing an alert or an affirmation to be displayed via a display, based at least in part on the result.\n11. The system of 9, wherein the event data and the additional event data comprise at least one matching attribute.\n12. The system of claim 8, wherein the operations further comprise:\ndetermining an additional recommended action based at least in part on a simulation; and\ncausing at least one of the first recommended action or the additional recommended action to be displayed via the display.\n13. The system of claim 7, wherein the recommended action comprises at least one of a candidate trajectory, a candidate path, a region to include or exclude from path or trajectory determination, a modification to a rule, or identification of an additional or alternate event.\n14. A non-transitory computer-readable medium comprising processor-executable instructions that, when executed by one or more processors, cause the one or more processors to perform operations comprising:\nreceiving sensor data associated with an autonomous vehicle;\ndetermining, based at least in part on at least one of the sensor data, an event in a region of an environment, the event associated with event data;\nreceiving a teleoperator interaction associated with the event; and\ntraining, based at least in part on the teleoperator interaction and the event, a machine-learning (ML) model to output a recommended action based at least in part on at least one of the sensor data or the event data.\n15. The non-transitory computer-readable medium of claim 14, wherein the operations further comprise:\nreceiving additional sensor data from at least one of the autonomous vehicle or an additional vehicle;\ndetermining, based at least in part on the additional sensor data, an additional event associated with additional event data;\ndetermining, by the ML model and based at least in part on at least one of the additional sensor data or the additional event data, a first recommended action; and\ncausing the first recommended action to be displayed via a display.\n16. The non-transitory computer-readable medium of claim 15, wherein the operations further comprise determining a confidence level associated with the first recommended action and causing the confidence level to be displayed via the display.\n17. The non-transitory computer-readable medium of claim 15, wherein the operations further comprise:\nsimulating, based at least in part on at least one of map data, the additional sensor data, or the additional event data, a result of controlling at least one of the autonomous vehicle or the additional vehicle in accordance with the first recommended action; and\ncausing an alert or an affirmation to be displayed via the display, based at least in part on the result.\n18. The non-transitory computer-readable medium of claim 15, wherein the event data and the additional event data comprise at least one matching attribute.\n19. The non-transitory computer-readable medium of claim 15, wherein the operations further comprise:\ndetermining a second recommended action based at least in part on a simulation; and\ncausing at least one of the first recommended action or the second recommended action to be displayed via the display.\n20. The non-transitory computer-readable medium of claim 14, wherein the recommended action comprises a candidate trajectory or candidate path for the autonomous vehicle to follow, a region to include or exclude from path or trajectory determination, a modification to a rule, or identification of an additional or alternate event."
}