{
    "patent_link": "https://patents.google.com/patent/US20050165766A1/en",
    "patent_id": "US20050165766A1",
    "title": "Computer graphic display visualization system and method",
    "abstract": "An improved human user computer interface system, providing a graphic representation of a hierarchy populated with naturally classified objects, having included therein at least one associated object having a distinct classification. Preferably, a collaborative filter is employed to define the appropriate associated object. The associated object preferably comprises a sponsored object, generating a subsidy or revenue.",
    "inventors": [
        "Andrew Szabo"
    ],
    "assignee": "Relativity Display LLC",
    "classifications": [
        "G06Q30/0273",
        "G06F16/10",
        "G06F16/904",
        "G06F16/954",
        "G06Q30/02",
        "G06Q30/0255",
        "G06Q30/0269",
        "G06T11/206",
        "Y10S707/99933",
        "Y10S715/962"
    ],
    "claims": "\n1. The search engine according to claim 37, wherein said output processor comprises\nan object search engine for selecting a set of objects according to a the search query and returning hyperlinked identifiers of selected objects; and\n(b) said common output comprises an hierarchal organizational structure in graphic format, wherein the hierarchal organizational structure is automatically generated based on a content of or linkage between records.\n2-18. (canceled)\n19. The search engine according to claim 37, wherein at least two distinct predetermined hierarchical organizations of information resources are provided, each having at least three hierarchal levels, the output processor executing an algorithm comprising the steps of:\n(a) defining a relevant hierarchy from among the at least two distinct predetermined hierarchical organizations of information resources;\n(d) displaying hyperlinks to the set of information resources according to the relevant hierarchy; and\n(e) storing at least a subset of the presented hyperlinks within the relevant hierarchy as a state independent object.\n20-26. (canceled)\n27. The search engine according to claim 37, wherein said common output presents an hierarchal organizational structure in graphic format for the identifiers of records, wherein the hierarchal organizational structure is automatically generated based on a content of or linkage between records.\n28-36. (canceled)\n37. A search engine, comprising:\n(a) a first database containing records relating to a content of a plurality of information resources;\n(b) a second database of records relating to commercial messages;\n(c) a persistent identifier;\n(d) a search query input processor, receiving a search query and defining in dependence thereon a query of said first database to retrieve hyperlinked identifiers of records of said first database corresponding to said search query, and a selection of records from said second database to define hyperlinked identifiers of records of said second database relating to commercial messages associated with at least one of said search query and said persistent identifier;\n(e) an output processor for organizing said identifiers of records from said first database together with said identifiers of records from said second database in a common output, in further dependence on said persistent identifier; and\n(f) an accounting database, for recording accounting information for at least one of a presentation and a selection of an identifier of a record from said second database with respect to an account maintained by an entity relating to a corresponding commercial message.\n38. The search engine according to claim 37, wherein said first database is organized taxonomically, and wherein said identifiers of said second database are selectively inserted within a taxonomy generated by said output processor with records from said first database.\n39. The search engine according to claim 37, wherein said records of at least one of said first database and said second database are selected in dependence on a collaborative filter.\n40. The search engine according to claim 37, wherein said records of said second database are selected to be contextually appropriate for presentation in association with at least one of selected records from said first database and the search query.\n41. The search engine according to claim 37, wherein said records of said second database are selected competitively.\n42. The search engine according to claim 37, wherein said persistent identifier identifies a source of an input query.\n43. The search engine according to claim 38, wherein the organizational structure of the taxonomy comprises a tree structure displaying at least three hierarchal levels.\n44. The search engine according to claim 37, wherein said common output comprises an applet having executable code therein.\n45. The search engine according to claim 37, wherein said accounting database accounts for delivery of commercial messages based on at least one of a semantic context of message delivery and a value of a subsequent commercial transaction with the user.\n46. The search engine according to claim 37, wherein said output processor ranks records within a single taxonomic class in dependence on at least one of a correspondence to the search query and a ranking preference associated with a search query or a user, independent of the search query.\n47. The search engine according to claim 37, wherein said common output produces an output graphically representing a history of access to records by the user.\n48. The search engine according to claim 37, wherein at least one record has an associated digital rights rule conditionally limiting access to the record.\n49. An Internet portal, comprising a search engine for delivering a set of results having an associated content corresponding to a search query in conjunction with advertisements having an associated hyperlink, and an accounting database storing data representing at least one of a per impression and a per clickthrough basis with respect to said advertisements; and an output system for integrating advertisements into an output of said search engine in dependence on a conditional probability relating to said advertisement.\n50. The Internet portal according to claim 49, wherein said Internet portal maintains a user identifier, and presents advertising based on a conditional probability that an identified user will enter into a transaction associated with said advertising.\n51. The Internet portal according to claim 49, wherein said Internet portal maintains a user identifier, and presents advertising based on a utility to an advertiser of said advertising.\n52. The Internet portal according to claim 49, wherein an advertisement is associated with an economic parameter which varies in dependence on the conditional probability.\n53. The internet portal according to claim 49, wherein:\nthe set of results is generated from a first database containing records relating to a content of a plurality of information resources;\nsaid advertisements are generated from a second database of records relating to commercial messages;\nsaid search engine comprises a search query input processor, receiving the search query and defining in dependence thereon a query of said first database to retrieve hyperlinked identifiers of records of said first database corresponding to said search query, and a selection of records from said second database to define hyperlinked identifiers of records of said second database relating to commercial messages associated with said search query; and\nsaid output system organizing said identifiers of records from said first database together with said identifiers of records from said second database in a common output.\n54. The Internet portal according to claim 53, wherein said first database is organized taxonomically, and wherein said identifiers of said second database are selectively inserted within a taxonomy generated by said output system with records from said first database.\n55. The Internet portal according to claim 49, wherein said advertisements are selected in dependence on at least one of a collaborative filter and a contextual appropriateness for presentation in association with the set of results.\n56. The Internet Portal according to claim 49, wherein said advertisements are selected competitively.\n57. The Internet portal according to claim 49, wherein at least one of the members of said set of results and the advertisements are selected in dependence on a collaborative filter.\n58. The Internet portal according to claim 49, wherein said output comprises an executable applet.\n59. The Internet portal according to claim 49, wherein said output is presented taxonomically, wherein results within a single taxonomic class are ranked in dependence on a correspondence of the set of results to the search query.\n60. The Internet portal according to claim 49, wherein said output is ranked in dependence on a ranking preference associated with a search query or a user, independent of the search query.\n61. The Internet portal according to claim 49, wherein at least one result has an associated digital rights rule conditionally limiting access thereto.\n62. The Internet portal according to claim 49, wherein the output presents an hierarchal organizational structure in graphic format for the results, wherein the hierarchal organizational structure is automatically generated based on a content of or linkage between results.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US5768578A",
        "US5924090A",
        "US5974572A",
        "US5974412A",
        "US6028602A",
        "US6061692A",
        "US6104400A",
        "US6108698A",
        "US6122634A",
        "US6185625B1",
        "US6226648B1",
        "US6233575B1",
        "US6233571B1",
        "US6252597B1",
        "US6269361B1",
        "US6282538B1",
        "US20010020236A1",
        "US6292813B1",
        "US6370537B1",
        "US6377287B1",
        "US6404446B1",
        "US6434556B1",
        "US6460036B1",
        "US6470383B1",
        "US6496838B1",
        "US6591248B1",
        "US6604113B1",
        "US6604114B1",
        "US6606652B1",
        "US6654725B1",
        "US6763334B1",
        "US20040181554A1",
        "US6856967B1",
        "US6868525B1",
        "US7047242B1",
        "US7236969B1",
        "US7257604B1"
    ],
    "citations_ftf": [
        "US5021976A",
        "US5903454A",
        "US5297253A",
        "EP0581376A1",
        "KR970011623B1",
        "US5724521A",
        "US5855015A",
        "US5615341A",
        "US5758259A",
        "JP3118181B2",
        "US5978766A",
        "US5724573A",
        "US6014634A",
        "JP4079462B2",
        "US5946490A",
        "US5812134A",
        "US5848396A",
        "US6018748A",
        "US6014638A",
        "US5945988A",
        "DK0932398T3",
        "US5933811A",
        "US5890152A",
        "US5801747A",
        "JP4223578B2",
        "US5966126A",
        "US6012051A",
        "US5963965A",
        "US6006218A",
        "US5974398A",
        "US6012053A",
        "US5966705A",
        "US5964836A",
        "US6005597A",
        "US5973683A",
        "US6012052A",
        "US6014671A"
    ],
    "citedby_own": [
        "US20020049756A1",
        "US20030023595A1",
        "US20030110091A1",
        "US20040088323A1",
        "US20040176974A1",
        "US20040205638A1",
        "US20040212615A1",
        "US20060149719A1",
        "US20060200455A1",
        "US20060218121A1",
        "US20070011179A1",
        "US20070090468A1",
        "US20070112852A1",
        "US20070180471A1",
        "US20070185843A1",
        "US20070244769A1",
        "US20070244793A1",
        "US20070244801A1",
        "US20070244770A1",
        "US20070244772A1",
        "US20070255687A1",
        "US20070255624A1",
        "US20070282809A1",
        "US20070282826A1",
        "US20080016040A1",
        "US20080016218A1",
        "US20080027936A1",
        "US20080082904A1",
        "US20080154951A1",
        "US20080168135A1",
        "US20080177731A1",
        "US20080215989A1",
        "US20080243526A1",
        "US20080243607A1",
        "US20080320010A1",
        "US20090019036A1",
        "US20090100031A1",
        "US20090132494A1",
        "US7610185B1",
        "US20090282032A1",
        "US20100070904A1",
        "US20100082421A1",
        "US20100094693A1",
        "US20100121835A1",
        "US20100124738A1",
        "US20100123511A1",
        "US20100174726A1",
        "US7769751B1",
        "US7809709B1",
        "US20100332582A1",
        "US20100332960A1",
        "US20110040537A1",
        "US20110047111A1",
        "US20110047145A1",
        "US20110055756A1",
        "US20110055755A1",
        "US20110060651A1",
        "US20110078603A1",
        "US20110131206A1",
        "US20110191290A1",
        "US20110191326A1",
        "US20110191312A1",
        "US20110218855A1",
        "US8078557B1",
        "US8086624B1",
        "US8103659B1",
        "US20120072289A1",
        "US20120078706A1",
        "US20120117048A1",
        "US8180754B1",
        "US8229942B1",
        "US8266130B2",
        "US8335779B2",
        "US8380788B2",
        "US8392445B1",
        "US8577894B2",
        "US8639695B1",
        "US8880706B1",
        "US8880500B2",
        "US20150035836A1",
        "US8966405B2",
        "US20150106692A1",
        "US9098573B2",
        "WO2016014112A1",
        "WO2016049170A1",
        "US9465890B1",
        "US9571877B2",
        "US20170124622A1",
        "US9734169B2",
        "US20180018396A1",
        "US9886981B2",
        "US9936250B2",
        "CN107958385A",
        "US10069972B1",
        "US10091358B1",
        "US10127572B2",
        "US10140628B2",
        "US10248195B2",
        "US10269036B2",
        "EP3537350A1",
        "US10460286B2",
        "US10580031B2",
        "US10580018B2",
        "US10679241B2",
        "US10733625B2",
        "US10963895B2",
        "US10987015B2",
        "WO2021105749A1",
        "US11216438B2",
        "US11481788B2",
        "US11573956B2",
        "US11704681B2",
        "US11755583B2"
    ],
    "citedby_ftf": [
        "AU9377098A",
        "US8181113B2",
        "US6791580B1",
        "US7225229B1",
        "US9183306B2",
        "US7779015B2",
        "US7231439B1",
        "US6920616B1",
        "US6842877B2",
        "US6513046B1",
        "US6801223B1",
        "US7046263B1",
        "US8225214B2",
        "US7110993B2",
        "US7181438B1",
        "US20060229930A9",
        "US6600497B1",
        "US7020845B1",
        "FR2803929B1",
        "US6868525B1",
        "WO2001071572A2",
        "US7464153B1",
        "WO2001075676A2",
        "US7716163B2",
        "AUPQ853900A0",
        "US20020059132A1",
        "US20020069405A1",
        "US6907465B1",
        "US6678679B1",
        "GB2386724A",
        "US20020054130A1",
        "US20020077792A1",
        "US7844489B2",
        "JP3654173B2",
        "US7299259B2",
        "US6822945B2",
        "US7929562B2",
        "US20100223295A1",
        "US6591168B2",
        "US20040098386A1",
        "US7778816B2",
        "US7089195B2",
        "US7502833B2",
        "FR2824654B1",
        "US7742968B2",
        "JP3679731B2",
        "US7020662B2",
        "US20030028620A1",
        "US8301503B2",
        "US20040006745A1",
        "US7165054B2",
        "US20030069892A1",
        "US7305402B2",
        "US8131815B1",
        "US7512555B2",
        "US7415471B1",
        "US7565377B2",
        "FI20012416A0",
        "US20030115191A1",
        "US7072883B2",
        "US7133879B1",
        "US20030128236A1",
        "US7343365B2",
        "JP2003256301A",
        "US7567953B2",
        "US20030187716A1",
        "US7284204B2",
        "US7249116B2",
        "US7707496B1",
        "US7752252B2",
        "US7742048B1",
        "US7707024B2",
        "US6950825B2",
        "US7827546B1",
        "US7209915B1",
        "GB2391150B",
        "US8050970B2",
        "US20040030667A1",
        "USRE46776E1",
        "US7231393B1",
        "US7383258B2",
        "US8302019B2",
        "US9307884B1",
        "US7783614B2",
        "US8694504B2",
        "US7676034B1",
        "US8019705B2",
        "US7120619B2",
        "US20040243531A1",
        "US7523095B2",
        "US20040225654A1",
        "US7558841B2",
        "US7739588B2",
        "WO2005006140A2",
        "GB2403636A",
        "US20050021441A1",
        "JP4827388B2",
        "EP1661049A2",
        "US20050038861A1",
        "JP4400147B2",
        "EP1510939A1",
        "EP1510938B1",
        "EP1510941A1",
        "EP1510940A1",
        "US7756750B2",
        "US20120150888A1",
        "US7555705B2",
        "US7516086B2",
        "US7693827B2",
        "US7201311B2",
        "US7231375B2",
        "US20050091584A1",
        "US20050114197A1",
        "US7676397B2",
        "US7302645B1",
        "JP2005189995A",
        "US8312014B2",
        "US8676837B2",
        "US8126865B1",
        "US7415465B2",
        "US20050182755A1",
        "US7836083B2",
        "US8055553B1",
        "US20070150519A1",
        "US7788160B2",
        "US7877313B2",
        "US20050234804A1",
        "US7860749B2",
        "US7769752B1",
        "US20050273721A1",
        "US7272728B2",
        "US20050278258A1",
        "US8078607B2",
        "US7698333B2",
        "US7603349B1",
        "US7958115B2",
        "US7409402B1",
        "US8429190B2",
        "US8249929B2",
        "US7698339B2",
        "US7698291B2",
        "US7543740B2",
        "US7497374B2",
        "US20060064374A1",
        "US7685209B1",
        "US7565627B2",
        "US20060074609A1",
        "US20060074608A1",
        "US20060080169A1",
        "US20060085258A1",
        "US20060095443A1",
        "US7712022B2",
        "US20060111971A1",
        "US20060111970A1",
        "US8874570B1",
        "US7421651B2",
        "US8001005B2",
        "US20060178934A1",
        "EP1691305A1",
        "US9600835B1",
        "US8316315B2",
        "EP1861800A1",
        "US9424563B2",
        "US8230072B1",
        "US7596574B2",
        "US7606781B2",
        "US9177248B2",
        "US7849090B2",
        "US9104779B2",
        "US10002325B2",
        "US9378203B2",
        "US8849860B2",
        "US9256685B2",
        "US20060224583A1",
        "US20060224608A1",
        "US8140499B2",
        "JP4660264B2",
        "US7734644B2",
        "US20060259357A1",
        "US20060259356A1",
        "US20070016985A1",
        "US8121895B2",
        "US9268867B2",
        "US8739020B2",
        "US7702675B1",
        "US8024338B2",
        "US8423323B2",
        "US7992085B2",
        "US7788590B2",
        "US8392151B1",
        "US8874477B2",
        "US8209222B2",
        "WO2007048229A1",
        "US20070124506A1",
        "US20070150406A1",
        "US7895115B2",
        "US8095428B2",
        "US20070143205A1",
        "US20070106595A1",
        "US7835977B2",
        "US8095449B2",
        "US7475054B2",
        "US7596540B2",
        "US7596536B2",
        "US8629885B2",
        "US20070168309A1",
        "US20070296718A1",
        "EP1960897A4",
        "US7788131B2",
        "US8327297B2",
        "US9170987B2",
        "US10534820B2",
        "US7542886B2",
        "US20070192319A1",
        "US20070179823A1",
        "US8756228B2",
        "US7664680B2",
        "US20070220103A1",
        "WO2007106844A2",
        "US20070239410A1",
        "US7793216B2",
        "US20070255740A1",
        "US20090133058A1",
        "EP2033175A4",
        "US20070282813A1",
        "US20070265980A1",
        "JP4933149B2",
        "US20070285426A1",
        "US8209320B2",
        "US7831586B2",
        "US8001105B2",
        "WO2007147080A1",
        "US20070299789A1",
        "CA2656935A1",
        "US20080082417A1",
        "US8245157B2",
        "US20080059308A1",
        "US20080103877A1",
        "US20080063201A1",
        "EP1898577A1",
        "US7693757B2",
        "US8965783B2",
        "US8121875B2",
        "US8849864B2",
        "US20080097854A1",
        "US8751815B2",
        "GB0621300D0",
        "US20080103913A1",
        "WO2008055034A2",
        "US9208174B1",
        "US7921139B2",
        "US8713090B2",
        "US20100023894A1",
        "US7788265B2",
        "US8516439B2",
        "US8458063B2",
        "US8086511B2",
        "US8099084B2",
        "US7765173B2",
        "US7647283B2",
        "US8121896B1",
        "US8712757B2",
        "EP2118721A4",
        "US8131536B2",
        "US20080172616A1",
        "US7912847B2",
        "US7580858B2",
        "US7529743B1",
        "US20080215417A1",
        "US20080208687A1",
        "US8949215B2",
        "US20080208731A1",
        "US20080221987A1",
        "US7827170B1",
        "KR100910517B1",
        "US20080250323A1",
        "US7739596B2",
        "US7712043B2",
        "US20080256052A1",
        "US8122016B1",
        "US7936354B2",
        "US20080300958A1",
        "US20080301551A1",
        "US20080301582A1",
        "US8935249B2",
        "US20090048977A1",
        "US9392074B2",
        "US20090013051A1",
        "US20090018904A1",
        "KR20090009544A",
        "US20090058820A1",
        "US20090094039A1",
        "US7890539B2",
        "US20090125321A1",
        "US9203911B2",
        "US20090128581A1",
        "US9391789B2",
        "US20090171986A1",
        "US20090177538A1",
        "JP5232478B2",
        "TW200933391A",
        "US20090204900A1",
        "US20090222762A1",
        "US8627299B2",
        "US20090327928A1",
        "US20110161827A1",
        "GB2470333B",
        "US20090240608A1",
        "US8244569B2",
        "US9361365B2",
        "US20110314382A1",
        "WO2009132442A1",
        "US8676732B2",
        "US10387892B2",
        "US20090278848A1",
        "US9405847B2",
        "US20090322739A1",
        "US8117145B2",
        "US8255192B2",
        "US8620635B2",
        "US8411085B2",
        "US8667404B2",
        "US20100064235A1",
        "JP5538393B2",
        "US9390180B1",
        "US8301649B1",
        "US20100100827A1",
        "US20100100542A1",
        "US20110113041A1",
        "US20100100826A1",
        "US20100114937A1",
        "US8781915B2",
        "US20100106668A1",
        "US20100107075A1",
        "US9342901B2",
        "US8584084B2",
        "US8103608B2",
        "US8190406B2",
        "US8145615B2",
        "US8155931B2",
        "JP2010140383A",
        "US8314793B2",
        "WO2010082343A1",
        "US10191982B1",
        "US9607324B1",
        "US8341167B1",
        "US9542436B2",
        "US9935793B2",
        "US9172482B2",
        "US20100299172A1",
        "US8866818B2",
        "US8493406B2",
        "US20100325564A1",
        "US8788574B2",
        "US8692826B2",
        "US9330503B2",
        "US8259134B2",
        "US8531451B2",
        "US8352218B2",
        "US20110016102A1",
        "US20110040555A1",
        "US20110060645A1",
        "US20110060644A1",
        "US9292855B2",
        "US8352397B2",
        "FR2950177B1",
        "US8954893B2",
        "US9262520B2",
        "US8433660B2",
        "EP2507995A4",
        "US20110154197A1",
        "US9148706B1",
        "US8983989B2",
        "US8903794B2",
        "US20110213679A1",
        "US20110231395A1",
        "US8676684B2",
        "US8924377B2",
        "CN102939603B",
        "US20110307460A1",
        "US9235806B2",
        "US10474647B2",
        "US8957920B2",
        "US8762939B1",
        "US9043296B2",
        "US20120053952A1",
        "US8762411B2",
        "US20120096407A1",
        "US20130290340A1",
        "US10068266B2",
        "US8379833B2",
        "US8473437B2",
        "US9230019B2",
        "US11294977B2",
        "US9152779B2",
        "US10268843B2",
        "US8856673B1",
        "CA2833034A1",
        "US20120296700A1",
        "US9336298B2",
        "US20120324367A1",
        "US8725586B2",
        "US9467708B2",
        "US8909922B2",
        "US8903712B1",
        "US9183280B2",
        "US9335885B1",
        "US8761373B1",
        "EP2774059A1",
        "US20130144720A1",
        "US9588652B2",
        "US9852432B2",
        "US20130151624A1",
        "US9124657B2",
        "US9141264B2",
        "US9355366B1",
        "WO2013096892A1",
        "CN102609465B",
        "US20130204869A1",
        "US9934522B2",
        "US8825866B2",
        "US20140089092A1",
        "US9020962B2",
        "US10055541B2",
        "US10037538B2",
        "US9191457B2",
        "US9003551B2",
        "US9245299B2",
        "EP2972978A4",
        "US10515123B2",
        "US9094737B2",
        "US9727656B2",
        "EP3049952A4",
        "US20150154002A1",
        "US9411836B2",
        "US9866878B2",
        "US9953062B2",
        "CN107109484B",
        "US10073909B1",
        "US11443332B2",
        "US9996602B2",
        "US9774663B2",
        "US10387034B2",
        "WO2017123746A1",
        "WO2017180106A1",
        "US10061761B2",
        "US20180061257A1",
        "US20180068329A1",
        "US20180101900A1",
        "US10476974B2",
        "US10621558B2",
        "US10510088B2",
        "US10614517B2",
        "US10496721B2",
        "US20180341716A1",
        "US10643178B1",
        "TWI635451B",
        "US11520606B2",
        "US11061919B1",
        "US10970291B2",
        "US11775588B1",
        "CN111930360B",
        "US20220215064A1",
        "US11748772B2",
        "US20220270117A1"
    ]
}