{
    "patent_link": "https://patents.google.com/patent/US5530484A/en",
    "patent_id": "US5530484A",
    "title": "Image scanning format converter suitable for a high definition television system",
    "abstract": "An adaptive scan format converter (14, FIG. 1; FIG. 2) at a transmitter/encoder of a video signal processing system such as a high definition television (HDTV) system, as a function of what format is desired for coding and transmission via an output channel. Similarly, at a receiver, a received scan format is automatically converted (36, FIG. 1; FIG. 2) to a desired format for display as needed. For example, a received interlaced signal (I) will be automatically converted to progressive (P) format to be compatible with a progressive scan display device (39). A received progressive signal will be passed to the display device without format conversion. Automatic scan conversion is performed seamlessly so that, for example, the conversion between progressive main television program material and interlaced commercial material is produced without artifacts and is essentially invisible to a viewer.",
    "inventors": [
        "Bhavesh B. Bhatt",
        "Nicola J. Fedele",
        "Glenn A. Reitmeier"
    ],
    "assignee": "Technicolor SA",
    "classifications": [
        "H04N7/012",
        "H04N7/01",
        "H04N21/426",
        "H04N5/46"
    ],
    "claims": "\n1. In a system for processing video signals subject to exhibiting either a first image line scanning format (I) or alternatively a different second image line scanning format (P), signal processing apparatus comprising:\nan input for receiving a first signal to be conveyed to an output path, said first signal exhibiting said first format;\nan input for receiving a second signal to be conveyed to said output path with said second format;\nan output processor for providing an output signal to said output path, said output signal exhibiting a predetermined one of said first and second formats compatible with the requirements of said output path; and\nan automatic scan format converter responsive to said first and second signals for automatically providing an active one of said first and second signals with said predetermined compatible format to said output processor, said converter (a) automatically converting the format of an active signal to said predetermined format if said active signal does not exhibit said predetermined format; and (b) passing said active signal to said output processor without format conversion if said active signal exhibits said predetermined format, wherein said converter comprises:\na first conversion path between an input network and an output network for converting a progressive format signal to an interlaced format signal;\na second conversion path between said input network and said output network for converting an interlaced format signal to a progressive format signal; and\na bypass path for conveying a signal without conversion between said input and output networks.\n2. A system according to claim 1, wherein\nsaid first conversion path includes a decimation network;\nsaid second conversion path includes a de-interlacing network and a decimating network following said de-interlacing network;\nsaid input network includes an input multiplexer; and\nsaid output network includes an output multiplexer for receiving output signals from said first and second conversion paths and from said bypass path.\n3. A system according to claim 2, wherein\nsaid signals received by said input multiplexer are derived from digital signals; and\nsaid input multiplexer additionally receives an input signal derived from an analog signal (R,G,B H,V).\n4. A system according to claim 1, wherein\nsaid system is a receiver system comprising a decoder network in a signal processing path including said format converter; and\nsaid first and second formats are line interlaced and line sequential progressive formats, respectively.\n5. In a system for processing video signals subject to exhibiting either a first image line scanning format (I) or alternatively a different second image line scanning format (P), signal processing apparatus comprising:\nan input for receiving a first signal to be conveyed to an output path, said first signal exhibiting said first format;\nan input for receiving a second signal to be conveyed to said output path with said second format;\nan output processor for providing an output signal to said output path, said output signal exhibiting a predetermined one of said first and second formats compatible with the requirements of said output path; and\nan automatic scan format converter responsive to said first and second signals for automatically providing an active one of said first and second signals with said predetermined compatible format to said output processor; wherein\nsaid system is a transmitter system further including a coder and a transport processor coupled between said format converter and said output processor.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4677482A",
        "US4897716A",
        "US5132793A",
        "US5255097A",
        "US5325131A",
        "US5347318A",
        "US5361099A",
        "US5386237A",
        "US5389974A",
        "US5410354A",
        "US5410357A",
        "US5420641A",
        "US5444491A",
        "US5461428A"
    ],
    "citations_ftf": [
        "FR2670348A1",
        "JP2924540B2",
        "US5473381A",
        "JPH0759056A",
        "KR950012664B1",
        "US5530484A"
    ],
    "citedby_own": [
        "US5642168A",
        "US5838750A",
        "WO1999033273A1",
        "US5973748A",
        "US5978545A",
        "US6034732A",
        "US6058143A",
        "US6108046A",
        "US6205288B1",
        "US6256045B1",
        "KR100310046B1",
        "US6337716B1",
        "US20020024615A1",
        "US20020060746A1",
        "EP1239679A2",
        "US20020136293A1",
        "US6463445B1",
        "US20020147995A1",
        "US20020149703A1",
        "US20020163595A1",
        "US6483951B1",
        "US20030035645A1",
        "US20030076445A1",
        "US6577349B1",
        "US20030210348A1",
        "US20030218692A1",
        "US20040001159A1",
        "US6700622B2",
        "US20040075768A1",
        "US6728775B1",
        "US20040233332A1",
        "EP1443761A3",
        "US6873368B1",
        "US20050174490A1",
        "WO2007002949A1",
        "US20070002168A1",
        "US20080055464A1",
        "US20080191991A1",
        "US20080291266A1",
        "US20090251595A1",
        "US20100123825A1",
        "US20100128181A1",
        "US8253856B1",
        "US20130225243A1",
        "US20190124291A1"
    ],
    "citedby_ftf": [
        "US5530484A",
        "DE69941284D1",
        "US8743285B2",
        "JP2005510905A",
        "CN100466714C",
        "CN100464567C",
        "JP4855345B2",
        "US20080309816A1",
        "CN102238384A",
        "EP3474270A1"
    ]
}