{
    "patent_link": "https://patents.google.com/patent/US20110238758A1/en",
    "patent_id": "US20110238758A1",
    "title": "Method And Apparatus For Displaying Feeds Content Of Contact And Processing Apparatus And System Thereof",
    "abstract": "A system for displaying feeds contents of a contact and for processing feeds contents of a contact. The system obtains feeds content data of a contact of a user, mixes and sorts the feeds content data. The system pulls out, when the user requests for obtaining the feeds contents of the contact, complete information of the feeds contents requested by the user, and displaying the complete information.",
    "inventors": [
        "Zhu Liang",
        "Xing Yao",
        "Songtao Lin",
        "Zhihao Zheng",
        "Jiang Jiang",
        "Qun Yu",
        "Yue Wu",
        "Zhenyu Guo",
        "Xiaojun Zeng",
        "Min Chen",
        "Yanjie He",
        "Shan Chen",
        "Wenjiang Zhou",
        "Hao Wu",
        "Ye Deng"
    ],
    "assignee": "Tencent Technology Shenzhen Co Ltd",
    "classifications": [
        "H04N7/173",
        "G06Q10/10",
        "H04N21/4788"
    ],
    "claims": "\n1. A method for displaying feeds contents of a contact, comprising:\nobtaining feeds content data of a contact of a user, mixing and sorting the feeds content data which comprises complete information of feeds contents; and\npulling out, when the user requests for obtaining the feeds contents of the contact, complete information of the feeds contents requested by the user, and displaying the complete information.\n2. The method according to claim 1, wherein mixing and sorting the feeds content data comprises:\nsorting the feeds content data according to publication time of the feeds content data, or usernames of users who publish the feeds content data, or categories of users who publish the feeds content data.\n3. The method according to claim 1, wherein obtaining the feeds content data of the contact of the user comprises:\nobtaining the feeds content data of the contact according to contact information set in a Social Networking Service (SNS) relation chain set by the user; or\nobtaining the feeds content data of the contact according to a received update notification message when the feeds content data of the contact of the user is updated, the update notification message comprises information of contacts whose feeds content data is updated and timestamps of update times.\n4. The method according to claim 3, further comprising:\nobtaining feeds content data corresponding to added contact information when the contact information is added; and\ndeleting feeds content data corresponding to deleted contact information from the feeds content data when the contact information is cancelled.\n5. The method according to claim 3, wherein obtaining the feeds content data of the contact according to the received update notification message comprises:\nstoring update time which is closest to the current time, in update time of the feeds content data as a timestamp of this update each time the feeds content data of the contact is obtained;\ncomparing the stored timestamp with the timestamps of the update times when the update notification message is received;\npulling out the feeds content data corresponding to the timestamp of an update time if the timestamp of the update time is closer to the current time than the stored timestamp, and\nstoring a timestamp which is closest to the current time in the timestamps of the update times as a timestamp of this update.\n6. The method according to claim 1, further comprising:\naggregating mixed and sorted data, and storing aggregated mixed and sorted data;\nobtaining feeds content data which is updated latest when the feeds content data of the contacts of the user is updated, and\nadding the obtained dynamic data which is updated latest into the aggregated mixed and sorted data.\n7. An apparatus for displaying feeds contents of contacts, comprising:\na display content pulling unit, the pulling unit pulling complete information of feeds contents corresponding to a request and obtaining the feeds contents of a contact sent by a user from feeds content data obtained by being mixed and sorted of the contact; and\na data displaying unit, the displaying unit displaying the complete information of the feeds contents corresponding to the request of the user and pulled out by the display content pulling unit.\n8. The apparatus according to claim 7, the feeds content data comprises abstracts of the feeds contents of the contact of the user and the complete information of the feeds contents corresponding to the abstracts.\n9. An apparatus for processing feeds contents of a contact, comprising:\na single contact data pulling module, the pulling module obtaining feeds content data of a contact of a user;\na contact data mixing and sorting processing module, the mixing module mixing and sorting the feeds content data obtained by the single contact data pulling module; and\na contact data aggregation module, the aggregation module aggregating the feeds content data obtained by being mixed and sorted by the contact data mixing and sorting processing module.\n10. The apparatus according to claim 9, wherein the contact data mixing and sorting processing module is configured to sort the feeds content data according to publication time of the feeds content data, or usernames of users who publish the feeds content data, or categories of users who publish the feeds content data.\n11. The apparatus according to claim 9, further comprises:\na contact data discretely storing module, the storing module storing feeds content data of all contacts and timestamps corresponding to the feeds content data of all the contacts and providing a data source when the single contact data pulling module obtains the feeds content data of the contact.\n12. The apparatus according to claim 9, further comprising:\na contact data update notifying module, the notifying module monitoring feeds content data of all contacts every time feeds content data of a contact is obtained and sending an update notification message to the single contact data pulling module when the feeds content data is updated; wherein\nthe single contact data pulling module updates obtained feeds content data according to the update notification message sent by the content data update notifying module.\n13. The apparatus according to claim 9, further comprising:\na SNS relation chain storing module, the storing module storing contact information of the user, providing a foundation for obtaining the feeds content data of the contact for the single contact data pulling module, and sending a contact information change message to the single contact data pulling module when the information of the contact is changed; wherein\nthe single contact data pulling module performs corresponding processing on obtained feeds content data according to the contact information change message sent by the SNS relation chain storing module; sends obtained feeds content data corresponding to the contact information to the contact data mixing and sorting processing module when the contact information is added in the message, and delete feeds content data corresponding to deleted contact information from the contact data mixing and sorting processing module when the message includes cancelled contact information.\n14. The apparatus according to claim 13, wherein the SNS relation chain storing module comprises:\na contact information setting unit, the setting unit setting the contact information, or to receive the contact information set by the system;\na storing unit, the storing unit storing the contact information set by the contact information setting unit and storing the contact information set by the system; and\na monitoring unit, the monitoring unit monitoring the contact information stored by the storing unit and sending the contact information change message to the single contact data pulling module when the contact information is changed, the contact information change message comprises changed contact information.\n15. The apparatus according to claim 12, further comprising:\na timestamp recording module, the recording module storing update time which is closest to the current time, in update time of the data, as a timestamp of this update every time feeds content data of a contact is obtained; wherein\nthe single contact data pulling module, according to contact information of a contact whose data is updated and timestamps of update times comprised in the update notification message sent by the contact data update notifying module, comparing the timestamp stored by the timestamp recording module with the timestamps of the update times, pulling out the updated data corresponding to the timestamp of an update time if the timestamp of update time is closer to current time than the timestamp stored by the timestamp recording module, sending the updated data to the contact data aggregation module, and stores a timestamp which is closest to current time, in the timestamps of update times, as a timestamp of this update.\n16. A system for processing feeds contents of a contact, comprising:\nan apparatus for displaying feeds contents of a contact pulling complete information of feeds contents corresponding to a request sent by a user for obtaining the feeds contents of a contact from mixed and sorted data and displaying the complete information; and\nan apparatus for processing feeds contents of a contact, the feeds apparatus obtaining feeds content data of a contact of a user, mix and sort the feeds content data, and aggregate the mixed and sorted data.",
    "status": "Abandoned",
    "citations_own": [
        "US20060230061A1",
        "US20080256177A1",
        "US20090271247A1",
        "US20090300506A1",
        "US20100057682A1",
        "US20100082745A1"
    ],
    "citations_ftf": [
        "CN100413249C",
        "CN101425093A"
    ],
    "citedby_own": [
        "US20100086130A1",
        "CN102932454A",
        "CN103338296A",
        "US20140359036A1",
        "US9191487B2",
        "US10043220B2",
        "US10200316B2"
    ],
    "citedby_ftf": [
        "CN101425093A",
        "CN101626398B",
        "CN104010083B",
        "CN104010084B",
        "US9277021B2",
        "CN102122282A",
        "US20110173316A1",
        "CN101777078A",
        "CN101807203A",
        "CN101841491A",
        "CN102244695A",
        "CN101854399A",
        "CN102375865B",
        "CN102387089B",
        "CN102411593A",
        "CN102447647B",
        "CN101977238A",
        "CN103051511B",
        "CN103095748B",
        "CN103186534B",
        "CN103297318B",
        "WO2014063341A1",
        "CN103095684B",
        "CN103902628B",
        "CN104090884B",
        "CN104283974A",
        "US9519690B1",
        "CN106973004A",
        "CN107301212B",
        "CN110428153A"
    ]
}