{
    "patent_id": "US-11092459-B2",
    "title": "GPS features and functionality in an athletic watch system ",
    "assignee": "Nike, Inc.",
    "publication_date": "2021-08-17",
    "patent_link": "https://patents.google.com/patent/US11092459B2/en",
    "inventors": [
        "Michael Hoffman",
        "Miles W. Brown",
        "Aaron B. Weast",
        "Matt Capozzi",
        "Tomislav Lakovic",
        "James Molyneux",
        "Jamian R. Cobbett"
    ],
    "classifications": [
        "G04F10/00",
        "G01C22/006",
        "A61B5/1118",
        "A63B69/00",
        "A61B5/002",
        "A61B5/6807",
        "A61B5/681",
        "A63B24/00",
        "A63B24/0062",
        "A63B71/06",
        "A63B71/0622",
        "A63B71/0686",
        "G01S19/19",
        "G04G17/04",
        "G04G17/045",
        "G04G21/00",
        "G04G21/02",
        "G04G21/025",
        "G04G21/08",
        "G04G9/007",
        "G06F11/30",
        "G06F13/4282",
        "G06F15/00",
        "G07C1/22",
        "H01R24/64",
        "A61B2562/0219",
        "A63B2071/0663",
        "A63B2220/20",
        "A63B2220/30",
        "A63B2220/40",
        "A63B2220/62",
        "A63B2225/50",
        "G04G9/0064",
        "H01R2107/00"
    ],
    "abstract": "Athletic performance monitoring systems include GPS data to enhance various features of the workout as well as the post-workout data analysis. Such features include using output from multiple sensors to determine the most accurate data available for providing distance measurements for individual segments of a route. The most accurate data for each route segment, from whatever source, then is used to provide the overall route distance and as the basis for making other calculations, such as pace, calorie burn, etc. Another feature relates to the ability to both input and output geographically tagged messages while moving along a route during an athletic performance.",
    "claims": "\n1. A system for monitoring an athletic performance, comprising:\na wrist-borne device, further comprising:\nan input system for receiving: (a) a first type of input data from a sensor of the wrist-borne device, indicative of an athlete's movement distance during an athletic performance over at least a first portion of a route and (b) a second type of input data indicative of the athlete's movement distance during the same athletic performance over at least the first portion of the route, wherein the first type of input data is generated by a first sensor hardware system that is independent from a second sensor hardware system that generates the second type of input data, wherein the second type of input data from the second sensor hardware system is indicative of features of foot contact with a surface over at least a portion of the athletic performance; and\na processing system programmed and adapted for:\ndetecting a discrepancy between the first type of input data and the second type of input data;\ndetermining that the second type of input data is more accurate for the first portion of the route;\ncalibrating the first type of input data using the second type of input data; and\ndetermining at least one of overall movement distance during the athletic performance, movement distance over the first portion of the route, overall pace during the athletic performance, or pace over the first portion of the route using the calibrated first type of input data.\n2. A system according to claim 1, wherein the first type of input data is pedometer data and the second type of input data is GPS data.\n3. A system according to claim 2, wherein the first sensor system generates the pedometer data over a second portion of the route during the athletic performance, and wherein the second sensor system generates the GPS data over the second portion of the route during the athletic performance.\n4. A system according to claim 3, wherein, in the step of determining at least one of overall movement distance during the athletic performance, movement distance over the first portion of the route, overall pace during the athletic performance, or pace over the first portion of the route, the processing system uses the pedometer data for providing the movement distance over the first portion of the route and the GPS data for providing the movement distance over the second portion of the route.\n5. A system according to claim 1, wherein the input system further receives a third type of input data indicative of acceleration changes over at least the first portion of the route.\n6. A system according to claim 5, wherein the third type of input data is used by the processing system in determining that the first type of input data is more accurate for the first portion of the route.\n7. A system according to claim 1, wherein the first sensor system generates the first type of input data over a second portion of the route during the athletic performance, and wherein the second sensor system generates the second type of input data over the second portion of the route during the athletic performance.\n8. A system according to claim 7, wherein, in the step of determining at least one of overall movement distance during the athletic performance, movement distance over the first portion of the route, overall pace during the athletic performance, or pace over the first portion of the route, the processing system uses the first type of input data for providing the movement distance over the first portion of the route and the second type of input data for providing the movement distance over the second portion of the route.\n9. A system according to claim 1, wherein the wrist-borne device comprises a watch device.\n10. A system according to claim 1, wherein the input system and processing system are included as part of a personal computer device.\n11. A method for monitoring an athletic performance, comprising:\nreceiving input data from a first sensor hardware system indicative of an athlete's movement distance during an athletic performance over a plurality of distance segments of a route;\nreceiving input data from a second sensor hardware system indicative of the athlete's movement distance during the same athletic performance over a plurality of distance segments of the route, wherein the received input data from the second sensor hardware system is indicative of features of foot contact with a surface over at least a portion of the athletic performance, wherein the first sensor hardware system is independent of the second sensor hardware system, and wherein the first sensor hardware system and the second sensor hardware system generate input data for at least partially overlapping segments of the route;\ndetecting a discrepancy between the input data from the first sensor hardware system and the input data from the second sensor hardware system;\ndetermining that the input data from the second sensor hardware system is more accurate for the segments of the route;\ncalibrating the input data from the first sensor hardware system using the input data from the second sensor hardware system; and\ndetermining at least one of overall movement distance during the athletic performance and overall pace during the athletic performance using the calibrated input data from the first sensor hardware system.\n12. A method according to claim 11, wherein the input data from the first sensor system is pedometer data and the input data from the second sensor system is GPS data.\n13. A method according to claim 12, wherein the pedometer data is used at a segment of the route corresponding to a start of the route.\n14. A method according to claim 12, wherein the pedometer data is used at segments of the route when GPS data is not available.\n15. A method according to claim 11, wherein the input data from the first and second sensor systems are received in a portable electronic device.\n16. A method according to claim 11, wherein the input data from the first and second sensor systems are received in a watch device.\n17. A method according to claim 11, wherein the input data from the first and second sensor systems are transmitted over a network to a remote computing device.\n18. A method according to claim 11, wherein the input data indicative of the features of foot contact with a surface over at least a portion of the athletic performance is used in the determining whether the input data from the first sensor system or the input data from the second sensor system is likely more accurate."
}