{
    "patent_link": "https://patents.google.com/patent/US6115718A/en",
    "patent_id": "US6115718A",
    "title": "Method and apparatus for predicting document access in a collection of linked documents featuring link proprabilities and spreading activation",
    "abstract": "A method and apparatus for predicting document access within a collection of linked documents. The present invention utilizes a predictive technique known as \"spreading activation\" where document collections are graphically represented as a network. Empirical data is analyzed according to a law of surfing to generate a decay function which is used to dampen the activation as spreads through the network. Activation is applied to a set of focus documents and propagates through the network until a stable pattern of activation is achieved across all documents. From this stable pattern, the desired usage information is extracted. Such a system will provide several practical benefits to users of the World Wide Web. For example, the present invention can be used to identify relevant pages to a set of one or more focus pages or to predict the number of times a document will be accessed in a collection of linked documents. Further, alone or in combination, this information can be used in connection with web site design or re-design.",
    "inventors": [
        "Bernardo A. Huberman",
        "James E. Pitkow",
        "Peter L. Pirolli"
    ],
    "assignee": "Xerox Corp",
    "classifications": [
        "G06F16/951",
        "G06F16/93",
        "Y10S707/99943"
    ],
    "claims": "\n1. A method for predicting document access within a collection of linked documents comprising the steps of:\na) gathering usage data for said collection of linked documents;\nb) generating initial activation information, said initial activation information indicating a set of focus documents in said collection of linked documents;\nc) generating page to page transition information from said usage data, said page to page transition information indicating a strength of association between documents in said collection of linked documents;\nd) generating link probability information from said usage data, said link probability information indicating a distribution of the number of documents a user will access in said collection of linked documents;\ne) performing a spreading activation operation based on said initial activation information, page to page transition information and said probability information based on a network representation of said collection of linked documents; and\nf) extracting said document access information resulting from said spreading activation step when a stable pattern of activation across all nodes of said network representation of said collection of linked documents is reached.\n2. The method as recited in claim 1 wherein said step of generating link probability information from said usage data is further comprised of the step of generating mean and standard deviation values for the number of document accesses made by all users in said document collection, said mean and standard deviation values based on an inverse Gaussian distribution.\n3. The method as recited in claim 1 wherein said step of performing a spreading activation operation is further comprised of the step of using said link probability information as a dampening factor for activation across said network representation of said collection of linked documents.\n4. A method for modeling document access in a collection of linked documents based on prior usage information of said collection, said method comprising the steps of:\na) generating an initial activation matrix, said initial activation matrix indicating a set of focus documents in said collection of linked documents;\nb) generating a transition matrix using said prior usage information, said transition matrix indicating user traversal information between documents in said collection of link ed documents;\nc) generating a link probability vector from said prior usage information, said link probability vector indicating probabilities that a user will link to another document in said document collection;\nd) performing a spreading activation operation using said initial activation matrix, transition matrix and link probability vector to obtain a spreading activation result; and\ne) extracting document access information from said spreading activation result.\n5. The method as recited in claim 4 wherein said step of generating a link probability vector from said prior usage information is further comprised of the step generating mean and standard deviation values for the number of document accesses made by all users in said document collection, said mean and standard deviation values based on an inverse Gaussian distribution.\n6. The method as recited in claim 4 wherein said step of performing a spreading activation operation is further comprised of the step of using said link probability vector to dampen activation.\n7. A system for predicting document access within a collection of linked documents comprising:\nmeans for gathering usage data for said collection of linked documents;\nmeans for generating initial activation information, said initial activation information indicating a set of focus documents in said collection of linked documents;\nmeans for generating page to page transition information from said usage data, said page to page transition information indicating a strength of association between documents in said collection of linked documents;\nmeans for generating link probability information from said usage data, said link probability information indicating a distribution of the number of documents a user will access in said collection of linked documents;\nspreading activation means for performing a spreading activation operation based on said initial activation information, page to page transition information and said probability information based on a network representation of said collection of linked documents; and\ninformation extraction means for extracting said document access information resulting from said spreading activation step when a stable pattern of activation across all nodes of said network representation of said collection of linked documents is reached.\n8. The system as recited in claim 7 wherein said means for generating link probability information is further comprised of statistics generation means for generating mean and standard deviation values for the number of document accesses made by all users in said document collection, said mean and standard deviation values based on an inverse Gaussian distribution.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5305389A",
        "US5418948A",
        "US5668988A",
        "US5754939A",
        "US5835905A",
        "US5842199A",
        "US5878223A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6263361B1",
        "WO2001058076A2",
        "WO2001093102A1",
        "US20020049573A1",
        "US20020056082A1",
        "US20020091820A1",
        "US6421675B1",
        "US20020118835A1",
        "US20020124075A1",
        "US20020133614A1",
        "US6499034B1",
        "US20030004996A1",
        "US20030005038A1",
        "US20030004995A1",
        "US20030005053A1",
        "US20030033333A1",
        "US6526398B2",
        "US20030074350A1",
        "US20030167252A1",
        "US20030184598A1",
        "US6631496B1",
        "US20030195944A1",
        "US6640218B1",
        "US6665837B1",
        "US20040088323A1",
        "US20040088312A1",
        "US20040088325A1",
        "US20040088275A1",
        "US20040088287A1",
        "US20040088276A1",
        "US20040088322A1",
        "US20040090462A1",
        "US20040167765A1",
        "US6826572B2",
        "US20040249482A1",
        "US20050005760A1",
        "US20050034057A1",
        "US20050033712A1",
        "US20050080657A1",
        "US20050080656A1",
        "WO2005048053A2",
        "US20050114322A1",
        "US20050182592A1",
        "US20050182753A1",
        "US20050223309A1",
        "US20050240662A1",
        "US20060004732A1",
        "US6990437B1",
        "US6990628B1",
        "US20060041542A1",
        "US7017110B1",
        "US20060064411A1",
        "US7035786B1",
        "US20060112105A1",
        "US20060122927A1",
        "US20060143096A1",
        "US20060241931A1",
        "US20060284981A1",
        "US20070005892A1",
        "US20070055612A1",
        "US20070106758A1",
        "US7253919B2",
        "US20070260598A1",
        "US20070265996A1",
        "US20080034113A1",
        "US20080168070A1",
        "US7424129B2",
        "US7440126B2",
        "US20080270377A1",
        "US20080270398A1",
        "US20080313117A1",
        "US7495795B2",
        "US7505163B2",
        "US7505178B2",
        "US7508535B2",
        "US7511846B2",
        "US20090112668A1",
        "US7528976B2",
        "US7528977B2",
        "US7551312B1",
        "US20090187446A1",
        "US7570380B2",
        "US20090198559A1",
        "US7573593B2",
        "US7669127B2",
        "US7689712B2",
        "US7707575B2",
        "US20100161611A1",
        "US7747655B2",
        "US7769805B1",
        "US7853594B2",
        "US7861169B2",
        "US7864352B2",
        "US7881920B2",
        "US20110093425A1",
        "US20110099164A1",
        "US8077341B2",
        "US8274666B2",
        "US8380866B2",
        "US8635531B2",
        "US20140082149A1",
        "US8781977B1",
        "US8805929B2",
        "US9081866B2",
        "US9087307B2",
        "US20150271036A1",
        "US10083420B2",
        "US10118099B2",
        "US10268536B2",
        "US10284454B2",
        "US10286326B2",
        "US10315113B2",
        "US10376793B2",
        "US10471348B2",
        "US10500498B2",
        "US10561945B2",
        "US10627983B2",
        "US10765948B2",
        "US10909209B2",
        "US10974150B2",
        "US11040286B2",
        "US11097193B2",
        "US11351459B2",
        "US11524234B2",
        "US11679330B2",
        "US11712627B2"
    ],
    "citedby_ftf": [
        "EP1252735B1",
        "US7974875B1",
        "US6671711B1",
        "US6549896B1",
        "US6907459B2",
        "US7996391B2",
        "US10949320B2"
    ]
}