{
    "patent_link": "https://patents.google.com/patent/US4663703A/en",
    "patent_id": "US4663703A",
    "title": "Predictive model reference adaptive controller",
    "abstract": "Apparatus and method for controlling the output of a dynamic system which is susceptible to changing dynamic characteristics. The desired present and future outputs of the system are applied to a predictor which determines the inputs to a model reference adaptive control subsystem from which the actual outputs are produced. The predictor uses an impulse model of the subsystem to simulate and predict future outputs. The adaptive control subsystem includes adjustable gain feedback or controlloops which are adjusted to make the dynamic system appear to have constant characteristics even when its dynamic characteristics are changing. A reference model of the dynamic system is used as the basis for the gain adjustments. The equation weights for the mathematical impulse model used by the input predictor are derived from the reference model of the adaptive control subsystem, and remain constant throughout the operation of the controller.",
    "inventors": [
        "George S. Axelby",
        "Vedat Geldiay",
        "Clinton W. Moulds, III"
    ],
    "assignee": "CBS Corp",
    "classifications": [],
    "claims": "\n1. An arrangement for controlling the output of a dynamic system, said arrangement comprising:\nmeans for providing signals proportional to the desired output of the dynamic system;\nan adaptive control subsystem for controlling the output of the dynamic system based upon a reference model;\nan impulse model having constants derived from said reference model; and\nan input predictor which uses said impulse model to predict inputs for said subsystem which will provide a dynamic system output similar to the output available from the providing means.\n2. The controlling arrangement of claim 1 wherein the reference model represents the response of the dynamic system when its dynamic characteristics do not change.\n3. The controlling arrangement of claim 1 wherein the adaptive control subsystem presents fixed and known response characteristics to the inputs from the predictor.\n4. The controlling arrangement of claim 1 wherein the inputs to the adaptive control subsystem from the predictor cause a known response at the output of the subsystem even upon drastic changes in the dynamic characteristics of the controlled dynamic system.\n5. The controlling arrangement of claim 1 wherein the signal providing means produces signals representative of the present and future desired output of the dynamic system.\n6. The controlling arrangement of claim 1 wherein the adaptive control subsystem varies the gain of output position and output derived velocity control loops driving the dynamic system.\n7. The controlling arrangement of claim 1 wherein the adaptive control subsystem responds to a difference signal between the output of the reference model and the output of the dynamic system.\n8. The controlling arrangement of claim 1 wherein the constants of the impulse model are predetermined from reference model weights and remain the same during the operation of the controlling arrangement.\n9. The controlling arrangement of claim 1 wherein the input predictor analyzes simulated future outputs of the dynamic system in producing the present input to the adaptive control subsystem.\n10. An arrangement for controlling the output of a dynamic system, said arrangement comprising:\nmeans for providing signals representing the desired present and future outputs of the dynamic system;\na reference model based upon the unchanging characteristics of the dynamic system;\nadaptive means for maintaining the characteristics of the dynamic system equal to the characteristics of the reference model under changing conditions;\nan impulse model with weights derived from said reference model; and\nan input predictor which uses said impulse model to determine the present input to the adaptive means which is calculated to yield the closest match between a desired future output and a future output predicted by use of the impulse model.\n11. A method for controlling the output of a dynamic system, said method comprising the steps of:\ndetermining the weights of an impulse response model from a reference model used by a model reference adaptive control subsystem;\nproviding signals proportional to the desired present and future outputs of the dynamic system;\npredicting future outputs of the subsystem by use of said impulse model;\ncomparing the predicted future outputs of the subsystem with the desired future outputs; and\napplying a present input to the subsystem which gives the closest match between said desired and predicted future outputs.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US3221151A",
        "US3221230A",
        "US3221229A",
        "US4021716A",
        "US4195337A",
        "US4197576A",
        "US4437045A",
        "US4495577A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4750965A",
        "US4774667A",
        "EP0291553A1",
        "US4873649A",
        "US4882526A",
        "US4951191A",
        "US5027299A",
        "US5049796A",
        "US5062066A",
        "US5081591A",
        "US5144549A",
        "US5166872A",
        "US5198984A",
        "US5233512A",
        "US5260874A",
        "FR2694849A1",
        "US5335164A",
        "US5406488A",
        "US5455763A",
        "US5519605A",
        "US5532565A",
        "US5539638A",
        "US5623402A",
        "US5682309A",
        "US5687077A",
        "US5724239A",
        "US5740033A",
        "US5933345A",
        "WO2001075660A1",
        "US6421823B1",
        "US20020128735A1",
        "US20020156548A1",
        "US6473658B1",
        "US6493596B1",
        "US20020193902A1",
        "US20020193899A1",
        "US20020199082A1",
        "US20030014145A1",
        "WO2003023532A1",
        "WO2003034160A1",
        "US20030120360A1",
        "US6615090B1",
        "US20030200075A1",
        "US20030200189A1",
        "US20030200191A1",
        "US20030199112A1",
        "US20040015335A1",
        "US20040019574A1",
        "US6708074B1",
        "US20040059441A1",
        "US6721608B1",
        "US20040143357A1",
        "US6768969B1",
        "US20040225377A1",
        "US6825631B1",
        "US20040248409A1",
        "US20050008227A1",
        "US20050027373A1",
        "US20050033709A1",
        "US20050033456A1",
        "US6913938B2",
        "EP1229232A3",
        "WO2005062906A2",
        "US20050201048A1",
        "US20050208879A1",
        "US6961626B1",
        "US6984198B2",
        "US20060074501A1",
        "US7050865B2",
        "US20060111816A1",
        "US7096085B2",
        "US7101799B2",
        "US20060229743A1",
        "US20060241786A1",
        "US20060259197A1",
        "US7149590B2",
        "US20060287741A1",
        "US7160739B2",
        "US7188142B2",
        "US7201936B2",
        "US7225047B2",
        "US20070225674A1",
        "US20070250133A1",
        "US20070249953A1",
        "US20070249955A1",
        "US20070249956A1",
        "US20070249954A1",
        "US20070265544A1",
        "US7333871B2",
        "US20080065241A1",
        "US7356377B2",
        "US7354332B2",
        "US7853338B1",
        "US20110288846A1",
        "CN102497125A",
        "CN103777520A",
        "USRE45815E1",
        "CN105182756A",
        "FR3039130A1",
        "US10048658B2",
        "US20200150630A1",
        "US10844795B2",
        "CN113328672A"
    ],
    "citedby_ftf": []
}