{
    "patent_link": "https://patents.google.com/patent/US20020087797A1/en",
    "patent_id": "US20020087797A1",
    "title": "System and method for populating cache servers with popular media contents",
    "abstract": "A system and method for caching files is disclosed. Popularity values are calculated for a plurality of files over a period of time. The popularity values are then used to determine which files should be cached at various remote sites. Once the caches are filled, the popularity values associated with the cached files are periodically compared with the popularity values of uncached content. Generally, if the popularity of an uncached file is greater than the popularity of a cached file, then the cached file will be replaced. However, numerous different variables may be factored into the caching determination including, for example, the size of the file, the required bitrate of the file, the identity of the owner of the file, and/or the type of file.",
    "inventors": [
        "Farid Adrangi"
    ],
    "assignee": "Intel Corp",
    "classifications": [
        "H04L63/10",
        "G06F12/0888",
        "G06F16/9574"
    ],
    "claims": "\n1. A method for network caching comprising:\ncalculating popularity values for a plurality of network files, said popularity values based on a number of requests for each of said files over a period of time; and\ntransferring a subset of said plurality of network files to a cache based on said calculated popularity values.\n2. The method as in claim 1 wherein calculating further comprises:\npruning one of said requests from said popularity value calculation if a subsequent request for a particular file is not received after a specified period of time.\n3. The method as in claim 1 further comprising:\ncalculating popularity values for files stored in said cache; and\nreplacing one or more of said files in said cache with one or more of said plurality of files not in said cache having higher popularity values when said cache is full.\n4. The method as in claim 1 further comprising:\nstoring a popularity value associated with each file in a file request history list.\n5. The method as in claim 4 wherein said popularity values are calculated for each file after a predetermined miss-count threshold is reached.\n6. The method as in claim 4 wherein said popularity values are calculated after a predetermined period of time.\n7. The method as in claim 1 wherein said popularity values are calculated using the equation: Popularity=Number of Requests/Elapsed Time.\n8. The method as in claim 1 wherein said popularity values are further based on file size.\n9. The method as in claim 1 wherein said popularity values are further based on file type.\n10. The method as in claim 1 wherein said popularity values are further based on identities of content providers providing said files.\n11. A system for caching files comprising:\none or more popularity calculation modules to calculate popularity values for a plurality of files based at least in part on a number of user requests for each of said plurality of files and to generate a prioritized list of said plurality of files based on said popularity values; and\none or more caching analysis modules to transfer one or more of said plurality of files to a cache based on said prioritized list; and\none or more file transfer modules to transfer said one or more of said plurality of files to a cache.\n12. The system as in claim 11 further comprising:\npruning logic to prune one or more of said requests from said popularity value calculation if a subsequent user request for a particular file is not received after a specified period of time.\n13. The system as in claim 11 wherein said popularity calculation modules further:\ncalculate popularity values for files stored in said cache; and\nreplace one or more of said files in said cache with one or more of said plurality of files not in said cache having higher popularity values when said cache is full.\n14. The system as in claim 11 further comprising:\na file request history list employed by said popularity calculation modules to calculate and store said popularity values associated with said files.\n15. The system as in claim 14 wherein said popularity values are calculated for each file after a predetermined miss-count threshold is reached.\n16. The system as in claim 11 wherein said popularity calculation modules calculate said popularity values using the equation: Popularity=Number of Requests/Elapsed Time.\n17. The system as in claim 11 wherein popularity calculation modules factor in file size when calculating said popularity.\n18. The method as in claim 11 wherein popularity calculation modules factor in file type when calculating said popularity.\n19. The method as in claim 11 wherein said popularity calculation modules factor in identities of content providers providing said files when calculating said popularity values.\n20. An article of manufacture including a sequence of instructions which, when executed by a processor, causes said processor to:\ncalculate popularity values for a plurality of network files, said popularity values based on a number of requests for each of said files over a period of time; and\ncache a subset of said plurality of network files based on said calculated popularity values.\n21. The article of manufacture as in claim 20 including additional instructions to cause said processor to:\nprune one of said requests from said popularity value calculation if a subsequent request for a particular file is not received after a specified period of time.\n22. The article of manufacture as in claim 20 including additional instructions to cause said processor to:\ncalculate popularity values for files stored in said cache; and\nreplace one or more of said files in said cache with one or more of said plurality of files not in said cache having higher popularity values when said cache is full.\n23. The article of manufacture as in claim 20 including additional instructions to cause said processor to:\nstore a popularity value associated with each file in a file request history list.\n24. The article of manufacture as in claim 23 wherein said popularity values are calculated for each file after a predetermined miss-count threshold is reached.\n25. The article of manufacture as in claim 20 wherein said popularity values are calculated after a predetermined period of time.\n26. The article of manufacture as in claim 20 including additional instructions to cause said processor to calculate popularity values using the equation: Popularity=Number of Requests/Elapsed Time.\n27. The article of manufacture as in claim 20 including additional instructions to cause said processor to factor in file size when calculating popularity values.\n28. The article of manufacture as in claim 20 including additional instructions to cause said processor to factor in a required bitrate at which said files are to be transmitted to end users when calculating popularity values.\n29. The article of manufacture as in claim 20 including additional instructions to cause said processor to factor in identities of content providers providing said files when calculating popularity values.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US6098096A",
        "US6415368B1"
    ],
    "citations_ftf": [
        "US4920432A",
        "US4949248A",
        "US4949187A",
        "US5544347A",
        "US5172413A",
        "US5253275A",
        "US5253341A",
        "DE69232164T2",
        "US5247347A",
        "US5528281A",
        "US5371532A",
        "US5291554A",
        "US5442389A",
        "US5508732A",
        "EP0625856B1",
        "US5550982A",
        "US5414455A",
        "US5442390A",
        "JPH07175868A",
        "JPH07212712A",
        "US5475615A",
        "US5845090A",
        "US5544327A",
        "US5544313A",
        "US5768521A",
        "JP2601189B2",
        "US5515511A",
        "US5519435A",
        "US5614940A",
        "US6181867B1",
        "US6003030A",
        "US5774668A",
        "US5737495A",
        "US5832069A",
        "US6233623B1",
        "US5778187A",
        "US6023470A",
        "US5918013A",
        "US5774660A",
        "WO1998044733A1",
        "US6112239A",
        "ATE252801T1",
        "US6098108A",
        "US6240462B1",
        "US6421714B1",
        "US6081840A",
        "US6070191A",
        "US6016512A",
        "US6266335B1",
        "AU3092699A",
        "US6115752A",
        "US6108703A",
        "US6317787B1",
        "US6442588B1",
        "US6466949B2",
        "US6427170B1",
        "US6389462B1",
        "US6345294B1",
        "US6487555B1",
        "US6351776B1",
        "US6484143B1"
    ],
    "citedby_own": [
        "US20020087623A1",
        "US20030050966A1",
        "US20030182390A1",
        "US20030182400A1",
        "US20040034855A1",
        "EP1406174A2",
        "US20040122867A1",
        "US20040221019A1",
        "US20050166019A1",
        "US20050283537A1",
        "US20060028995A1",
        "US20060047818A1",
        "US20060047532A1",
        "US20060075059A1",
        "US20060080443A1",
        "US20060206796A1",
        "US20060224620A1",
        "US20060238379A1",
        "US20060294049A1",
        "US20070055643A1",
        "US20070162700A1",
        "US20070226229A1",
        "US20070243871A1",
        "US20070282980A1",
        "US20070282950A1",
        "EP1866788A2",
        "US20080059721A1",
        "US20080059565A1",
        "EP1896954A2",
        "US20080071859A1",
        "US20080162623A1",
        "US7430738B1",
        "US20080271112A1",
        "US20080274755A1",
        "US7490137B2",
        "US20090043967A1",
        "US20090144793A1",
        "US7594230B2",
        "US20090254661A1",
        "US20090316715A1",
        "US7734820B1",
        "US20100235432A1",
        "US20110022685A1",
        "US20110170470A1",
        "US20110202596A1",
        "EP2388704A1",
        "US20120093054A1",
        "US20120110036A1",
        "US20120151073A1",
        "US8489815B2",
        "US20130204961A1",
        "US20130263194A1",
        "US8626837B2",
        "US8631203B2",
        "US20140068196A1",
        "US8688742B2",
        "US20140280606A1",
        "US8909861B2",
        "US9032151B2",
        "US9165282B2",
        "CN105190566A",
        "US20160028830A1",
        "US20160078361A1",
        "US20160156714A1",
        "US20160156733A1",
        "US9361183B2",
        "US20160248867A1",
        "US20160330269A1",
        "US9565222B2",
        "US9762692B2",
        "EP3217670A1",
        "US9930132B2",
        "US10037271B1",
        "CN108966014A",
        "US10194183B2",
        "US10205797B2",
        "US10291735B2",
        "US10326855B2",
        "WO2019165264A1",
        "EP3032805B1",
        "US10506063B2",
        "US20200029189A1",
        "US10630771B1",
        "US10757360B1",
        "US10924573B2",
        "US11025747B1",
        "US11039176B2",
        "US11075987B1",
        "US11108729B2",
        "US11115500B2",
        "US11134134B2",
        "US11184457B2",
        "US11194719B2",
        "US11205037B2",
        "US11245770B2",
        "US11283715B2",
        "US11290418B2",
        "US11297140B2",
        "US11303717B2",
        "US11330008B2",
        "US11336712B2",
        "US11362986B2",
        "US11381487B2",
        "US11445225B2",
        "US11451472B2",
        "US11457088B2",
        "US11463550B2",
        "US11461402B2",
        "US11474706B2",
        "US11604667B2",
        "US11762703B2"
    ],
    "citedby_ftf": [
        "SE512880C2",
        "US20030065746A1",
        "US7130908B1",
        "US7174373B1",
        "US7154898B1",
        "US7237017B1",
        "US20020131428A1",
        "US20020138589A1",
        "US20020174189A1",
        "US20020156863A1",
        "US6957212B2",
        "US7013462B2",
        "US20030055910A1",
        "US8713623B2",
        "US7444393B2",
        "US7062756B2",
        "US20030115346A1",
        "US20030115421A1",
        "US7103724B2",
        "US20030225885A1",
        "EP1401108A1",
        "US7299467B2",
        "US7069351B2",
        "JP2005010970A",
        "JP4144005B2",
        "US8234414B2",
        "US20060064482A1",
        "US7698386B2",
        "US9723267B2",
        "KR100758281B1",
        "US8688801B2",
        "US20070067309A1",
        "US20070061282A1",
        "US8005889B1",
        "US8788572B1",
        "JP4215786B2",
        "US7756130B1",
        "US7996483B2",
        "US8769185B2",
        "US20100281035A1",
        "US11144969B2",
        "US9300445B2",
        "US9185341B2",
        "US20120144117A1",
        "US20120221708A1",
        "US8898244B2",
        "CN107592656B",
        "CN110830535B",
        "KR20200058859A",
        "US11237730B2",
        "US11163698B2",
        "US11169919B2",
        "US11151035B2",
        "US11176052B2"
    ]
}