{
    "patent_id": "US-11288588-B2",
    "title": "Constructing and programming quantum hardware for robust quantum annealing processes ",
    "assignee": "Google Llc",
    "publication_date": "2022-03-29",
    "patent_link": "https://patents.google.com/patent/US11288588B2/en",
    "inventors": [
        "Masoud MOHSENI",
        "Hartmut Neven"
    ],
    "classifications": [
        "G06N10/00",
        "G06N10/60",
        "G06F15/82",
        "G06F17/11",
        "G06N10/20",
        "G06N7/005",
        "G06N7/01",
        "H01L39/025",
        "H01L39/223",
        "H01L39/228",
        "H10N60/12",
        "H10N60/128",
        "H10N60/805",
        "G06N10/40",
        "G06N20/00"
    ],
    "abstract": "Among other things, an apparatus comprises quantum units; and couplers among the quantum units. Each coupler is configured to couple a pair of quantum units according to a quantum Hamiltonian characterizing the quantum units and the couplers. The quantum Hamiltonian includes quantum annealer Hamiltonian and a quantum governor Hamiltonian. The quantum annealer Hamiltonian includes information bearing degrees of freedom. The quantum governor Hamiltonian includes non-information bearing degrees of freedom that are engineered to steer the dissipative dynamics of information bearing degrees of freedom.",
    "claims": "\n1. A method comprising:\nfor a quantum processor solving an optimization problem,\nencoding, by one or more processors, the optimization problem into an energy spectrum of a quantum Hamiltonian Htotal that characterizes the quantum processor, wherein the quantum processor is controllable such that Htotal evolves from an initial quantum Hamiltonian Hi over time to a problem quantum Hamiltonian Hp, wherein an energy spectrum of Hp encodes a solution to the optimization problem, and wherein a quantum state evolves from a ground state of Hi towards a ground state of Hp as Htotal evolves from Hi to Hp;\noutputting a first set of control parameters based on the encoding for programming the quantum processor and parameterization of Htotal;\noutputting a second set of control parameters for programming the quantum processor to reflect the parameterization of Htotal limit evolution of the quantum state into the ground state of Hp as Htotal evolves to Hp without diagonalizing Hp; and\nreceiving, by the one or more processors from the quantum processor, an output associated with a state of the quantum state at the end of the evolution.\n2. The method of claim 1, further comprising:\nrepeatedly, for a predetermined number of times, outputting a second set of control parameters; and\nperforming a statistical analysis on the received outputs.\n3. The method of claim 2, wherein the predetermined number of times is dependent on the length of the evolution.\n4. The method of claim 1, wherein the first set of control parameters comprise initialization parameters for the quantum processor.\n5. The method of claim 1, wherein the second set of control parameters comprise disorders induced, in part, by two-body interaction parameters.\n6. The method of claim 1, wherein the method further comprises:\nproviding, by the one or more processors, the first set of control parameters and second set of control parameters to the quantum processor to initialize and program the quantum processor.\n7. The method of claim 1, wherein the output associated with a state of the quantum state at the end of the evolution comprises eigenstates of the quantum Hamiltonian Htotal that characterize the quantum processor and their corresponding energy spectra.\n8. The method of claim 1, wherein the quantum state at the end of the evolution encodes a solution to the optimization problem.\n9. The method of claim 1, wherein the encoding is based on the structure of the quantum processor.\n10. The method of claim 9, wherein the structure of the quantum processor comprises couplings between qubits in the quantum processor.\n11. An apparatus comprising:\na quantum processor for solving an optimization problem; and\na control system for programming the quantum processor, wherein the control system comprises one or more processors configured to:\nencode the optimization problem into an energy spectrum of a quantum Hamiltonian Htotal that characterizes the quantum processor, wherein the quantum processor is controllable such that Htotal evolves from an initial quantum Hamiltonian Hi over time to a problem quantum Hamiltonian Hp, wherein an energy spectrum of Hp encodes a solution to the optimization problem, and wherein a quantum state evolves from a ground state of Hi, towards a ground state of Hp as Htotal evolves from Hi to Hp;\noutput a first set of control parameters based on the encoding for programming the quantum processor and parameterization of Htotal;\noutput a second set of control parameters for programming the quantum processor to reflect the parameterization of Htotal limit evolution of the quantum state into the ground state of Hp as Htotal evolves to Hp without diagonalizing Hp; and\nreceive, from the quantum processor, an output associated with a state of the quantum state at the end of the evolution.\n12. The apparatus of claim 11, wherein the control system is further configured to:\nrepeatedly, for a predetermined number of times, output a second set of control parameters; and\nperform a statistical analysis on the received outputs.\n13. The apparatus of claim 12, wherein the predetermined number of times is dependent on the length of the evolution.\n14. The apparatus of claim 11, wherein the first set of control parameters comprise initialization parameters for the quantum processor.\n15. The apparatus of claim 11, wherein the second set of control parameters comprise disorders induced, in part, by two-body interaction parameters.\n16. The apparatus of claim 11, wherein the control system is further configured to:\nprovide the first set of control parameters and second set of control parameters to the quantum processor to initialize and program the quantum processor.\n17. The apparatus of claim 11, wherein the output associated with a state of the quantum state at the end of the evolution comprises eigenstates of the quantum Hamiltonian Htotal that characterizes the quantum processor and their corresponding energy spectra.\n18. The apparatus of claim 11, wherein the quantum state at the end of the evolution encodes a solution to the optimization problem.\n19. The apparatus of claim 11, wherein the encoding is based on the structure of the quantum processor.\n20. The apparatus of claim 19, wherein the structure of the quantum processor comprises couplings between qubits in the quantum processor.",
    "status": "Active",
    "citations_own": [
        "WO2003090162A2",
        "US20040000666A1",
        "US20050224784A1",
        "US6979836B2",
        "US20070180586A1",
        "US20080162613A1",
        "WO2009075861A2",
        "CN101548288A",
        "WO2009143166A2",
        "US20090299947A1",
        "US20100258746A1",
        "US20110133770A1",
        "US20110231462A1",
        "US20120023053A1",
        "WO2012082938A2",
        "US20120254586A1",
        "US20140250288A1",
        "US20150262073A1",
        "US20150310350A1",
        "US20160328659A1",
        "US20160343932A1",
        "US20170104493A1"
    ],
    "citations_ftf": [
        "US7639035B2",
        "CA2719343C",
        "JP5669069B2"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US7533068B2",
        "US10037493B2",
        "CN105960650B",
        "US10002107B2",
        "US11797641B2",
        "CA2881033C",
        "WO2016138399A1",
        "JP6843336B2",
        "US10467545B2",
        "WO2017087630A1",
        "US10187065B2",
        "WO2017087627A1",
        "US10360088B2",
        "US11113620B2",
        "CN108701263B",
        "CA3017275C",
        "CA3210815A1",
        "JP6915110B2",
        "US9870273B2",
        "US10044638B2",
        "CN109716360B",
        "JP6723439B2",
        "JP2018067200A",
        "US11157828B2",
        "US11263547B2",
        "US10255557B2",
        "US10332024B2",
        "US10074792B1",
        "US10282675B2",
        "EP3504667A1",
        "US10977570B2",
        "KR102582515B1",
        "US11494655B2",
        "US11494683B2",
        "WO2019156759A2",
        "US11108380B2",
        "US10749096B2",
        "US11010145B1",
        "US11334693B1",
        "US10838792B1",
        "US11620561B2",
        "US10540603B2",
        "US10852366B2",
        "US11568293B2",
        "WO2020037301A1",
        "WO2020041295A1",
        "US10510943B1",
        "US11050009B2",
        "US10475983B1",
        "WO2020047444A1",
        "JP6856592B2",
        "US10886049B2",
        "US11650751B2",
        "US11488049B2",
        "CN110120799A",
        "US11537928B2",
        "CN110045613B",
        "JP7171520B2",
        "US11537381B2",
        "CN112651508B",
        "JP6773359B1",
        "WO2022204266A1",
        "US20220366287A1"
    ]
}