{
    "patent_link": "https://patents.google.com/patent/US6038574A/en",
    "patent_id": "US6038574A",
    "title": "Method and apparatus for clustering a collection of linked documents using co-citation analysis",
    "abstract": "The method and apparatus of the present invention generates clusters of documents in a collection of linked documents based on co-citation analysis. The frequency linkage is determined for each document in the collection. In other words, the number of times each document is linked to by another document in the collection is determined. Further, a minimum frequency linkage (link frequency threshold) is specified based on a predetermined minimum frequency of document linkage. Additionally, a list of pairs of documents that are linked to by the same document is created so that each of the pairs of documents has a count of the number of times (co-citation frequency) that they are both linked to by another document. Pairs of linked documents are clustered using a suitable co-citation technique.",
    "inventors": [
        "James E. Pitkow",
        "Peter L. Pirolli",
        "Jock D. Mackinlay",
        "Stuart K. Card"
    ],
    "assignee": "Majandro LLC",
    "classifications": [
        "G06F16/30",
        "Y10S707/99935",
        "Y10S707/99943"
    ],
    "claims": "\n1. A method for clustering documents contained in a collection of linked documents, said method comprising the steps of:\na) specifying a link frequency threshold, said link frequency threshold indicating a number of times a document is linked to from another document in said collection;\nb) for each document in said collection, determining an associated link frequency;\nc) discarding each document in said collection whose link frequency is lower than said link frequency threshold;\nd) creating a co-citation list, said co-citation list comprised of pairs of documents that are linked to by the same document in said collection; and\ne) performing a suitable clustering operation on said co-citation list to generate document clusters.\n2. The method as recited in claim 1 wherein said suitable clustering operation is a transitive closure clustering operation.\n3. The method as recited in claim 1 wherein said suitable clustering operation is a statistical clustering operation.\n4. The method as recited in claim 3 wherein said step of creating a co-citation list is further comprised of the step of for each pair in said co-citation list, generating a co-citation frequency indicating the number of times each pair was cited by the same document, and wherein said statistical clustering operations uses said co-citation frequency.\n5. The method as recited in claim 1 wherein said method is further comprised of the steps of:\nf) determining if said generated document clusters provides acceptable clustering results;\ng) if said generated document clusters does not provide acceptable clustering results, varying the value of said link frequency threshold; and\nh) repeating steps b)-e).\n6. The method as recited in claim 5 wherein an unacceptable clustering results is a combination of few large clusters and many small clusters, said step of varying the value of said link frequency threshold causes said link frequency threshold to decrease.\n7. The method as recited in claim 5 wherein an unacceptable clustering result is a combination of fewer clusters with fewer documents in the clusters, said step of varying the value of said link frequency threshold causes said link frequency threshold to increase.\n8. The method as recited in claim 5 wherein prior to step f) performing the step of presenting a visualization of said generated document clusters.\n9. A system for clustering documents in a collection of linked documents, said system comprising\nmeans for accessing said documents in said collection of linked documents;\nmeans for specifying a link frequency threshold;\nlink analysis means for analyzing the links contained in said documents in said collection of linked documents, said link analysis means further comprising:\nmeans for determining the number of times a document has been linked to; and\nmeans for generating a co-citation list, said co-citation list indicating pairs of documents that have been linked to by the same document;\nclustering means for generating document clusters from said co-citation list.\n10. The system as recited in claim 9 wherein said clustering means performs a transitive closure operation.\n11. The system as recited in claim 9 wherein said clustering means performs a statistical clustering operation.\n12. The system as recited in claim 11 wherein said means for generating a co-citation list is further comprised of the step of generating a co-citation frequency for each pair in said list, said co-citation frequency indicating the number of times each of said pairs in said list were linked to by the same document, and said statistical clustering operation utilizes said co-citation frequency.\n13. The system as recited in claim 9 further comprising cluster display visualization means for providing a visual display of said generated document clusters.\n14. A program storage device readable by a machine, tangibly embodying a program of instructions executable by the machine to perform method steps for the clustering of documents in a collection of linked documents, said method steps comprising:\na) specifying a link frequency threshold, said link frequency threshold indicating a number of times a document is linked to from another document in said collection;\nb) for each document in said collection, determining an associated link frequency;\nc) discarding each document in said collection whose link frequency is lower than said link frequency threshold;\nd) creating a co-citation list, said co-citation list comprised of pairs of documents that are linked to by the same document in said collection; and\ne) performing a suitable clustering operation on said co-citation list to generate document clusters.\n15. The program storage device as recited in claim 14 wherein said method steps are further comprised of the steps of:\nf) displaying a visualization of said document clusters;\ng) determining if said generated document clusters provides acceptable clustering results;\nh) if said generated document clusters does not provide acceptable clustering results, varying the value of said link frequency threshold; and\ni) repeating steps b)-f).",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5568640A",
        "US5594897A",
        "US5675819A",
        "US5717922A",
        "US5819258A",
        "US5870552A",
        "US5895470A",
        "US5920859A"
    ],
    "citations_ftf": [
        "US5794236A",
        "US5835905A"
    ],
    "citedby_own": [
        "US6131110A",
        "US6260038B1",
        "US6272507B1",
        "US6363377B1",
        "US20020156810A1",
        "WO2002091155A2",
        "WO2002097647A1",
        "US20030018617A1",
        "US20030033333A1",
        "US20030074368A1",
        "US20030074350A1",
        "US20030097357A1",
        "US6584468B1",
        "US6582474B2",
        "US20030120630A1",
        "US20030154181A1",
        "US20030195944A1",
        "US6654743B1",
        "US6654739B1",
        "US6675170B1",
        "US6684205B1",
        "US20040122841A1",
        "US20040133562A1",
        "US20040220842A1",
        "US20050010559A1",
        "US20050010555A1",
        "US6862586B1",
        "US20050138056A1",
        "US20050166149A1",
        "US20050171948A1",
        "US6941321B2",
        "US20050203924A1",
        "US20050251496A1",
        "US20060074867A1",
        "US20060106847A1",
        "US20060224973A1",
        "US20060224999A1",
        "US20060224978A1",
        "US20060224976A1",
        "US20060225000A1",
        "US20060224974A1",
        "US20060224972A1",
        "US20060224975A1",
        "US20060224983A1",
        "US20060224984A1",
        "US20060224980A1",
        "US20060248440A1",
        "US20060248094A1",
        "US20060265400A1",
        "US20060271536A1",
        "US20060287971A1",
        "US20070016848A1",
        "US7171618B2",
        "US20070057967A1",
        "US20070083505A1",
        "US20070094358A1",
        "US20070094297A1",
        "US7213198B1",
        "US20070112833A1",
        "US20070112748A1",
        "US7231494B1",
        "US20070133067A1",
        "US20070136288A1",
        "US20070162424A1",
        "US20070174254A1",
        "US20070250502A1",
        "US20070266144A1",
        "US20080134100A1",
        "US20080133479A1",
        "US20080134060A1",
        "US7391885B2",
        "US20080154848A1",
        "US20080201655A1",
        "US7428528B1",
        "US20080256031A1",
        "US7529756B1",
        "US20090125482A1",
        "US20090150431A1",
        "US20090154376A1",
        "US20090234816A1",
        "US20090259506A1",
        "US7617184B2",
        "US20100039431A1",
        "US20100049708A1",
        "US20100185962A1",
        "US7881255B1",
        "US20110029531A1",
        "US20110047156A1",
        "US20110107271A1",
        "US20110125751A1",
        "US8019752B2",
        "US20110221774A1",
        "US20110264672A1",
        "US8316001B1",
        "US8380718B2",
        "US8396882B2",
        "US8396889B2",
        "US20130198596A1",
        "US8639695B1",
        "US20140359412A1",
        "US9026591B2",
        "US20150169562A1",
        "US9098573B2",
        "US9262383B2",
        "US9262384B2",
        "US9268748B2",
        "US9336305B2",
        "US9443022B2",
        "US9600842B2",
        "US10095778B2",
        "US10467322B1",
        "US10635705B2",
        "US10984476B2",
        "US11037021B2",
        "US11068546B2",
        "US11636144B2"
    ],
    "citedby_ftf": [
        "US5544352A",
        "US6356922B1",
        "US6658623B1",
        "US7356462B2",
        "US6424979B1",
        "JP3674377B2",
        "US6990628B1",
        "US6421668B1",
        "US6754873B1",
        "US9471672B1",
        "US6651058B1",
        "US6704722B2",
        "EP1109106A1",
        "US6691163B1",
        "US20020116353A1",
        "US7685569B2",
        "US7386792B1",
        "US7158971B1",
        "CA2353682A1",
        "US20030033138A1",
        "AUPR796801A0",
        "US6754654B1",
        "JP2003242176A",
        "US20040133583A1",
        "US20040163044A1",
        "US20060075345A1",
        "US20050080768A1",
        "US7900160B2",
        "AR047362A1",
        "US7676517B2",
        "US7673019B2",
        "US8001121B2",
        "US8019763B2",
        "US20090063470A1",
        "JP5278327B2",
        "US20090112859A1",
        "US9135331B2",
        "US9251253B2",
        "US20160259819A1",
        "US11023475B2"
    ]
}