{
    "patent_link": "https://patents.google.com/patent/US20040254876A1/en",
    "patent_id": "US20040254876A1",
    "title": "Schemes for simulating a financial market",
    "abstract": "Schemes for simulating a financial market are described herein. In one embodiment, a system for simulating a financial market can comprise simulated market data and non-simulated market data associated with at least one tradable security, at least one server in communication with the data, and at least one agent in communication with the at least one server. The server can be configured to process trade requests associated with the tradable securities. The agent can be configured to provide a trade request associated with a selected one of the tradable securities. The trade request can be based on applying at least one rule to the non-simulated market data and the simulated market data associated with the selected tradable security.",
    "inventors": [
        "Joshua Coval",
        "Erik Stafford"
    ],
    "assignee": "Individual",
    "classifications": [
        "G06Q40/06",
        "G06Q40/04"
    ],
    "claims": "\n1. A system for simulating a financial market, the system comprising\nsimulated market data and non-simulated market data associated with at least one tradable security,\nat least one server in communication with the data, the at least one server configured to process trade requests associated with the at least one tradable security, and\nat least one agent in communication with the at least one server, the at least one agent configured to provide a trade request associated with a selected one of the at least one tradable security, the trade request based on applying at least one rule to the non-simulated market data and the simulated market data associated with the selected tradable security.\n2. The system of claim 1, wherein the at least one tradable security comprises at least one of a bond, a currency, a futures contract, an option contract, and a stock.\n3. The system of claim 1, wherein the simulated market data and the non-simulated market data comprise data based on at least one of a limit order book, a market price, and a trading volume associated with the at least one tradable security.\n4. The system of claim 1, wherein the non-simulated market data comprise data based on trading of the at least one tradable security on a physical financial market during a historical period of time.\n5. The system of claim 1, wherein the trade requests comprise at least one of:\na tradable security,\na trade type comprising one of a buy trade type and a sell trade type,\nan order type comprising one of a limit order type and a market order type,\na price, and\na quantity.\n6. The system of claim 1, wherein the at least one server is configured to update the simulated market data based on processing the trade requests.\n7. The system of claim 1, further comprising:\nportfolio data associated with at least one trading entity.\n8. The system of claim 7, wherein the at least one server is configured to determine whether the portfolio data associated with a trading entity from which a trade request originated satisfies a margin condition.\n9. The system of claim 7, wherein the at least one server is configured to update the portfolio data associated with a trading entity from which a trade request originated based on processing the trade request.\n10. The system of claim 7, wherein the at least one server is configured to provide to the at least one trading entity at least one of the simulated market data and the portfolio data associated with the at least one trading entity.\n11. The system of claim 1, wherein the at least one agent is configured to provide a trade request to adjust the simulated market data based on the non-simulated market data associated with the selected tradable security.\n12. The system of claim 1, wherein the at least one agent is configured to provide arbitrage data based on a difference between the simulated market data and the non-simulated market data associated with the selected tradable security.\n13. The system of claim 12, wherein the at least one agent is configured to provide a trade request based on applying the at least one rule to the arbitrage data.\n14. The system of claim 1, wherein the at least one rule comprises at least one threshold and at least one associated intervention scheme.\n15. A method for simulating a financial market, the method comprising:\nproviding simulated market data and non-simulated market data associated with at least one tradable security,\nprocessing trade requests associated with the at least one tradable security, and\nbased on applying at least one rule to the non-simulated market data and the simulated market data, generating a trade request associated with a selected one of the at least one tradable security.\n16. The method of claim 15, wherein the at least one tradable security comprises at least one of a bond, a currency, a futures contract, an option contract, and a stock.\n17. The method of claim 15, wherein the simulated market data and the non-simulated market data comprise data based on at least one of a limit order book, a market price, and a trading volume associated with the at least one tradable security.\n18. The method of claim 15, wherein the non-simulated market data comprise data based on trading of the at least one tradable security on a physical financial market during a historical period of time.\n19. The method of claim 15, wherein the at least one trade request comprises at least one of:\na tradable security,\na trade type comprising one of a buy trade type and a sell trade type,\nan order type comprising one of a limit order type and a market order type,\na price, and\na quantity.\n20. The method of claim 15, wherein processing comprises:\nupdating the simulated market data based on the trade requests.\n21. The method of claim 15, further comprising:\nproviding portfolio data associated with at least one trading entity.\n22. The method of claim 21, wherein processing comprises:\ndetermining whether the portfolio data associated with a trading entity from which a trade request originated satisfies a margin condition.\n23. The method of claim 21, wherein processing comprises:\nupdating the portfolio data associated with a trading entity from which a trade request originated based on the trade request.\n24. The method of claim 21, further comprising:\nproviding to the at least one trading entity at least one of the simulated market data and the portfolio data associated with the at least one trading entity.\n25. The method of claim 15, wherein generating a trade request comprises:\ngenerating a trade request to adjust the simulated market data based on the non-simulated market data associated with the selected tradable security.\n26. The method of claim 15, further comprising:\ngenerating arbitrage data based on a difference between the simulated market data and the non-simulated market data associated with the selected tradable security.\n27. The method of claim 26, wherein generating a trade request comprises:\nbased on applying the at least one rule to the arbitrage data, generating a trade request to adjust the simulated market data associated with the selected tradable security.\n28. The method of claim 15, wherein the at least one rule comprises at least one threshold and at least one associated intervention scheme.\n29. A processor program for simulating a financial market, the processor program being stored on a processor-readable medium and comprising instructions to cause a processor to:\nprovide simulated market data and non-simulated market data associated with at least one tradable security,\nprocess trade requests associated with the at least one tradable security, and\nbased on applying at least one rule to the non-simulated market data and the simulated market data, generate a trade request associated with a selected one of the at least one tradable security.\n30. The processor program of claim 29, wherein the at least one tradable security comprises at least one of a bond, a currency, a futures contract, an option contract, and a stock.\n31. The processor program of claim 29, wherein the simulated market data and the non-simulated market data comprise data based on at least one of a limit order book, a market price, and a trading volume associated with the at least one tradable security.\n32. The processor program of claim 29, wherein the non-simulated market data comprise data based on trading of the at least one tradable security on a physical financial market during a historical period of time.\n33. The processor program of claim 29, wherein the at least one trade request comprises at least one of:\na tradable security,\na trade type comprising one of a buy trade type and a sell trade type,\nan order type comprising one of a limit order type and a market order type,\na price, and\na quantity.\n34. The processor program of claim 29, wherein the instructions to process comprise instructions to:\nupdate the simulated market data based on the trade requests.\n35. The processor program of claim 29, further comprising instructions to:\nprovide portfolio data associated with at least one trading entity.\n36. The processor program of claim 35, wherein the instructions to process comprise instructions to:\ndetermine whether the portfolio data associated with a trading entity from which a trade request originated satisfies a margin condition.\n37. The processor program of claim 35, wherein the instructions to process comprise instructions to:\nupdate the portfolio data associated with a trading entity from which a trade request originated based on the trade request.\n38. The processor program of claim 35, further comprising instructions to:\nprovide to the at least one trading entity at least one of the simulated market data and the portfolio data associated with the at least one trading entity.\n39. The processor program of claim 29, wherein the instructions to generate comprise instructions to:\ngenerate a trade request to adjust the simulated market data based on the non-simulated market data associated with the selected tradable security.\n40. The processor program of claim 29, further comprising instructions to:\ngenerate arbitrage data based on a difference between the simulated market data and the non-simulated market data associated with the selected tradable security.\n41. The processor program of claim 40, wherein the instructions to generate a trade request comprise instructions to:\nbased on applying the at least one rule to the arbitrage data, generate a trade request to adjust the simulated market data associated with the selected tradable security.\n42. The processor program of claim 29, wherein the at least one rule comprises at least one threshold and at least one associated intervention scheme.",
    "status": "Abandoned",
    "citations_own": [
        "US20010042037A1",
        "US6493717B1",
        "US20030009411A1",
        "US20040243502A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "WO2005041101A1",
        "US20060036532A1",
        "US20060085321A1",
        "US20070203822A1",
        "US20090062016A1",
        "US20090061995A1",
        "US20090132335A1",
        "US20090215537A1",
        "WO2009132408A1",
        "US20100138360A1",
        "CN102376069A",
        "US20130097063A1",
        "US8930257B1",
        "US20160224995A1",
        "WO2016183563A1",
        "US10002154B1",
        "US20190213678A1",
        "US10367639B2",
        "CN113656435A"
    ],
    "citedby_ftf": []
}