{
    "patent_link": "https://patents.google.com/patent/US20050015323A1/en",
    "patent_id": "US20050015323A1",
    "title": "Machine learning automatic order transmission system for sending self-optimized trading signals",
    "abstract": "The invention is a Machine Learning system, method and computer program for automated transmission of Buy/Sell orders generated according to self-optimized trading parameters. Optimization could be performed according to every optimization method used. Perpetual real-time optimization (or self-optimization) of trading parameters adds Machine Learning feature to the invention. The invention provides a centralized trading system for the individual user or organization that wants to perform his trading automatically and completely without human intervention from receiving the data from the central server provider to real-time order execution in computerized financial markets. The disclosed system is integrated into a network of brokers, banks and other institutions trading on computerized markets. The system receives real-time market quotes information from a data provider remote server and uses it as an input for the defined trading strategies. These trading strategies generate Buy/Sell signals for a plurality of chosen market securities. The trading could be performed with previously optimized parameters or, alternatively, the optimization could be performed in real-time with trading strategy and its parameters being perpetually and automatically updated, and consequently the trading being performed with self-optimized parameters. The system further includes a module for storing specific order settings and risk/return information. Once execution criteria are satisfied, the order is sent for execution automatically. The system also includes a module for storing information relating to the Buy/Sell transactions and to the profit/loss accounting.",
    "inventors": [
        "David Myr"
    ],
    "assignee": "Makor Issues and Rights Ltd",
    "classifications": [
        "G06Q40/04",
        "G06Q40/06"
    ],
    "claims": "\n1. A Machine Learning trading system for automatically sending Buy or Sell trading orders for selected securities, according to self-optimized trading strategies and parameters, from trader's computer to computerized market exchanges, comprising of the following modules:\nData Feed module for receiving real-time and historical trading data on a variety of securities from a remote data server;\nTrading software module as a means of building trading strategy that generates optimal and/or self-optimized Buy/Sell trading signals based on a number of optimized trading parameters;\nMachine Learning Mechanism module that takes previously optimized Buy/Sell signals and its trading results as an input for building new Buy/Sell signals based on a new and updated trading results, trading data and trading parameters;\nAutomatic execution platform as a means of transferring self-optimized Buy/Sell orders from trader's computer to computerized exchanges, automatically and completely without human intervention.\n2. The system of claim 1, further comprising means of choosing order execution preferences in order to route automatic Buy/Sell order to a preferable execution channel.\n3. The system of claim 1, further comprising means of choosing order type and other execution details to suit trader's individual trading preferences and style.\n4. The system of claim 1, further comprising means enabling a trader personal order adjustments according to his preferences and current market conditions.\n5. The system of claim 1, further comprising means of receiving order execution particulars.\n6. The system of claim 1, further comprising means of handling partial order execution cases and readjusting the system when partial order execution has occurred.\n7. The system of claim 1, further comprising software for storing and accounting trader's profit/loss information according to order execution details.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US6317728B1",
        "US6594643B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20040167840A1",
        "US20050171890A1",
        "US20050171887A1",
        "US20050171891A1",
        "US20050171888A1",
        "US20050273421A1",
        "US20050278237A1",
        "US20060010066A1",
        "US20060080223A1",
        "WO2006102648A2",
        "US20060259394A1",
        "US20060259400A1",
        "US20060259407A1",
        "US20060277137A1",
        "US20060287942A1",
        "US20070043653A1",
        "US20070088658A1",
        "US20070112665A1",
        "US20070130048A1",
        "US20070130050A1",
        "US20070185808A1",
        "US20070192208A1",
        "US20070219898A1",
        "US20070233593A1",
        "US20070244788A1",
        "US20080059846A1",
        "US20080162378A1",
        "US20080177652A1",
        "US20080288391A1",
        "US20090076945A1",
        "US20090186689A1",
        "US20090240620A1",
        "US7599868B1",
        "US20090258139A1",
        "US20090276373A1",
        "US7627517B2",
        "US20100010937A1",
        "US20100030697A1",
        "WO2010042599A2",
        "US20100094777A1",
        "US20100114753A1",
        "US20100268634A1",
        "US20100312718A1",
        "US20100325027A1",
        "US20110016035A1",
        "US20110022509A1",
        "US20110125672A1",
        "US20110225080A1",
        "US20120022994A1",
        "US20120191627A1",
        "US8429059B2",
        "US8504458B1",
        "US8589280B2",
        "US20140006249A1",
        "US8898090B2",
        "WO2016069662A1",
        "US20170109824A1",
        "US20180189674A1",
        "US20190080403A1",
        "WO2019070589A1",
        "CN110956549A",
        "WO2020069748A1",
        "US10755350B1",
        "US11144844B2",
        "US11392858B2",
        "WO2022203636A1",
        "US11580601B1",
        "US20230161734A1",
        "CN116228424A"
    ],
    "citedby_ftf": [
        "US8232962B2",
        "US8117102B1",
        "US10467691B2",
        "US10460387B2",
        "US11315186B1"
    ]
}