{
    "patent_id": "US-11768949-B2",
    "title": "Personalized privacy assistant ",
    "assignee": "Carnegie Mellon University",
    "publication_date": "2023-09-26",
    "patent_link": "https://patents.google.com/patent/US11768949B2/en",
    "inventors": [
        "Norman Sadeh",
        "Bin Liu",
        "Anupam Das",
        "Martin Degeling",
        "Florian Schaub"
    ],
    "classifications": [
        "G06F21/604",
        "G06F21/6245",
        "G06F21/629",
        "G06N20/00",
        "G06N20/20",
        "G06N7/00",
        "H04L63/101",
        "H04L63/102",
        "H04L67/306",
        "G06N20/10",
        "G06N3/088",
        "G06N5/01",
        "G06N7/01",
        "H04L67/12",
        "H04L67/535"
    ],
    "abstract": "A system and method configures permission settings for applications (“apps”) running on a computing device of a user. A data center generates at least one model of collective privacy preferences. The computing device is in communication with the data center via a communications network. The computing device comprises a processor that execute at least a first app that requests access to at least one permission of the computing device and a personal privacy assistant app. The personal privacy assistant app receives the at least one model from the one or more servers of the data center; collects information about the user; identifies at least one recommended permission setting for the first app based on the at least one model and such that the recommended permission setting is user-specific; and configures the computing device to implement the received at least one user-specific recommended permission setting.",
    "claims": "\n1. A system for configuring privacy settings for IoT resources, the system comprising:\na first IoT resource; and\na computing device of a user, wherein the computing device comprises a processor that executes a personal privacy assistant app that:\nreceives data about the first IoT resource, wherein the data comprise user-specific privacy settings for the first IoT resource that are exposed to users; and\nconfigures the user-specific privacy settings for the first IoT resource for the user based on the data received about the first IoT resource and based on a privacy preference model for the user accessible by the personal privacy assistant.\n2. The system of claim 1, wherein the data about the first IoT resource comprise user-specific privacy settings for the first IoT resource.\n3. The system of claim 1, wherein the data about the first IoT resource received by the personal privacy assistant app comprises privacy opt-in settings for the first IoT resource.\n4. The system of claim 1, wherein the personal privacy assistant app communicates directly with the first IoT resource to configure the user-specific privacy settings for the first IoT resource.\n5. The system of claim 1, wherein the personal privacy assistant app communicates directly with a policy enforcement point associated with the first IoT resource to configure the user-specific privacy settings for the first IoT resource.\n6. The system of claim 1, the first IoT resource comprises an IoT resource selected from the group consisting of an IoT app, an IoT device, and an IoT service.\n7. The system of claim 1, further comprising a first IoT resource registry that advertises the data about the first IoT resource to the computing device of the user.\n8. The system of claim 7, wherein the personal privacy assistant is for accessing an Application Programming Interface (API) advertised by the IoT resource registry to control the user-specific privacy setting for the first IoT resource.\n9. The system of claim 7, wherein the personal privacy assistant app discovers the IoT resource registry based on a location of the computing device.\n10. The system of claim 9, wherein the personal privacy assistant discovers the IoT resource registry based on a wireless message received from the IoT resource registry.\n11. The system of claim 1, wherein the personal privacy assistant app is configured to discover the first IoT resource based on wireless signals.\n12. The system of claim 1, wherein the personal privacy assistant app is configured to discover the first IoT resource based on a location of the computing device.\n13. The system of claim 1, wherein the data about the first IoT resource received by the personal privacy assistant app comprises privacy opt-out settings for the first IoT resource.\n14. The system of claim 1, wherein the data about the first IoT resource received by the personal privacy assistant app comprises privacy opt-out settings for the first IoT resource.\n15. The system of claim 1, wherein the user-specific privacy settings for the first IoT resource for the user comprise a limit on retention of data collected by the first IoT resource.\n16. The system of claim 1, wherein the user-specific privacy settings for the first IoT resource for the user comprise a limit on sharing, by the first IoT resource, data collected by the first IoT resource.\n17. The system of claim 1, wherein the user-specific privacy settings for the first IoT resource for the user comprise a request that the first IoT resource erase user data collected by the first IoT resource.\n18. A system for configuring privacy settings for IoT resources, the system comprising:\na first IoT resource;\na computing device of a user, wherein the computing device comprises a processor that executes a personal privacy assistant app that:\nreceives data about the first IoT resource; and\nconfigures user-specific privacy settings for the first IoT resource based on the data received about the first IoT resource and based on a privacy preference model for the user accessible by the personal privacy assistant; and\na first IoT resource registry that advertises the data about the first IoT resource to the computing device of the user; and\nwherein the personal privacy assistant app discovers the IoT resource registry based on a location of the computing device and based on a wireless message received from the IoT resource registry and wherein the wireless message comprises a URL for the personal privacy assistant to reach entries in the IoT resource registry for the first IoT resource.\n19. A system for configuring privacy settings for IoT resources, the system comprising:\na first IoT resource;\na computing device of a user, wherein the computing device comprises a processor that executes a personal privacy assistant app that:\nreceives data about the first IoT resource; and\nconfigures user-specific privacy settings for the first IoT resource based on the data received about the first IoT resource and based on a privacy preference model for the user accessible by the personal privacy assistant;\na first IoT resource registry that advertises the data about the first IoT resource to the computing device of the user; and\nan IoT resource registry directory, wherein the personal privacy assistant receives a list of IoT resource registries from the IoT resource registry directory based on a location of the computing device, wherein the list of IoT resource registries comprises at least the first IoT resource registry.\n20. A method for configuring user-specific privacy settings for IoT resources, the method comprising:\nreceiving, by a computing device of a user, data about a first IoT resource, wherein the data comprise user-specific privacy settings for the first IoT resource that are exposed to users; and\nconfiguring, by a personal privacy assistant app running on the computing device, the user-specific privacy settings for the first IoT resource for the user based the data about the first IoT resource and based on a privacy preference model for the user.\n21. The method of claim 20, wherein the data about the first IoT resource comprise user-specific privacy settings for the first IoT resource.\n22. The method of claim 20, wherein the data about first IoT resource received by the personal privacy assistant app comprises privacy opt-in settings for the first IoT resource.\n23. The method of claim 20, wherein the personal privacy assistant communicates directly with the first IoT resource to configure the user-specific privacy settings for the first IoT resource.\n24. The method of claim 20, wherein the personal privacy assistant app communicates directly with a policy enforcement point associated with the first IoT resource to configure the user-specific privacy settings for the first IoT resource.\n25. The method of claim 20, wherein receiving the data about first IoT resource comprises receiving, by the computing device, that data about the first IoT resource from an IoT resource registry, wherein the IoT resource registry advertises the data about the first IoT resource.\n26. The method of claim 25, wherein the data about the first IoT resource are advertised by an Application Programming Interface (API) of the IoT resource registry.\n27. The method of claim 25, further comprising discovering, by the personal privacy assistant app, the IoT resource registry based on a location of the computing device.\n28. The method of claim 27, wherein the personal privacy assistant app discovers the IoT resource registry based on a wireless message received from the IoT resource registry.\n29. The method of claim 20, wherein the data about the first IoT resource received by the personal privacy assistant app comprises privacy opt-out settings for the first IoT resource.\n30. The method of claim 20, wherein the user-specific privacy settings for the first IoT resource for the user comprise a limit on retention of data collected by the first IoT resource.\n31. The method of claim 20, wherein the user-specific privacy settings for the first IoT resource for the user comprise a limit on sharing, by the first IoT resource, data collected by the first IoT resource.\n32. The method of claim 20, wherein the user-specific privacy settings for the first IoT resource for the user comprise a request that the first IoT resource erase user data collected by the first IoT resource.\n33. A method for configuring user-specific privacy settings for IoT resources, the method comprising:\nreceiving, by a computing device of a user, data about a first IoT resource;\nconfiguring, by a personal privacy assistant app running on the computing device, user-specific privacy settings for the first IoT resource based the data about the first IoT resource and based on a privacy preference model for the user;\nwherein receiving the data about first IoT resource comprises receiving, by the computing device, that data about the first IoT resource from an IoT resource registry, wherein the IoT resource registry advertises the data about the first IoT resource; and\ndiscovering, by the personal privacy assistant app, the IoT resource registry based on a location of the computing device, wherein the personal privacy assistant app discovers the IoT resource registry based on a wireless message received from the IoT resource registry, and wherein the wireless message comprises a URL for the personal privacy assistant app to reach the IoT resource registry.\n34. A method for configuring user-specific privacy settings for IoT resources, the method comprising:\nreceiving, by a computing device of a user, data about a first IoT resource;\nconfiguring, by a personal privacy assistant app running on the computing device, user-specific privacy settings for the first IoT resource based the data about the first IoT resource and based on a privacy preference model for the user;\nwherein receiving the data about first IoT resource comprises receiving, by the computing device, that data about the first IoT resource from an IoT resource registry, wherein the IoT resource registry advertises the data about the first IoT resource; and\nreceiving, by the computing device, a list of IoT resource registries from an IoT resource registry directory based on a location of the computing device, wherein the list of IoT resource registries comprises at least the first IoT resource registry.",
    "status": "Active",
    "citations_own": [
        "US20030023726A1",
        "US20050273841A1",
        "US20060174334A1",
        "US20070113270A1",
        "US20080120339A1",
        "US7810153B2",
        "US20110283336A1",
        "US20120317609A1",
        "US20120330777A1",
        "US20130055411A1",
        "US20130103628A1",
        "US20130198849A1",
        "US20140059695A1",
        "US20140123319A1",
        "US20140214610A1",
        "US20140229498A1",
        "US9374379B1",
        "US20160191534A1",
        "US20160352673A1",
        "US20170011215A1",
        "US20170187749A1",
        "US20180176009A1",
        "US20180212768A1",
        "WO2019133841A1",
        "US10671760B2"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "US9729583B1",
        "GB2540957B",
        "US10706447B2",
        "US20220164840A1",
        "US11004125B2",
        "US11244367B2",
        "US10796260B2",
        "US11418492B2",
        "US10997315B2",
        "US11057356B2",
        "US11354435B2",
        "US11200341B2",
        "US11294939B2",
        "US11210420B2",
        "US10706131B2",
        "US11651104B2",
        "US11651106B2",
        "US10873606B2",
        "US10909265B2",
        "US11416589B2",
        "US10997318B2",
        "US10776518B2",
        "US11138299B2",
        "US10783256B2",
        "US10798133B2",
        "US10839102B2",
        "US11100444B2",
        "US10592692B2",
        "US11343284B2",
        "US10169609B1",
        "US11341447B2",
        "US11461500B2",
        "US11392720B2",
        "US10607028B2",
        "US10284604B2",
        "US11403377B2",
        "US10318761B2",
        "US10944725B2",
        "US11625502B2",
        "US10242228B2",
        "US10909488B2",
        "US11144622B2",
        "US11416109B2",
        "US10848523B2",
        "US10949170B2",
        "US11277448B2",
        "US10706174B2",
        "US11222309B2",
        "US11074367B2",
        "US10803200B2",
        "US10565236B1",
        "US10606916B2",
        "US11328092B2",
        "US11727141B2",
        "US10585968B2",
        "US10565397B1",
        "US11475136B2",
        "US10949565B2",
        "US11636171B2",
        "US11222139B2",
        "US10572686B2",
        "US10503926B2",
        "US10776517B2",
        "US11562097B2",
        "US10416966B2",
        "US11227247B2",
        "US11151233B2",
        "US10592648B2",
        "US11520928B2",
        "US10878127B2",
        "US11222142B2",
        "US11366909B2",
        "US11134086B2",
        "US11188615B2",
        "US10706379B2",
        "US10713387B2",
        "US11544667B2",
        "US11087260B2",
        "US11146566B2",
        "US11023842B2",
        "US11336697B2",
        "US11354434B2",
        "US11157600B2",
        "US11366786B2",
        "US10896394B2",
        "US10708305B2",
        "US11481710B2",
        "US11138242B2",
        "US10510031B2",
        "US11416590B2",
        "US10565161B2",
        "US10726158B2",
        "US10706176B2",
        "US10846433B2",
        "US10769301B2",
        "US10762236B2",
        "US11416798B2",
        "US11025675B2",
        "US11295316B2",
        "US10282700B2",
        "US10885485B2",
        "US10776514B2",
        "US10685140B2",
        "US11188862B2",
        "US11238390B2",
        "US10678945B2",
        "US10740487B2",
        "US10282559B2",
        "US11675929B2",
        "US10467432B2",
        "US10496846B1",
        "US11038925B2",
        "US11301796B2",
        "US11586700B2",
        "US11438386B2",
        "US10853501B2",
        "US11228620B2",
        "KR20180067139A",
        "US20190207946A1",
        "US10127227B1",
        "US11436417B2",
        "US10013577B1",
        "KR102282023B1",
        "US11494514B1",
        "US11157648B1",
        "US10831904B2",
        "US11645414B2",
        "EP3937030A1",
        "US10803202B2",
        "US11544409B2",
        "US11144675B2",
        "US10743171B2",
        "US11641406B2",
        "US10924417B2",
        "US10904258B2",
        "US10929475B2",
        "US10630677B1",
        "US11102064B2",
        "US20210126823A1",
        "US11599960B2",
        "KR20210085159A",
        "KR20210124632A",
        "US10749910B1",
        "US11038966B1",
        "US20210374194A1",
        "US11756112B2",
        "WO2022011142A1",
        "US11444976B2",
        "US20230289376A1",
        "US11436373B2",
        "US20230334158A1",
        "WO2022099023A1",
        "US11538076B1",
        "WO2022159901A1",
        "US11442906B2",
        "WO2022170254A1",
        "US11601464B2",
        "WO2022178089A1",
        "US11546661B2",
        "WO2022192269A1",
        "RU2767714C1",
        "US11562078B2",
        "CN116451264A",
        "US11620142B1"
    ]
}