{
    "patent_id": "US-11334407-B2",
    "title": "Abnormality detection system, abnormality detection method, abnormality detection program, and method for generating learned model ",
    "assignee": "Preferred Networks, Inc.",
    "publication_date": "2022-05-17",
    "patent_link": "https://patents.google.com/patent/US11334407B2/en",
    "inventors": [
        "Daisuke Okanohara",
        "Kenta OONO"
    ],
    "classifications": [
        "G06F11/0703",
        "G06N7/01",
        "G06F11/07",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/08",
        "G06N7/00",
        "G06N7/005",
        "G06K2009/00583",
        "G06N3/04",
        "G06V20/90"
    ],
    "abstract": "A method and system that efficiently selects sensors without requiring advanced expertise or extensive experience even in a case of new machines and unknown failures. An abnormality detection system includes a storage unit for storing a latent variable model and a joint probability model, an acquisition unit for acquiring sensor data that is output by a sensor, a measurement unit for measuring the probability of the sensor data acquired by the acquisition unit based on the latent variable model and the joint probability model stored by the storage unit, a determination unit for determining whether the sensor data is normal or abnormal based on the probability of the sensor data measured by the measurement unit, and a learning unit for learning the latent variable model and the joint probability model based on the sensor data output by the sensor.",
    "claims": "\n1. A system comprising:\none or more memories; and\none or more processors configured to output anomaly information of target data inputted into the system using at least an encoder of a machine learning model,\nwherein, in the encoder of the machine learning model, a probability distribution of a latent variable of normal data is modeled based on a predetermined probability distribution.\n2. The system according to claim 1, further comprising the encoder of the machine learning model, and a decoder of the machine learning model capable of decoding latent variables generated by the encoder of the machine learning model.\n3. The system according to claim 2, wherein the encoder and the decoder of the machine learning model have been learned based on training data that is normal.\n4. The system according to claim 1, wherein the one or more processors are configured to generate a latent variable from the target data based on the encoder of the machine learning model and perform a predetermined process on the generated latent variable to output the anomaly information of the target data.\n5. The system according to claim 4, wherein the predetermined process is a decoding process of decoding the latent variable generated based on the encoder of the machine learning model, using a decoder of the machine learning model.\n6. The system according to claim 1, wherein the encoder of the machine learning model is represented by a multi-layer neural network.\n7. The system according to claim 1, wherein the target data is derived from a sensor.\n8. The system according to claim 1, wherein the anomaly information is at least one of a likelihood of the target data, an anomaly score of the target data, or information indicating whether the target data is anomaly or not.\n9. The system according to claim 1, wherein the machine learning model is a standard VAE or a derivative of the standard VAE.\n10. The system according to claim 1, wherein, in the encoder of the machine learning model, the probability distribution of the latent variable of normal data is modeled based on the predetermined probability distribution so as to correspond to the predetermined probability distribution.\n11. A system comprising:\none or more memories; and\none or more processors configured to:\ninput target data into a predetermined machine learning model for anomaly detection that encodes, by an encoder of the predetermined machine learning model, input data into a latent variable and decodes, by a decoder of the predetermined machine learning model, the latent variable, and acquire output data corresponding to the target data from the predetermined machine learning model; and\noutput anomaly information based on at least the output data corresponding to the target data acquired from the predetermined machine learning model,\nwherein the encoder of the predetermined machine learning model is configured to model a probability distribution of a latent variable of normal data based on a predetermined probability distribution.\n12. The system according to claim 11, wherein the predetermined machine learning model is trained using training data including the normal data so that the probability distribution of the latent variable of the normal data approaches to the predetermined probability distribution.\n13. The system according to claim 11, wherein the encoder and the decoder are each implemented by a multi-layer neural network.\n14. The system according to claim 13, wherein parameters of each of the multi-layer neural network that implements the encoder and the decoder respectively are adjusted by a backpropagation method based on a predetermine function that includes regularization term for the probability distribution of the latent variable.\n15. The system according to claim 14, wherein the regularization term corresponds to a Kullback-Liebler divergence from the probability distribution of the latent variable encoded from the training data including the normal data by the encoder to the predetermined probability distribution.\n16. The system according to claim 11, wherein the predetermined machine learning model is one of a standard VAE (Variational Auto-Encoder), a derivative of the standard VAE, AAE (Adversarial Auto-Encoder), or ADGM (Auxiliary Deep Generative Model).\n17. The system according to claim 11, wherein the predetermined machine learning model has been trained to model the probability distribution of the latent variant of the normal data with the predetermined probability distribution without data to be processed for the anomaly detection.\n18. The system according to claim 11, wherein the inputting and the acquiring include:\ninputting the target data into the predetermined machine learning model;\nperforming the encoding and the decoding on the target data; and\nacquiring the output data corresponding to the target data.\n19. The system according to claim 11, wherein the outputting the anomaly information outputs the anomaly information based on at least the target data in addition to the output data corresponding to the target data.\n20. The system according to claim 11, wherein the outputting the anomaly information includes a calculation process of calculating a likelihood or an anomaly score of the target data.\n21. The system according to claim 11, wherein the output data is restored data of data to be processed, and the outputting the anomaly information includes a calculation process of calculating a deviation between the target data and the restored data.\n22. The system according to claim 11, wherein the one or more processors determines whether or not the target data is anomaly based on at least the output data corresponding to the target data, and outputs the anomaly information indicating the determination.\n23. The system according to claim 11, wherein the target data and the normal data are sensor data.\n24. The system according to claim 23, wherein the target data and the normal data are preprocessed sensor data.\n25. The system according to claim 23, wherein the sensor data is image data or physical quantity data.\n26. The system according to claim 11, wherein the predetermined probability distribution is standard normal distribution.\n27. A data encoding apparatus comprising: an interface acquiring target data to be processed for anomaly detection; and an encoder of a machine learning model encoding the target data to be processed for the anomaly detection acquired by the interface into a latent variable, wherein a probability distribution of a latent variable of normal data of the encoder of the machine learning model is configured to be modeled based on a predetermined probability distribution.\n28. The data encoding apparatus according to claim 27, wherein the predetermined probability distribution is a standard normal distribution.\n29. The data encoding apparatus according to claim 27, wherein the encoder is implemented by a multi-layer neural network.\n30. A data encoding apparatus comprising:\nan interface that acquires target data to be processed for anomaly detection; and\nan encoder that encodes the target data into a latent variable and has parameters of an encoder part of a predetermined machine learning model, wherein the parameters are obtained by at least:\ninputting, by one or more computers, training data including normal data into a predetermined machine learning model that encodes input data into a latent variable and decodes the latent variable to encode the training data into a latent variable and decode the latent variable corresponding to the training data; and\nupdating the parameters, by the one or more computers, to reduce a deviation between (i) data that obtained by inputting the training data into the predetermined machine learning model and performing the encoding and the decoding and (ii) the training data, and so that a probability distribution of a latent variable of normal data approaches to a predetermined probability distribution.\n31. A method comprising:\nacquiring, by one or more computers, target data to be processed for anomaly detection; and\noutputting, by the one or more computers, anomaly information of the acquired target data using at least an encoder of a machine learning model, wherein a probability distribution of a latent variable of normal data is modeled based on a predetermined probability distribution.\n32. A non-transitory computer-readable medium storing a program which executes a method, the method comprising:\nacquiring, by one or more computers, target data to be processed for anomaly detection; and\noutputting, by the one or more computers, anomaly information of the acquired target data using at least an encoder of a machine learning model, wherein a probability distribution of a latent variable of normal data is modeled based on a predetermined probability distribution.\n33. A method for generating anomaly detection model comprising:\ninputting, by one or more computers, training data including normal data into a predetermined machine learning model that encodes input data into a latent variable and decodes the latent variable to encode the training data into a latent variable and decode the latent variable corresponding to the training data; and\nupdating parameters, by the one or more computers, to reduce a deviation between (i) data that obtained by inputting the training data into the predetermined machine learning model and performing the encoding and the decoding and (ii) the training data, and so that a probability distribution of a latent variable of normal data approaches to a predetermined probability distribution in an encoder part of the predetermined machine learning model,\nwherein the one or more computers obtain the predetermined machine learning model as the anomaly detection model into which target data to be processed for anomaly detection is input."
}