{
    "patent_id": "US-2021158227-A1",
    "title": "Systems and methods for generating model output explanation information ",
    "assignee": "Zestfinance, Inc.",
    "publication_date": "2021-05-27",
    "patent_link": "https://patents.google.com/patent/US20210158227A1/en",
    "inventors": [
        "Jerome Louis Budzik",
        "Sean Javad Kamkar"
    ],
    "classifications": [
        "G06N5/045",
        "G06N20/20",
        "G06N5/003",
        "G06N5/01",
        "G06N5/04",
        "G06N3/02",
        "G06N7/01"
    ],
    "abstract": "Systems and methods for explaining models.",
    "claims": "\n1. A method comprising: with a model evaluation system:\naccessing model access information for a trained predictive model;\nselecting a plurality of evaluation input rows for the trained predictive model;\nselecting a plurality of reference input rows for the trained predictive model;\nidentifying each feature included in the selected evaluation input rows;\nfor each identified feature, determining a distribution of feature contribution values by using the accessed model access information, the selected plurality of evaluation input rows, and the selected reference input rows;\nidentifying each pair of features among the identified features, each pair including a first feature and a second feature;\nfor each identified pair, determining a similarity metric value for the pair by using the distribution of feature contribution values determined for the first feature and the distribution of feature contribution values determined for the second feature;\ndetermining feature groups based on the determined similarity metric values; and\nstoring explanation information for each feature group, wherein explanation information for a feature group identifies the feature group and human-readable output explanation information associated with the feature group.\n2. The method of claim 1, wherein determining feature groups based on the determined similarity metric values comprises:\nconstructing a graph that comprises nodes representing each identified feature and edges representing each determined similarity metric value;\nperforming a node clustering process to identify node clusters of the graph based on similarity metrics assigned to the graph edges, wherein each node cluster represents a feature group.\n3. The method of claim 2, wherein the node clustering process is a hierarchical agglomerative clustering process.\n4. The method of claim 3, wherein determining a similarity metric value comprises performing a Kolmogorov-Smirnov test.\n5. The method of claim 3, wherein determining a similarity metric value comprises by computing at least one Pearson correlation coefficient.\n6. The method of claim 1, wherein selecting a plurality of evaluation input rows comprises: iteratively sampling the evaluation input rows from at least one dataset until a sampling metric computed for a current sample indicates that results generated by using the current sample are likely to have an accuracy above an accuracy threshold.\n7. The method of claim 1, wherein selecting a plurality of reference input rows comprises: iteratively sampling the evaluation input rows from at least one dataset until a sampling metric computed for a current sample indicates that results generated by using the current sample are likely to have an accuracy above an accuracy threshold.\n8. The method of claim 1, further comprising: with the model evaluation system automatically updating the stored explanation information in response to re-training of the predictive model.\n9. The method of claim 1, further comprising: with the model evaluation system:\ngenerating output-specific explanation information for output generated by the predictive model.\n10. The method of claim 9, wherein generating output-specific explanation information for a model output generated by the predictive model comprises:\nfor each feature included in an input row used by the predictive model to generate the model output, generating a feature contribution value for the feature;\nidentifying features having feature contribution values generated for the model output that exceed associated thresholds;\naccessing the human-readable output explanation information for the feature group that includes the identified features; and\ngenerating the output-specific explanation information for the model output by using the accessed the human-readable output explanation information.\n11. The method of claim 10, wherein the input row represents a credit application, wherein the model output is a credit score, and the output-specific explanation information includes at least one FCRA Adverse Action Reason Code.\n12. The method of claim 11,\nwherein the input row used to generate the model output is received from an application server that provides an on-line lending application that is accessible by an operator device via a public network, and\nwherein the application server provides the output-specific explanation information to the operator device.\n13. The method of claim 11, wherein the trained predictive model includes at least one tree model.\n14. The method of claim 11, wherein the trained predictive model includes at least a gradient boosted tree forest (GBM) coupled to base signals, and a smoothed approximate empirical cumulative distribution function (ECDF) coupled to output of the GMB, wherein output values of the GBM are transformed by using the ECDF and presented as a credit score.\n15. The method of claim 11, wherein the trained predictive model includes submodels including at least a GMB, a neural network, and an Extremely Random Forest (ETF), wherein outputs of the submodels are ensembled together using one of a stacking function and a combining function, and wherein an ensembled output is presented as a credit score.\n16. The method of claim 11, wherein the trained predictive model includes submodels including at least a neutral network (NN), a GBM, and an ETF, wherein outputs of the submodels are ensembled by a linear ensembling module, wherein an output of the linear ensembling module is processed by a differentiable function, and wherein an output of the differentiable function is presented as a credit score.\n17. The method of claim 11, wherein the trained predictive model includes at least a neutral network (NN), a GBM, and a neural network ensembling module, wherein an output of the neural network ensembling module is processed by a differentiable function.",
    "status": "Pending",
    "citations_own": [],
    "citations_ftf": [
        "US8660943B1",
        "US10366346B2"
    ],
    "citedby_own": [
        "US20220234614A1",
        "CN114997549A",
        "US20230083899A1"
    ],
    "citedby_ftf": []
}