{
    "patent_link": "https://patents.google.com/patent/US5612865A/en",
    "patent_id": "US5612865A",
    "title": "Dynamic hashing method for optimal distribution of locks within a clustered system",
    "abstract": "A method for redistributing the mastership of system resources among the processing nodes within the clustered computer system following a change in the system configuration, such as the failure of a processing node or the return to service of a failed processing node. The method includes the steps of: maintaining a set of hash buckets within each processing node; assigning each one of the resources to one of the hash buckets; and assigning a hash vector, determined through utilization of an N-way recursive algorithm, to each one of the hash buckets, each one of the hash vectors identifying the processing nodes within the clustered computer system in a predetermined sequence unique to the one of the hash buckets. Mastership of any system resource resides with the first processing node identified by the hash vector assigned to the hash bucket to which the system resource is assigned. Following the failure of a processing node, the method reassigns mastership of the system resources assigned to the set of hash buckets associated with a failed processing node the next processing node having an active state identified by the hash vector assigned to the set of hash buckets associated with the failed processing node. Mastership of the resources initially assigned to the set of hash buckets associated with the failed node is reassigned to the failed node upon return of the failed node to an active state.",
    "inventors": [
        "Ranjan Dasgupta"
    ],
    "assignee": "SteelEye Tech Inc",
    "classifications": [
        "G06F9/52",
        "Y10S707/99953"
    ],
    "claims": "\n1. In a clustered computer system including a network of processing nodes, resources shared by said processing nodes, and a distributed lock manager for coordinating processing activities within the clustered computer system, the improvement comprising a method for evenly distributing the mastership of said resources within a clustered computer system amongst the processing nodes, said method comprising the steps of:\nmaintaining a set of hash buckets within each processing node;\nassigning each one of said resources to one of said hash buckets;\nassigning a hash vector to each one of said hash buckets, each one of said hash vectors identifying said processing nodes in a predetermined sequence unique to said one of said hash buckets, mastership of the resources assigned to any one of said hash buckets residing with the first processing node identified by the hash vector assigned to said one of said hash buckets; and\nreassigning mastership of the resources assigned to said set of hash buckets associated with one of said processing nodes following a failure of said one of said processing nodes to the next processing node having an active state identified by the hash vector assigned to said set of hash buckets associated with said failed processing node.\n2. The method according to claim 1, wherein:\neach one of said hash vectors identifies each one of said processing nodes within said clustered computer system, the sequence in which said processing nodes are identified being unique to each one of said hash vectors.\n3. The method according to claim 2, wherein said hash vectors are determined through an N-way recursive algorithm, wherein N is the number of processing nodes within said clustered computer system.\n4. The method according to claim 1, further including the step of:\nreassigning mastership of the resources initially assigned to said set of hash buckets associated with said failed node to said failed node upon return of said failed node to an active state.\n5. The method according to claim 1, wherein said hash vectors for a set of hash buckets associated with each one of said processing nodes are selected to evenly distribute the mastership of the resources assigned to said set of hash buckets associated with each one of said processing nodes to the processing nodes within said clustered computer system having an active state.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4553205A",
        "US4648030A",
        "US4661905A",
        "US4706190A",
        "US4720782A",
        "US4763249A",
        "US4769768A",
        "US4787031A",
        "US4787033A",
        "US4833599A",
        "US4920477A",
        "US4926375A",
        "US4961139A",
        "US4962463A",
        "US5016159A",
        "US5023907A",
        "US5029164A",
        "US5043886A",
        "US5058006A",
        "US5057837A",
        "US5109512A",
        "US5115499A",
        "US5117352A",
        "US5175852A",
        "US5202971A",
        "US5301337A",
        "US5327556A",
        "US5339427A",
        "US5440732A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5727206A",
        "US5828876A",
        "US5960434A",
        "US5964838A",
        "US6003075A",
        "US6006259A",
        "WO1999032956A3",
        "US6078957A",
        "WO2000038062A1",
        "WO2000052603A1",
        "WO2000072167A1",
        "US6266335B1",
        "US6311216B1",
        "US6341311B1",
        "US6363495B1",
        "US6377991B1",
        "US6460149B1",
        "US20030014526A1",
        "US20030014480A1",
        "US20030033308A1",
        "US6523078B1",
        "US6529906B1",
        "US20030051187A1",
        "US20030065708A1",
        "US20030097345A1",
        "US20030158908A1",
        "US20030163495A1",
        "WO2003073278A2",
        "WO2003073204A2",
        "US20030177150A1",
        "US6636982B1",
        "US20030204539A1",
        "US6697901B1",
        "US6751616B1",
        "US6772226B1",
        "US6779039B1",
        "US20040221261A1",
        "US6851005B1",
        "US6880089B1",
        "US20050144170A1",
        "US20050149540A1",
        "US6920454B1",
        "US20050171927A1",
        "US20050240595A1",
        "US20050240737A1",
        "US20050257219A1",
        "US20050262313A1",
        "US20050262513A1",
        "US20060020913A1",
        "US20060095438A1",
        "US20060095483A1",
        "US20060101062A1",
        "US20060112127A1",
        "US7055173B1",
        "US20060129872A1",
        "US20060187906A1",
        "US20060200469A1",
        "US20060212573A1",
        "US20060224805A1",
        "US20060253844A1",
        "US7158961B1",
        "US20070094269A1",
        "US20070094310A1",
        "US20070094277A1",
        "US20070100954A1",
        "US20070101080A1",
        "US20070100828A1",
        "US20070101057A1",
        "US20070126750A1",
        "US7246120B2",
        "US20070171919A1",
        "US20070174734A1",
        "US20070195810A1",
        "US20070233710A1",
        "US20080031238A1",
        "US20080046444A1",
        "US20080046475A1",
        "US20080046432A1",
        "US20080046443A1",
        "US20080046667A1",
        "US20080059471A1",
        "US20080114944A1",
        "US20080114943A1",
        "US20080114896A1",
        "US20080114853A1",
        "US20080120478A1",
        "US20080120477A1",
        "US20080126508A1",
        "US20080126502A1",
        "US20080126365A1",
        "US20080126516A1",
        "US20080126506A1",
        "US20080126503A1",
        "US20080126703A1",
        "US20080126721A1",
        "US20080123642A1",
        "US20080134189A1",
        "US20080133869A1",
        "US20080133871A1",
        "US20080133861A1",
        "US20080133859A1",
        "US20080130652A1",
        "US20080140805A1",
        "US20080140975A1",
        "US20080154978A1",
        "US20080155127A1",
        "US20080151724A1",
        "US20080243773A1",
        "US20080250213A1",
        "US20080250221A1",
        "US20080256103A1",
        "US20080256545A1",
        "US20080256537A1",
        "US20090055607A1",
        "US20090055604A1",
        "US20090055399A1",
        "WO2009087413A1",
        "US7590652B2",
        "US20090248765A1",
        "US20090248756A1",
        "US20090252066A1",
        "US7680836B2",
        "US20100121935A1",
        "US20100146122A1",
        "US7870345B2",
        "US7882071B2",
        "US7937421B2",
        "US20110106778A1",
        "US7984324B2",
        "US8082379B2",
        "US8788465B2",
        "US8943082B2",
        "US9069571B2",
        "US9183148B2",
        "US9519589B2",
        "US20180293188A1",
        "US10459810B2",
        "US10839289B2",
        "CN112306651A",
        "US11095715B2"
    ],
    "citedby_ftf": []
}