{
    "patent_id": "US-11475385-B2",
    "title": "Method and system for utility power line monitoring ",
    "assignee": "Green Grid, Inc.",
    "publication_date": "2022-10-18",
    "patent_link": "https://patents.google.com/patent/US11475385B2/en",
    "inventors": [
        "Chinmoy Prosun Saha",
        "Jeffrey Scott Pickles"
    ],
    "classifications": [
        "G06Q10/06316",
        "B63B35/00",
        "B64C39/024",
        "B64D1/18",
        "B64F1/362",
        "G01S17/86",
        "G01S17/89",
        "G06N20/00",
        "G06N3/08",
        "G06Q10/06315",
        "G06Q10/0635",
        "G06Q10/20",
        "G06Q40/08",
        "G06Q50/163",
        "G06Q50/265",
        "G06T7/0004",
        "G06T7/0012",
        "G06T7/20",
        "G06V10/764",
        "G06V10/82",
        "G06V20/188",
        "G06V20/52",
        "G08B17/005",
        "G08B21/10",
        "G08B21/16",
        "G08B29/20",
        "H04N7/185",
        "H04Q9/00",
        "B64C2201/12",
        "B64U2101/00",
        "B64U2101/30",
        "G06N3/044",
        "G06N3/045",
        "G06Q50/06",
        "G06T2207/20084",
        "G06T2207/30184",
        "G06T2207/30188",
        "G08B19/00",
        "G08B25/006",
        "H04Q2209/25",
        "H04Q2209/40",
        "H04Q2209/50"
    ],
    "abstract": "The present invention solves a very complex problem that is a major obstacles for electric utility industry's power lines vegetation encroachment management business. Vegetation contacts to the high voltage overhead power lines cause flash-over and/or blackout which results in hazardous situations and economic losses. Power line vegetation management is a very cost intensive business process which is essential to ensure safe, reliable and affordable electric energy supply by the electric utilities, transmission and generation owners. This routine electric utility vegetation management related work is mandated and overseen by applicable federal, state or local regulatory agencies. The state-of-the-art vegetation management process involves labor and cost intensive foot-patrol, vehicular patrol, air patrol and airborne LiDAR patrol of power lines. These methods are often inefficient, unreliable, risky and costly. The present invention provides a method and system for automated vegetation growth, condition and status monitoring near high voltage utility electric lines using stationary sensors, wireless or wired communications and computation technologies and proprietary algorithms. The method and system of the current invention monitors the power line infrastructures remotely and advises the vegetation maintenance crews on mitigating actions without requiring human interventions, thus saving cost and reducing risks to the humans and environment. A comprehensive vegetation encroachment condition report with vegetation proximity advisory (VPA) and vegetation resolution advisory (VRA) is automatically generated and transmitted to the operational staff by the system for each electric line span at certain time interval or continuously without boots-on-the-ground manual asset inspection and/or air patrol using aircraft. This current invention is an automated, safer and low-cost solution to an electric utility industry's essential reliability and compliance related business process.",
    "claims": "\n1. A monitoring system comprising:\n(a) multiple, spaced apart utility structures;\n(b) a high voltage, electrical power line spanning across an area between the utility structures and being adjacent vegetation, the power line being attached to the utility structures;\n(c) a camera attached to one of the utility structures, the camera capturing image data of the area between the utility structures adjacent to the electrical power line, the image data including the vegetation;\n(d) a processing unit and a server:\n(i) obtaining the image data from the camera; and\n(ii) determining whether a potential hazard exists in the area between the utility structures;\n(e) a communicator notifying a remote receiver of a need for a remedial action pertaining to the potential hazard, based on the determination by the processing unit; and\n(f) the communicator transmitting locational data of the potential hazard to the remote receiver.\n2. The system of claim 1, wherein the camera has an adjustable field of view including a narrow field of view, a medium field of view, and a wide field of view, each of the fields of view at least partially overlap, and further comprising a second camera on a second of the utility structures, the second camera having multiple fields of view.\n3. The system of claim 1, wherein:\nthe processing unit is part of a cloud computer remote from the camera;\nthe cloud computer obtains, via a wireless connection, the image data from the camera; and\nthe processing unit generates a model of the area adjacent to the electrical power line, based on the image data, the model assisting in the potential hazard determination.\n4. The system of claim 1, further comprising multiple sensors attached to the one of the utility structures, the multiple sensors including the camera, and all of the sensors transmitting data to the server, and the sensors are stationary without aircraft sensing of the vegetation and the potential hazard.\n5. The system of claim 1, wherein the potentially hazardous condition is a fire or flashover, and the power line being configured to carry high voltage of at least 4 kV.\n6. The system of claim 5, wherein the camera is stationary and the processing unit automatically monitors the potential hazard in the area, the utility structures being at least one of: a pole or tower.\n7. The system of claim 1, wherein current and historical results of the data are transmitted to the server and are used in the potential hazard determination, and the processing unit uses machine learning and artificial intelligence in the potential hazard determination.\n8. The system of claim 1, wherein the image data is used to automatically determine whether an environmental encroachment of the vegetation relative to the power line poses the potential hazard.\n9. A monitoring system comprising:\n(a) multiple, spaced apart utility structures;\n(b) an electrical power line spanning between the utility structures and being adjacent vegetation;\n(c) cameras mounted to the utility structures, the cameras creating digital images of the electrical power line and vegetation with different, adjustable and overlapping fields of view, the images scanning an area of the vegetation between the utility structures;\n(d) sensors mounted to at least some of the utility structures configured to sense weather data;\n(e) a processing unit, the cameras and the sensors sending the images and the weather data to the processing unit;\n(f) the processing unit automatically storing recent and previous images to automatically track changes;\n(g) current and historical analysis results from the automatically tracked changes being sent to a remote user; and\n(h) location coordinates of the cameras being sent to the remote user when a wildfire or flashover at the vegetation is automatically detected by the processing unit.\n10. The system of claim 9, wherein the camera has an adjustable field of view including a narrow field of view, a medium field of view, and a wide field of view, each of the fields of view at least partially overlap, and further comprising a second camera on a second of the utility structures, the second camera having multiple fields of view.\n11. The system of claim 9, wherein:\ncloud data storage located remote from the camera;\nthe processing unit is remotely located from the cameras and the utility structures; and\nthe processing unit obtains, via a wireless connection, the image data from the camera; and\nthe sensors and the cameras are stationary without aircraft sensing of the vegetation areas.\n12. The system of claim 9, wherein the processing unit and a data storage are onsite with the camera, mounted to the one of the utility structures which includes at least one of: a pole or a tower, and a second camera and second processing unit mounted to a second of the utility structures.\n13. The system of claim 9, further comprising multiple sensors attached to the one of the utility structures, the multiple sensors including the camera, and all of the sensors transmitting data to the server.\n14. The system of claim 9, wherein the potentially hazardous condition is a wildfire or flashover.\n15. The system of claim 9, wherein the cameras are stationary and the processing unit automatically monitors the potential hazard in the area.\n16. The system of claim 9, wherein current and historical results of the data are transmitted to the server and are used in the potential hazard determination, and the processing unit uses machine learning and artificial intelligence in the potential hazard determination.\n17. The system of claim 9, wherein the image data is used to automatically determine whether an environmental encroachment of the vegetation relative to the power line poses the potential hazard.\n18. A monitoring system comprising:\n(a) multiple, spaced apart structures each comprising at least one of: a pole or a tower;\n(b) cameras mounted to at least some of the structures, the cameras continuously creating scanned images of vegetation with different and overlapping fields of view, without aircraft-based camera monitoring of the vegetation;\n(c) sensors mounted to at least some of the structures configured to sense weather data;\n(d) a data processor remotely located from the cameras and the structures, the cameras and the sensors configured to send the images and the weather data to the data processor in real time;\n(e) the data processor automatically storing recent and previous of the images to automatically track changes;\n(f) current and historical analysis results from the automatically tracked changes operably being sent to a remote receiver;\n(g) location coordinates of the cameras operably being sent to the remote receiver; and\n(h) an advisory and map being automatically sent by the data processor to the remote receiver if an undesirable condition exists based on the analysis results.\n19. The system of claim 18, wherein the cameras each have an adjustable field of view including a narrow field of view, a medium field of view, and a wide field of view, each of the fields of view at least partially overlap.\n20. The system of claim 18, wherein:\ncloud data storage located remote from the camera;\nthe data processor is remotely located from the cameras and the structures; and\nthe processing unit obtains, via a wireless connection, the images from the cameras.\n21. The system of claim 18, further comprising a data storage located onsite with each of the cameras to store the images, the data storage being mounted to an associated one of the structures.\n22. The system of claim 18, further comprising multiple sensors attached to a first and a second of the structures, the multiple sensors including the camera, and an at least 4 kV power line spanning between the first and the second of the structures with vegetation adjacent the power line.\n23. The system of claim 18, wherein the undesirable condition is a wildfire or flashover.\n24. The system of claim 18, further comprising power lines spanning between the structures which are high voltage transmission towers, the cameras are stationary, and the images from the cameras include the vegetation and the power lines.\n25. The system of claim 18, further comprising a server in communication with the data processor which is a central processing unit, the images and the weather data being transmitted to the server, and the central processing unit using machine learning and artificial intelligence in the undesirable condition determination.\n26. The system of claim 18, further comprising a high voltage power transmission line spanning between the structures, and the images being used by the data processor to automatically determine whether an environmental encroachment of the vegetation relative to the power transmission line poses the undesirable condition.\n27. A monitoring system comprising:\n(a) multiple, spaced apart and stationary structures each comprising at least one of: a pole or a tower;\n(b) cameras mounted to at least some of the structures, the cameras creating scanned images of vegetation area with different and overlapping fields of view, at least one of the fields of view being greater than 90 degrees, and at least another of the fields of view being narrower and less than 90 degrees;\n(c) a server receiving the images;\n(d) a processing unit receiving the images in real time;\n(e) the processing unit automatically storing recent and previous of the images to automatically track changes;\n(f) the vegetation areas being assigned unique identifiers associated with location data; and\n(g) a remote receiver, the processing unit being configured to automatically send the locational data and the identifier of at least one of the vegetation areas to the remote receiver when a wildfire or flashover is automatically detected by the processing unit therein, and without an aircraft-based camera.\n28. The system of claim 27, further comprising an advisory and map being automatically sent by the processing unit to the remote receiver if the undesirable condition is detected.\n29. The system of claim 27, further comprising a high voltage power distribution line spanning between the structures which include the towers, and the images being used by the processing unit to automatically determine whether an environmental encroachment of the vegetation relative to the power distribution line poses a fire hazard.\n30. The system of claim 27, wherein the cameras are stationary and each have an adjustable field of view including a narrow field of view, a medium field of view, and a wide field of view, each of the fields of view at least partially overlap."
}