{
    "patent_link": "https://patents.google.com/patent/US20050010445A1/en",
    "patent_id": "US20050010445A1",
    "title": "CAD (computer-aided decision) support for medical imaging using machine learning to adapt CAD process with knowledge collected during routine use of CAD system",
    "abstract": "CAD (computer-aided decision) support systems, methods and tools for medical imaging are provided, which use machine learning classification for automated detection and marking of regions of interest in medical images. Machine learning methods are used for adapting/optimizing a CAD process by seamlessly incorporating physician knowledge into the CAD process using training data that is obtained during routine use of the CAD system.",
    "inventors": [
        "Arun Krishnan",
        "Jonathan Stoeckel"
    ],
    "assignee": "Siemens Healthcare GmbH",
    "classifications": [
        "G06T7/0012",
        "G16H30/20",
        "G16H30/40",
        "G16H50/20",
        "G06T2207/30004",
        "G16H40/63",
        "Y10S128/922"
    ],
    "claims": "\n1. A method for computer-aided decision (CAD) support in medical imaging, comprising:\nprocessing patient image data using a CAD process to detect potential regions of interest in the patient image data;\npresenting CAD results obtained from the CAD process for review by a user;\nobtaining training data based on user review of the CAD results; and\nadapting the CAD process using the training data.\n2. The method of claim 1, wherein processing the patient image data using a CAD process comprises automatically extracting image parameters from the patient image data and classifying the parameters using a classification method, and wherein adapting the CAD process is performed using a machine learning process to retrain a classifier using the training data.\n3. The method of claim 1, wherein presenting the CAD results comprises displaying at least a portion of the image data with CAD marks for detected regions of interest, if any.\n4. The method of claim 3, wherein obtaining training data comprises:\ndetermining a user mark added by the user which indicates a region of interest that was not detected and marked with a CAD mark; and\ncollecting image information for the region of interest associated with the user mark.\n5. The method of claim 3, wherein obtaining training data comprises:\ndetermining a CAD mark that was accepted by the user during the user review; and\ncollecting image information for the region of interest associated with the accepted CAD mark.\n6. The method of claim 3, wherein obtaining training data comprises:\ndetermining a CAD mark that was rejected by the user during the user review; and\ncollecting image information for the region of interest associated with the rejected CAD mark.\n7. The method of claim 3, wherein obtaining training data comprises collecting image information for regions of interest that were neither marked with a CAD mark nor marked with a user mark.\n8. The method of claim 1, wherein adapting the CAD process using the training data comprises retraining the CAD process continuously or periodically.\n9. The method of claim 1, further comprising obtaining training data based on results of a CAD-unassisted user review of the patient image data.\n10. A program storage device readable by a machine, tangibly embodying a program of instructions executable by the machine to perform method steps for providing computer-aided decision (CAD) support in medical imaging, the method steps comprising:\nprocessing patient image data using a CAD process to detect potential regions of interest in the patient image data;\npresenting CAD results obtained from the CAD process for review by a user;\nobtaining training data based on user review of the CAD results; and\nadapting the CAD process using the training data.\n11. The program storage device of claim 10, wherein the instructions for processing the patient image data using a CAD process comprise instructions for automatically extracting image features from the patient image data and classifying the features using a classification method, and wherein the instructions for adapting the CAD process include instructions for using a machine learning process to rebuild a classifier using the training data.\n12. The program storage device of claim 10, wherein the instructions for presenting the CAD results comprise instructions for displaying at least a portion of the image data with CAD marks for detected regions of interest, if any.\n13. The program storage device of claim 12, wherein the instructions for obtaining training data comprise instructions for:\ndetermining a user mark added by the user which indicates a region of interest that was not detected and marked with a CAD mark; and\ncollecting image information for the region of interest associated with the user mark.\n14. The program storage device of claim 12, wherein the instructions for obtaining training data further comprise instructions for:\ndetermining a CAD mark that was accepted by the user during the user review; and\ncollecting image information for the region of interest associated with the accepted CAD mark.\n15. The program storage device of claim 12, wherein the instructions for obtaining training data further comprise instructions for:\ndetermining a CAD mark that was rejected by the user during the user review; and\ncollecting image information for the region of interest associated with the rejected CAD mark.\n16. The program storage device of claim 12, wherein the instructions for obtaining training data comprise instructions for collecting image information for regions of interest that were neither marked with a CAD mark nor marked with a user mark.\n17. The program storage device of claim 10, wherein the instructions for adapting the CAD process using the training data comprise instructions for retraining the CAD process continuously or periodically.\n18. The program storage device of claim 10, further comprising instructions for obtaining training data based on results of a CAD-unassisted user review of the patient image data.\n19. A method for computer-aided decision (CAD) support, comprising:\nobtaining CAD results from processing patient data using a CAD process;\nobtaining user review results comprising the results of (i) a user review of the patient data, or (ii) a user review of the CAD results, or (iii) both a user review of the patient data and the CAD results;\ncomparing the CAD results and the user review results; and\nobtaining training data based on the comparing results.\n20. The method of claim 19, wherein comparing the CAD results and the user review results comprises determining a false positive CAD result, or a false negative CAD result, or a true positive CAD result, or any combination thereof.\n21. The method of claim 19, wherein the CAD results comprise CAD marks for potential regions of interest detected by the CAD process, if any, in patient image data.\n22. The method of claim 21, wherein the results of the user review of the CAD results comprise indications as to the user's acceptance or rejection of a CAD mark.",
    "status": "Active",
    "citations_own": [
        "US5586160A",
        "US6198838B1",
        "US20020070970A1",
        "US20020076091A1",
        "US20030165262A1",
        "US6738499B1"
    ],
    "citations_ftf": [
        "US5491627A",
        "US5729620A",
        "EP0879449A2",
        "GB0007156D0"
    ],
    "citedby_own": [
        "US20050197980A1",
        "US20060120608A1",
        "US20060215894A1",
        "US20060274928A1",
        "US20070005853A1",
        "US20070036414A1",
        "US20070064982A1",
        "US20070081712A1",
        "US20070081706A1",
        "US20070133852A1",
        "US20080044067A1",
        "US20080044068A1",
        "US20080043036A1",
        "US20080120132A1",
        "US20080154650A1",
        "US20080159611A1",
        "US20090097741A1",
        "US20090118609A1",
        "US20090148007A1",
        "US20090257635A1",
        "US20100007658A1",
        "US20100128943A1",
        "US20100179415A1",
        "US20100256459A1",
        "US20100311034A1",
        "US20110046979A1",
        "US20110182493A1",
        "US20110188715A1",
        "US20120190962A1",
        "US20120283546A1",
        "US20130208897A1",
        "US20130212056A1",
        "US20130223716A1",
        "US20130311200A1",
        "US20130345585A1",
        "US8942917B2",
        "US8951200B2",
        "US9047269B2",
        "US20160361025A1",
        "US9522330B2",
        "US9548987B1",
        "WO2017034512A1",
        "EP2755154A3",
        "US20170200266A1",
        "US20170224301A1",
        "US20180038930A1",
        "CN108604462A",
        "US20190073447A1",
        "US20190138693A1",
        "US20190189278A1",
        "US10346982B2",
        "EP3526730A4",
        "US10706534B2",
        "US10832808B2",
        "CN112334070A",
        "US11096674B2",
        "US11141115B2",
        "US11158405B2",
        "US20210350166A1",
        "US11183280B2",
        "US11215711B2",
        "US11257575B2",
        "US11322256B2",
        "US11410307B2",
        "US11423541B2",
        "US11468319B2",
        "US11501871B2",
        "US20230117254A1",
        "US11710309B2"
    ],
    "citedby_ftf": [
        "US7688995B2",
        "JP5014429B2",
        "US10121243B2",
        "JP4928955B2",
        "US20080183501A1",
        "US8081811B2",
        "US8295564B2",
        "US10013638B2",
        "AU2009295315A1",
        "US20100138240A1",
        "JP2012518493A",
        "JP5618129B2",
        "US8874607B2",
        "US9138143B2",
        "US20140010433A1",
        "US9786047B2",
        "JP5802175B2",
        "US9949696B2",
        "KR20140138501A",
        "KR20150073628A",
        "US10350438B2",
        "JP6734111B2",
        "US20180060512A1",
        "US10265044B2",
        "US10242443B2",
        "CN111819583A",
        "JP2021535484A",
        "WO2020165978A1",
        "US20210166807A1"
    ]
}