{
    "patent_link": "https://patents.google.com/patent/US6216137B1/en",
    "patent_id": "US6216137B1",
    "title": "Method and apparatus for providing schema evolution without recompilation",
    "abstract": "A method and apparatus that allow schema version evolution to occur without requiring applications that expect older schema versions to be recompiled is provided. According to one aspect of the invention, each application that requests data is supplied the data in the format that the application expects. To supply the data in the expected format, a mechanism is provided for tracking the evolution of data types without losing information. In addition, mechanisms are provided for determining the format expected by the application and the format in which the data is currently stored. A mechanism is also provided for converting the data from the stored format to the expected format when the two formats do not match. A data migration strategy is described in which data is gradually migrated to newer formats when the data is updated by applications that expect a more recent format than the format in which the data is currently stored.",
    "inventors": [
        "Tin Anh Nguyen",
        "Susan Marie Kotsovolos",
        "Srinath Krishnaswamy"
    ],
    "assignee": "Oracle International Corp",
    "classifications": [
        "G06F16/258",
        "G06F16/213",
        "Y10S707/99944",
        "Y10S707/99953",
        "Y10S707/99954"
    ],
    "claims": "\n1. A method for tracking versions of a plurality of data types, the method comprising the computer-implemented steps of:\n2. The method as recited in claim 1, further comprising setting a type identifier in second data to a new value that is different from the type identifier in the first data, wherein the second data corresponds to a second schema version record that corresponds to a previous version of said data type.\n3. The method as recited in claim 1, wherein:\n4. The method as recited in claim 1, wherein the first data includes second data that corresponds to a previous version of said data type and the method further comprises:\n5. The method as recited in claim 1, further comprising:\n6. A method for storing an instance that resides in volatile memory to non-volatile memory, wherein the instance is formatted according to a first format associated with a particular version of a data type, wherein said particular version is not a latest version of the data type, the method comprising the computer-implemented steps of:\n7. The method as recited in claim 6, further comprising:\n8. A method for tracking versions of one or more data types, the method comprising the computer-implemented steps of:\n9. The method as recited in claim 8, further comprising updating a data type identifier in a schema version record for the previous version of the particular data type to a value different from the data type identifier that uniquely identifies the particular data type.\n10. A computer-readable medium for tracking versions of one or more data types, the computer-readable medium carrying one or more sequences of one or more instructions which, when executed by one or more processors, cause the one or more processors to perform the steps of:\n11. The computer-readable medium as recited in claim 10, further comprising one or more sequences of one or more instructions which, when executed by the one or more processors, cause the one or more processors to update a data type identifier in a schema version record for the previous version of the particular data type to a value different from the data type identifier that uniquely identifies the particular data type.\n12. A computer-system for tracking versions of one or more data types, the computer system comprising:\n13. The computer-system as recited in claim 12, wherein the memory further includes one or more sequences of one or more instructions which, when executed by the one or more processors, cause the one or more processors to update a data type identifier in a schema version record for the previous version of the particular data type to a value different from the data type identifier that uniquely identifies the particular data type.\n14. A computer-readable medium for tracking versions of a plurality of data types, the computer-readable medium carrying one or more sequences of one or more instructions which, when executed by one or more processors, cause the one or more processors to perform the steps of:\n15. The computer-readable medium as recited in claim 14, further comprising one or more sequences of one or more instructions which, when executed by the one or more processors, cause the one or more processors to perform the step of setting a type identifier in second data to a new value that is different from the type identifier in the first data, wherein the second data corresponds to a second schema version record that corresponds to a previous version of said data type.\n16. The computer-readable medium as recited in claim 14, wherein:\n17. The computer-readable medium as recited in claim 14, wherein the first data includes second data that corresponds to a previous version of said data type and the computer-readable medium further comprises one or more sequences of one or more instructions which, when executed by the one or more processors, cause the one or more processors to perform the steps of:\n18. The computer-readable medium as recited in claim 14, further comprising one or more sequences of one or more instructions which, when executed by the one or more processors, cause the one or more processors to perform the steps of:\n19. A computer system for tracking version of a plurlaity of data types comprising:\n20. The computer system as recited in claim 19, wherein the memory further includes one or more sequences of one or more instructions which, when executed by the one or more processors, cause the one or more processors to perform the step of setting a type identifier in said data to a new value that is different from the type identifier in the first data, wherein the second data corresponds to a second schema version record that corresponds to a previous version of said data type.\n21. The computer system as recited in claim 19, wherein:\n22. The computer system as recited in claim 19, wherein the first data includes second data that corresponds to a previous version of said data type and the method further comprises one or more sequences of one or more instructions which, when executed by the one or more processors, cause the one or more processors to perform the steps of:\n23. The computer system as recited in claim 19, wherein the memory further includes one or more sequences of one or more instructions which, when executed by the one or more processors, cause the one or more processors to perform the steps of:\n24. A computer-readable medium for storing an instance that resides in volatile memory to non-volatile memory, the computer-readable medium carrying one or more sequences of one or more instructions which, when executed by one or more processors, cause the one or more processors to perform the steps of:\n25. The computer-readable medium as recited in claim 24, further comprising one or more sequences of one or more instructions which, when executed by the one or more processors, cause the one or more processors to perform the step of:\n26. A computer system for storing an instance that resides in volatile memory to non-volatile memory, wherein the computer-system comprises:\n27. The computer system as recited in claim 26, wherein the memory further includes one or more sequences of one or more instructions which, when executed by the one or more processors, cause the one or more processors to perform the steps of:",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4558413A",
        "US4686522A",
        "US5058000A",
        "US5280612A",
        "US5347653A",
        "US5446880A",
        "US5495561A",
        "US5504879A",
        "US5511188A",
        "US5517670A",
        "US5526518A",
        "US5535386A",
        "US5548753A",
        "US5559954A",
        "US5600833A",
        "US5600836A",
        "US5603027A",
        "US5625816A",
        "US5625465A",
        "US5627996A",
        "US5649101A",
        "US5652876A",
        "US5657259A",
        "US5680618A",
        "US5706504A",
        "US5794030A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "EP1347394A1",
        "US20030187930A1",
        "US20040019856A1",
        "US20040177349A1",
        "US20040230977A1",
        "US20040249867A1",
        "US20040249857A1",
        "US20040250255A1",
        "US20050071359A1",
        "US20050091236A1",
        "US6965947B1",
        "US6968183B2",
        "US20060004746A1",
        "US20060190498A1",
        "US20060190503A1",
        "US20060190497A1",
        "US20060190504A1",
        "US20070115999A1",
        "US20080059469A1",
        "US20080071887A1",
        "US20080071817A1",
        "US20080072160A1",
        "US20080071806A1",
        "US20080126385A1",
        "US20080126386A1",
        "US20080147704A1",
        "US7428726B1",
        "US20090106779A1",
        "US20090228527A1",
        "US7594167B1",
        "US7725768B1",
        "US20100131572A1",
        "US20140379634A1",
        "US20150142804A1",
        "US9152988B2",
        "US10915507B1",
        "US11429376B2"
    ],
    "citedby_ftf": [
        "US6460052B1",
        "JP4713707B2",
        "US7016922B1",
        "US7016906B1",
        "US20020194267A1",
        "US6996809B2",
        "US7627865B2",
        "US20020059280A1",
        "US20060047781A1",
        "US20060020602A9",
        "US7143164B2",
        "US20030033442A1",
        "US7293070B2",
        "US8606916B2",
        "US20030079051A1",
        "US6915287B1",
        "US8032828B2",
        "US6963880B1",
        "DE60309636T2",
        "ATE345534T1",
        "US7844639B2",
        "US7818759B2",
        "US7543019B1",
        "US7683904B2",
        "US7730450B2",
        "US20060136471A1",
        "US20070106683A1",
        "US8161372B2",
        "US20090006466A1",
        "US8255790B2",
        "US7974993B2",
        "US8086637B1",
        "US8583613B2",
        "US20090119584A1",
        "US8244778B1",
        "US20090300054A1",
        "US8624898B1",
        "US10403403B2",
        "US10424403B2",
        "US9424289B2",
        "US9779126B2",
        "US9158786B1",
        "USD789988S1",
        "US20230095852A1"
    ]
}