{
    "patent_id": "US-11343375-B2",
    "title": "Systems and methods for automatically conducting risk assessments for telephony communications ",
    "assignee": "Transaction Network Services, Inc.",
    "publication_date": "2022-05-24",
    "patent_link": "https://patents.google.com/patent/US11343375B2/en",
    "inventors": [
        "Sean J. Kent",
        "Ken Cartwright",
        "Amit Singla",
        "Srikanth Mohan",
        "Paul Florack"
    ],
    "classifications": [
        "H04M3/436",
        "G06N20/00",
        "H04L63/1433",
        "H04M3/42042",
        "H04Q11/06",
        "H04Q3/0029",
        "H04Q3/0083",
        "H04W12/128",
        "G06N3/08",
        "G06N5/01",
        "G06N7/01",
        "H04M2203/551",
        "H04M2203/6027",
        "H04Q2213/13139",
        "H04Q2213/13345"
    ],
    "abstract": "Systems and methods for using machine-learning techniques for labeling incoming calls with categories relating to a risk level. A model is generated using call log data. The call log data is augmented using information from additional data sources to generate features for the model. The model may then be used to categorize additional incoming calls. The model may be used in real-time to categorize incoming calls, or categorization results may be stored for a plurality of calling numbers. Various embodiments provide various technical advantages by virtue of how the components of the system are deployed between an endpoint communication device, a telephony provider system, and possibly other systems.",
    "claims": "\n1. A method for automatically conducting risk assessments for calls to an endpoint communication device, the method comprising:\nreceiving, by a risk processing engine, a message associated with an incoming call;\nextracting, by the risk processing engine, identifying data from the message;\nretrieving, by the risk processing engine, information about past calls associated with the identifying data;\ndetermining, by the risk processing engine, a likelihood that an origin of the incoming call is spoofed, wherein the determining includes comparing the information about past calls to the message; and\nin response to determining that the likelihood that the origin of the incoming call is spoofed is greater than a predetermined threshold, causing a warning to be presented to a user of the endpoint communication device.\n2. The method of claim 1, wherein the identifying data includes a caller number.\n3. The method of claim 1, wherein the information about past calls associated with the identifying data includes an identification of a service provider.\n4. The method of claim 3, wherein comparing the information about past calls to the message includes:\ndetermining a service provider associated with the incoming call; and\ncomparing the service provider associated with the incoming call to the service provider identified in the information about past calls.\n5. The method of claim 1, wherein the determining further includes determining a line type associated with the incoming call.\n6. The method of claim 1, wherein at least one of the message associated with the incoming call and the retrieval of the information about past calls is transmitted via session initiation protocol (SIP).\n7. The method of claim 1, wherein at least a portion of the risk processing engine is provided by the endpoint communication device.\n8. An endpoint communication device comprising:\na processor; and\na memory storing instructions that, in response to execution by the processor, cause the device to perform actions comprising:\nreceiving a message associated with an incoming call;\nextracting identifying data from the message;\nretrieving information about past calls associated with the identifying data;\ndetermining a likelihood that an origin of the incoming call is spoofed, wherein the determining includes comparing the information about past calls to the message; and\nin response to determining that the likelihood that the origin of the incoming call is spoofed is greater than a predetermined threshold, presenting a warning to a user of the endpoint communication device.\n9. The endpoint communication device of claim 8, wherein the identifying data includes a caller number.\n10. The endpoint communication device of claim 8, wherein the information about past calls associated with the identifying data includes an identification of a service provider.\n11. The endpoint communication device of claim 10, wherein comparing the information about past calls to the message includes:\ndetermine a service provider associated with the incoming call; and\ncompare the service provider associated with the incoming call to the service provider identified in the information about past calls.\n12. The endpoint communication device of claim 8, wherein the determining further includes determining a line type associated with the incoming call.\n13. The endpoint communication device of claim 8, wherein at least one of the message associated with the incoming call and the retrieval of the information about past calls is transmitted via session initiation protocol (SIP).\n14. A non-transitory computer-readable medium having computer-executable instructions stored thereon that, in response to execution by one or more processors of a computing device, cause the computing device to perform actions for automatically conducting risk assessments for calls to an endpoint communication device, the actions comprising:\nreceiving a message associated with an incoming call;\nextracting identifying data from the message;\nretrieving information about past calls associated with the identifying data;\ndetermining a likelihood that an origin of the incoming call is spoofed, wherein the determining includes comparing the information about past calls to the message; and\nin response to determining that the likelihood that the origin of the incoming call is spoofed is greater than a predetermined threshold, causing a warning to be presented to a user of the endpoint communication device.\n15. The non-transitory computer-readable medium of claim 14, wherein the identifying data includes a caller number.\n16. The non-transitory computer-readable medium of claim 14, wherein the information about past calls associated with the identifying data includes an identification of a service provider.\n17. The non-transitory computer-readable medium of claim 16, wherein comparing the information about past calls to the message includes:\ndetermining a service provider associated with the incoming call; and\ncomparing the service provider associated with the incoming call to the service provider identified in the information about past calls.\n18. The non-transitory computer-readable medium of claim 14, wherein the determining further includes determining a line type associated with the incoming call.\n19. The non-transitory computer-readable medium of claim 14, wherein at least one of the message associated with the incoming call and the retrieval of the information about past calls is transmitted via session initiation protocol (SIP).\n20. The non-transitory computer-readable medium of claim 14, wherein the computing device is the endpoint communication device.",
    "status": "Active",
    "citations_own": [
        "US6363411B1",
        "US6779030B1",
        "US7096498B2",
        "US20070087756A1",
        "US7694128B2",
        "US9002334B2",
        "US9001985B2",
        "US9264536B1"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "US9824692B1",
        "AU2017327003B2",
        "US10325601B2",
        "US9762728B1",
        "CN106657528B",
        "US10397398B2",
        "US10887457B1",
        "US11538128B2",
        "EP3813347B1",
        "US10542137B1",
        "US10484532B1",
        "US10778841B2",
        "US10631257B1",
        "US20200204572A1",
        "US11050793B2",
        "US11032312B2",
        "US11431738B2",
        "WO2020163624A1",
        "US20200265356A1",
        "US11646018B2",
        "US10938982B1",
        "KR102123103B1",
        "US10827338B1",
        "US10893414B1",
        "JP2021532427A",
        "US10972602B1",
        "FR3102903A1",
        "WO2021101935A1",
        "US11470042B2",
        "US11477234B2",
        "US11790060B2",
        "WO2021183939A1",
        "US11470108B2",
        "CA3078051A1",
        "CN115702419A",
        "US11528242B2",
        "CN112468660B",
        "US11687648B2",
        "US11622245B2",
        "US20220272124A1",
        "CN113079476B",
        "US11689542B2",
        "WO2023085989A1",
        "CN114629942B",
        "CN115374190B"
    ]
}