{
    "patent_link": "https://patents.google.com/patent/US20030220100A1/en",
    "patent_id": "US20030220100A1",
    "title": "Technique for effectively accessing programming listing information in an entertainment delivery system",
    "abstract": "In a broadband communications system, e.g., a cable system, programming content can be readily reserved and accessed for viewing using an interactive program guide, a network home graphic user interface (GUI), Quick View Guide, etc., in accordance with the invention. Such programming content may include in-progress programs, future programs and previously broadcast programs which are recorded at a headend in the cable system, and which may or may not have overlapping broadcast times. In addition, the user may reserve programs at a set-top terminal, and may also do so remotely from the terminal through a communications network such as, the Internet, a public switched telephone network (PSTN), a wireless telephone network, etc.",
    "inventors": [
        "David McElhatten",
        "Steven Johnson",
        "Robert Benya",
        "Robert Golden",
        "James Kasanin"
    ],
    "assignee": "Time Warner Cable Enterprises LLC",
    "classifications": [
        "H04N21/4821",
        "G06F3/0482",
        "H04N21/23106",
        "H04N21/235",
        "H04N21/23614",
        "H04N21/2408",
        "H04N21/242",
        "H04N21/2625",
        "H04N21/26291",
        "H04N21/2747",
        "H04N21/4147",
        "H04N21/4227",
        "H04N21/4312",
        "H04N21/4325",
        "H04N21/4331",
        "H04N21/4333",
        "H04N21/4334",
        "H04N21/4335",
        "H04N21/435",
        "H04N21/4532",
        "H04N21/454",
        "H04N21/4583",
        "H04N21/47202",
        "H04N21/47214",
        "H04N21/4722",
        "H04N21/482",
        "H04N21/4825",
        "H04N21/4826",
        "H04N21/485",
        "H04N21/6587",
        "H04N21/8545",
        "H04N5/445",
        "H04N5/782",
        "H04N7/17318",
        "H04N7/17327",
        "H04N7/17336",
        "H04H60/46",
        "H04H60/74",
        "H04N21/42204",
        "H04N21/42228",
        "H04N21/426",
        "H04N21/4316",
        "H04N21/47",
        "H04N21/478",
        "H04N5/45",
        "H04N5/602"
    ],
    "claims": "\n1. A method for facilitating user access to programming content via a program guide, comprising:\nidentifying at least one group of program channels which are associated with a programming content provider;\nlisting on the program guide a plurality of indicators, indicating two or more of the program channels in the group, as an aggregation exclusive of any indicator indicating a program channel outside the group; and\nallowing a selection of one of the indicators to access programming content offered by the program channel indicated thereby.\n2. The method of claim 1 wherein the indicators are associated with different channel numbers, respectively, and the channel numbers associated with the indicators indicating the two or more of the program channels are not consecutive.\n3. The method of claim 1 wherein at least one of the program channels in the group offers high definition television (HDTV).\n4. The method of claim 1 wherein the programming content provider includes a CNN programming network.\n5. The method of claim 1 wherein the programming content provider includes a NBC programming network.\n6. The method of claim 1 wherein the programming content provider includes a HBO programming network.\n7. The method of claim 1 wherein the programming content includes video content.\n8. The method of claim 1 further comprising receiving the selection via a multi-channel communications network.\n9. The method of claim 8 wherein the multi-channel communications network includes a broadband network.\n10. A method for managing a subscription based program channel provided through a multi-channel communications network, comprising:\nlisting an identifier of at least one program provided by the program channel;\nreceiving a selection by a user of the identifier to review content of the program;\nin response to the selection, determining whether the user is a subscriber to the program channel; and\ninquiring whether the user wants to subscribe to the program channel when it is determined that the user is not a subscriber to the program channel.\n11. The method of claim 10 wherein the program channel provides an on-demand programming service.\n12. The method of claim 10 further comprising offering a free trial of the program channel when it is determined that the user is not a subscriber to the program channel.\n13. The method of claim 10 wherein the selection is received via the multi-channel communications network.\n14. The method of claim 10 wherein the multi-channel communications network includes a broadband network.\n15. The method of claim 10 wherein the program includes a TV program.\n16. A method for facilitating user access to programming content via a program guide, comprising:\nallowing a selection of an indicator indicating a program channel on the program guide;\nin response to the selection, listing a plurality of identifiers identifying a predetermined number of programs offered by the program channel; and\nallowing a selection of one of the identifiers to access content of the program identified thereby.\n17. The method of claim 16 wherein the predetermined number is determined independently from durations of the programs.\n18. The method of claim 16 further comprising receiving at least one of the selections of the indicator and the identifier via a multi-channel communications network.\n19. The method of claim 18 wherein the multi-channel communications network includes a broadband network.\n20. The method of claim 16 wherein the program includes a TV program.\n21. A system for facilitating user access to programming content via a program guide, at least one group of program channels which are associated with a programming content provider being identified, the system comprising:\na server for listing on the program guide a plurality of indicators, indicating two or more of the program channels in the group, as an aggregation exclusive of any indicator indicating a program channel outside the group; and\na mechanism for allowing a selection of one of the indicators to access programming content offered by the program channel indicated thereby.\n22. The system of claim 21 wherein the indicators are associated with different channel numbers, respectively, and the channel numbers associated with the indicators indicating the two or more of the program channels are not consecutive.\n23. The system of claim 21 wherein at least one of the program channels in the group offers HDTV.\n24. The system of claim 21 wherein the programming content provider includes a CNN programming network.\n25. The system of claim 21 wherein the programming content provider includes a NBC programming network.\n26. The system of claim 21 wherein the programming content provider includes a HBO programming network.\n27. The system of claim 21 wherein the programming content includes video content.\n28. The system of claim 11 wherein the selection is received via a multi-channel communications network.\n29. The system of claim 28 wherein the multi-channel communications network includes a broadband network.\n30. A system for managing a subscription based program channel provided through a multi-channel communications network, comprising:\na mechanism for listing an identifier of at least one program provided by the program channel;\nan interface for receiving a selection by a user of the identifier to review content of the program; and\na server responsive to the selection for determining whether the user is a subscriber to the program channel, whether the user wants to subscribe to the program channel being inquired when it is determined that the user is not a subscriber to the program channel.\n31. The system of claim 30 wherein the program channel provides an on-demand programming service.\n32. The system of claim 30 wherein a free trial of the program channel is offered when it is determined that the user is not a subscriber to the program channel.\n33. The system of claim 30 wherein the selection is received via the multi-channel communications network.\n34. The system of claim 30 wherein the multi-channel communications network includes a broadband network.\n35. The system of claim 30 wherein the program includes a TV program.\n36. A system for facilitating user access to programming content via a program guide, comprising:\nan interface for allowing a selection of an indicator indicating a program channel on the program guide; and\na mechanism responsive to the selection for listing a plurality of identifiers identifying a predetermined number of programs offered by the program channel, a selection of one of the identifiers being allowed to access content of the program identified thereby.\n37. The system of claim 36 wherein the predetermined number is determined independently from durations of the programs.\n38. The system of claim 36 wherein at least one of the selections of the indicator and the identifier is received via a multi-channel communications network.\n39. The system of claim 38 wherein the multi-channel communications network includes a broadband network.\n40. The system of claim 36 wherein the program includes a TV program.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5850218A",
        "US20030149988A1",
        "US6792616B1",
        "US20040250279A1",
        "US20040261098A1"
    ],
    "citations_ftf": [
        "CA2170429C",
        "US6732369B1",
        "US5872588A",
        "US6111611A",
        "US6175362B1",
        "US20020078466A1",
        "US20030046695A1"
    ],
    "citedby_own": [
        "US20040240466A1",
        "US20050149501A1",
        "US20050235316A1",
        "US20050282875A1",
        "US20060015889A1",
        "US20060075426A1",
        "US20060156345A1",
        "US20060178155A1",
        "US20060281555A1",
        "US20070174276A1",
        "US20070180057A1",
        "US20070186247A1",
        "US20070206590A1",
        "US20070214103A1",
        "US20080112690A1",
        "US20080148322A1",
        "GB2444974A",
        "US20080256569A1",
        "US20080271075A1",
        "US20080313672A1",
        "US20090031345A1",
        "US20090044223A1",
        "US20090094253A1",
        "US20090132453A1",
        "US20090288109A1",
        "US20100037255A1",
        "US7698236B2",
        "US20100095333A1",
        "US7730509B2",
        "US20100146557A1",
        "US20100186047A1",
        "US20100199309A1",
        "US7774808B2",
        "US7849477B2",
        "US20110138423A1",
        "US8019271B1",
        "US8065703B2",
        "US8090694B2",
        "US20120124606A1",
        "US8272009B2",
        "US8352997B2",
        "US20130226964A1",
        "US20130294527A1",
        "US8606828B2",
        "US20130339431A1",
        "US20140115633A1",
        "US8776115B2",
        "US8789117B2",
        "US8789102B2",
        "US8806532B2",
        "US8832749B2",
        "US8869200B2",
        "US8869191B2",
        "US8924997B2",
        "US9003436B2",
        "US9003464B2",
        "US9071729B2",
        "US20150188776A1",
        "US9135334B2",
        "US9167302B2",
        "US20150350718A1",
        "WO2016048913A1",
        "US9323913B2",
        "CN105765985A",
        "US9467733B2",
        "USD771676S1",
        "USD771673S1",
        "US9503791B2",
        "US9519728B2",
        "US9531760B2",
        "USD779528S1",
        "US9621939B2",
        "US9635421B2",
        "US9693086B2",
        "US9824389B2",
        "USD806734S1",
        "USD807385S1",
        "US9883223B2",
        "US9906838B2",
        "US9924217B1",
        "US20180097574A1",
        "US10028025B2",
        "US10051304B2",
        "US10116676B2",
        "US10136172B2",
        "US10148623B2",
        "USD836129S1",
        "US10178435B1",
        "US10250932B2",
        "US10278008B2",
        "US10313755B2",
        "US10339281B2",
        "US10404758B2",
        "US20190373307A1",
        "US10532463B2",
        "USD874494S1",
        "USD874493S1",
        "USD874507S1",
        "US10586023B2",
        "US10602231B2",
        "US10652607B2",
        "US10667008B1",
        "US10827066B2",
        "US10863238B2",
        "US10958629B2",
        "US11032518B2",
        "US11076189B2",
        "US11122334B2",
        "US11140463B2",
        "US11159851B2",
        "US11212593B2",
        "US11381549B2",
        "US11552999B2",
        "US11792462B2"
    ],
    "citedby_ftf": [
        "US8352400B2",
        "US7966078B2",
        "US20030023975A1",
        "US8713623B2",
        "US7818763B2",
        "US7788688B2",
        "US7882528B1",
        "US7542471B2",
        "US8233392B2",
        "US7630305B2",
        "US8270423B2",
        "US7616638B2",
        "WO2004100470A1",
        "DE10320889B3",
        "US8432800B2",
        "US8437284B2",
        "US8238241B2",
        "US7656799B2",
        "US9380269B2",
        "US7103388B2",
        "US20050138659A1",
        "US8266429B2",
        "US8312267B2",
        "JP2006094442A",
        "US7904930B2",
        "US7870590B2",
        "US7613383B2",
        "US9420021B2",
        "US9723267B2",
        "US8296441B2",
        "US8145777B2",
        "US8340130B2",
        "US8935316B2",
        "US7831728B2",
        "US8200828B2",
        "US8230096B2",
        "US20060159432A1",
        "JPWO2006077791A1",
        "KR101087102B1",
        "WO2006084102A2",
        "US7797321B2",
        "US8730985B2",
        "JP2006295822A",
        "US7840570B2",
        "EP1978480A3",
        "US7532253B1",
        "KR100754626B1",
        "US7877387B2",
        "US8191008B2",
        "EP1798654A1",
        "EP2437158A1",
        "US20070244880A1",
        "US20070186231A1",
        "US9288424B2",
        "KR20080100342A",
        "WO2007103923A2",
        "US20100064320A1",
        "US8079044B1",
        "US8280982B2",
        "US9386327B2",
        "US8024762B2",
        "US8392947B2",
        "US8667540B2",
        "US20080125101A1",
        "US8694684B2",
        "US8732854B2",
        "US8181206B2",
        "KR101351023B1",
        "US8671000B2",
        "KR101443609B1",
        "US20090037961A1",
        "JP5038431B2",
        "KR101402626B1",
        "US9071859B2",
        "EP2193658B1",
        "US8099757B2",
        "JP2009111863A",
        "US20090165049A1",
        "US20090167839A1",
        "US8804052B2",
        "US9503691B2",
        "US8223185B2",
        "US20090276806A1",
        "US8209713B1",
        "US8327402B1",
        "US9338407B2",
        "WO2010011637A1",
        "US20100049832A1",
        "US8601003B2",
        "WO2010040082A1",
        "US8321887B2",
        "US8365222B2",
        "US20100217613A1",
        "KR101644875B1",
        "US8930278B2",
        "US8490135B2",
        "US9866609B2",
        "US9178634B2",
        "US8935721B2",
        "US20110029928A1",
        "US20110060738A1",
        "US8640052B2",
        "TWI457687B",
        "US20110264530A1",
        "US9300445B2",
        "US8997136B2",
        "KR101850723B1",
        "US9185341B2",
        "JP4988021B2",
        "US9241195B2",
        "US9602414B2",
        "US20120239690A1",
        "US20120239689A1",
        "US8615159B2",
        "US8983905B2",
        "US9426123B2",
        "US20130227283A1",
        "US8838149B2",
        "US9854280B2",
        "US11368760B2",
        "US9819986B2",
        "US20140282786A1",
        "US9402107B2",
        "US9066153B2",
        "US10368255B2",
        "US20140380343A1",
        "US9313568B2",
        "US11540148B2",
        "US9554167B2",
        "US9935833B2",
        "US9948962B2",
        "US10834065B1",
        "US9986578B2",
        "US10404698B1",
        "US9918345B2",
        "US10492034B2",
        "US10164858B2",
        "US10911794B2",
        "US10936653B2",
        "US10645547B2",
        "US10638361B2",
        "CN108961245A",
        "US10904375B2",
        "US11403849B2",
        "CN111031337A",
        "US11490166B2"
    ]
}