{
    "patent_link": "https://patents.google.com/patent/US20020087454A1/en",
    "patent_id": "US20020087454A1",
    "title": "Global trading system",
    "abstract": "A computerized trading system permits trading across international boundaries. The system preferably includes multiple affiliates at the local level, each in a different country, that act as either introducing or executing agents. Between these local affiliates there is a global hub, with the local affiliates and the global hub being arranged in a hub-and-spoke arrangement. Introducing affiliates are responsible for handling customer accounts and information, and accepting transaction orders. Executing affiliates are responsible for executing the transaction orders for, e.g., equity trades in a local stock exchange. The global hub is responsible for routing orders and handling associated foreign exchange transactions to convert one currency into another.",
    "inventors": [
        "Bea Calo",
        "William Johnson"
    ],
    "assignee": "Morgan Stanley Services Group Inc",
    "classifications": [
        "G06Q30/06",
        "G06Q40/04"
    ],
    "claims": "\n1. A computerized system for trading securities and commodities, comprising:\na first computerized introducing affiliate in a first country suitable for accepting a transaction order from a customer, and transmitting said transaction order electronically, said transaction order being for the handling of a security or commodity; a second computerized introducing affiliate in a second country;\nan exchange on which said security or commodity is traded;\na global hub connected between said first introducing affiliate and said second introducing affiliate, said global hub for electronically routing said transaction order from said introducing affiliate to said exchange.\n2. The system of claim 1, further comprising a computerized executing affiliate in a second country suitable for electronically receiving said transaction order, said global hub connected between said first introducing affiliate and said executing affiliate, said global hub suitable to route electronically said transaction order to said executing affiliate.\n3. The system of claim 2, wherein said transaction order is to sell an equity, and said executing affiliate electronically transmits proceeds from said sale of said equity to said global hub.\n4. The system of claim 3, wherein said global hub transmits said proceeds to said introducing affiliate.\n5. The system of claim 2, further comprising a second computerized executing affiliate in a third country suitable for electronically receiving said transaction order, said global hub for electronically routing said transaction order to said second executing affiliate.\n6. The system of claim 1, wherein said transaction order is to purchase an equity, and said introducing affiliate electronically transmitting currency for said purchase of said equity to said global hub.\n7. The system of claim 6, wherein said global hub transmits said currency to said executing affiliate.\n8. The system of claim 7, wherein said first affiliate maintains an account for said customer in a first currency and prior to transmitting said currency to said executing affiliate, a check is made of said account to ensure said account holds an amount greater than said amount of said purchase of said equity.\n9. The system of claim 1, wherein said first affiliate maintains an account for said customer in a first currency and said execution of said transaction order is made is a second currency.\n10. The system of claim 1, further comprising a second introducing affiliate in a second country, said second introducing affiliate being suitable for accepting a transaction order from a second customer, and transmitting said transaction order electronically.\n11. The system of claim 1, wherein each of said transaction orders requires a trade of a first currency to a second currency, said global hub responsible for converting said first currency to said second currency.\n12. The system of claim 11, wherein said global hub is connected to a foreign exchange rate information source and a foreign exchange rate bank, said global hub sending said first currency to said foreign exchange rate bank and receiving in return said second currency.\n13. The system of claim 1, wherein there exists a customer account corresponding to said customer, and further wherein other than said transaction order, said introducing affiliate not sending information pertaining to said customer account to said global hub.\n14. A method of buying a security or commodity, comprising the acts of:\naccepting an electronic transaction order from a first customer in a first country to purchase a stock for a first amount, said stock being available on a first financial exchange;\nchecking an account balance in a customer account for said first customer to determine if said customer account balance is at least equal to said first amount;\nelectronically transmitting said transaction order to a global hub where said customer account balance is at least said first amount, said global hub being electronically connected to at least a second financial exchange and said first financial exchange;\npurchasing said stock on said first financial exchange; and\ndeleting a second amount from said customer account.\n15. The method of claim 14, wherein said first financial exchange is in a second country different from said first country.\n16. The method of claim 14, wherein said step of purchasing said stock includes said global hub electronically transmitting said transaction order to an executing affiliate that purchases said stock in said first financial exchange.\n17. The method of claim 14, wherein said second amount correlates to said first amount.\n18. The method of claim 14, wherein said customer account is in a first currency and a second currency is purchases said stock on said first financial exchange.\n19. The system of claim 18, wherein said global hub converts said first currency to said second currency.\n20. The system of claim 14, further comprising:\naccepting a second electronic transaction order from a second customer in a third country different from said first country.\n21. A method of selling a security or commodity, comprising the acts of:\naccepting an electronic transaction order from a first customer in a first country to sell a stock, said stock being traded on a first financial exchange;\nchecking an account in a customer account for said first customer to determine if said customer owns said stock;\nelectronically transmitting said transaction order to a global hub, said global hub being electronically connected to at least a second financial exchange and said first financial exchange;\nselling said stock on said first financial exchange;\nelectronically transmitting proceeds from said sale of said stock from said first financial exchange to said customer account.\n22. The method of claim 21, wherein said first financial exchange is in a second country.\n23. The method of claim 21, where prior to electronically transmitting said proceeds to said customer account, said proceeds are transmitted to said global hub.\n24. The system of claim 21, wherein said step of selling said stock includes said global hub electronically transmitting said transaction order to an executing affiliate that sells said stock on said first exchange.\n25. The system of claim 24, wherein said executing affiliate is in a second country.\n26. A method of buying a security or commodity, comprising:\nentering a transaction order into a first computerized system, said transaction order being for the purchase of a security or commodity;\ntransmitting said transaction order electronically to a second computerized system, said second computerized system being connected to a plurality stock exchanges in a plurality of countries; and\nreceiving from said second computerized system execution details regarding the purchase of said security or commodity in response to said transaction order, said purchase of said security or commodity being made by a stock exchange member connected to said second computerized system.\n27. The method of claim 26, wherein said first computerized system maintains a customer account in a first currency and said security or commodity trades on a stock exchange in a second currency.\n28. The method of claim 27, wherein said second computerized system converts said first currency to said second currency to purchase said security or commodity.\n29. The method of claim 26, wherein said second computerized system connects to stock exchanges in at least three countries.\n30. The method of claim 26, further comprising:\nvetting a customer account in said first computerized system to determine that said customer account holds funds sufficient to purchase said security or commodity.\n31. A method for buying a security or commodity, comprising:\nreceiving a transaction order electronically in a first country to purchase a security or commodity, said transaction order being initiated from a second country and being transmitted through a global hub, said global hub being connected to stock exchanges in a plurality of countries;\nexecuting the purchase of said security or commodity on a stock exchange in said first country in response to said transaction order;\ntransmitting electronically the execution details of said purchase of said security or commodity, said execution details including a price for said purchase.\n32. The method of claim 31, wherein said method includes converting a first currency to a second currency to facilitate said purchase of said security or commodity.\n33. The method of claim 32, wherein said conversion of said first currency to said second currency occurs on the settlement date for said purchase.\n34. The method of claim 31, wherein said step of transmitting comprises first transmitting said execution details to said global hub from an executing affiliate and second transmitting to an introducing affiliate in said first country.\n35. The method of claim 31, wherein said transaction order is associated with a customer account upon generation of said transaction order, said customer account being encumbered by an amount at least equal to said price for said purchase.\n36. The method of claim 35, wherein the amount of said encumbrance is based on a price for said security or commodity, and an exchange rate between a first currency and a second currency.\n37. The method of claim 31, wherein said method includes an executing broker that executes said transaction order, said executing broker also being suitable to act as an introducing broker for the generation of a transaction order.\n38. The method of claim 31, wherein said transaction order is received electronically by a computer system.\n39. The method of claim 31, wherein said global hub connects between any given pair of stock exchanges.\n40. A method of selling a security or commodity, comprising:\nentering a transaction order into a first computerized system, said transaction order being for the sale of a security or commodity;\ntransmitting said transaction order electronically toward a second computerized system, said second computerized system being connected to a plurality stock exchanges in a plurality of countries; and\nreceiving from said second computerized system execution details regarding the sale of said security or commodity in response to said transaction order, said sale of said security or commodity being made by a stock exchange member connected to said second computerized system.\n41. The method of claim 40, wherein said second computerized system connects to said plurality of stock exchanges in a hub and spoke configuration.\n42. The method of claim 40, wherein said method includes receiving from said second computerized system the proceeds from the sale of said security or commodity.\n43. The method of claim 40, wherein said method includes the conversion of a first currency to a second currency.\n44. A method for selling a security or commodity, comprising:\nreceiving a transaction order electronically in a first country to sell a security or\ncommodity, said transaction order being initiated from a second country and being\ntransmitted through a global hub, said global hub being electronically connected to\nstock exchanges in a plurality of countries;\nexecuting the sale of said security or commodity on a stock exchange in said first country;\ntransmitting electronically the execution details of said sale of said security or commodity, said execution details including a price for said sale.\n45. The method of claim 44, further comprising a step of crediting a consumer account said price for said sale, less charges.",
    "status": "Abandoned",
    "citations_own": [
        "US87455A",
        "US4677552A",
        "US5424938A",
        "US6014643A",
        "US6029146A",
        "US20020032642A1",
        "US20020065752A1",
        "US20030208440A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20020087455A1",
        "US20020091624A1",
        "US20020133448A1",
        "US20020138407A1",
        "US20030040994A1",
        "US20030236742A1",
        "US20040006533A1",
        "US20040078321A1",
        "US20040148247A1",
        "US20040167840A1",
        "US20040267655A1",
        "US20050044022A1",
        "US20050114239A1",
        "US20050131802A1",
        "US20050131801A1",
        "US20050137955A1",
        "US20050171894A1",
        "US20050187857A1",
        "US20050256797A1",
        "US20060020535A1",
        "US20060095361A1",
        "US20060106708A1",
        "US20060111999A1",
        "US20070250437A1",
        "US20070276752A1",
        "US20070288347A1",
        "WO2008070024A1",
        "US20080243700A1",
        "US20080301061A1",
        "US20090024512A1",
        "US20090063362A1",
        "US7567928B1",
        "US20090192949A1",
        "US20090216666A1",
        "WO2009105340A2",
        "US20090216665A1",
        "US7620578B1",
        "US7624052B1",
        "US20090327117A1",
        "US7647268B1",
        "US7668771B1",
        "US7668772B1",
        "US7680731B1",
        "US7716107B1",
        "US7770184B2",
        "US7783568B1",
        "US7818238B1",
        "US7822682B2",
        "US7827096B1",
        "US20100287087A1",
        "US20100306096A1",
        "US20100325031A1",
        "US7890407B2",
        "US7899722B1",
        "US20110066538A1",
        "US20110087582A1",
        "US7930228B1",
        "US7933821B1",
        "WO2011053722A1",
        "US7966234B1",
        "US7970688B2",
        "US20110166982A1",
        "US20110202447A1",
        "US20110231283A1",
        "US8032456B1",
        "US8090639B2",
        "US8090651B2",
        "US8121937B2",
        "USRE43246E1",
        "US8150766B1",
        "US8209246B2",
        "US8234188B1",
        "US8260705B1",
        "US8290861B1",
        "US8311939B1",
        "US8352342B1",
        "US8352353B1",
        "US8352354B2",
        "US8364571B1",
        "US8370236B1",
        "US8380621B1",
        "US8386371B2",
        "US8423447B2",
        "US8452702B1",
        "US8458089B1",
        "US8538844B1",
        "US8548886B1",
        "US8583545B1",
        "US8645273B2",
        "US8655689B1",
        "US8688569B1",
        "US8738514B2",
        "US8762191B2",
        "US8793179B1",
        "WO2014147408A1",
        "US20140304190A1",
        "US8996481B2",
        "US9058581B2",
        "US9063985B2",
        "US9218720B2",
        "US9230284B2",
        "US9374370B1",
        "US20160210637A1",
        "US9767514B2",
        "US9811868B1",
        "US20180330442A1",
        "US10204380B1",
        "US10304292B2",
        "US20190244292A1",
        "US10387879B2",
        "CN110458695A",
        "US20200051042A1",
        "US10586282B2",
        "US10636018B2",
        "US10902389B1",
        "US11042882B2",
        "US11295308B1",
        "US11436577B2",
        "US11568362B2",
        "US11694168B2",
        "US11710181B1"
    ],
    "citedby_ftf": []
}