{
    "patent_id": "US-11687788-B2",
    "title": "Generating synthetic data examples as interpolation of two data examples that is linear in the space of relative scores ",
    "assignee": "D5Ai Llc",
    "publication_date": "2023-06-27",
    "patent_link": "https://patents.google.com/patent/US11687788B2/en",
    "inventors": [
        "James K. Baker"
    ],
    "classifications": [
        "G06N3/088",
        "G06F18/24",
        "G06N20/00",
        "G06N3/04",
        "G06N3/044",
        "G06N3/045",
        "G06N3/047",
        "G06N3/063",
        "G06N3/082",
        "G06N3/084",
        "G06N7/01",
        "G06F12/0815",
        "G06F17/18",
        "G06N3/048"
    ],
    "abstract": "Computer systems and methods generate data examples by training, through machine learning, a data generator with a training objective to produce a data example for a specific value of R, where R is value related to S1(x) and S2(x), where, for a data example, x, generated by the data generator, S1(x) is a likelihood that the data example x is in a first class of a first selected data example and S2(x) is a likelihood that the data example x is in a second class of a second selected data example. S1(x) and S2(x) are determined by a discriminator that is trained through machine learning to discriminate between the first and second classes. After training the data generator, the data generator generates a synthetic data example for each of multiple specific values of R.",
    "claims": "\n1. A machine-learning method of generating data examples, the method comprising:\ntraining, by a computer system, through machine learning, a data generator with one or more training objectives, wherein the one or more training objectives comprise a first objective to produce a data example for a specific value of R, where R is value related to S1(x) and S2(x), where, for a data example, x, generated by the data generator, S1(x) is a likelihood that the data example x is in a first class of a first selected data example and S2(x) is a likelihood that the data example x is in a second class of a second selected data example, wherein S1(x) and S2(x) are determined by a discriminator that is trained through machine learning to discriminate between the first and second classes;\nafter training the data generator, generating by the data generator a synthetic data example for each of multiple specific values of R, such that the data generator generates multiple synthetic data examples; and\nafter generating the multiple synthetic data examples:\ndetermining, by the computer system, parameters for a curve fitting the multiple synthetic data examples generated by the data generator for the multiple specific values of R;\ngenerating, by the data generator, additional synthetic data examples along the curve;\nclassifying, by a classifier, the additional synthetic data examples; and\nmodifying, by the computer system, a training hyperparameter of the generator based on a consistency of classifications by the classifier of the additional synthetic data examples.\n2. The method of claim 1, wherein the training hyperparameter comprises a regularization hyperparameter.\n3. The method of claim 2, further comprising, prior to generating the multiple synthetic data examples for the multiple specific values of R, training, by the computer system, the discriminator, through machine learning, to discriminate between the first and second classes.\n4. The method of claim 3, wherein training the discriminator comprises:\ngenerating, by a second data generator of the computer system, augmented data examples from the first and second classes; and\ntraining, by the computer system, the discriminator with the augmented data examples.\n5. The method of claim 4, wherein the second data generator comprises a stochastic generator.\n6. The method of claim 1, wherein R is limited to values between 0 and 1 inclusive.\n7. The method of claim 6, wherein R is computed based on a ratio of S1(x) to (S1(x)+S2(x)).\n8. The method of claim 1, further comprising, prior to generating the multiple synthetic data examples for the multiple specific values of R training, by the computer system, the discriminator, through machine learning, to discriminate between the first and second classes, wherein training the discriminator comprises:\ngenerating, by a second data generator of the computer system, augmented data examples from the first and second classes; and\ntraining, by the computer system, the discriminator with the augmented data examples.\n9. The machine-learning method of claim 1, wherein the one or more training objectives for the data generator further comprises a second objective, wherein the second objective is back propagated from a real-vs-generated discriminator.\n10. A computer system comprising:\none or more processor cores; and\na memory that stores computer instructions that when executed by the one or more processor cores causes the one or more processor cores to:\ntrain, through machine learning, a data generator with one or more training objectives, wherein the one or more training objectives comprise a first objective to produce a data example for a specific value of R, where R is value related to S1(x) and S2(x), where, for a data example, x, generated by the data generator, S1(x) is a likelihood that the data example x is in a first class of a first selected data example and S2(x) is a likelihood that the data example x is in a second class of a second selected data example, wherein S1(x) and S2(x) are determined by a discriminator that is trained through machine learning to discriminate between the first and second classes;\nafter training the data generator, generate with the data generator a synthetic data example for each of multiple specific values of R, such that the data generator generates multiple synthetic data examples; and\nafter generating the multiple synthetic data examples:\ndetermine parameters for a curve fitting the multiple synthetic data examples generated by the data generator for the multiple specific values of R;\ngenerate additional synthetic data examples along the curve;\nclassify, by a classifier of the computer, the additional synthetic data examples; and\nmodify a training hyperparameter of the generator based on a consistency of classifications by the classifier of the additional synthetic data examples.\n11. The computer system of claim 10, wherein the training hyperparameter comprises a regularization hyperparameter.\n12. The computer system of claim 11, wherein the memory further stores computer instructions that when executed by the one or more processor cores cause the one or more processor cores to, prior to generating the multiple synthetic data examples for the multiple specific values of R, train the discriminator, through machine learning, to discriminate between the first and second classes.\n13. The computer system of claim 12, wherein the memory further stores computer instructions that when executed by the one or more processor cores cause the one or more processor cores to train the discriminator by:\ngenerating, with a second data generator, augmented data examples from the first and second selected data examples; and\ntraining the discriminator with the augmented data examples.\n14. The computer system of claim 13, wherein the second data generator comprises a stochastic generator.\n15. The computer system of claim 10, wherein R is limited to values between 0 and 1 inclusive.\n16. The computer system of claim 15, wherein R is computed based on a ratio of S1(x) to (S1(x)+S2(x)).\n17. The computer system of claim 10, wherein the memory further stores computer instructions that when executed by the one or more processor cores cause the one or more processor cores to, prior to generating the multiple synthetic data examples for the multiple specific values of R, train the discriminator, through machine learning, to discriminate between the first and second classes, wherein training the discriminator comprises:\ngenerating, with a second data generator, augmented data examples from the first and second selected data examples; and\ntraining the discriminator with the augmented data examples.\n18. The computer system of claim 10, wherein the one or more training objectives for the data generator further comprises a second objective, wherein the second objective is back propagated from a real-vs-generated discriminator.",
    "status": "Active",
    "citations_own": [
        "US20020008657A1",
        "US20030033194A1",
        "US20040042650A1",
        "US20050169529A1",
        "US20050216426A1",
        "US20160224903A1",
        "US20160247326A1",
        "US20160379132A1",
        "US20170337464A1",
        "US20180218256A1",
        "US20190095798A1",
        "US20190197358A1",
        "US20190197368A1",
        "US20190370969A1",
        "US20200051550A1",
        "US20200065625A1",
        "US20200090041A1",
        "US20200090001A1",
        "US20200090045A1",
        "US20200097763A1",
        "US20200111019A1",
        "US20200134451A1",
        "US20200143240A1",
        "US20200184337A1",
        "US20200210812A1",
        "US20200311572A1",
        "US20200327455A1",
        "US20210081761A1"
    ],
    "citations_ftf": [
        "US5131055A",
        "US6324532B1",
        "US6128606A",
        "US20040010480A1",
        "KR100506095B1",
        "US20070289013A1",
        "WO2008063598A2",
        "CA2638465A1",
        "US20100324708A1",
        "MX2012004620A",
        "US8687923B2",
        "US8484022B1",
        "US8527276B1",
        "US20140358828A1",
        "US10459117B2",
        "US9247911B2",
        "US9753796B2",
        "US11232319B2",
        "WO2016037300A1",
        "US10832138B2",
        "WO2016145516A1",
        "US20160277767A1",
        "US20160321523A1",
        "US10552730B2",
        "US9699205B2",
        "US10521902B2",
        "US10776712B2",
        "US10043243B2",
        "US10664766B2",
        "US11087234B2",
        "US10176799B2",
        "US10089717B2",
        "US20170328194A1",
        "US10043252B2",
        "US10387765B2",
        "US20180024968A1",
        "US10096088B2",
        "US11205103B2",
        "US10621586B2",
        "US10489887B2",
        "US20180342045A1",
        "US11403531B2",
        "WO2019067831A1",
        "WO2019067960A1",
        "EP3624021A1"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "GB201718756D0",
        "US10678244B2",
        "US11295210B2",
        "WO2018226527A1",
        "US10885470B2",
        "WO2019005507A1",
        "US11157441B2",
        "US11409692B2",
        "US10671349B2",
        "WO2019067542A1",
        "US10679129B2",
        "JP6886112B2",
        "US10360214B2",
        "US11455168B1",
        "US10671434B1",
        "US11494692B1",
        "US11263525B2",
        "US11250329B2",
        "US11763159B2",
        "US10832137B2",
        "CN111602149A",
        "US11321612B2",
        "US11561791B2",
        "US20210097401A1",
        "JP7002404B2",
        "US11151450B2",
        "US11797864B2",
        "US11215999B2",
        "WO2020005471A1",
        "US10922587B2",
        "US11195097B2",
        "US11636333B2",
        "US11468330B2",
        "US11501164B2",
        "WO2020041026A1",
        "US11010670B2",
        "WO2020046719A1",
        "US11562231B2",
        "US11593641B2",
        "US11151334B2",
        "US20200125924A1",
        "US11196678B2",
        "JP2020086479A",
        "KR20210111254A",
        "US11537811B2",
        "JPWO2020129412A1",
        "US20200202622A1",
        "US11610098B2",
        "US11610117B2",
        "US11514330B2",
        "DE102019200565A1",
        "US10997461B2",
        "US11567514B2",
        "US10510002B1",
        "US10956755B2",
        "US11681945B2",
        "US11704573B2",
        "DE102019206620A1",
        "CN110084863B",
        "US11610154B1",
        "US11531879B1",
        "US11175958B2",
        "US11175959B2",
        "CN110096810B",
        "JP7202260B2",
        "CN110113057B",
        "JP7328799B2",
        "JP7116711B2",
        "US11514311B2",
        "EP3767533A1",
        "WO2021019681A1",
        "US11443137B2",
        "US20220335296A1",
        "US20220327379A1",
        "EP3789924A1",
        "JP2021056928A",
        "US11586912B2",
        "EP3816864A1",
        "CN111008277B",
        "WO2020035085A2",
        "US20210150306A1",
        "US11710046B2",
        "US11727284B2",
        "US20210192376A1",
        "CN111104997B",
        "CN113093967A",
        "US11163592B2",
        "US11138094B2",
        "CN111131658B",
        "US11675879B2",
        "US11776679B2",
        "TWI714480B",
        "WO2021194516A1",
        "US11494496B2",
        "US11514318B2",
        "CN111242948B",
        "US11651225B2",
        "US20220035334A1",
        "US20220043681A1",
        "EP3958182A1",
        "KR20220046324A",
        "US20220108434A1",
        "US11580396B2",
        "US11615782B2",
        "US11088784B1",
        "US11191049B1",
        "US11575469B2",
        "US11477308B2",
        "US11483109B2",
        "US11368251B1",
        "US20220253990A1",
        "US20220291955A1",
        "US11496242B2",
        "US11489623B2",
        "TWI769820B",
        "WO2022252013A1",
        "US11675817B1",
        "US20220414447A1",
        "WO2023283501A1",
        "US11797425B2",
        "DE102021208726A1",
        "TWI780940B",
        "WO2023100190A1",
        "WO2023107164A1",
        "US20230289658A1",
        "WO2023192766A1",
        "US11615316B1"
    ]
}