{
    "patent_link": "https://patents.google.com/patent/US5974572A/en",
    "patent_id": "US5974572A",
    "title": "Software system and methods for generating a load test using a server access log",
    "abstract": "A visual Web site analysis program, implemented as a collection of software components, provides a variety of features for facilitating the analysis, management and load-testing of Web sites. A mapping component scans a Web site over a network connection and builds a site map which graphically depicts the URLs and links of the site. Site maps are generated using a unique layout and display methodology which allows the user to visualize the overall architecture of the Web site. Various map navigation and URL filtering features are provided to facilitate the task of identifying and repairing common Web site problems, such as links to missing URLs. A dynamic page scan feature enables the user to include dynamically-generated Web pages within the site map by capturing the output of a standard Web browser when a form is submitted by the user, and then automatically resubmitting this output during subsequent mappings of the site. An Action Tracker module detects user activity and behavioral data (link activity levels, common site entry and exit points, etc.) from server log files and then superimposes such data onto the site map. A Load Wizard module uses this activity data to generate testing scenarios for load testing the Web site.",
    "inventors": [
        "Amir Weinberg",
        "Eduardo Alperin"
    ],
    "assignee": "Micro Focus LLC",
    "classifications": [
        "G06F11/32",
        "G06F11/323",
        "G06F11/3414",
        "G06F11/3438",
        "G06F16/958",
        "G06Q30/02",
        "H04L67/02",
        "H04L67/535",
        "H04L9/40",
        "G06F11/3476",
        "G06F2201/875"
    ],
    "claims": "\n1. A method of load testing of a web site, the method comprising the computer-implemented steps of:\nprocessing site access information stored within an access log to generate at least one test script, the access log generated by a server application that runs on a computer system of the web site, the server application configured to serve informational content over a network in response to requests by visitors of the site and to record visitor accesses to the site within the access log, the site access information representing accesses to the site by multiple different visitors during ordinary, post-deployment usage of the web site, the test script including addresses of informational content entities of the site; and\nrunning the at least one test script to exercise the site, the step of running comprising submitting informational requests to the server application.\n2. The method of claim 1, wherein the step of processing comprises preserving a general load distribution represented by the access log, so that the step of running produces a load that reflects actual usage patterns of visitors.\n3. The method of claim 1, wherein the step of processing is performed such that the step of running produces a load on the site that has generally the same distribution as a load represented within the access log.\n4. The method of claim 3, further comprising prompting a user to enter a control parameter, wherein the load has a magnitude which is specified by the control parameter.\n5. The method of claim 1, wherein the step of processing comprises identifying a plurality of routes taken by visitors to the site.\n6. The method of claim 5, wherein the step of identifying a plurality of routes comprises using access timestamps and visitor identifiers contained within the access log to determine navigational links taken by individual visitors.\n7. The method of claim 5, wherein the step of processing further comprises translating the plurality of routes into a plurality of test scripts.\n8. The method of claim 7, wherein the step of running comprises running the plurality of test scripts in parallel to emulate multiple concurrent visitors.\n9. The method of claim 1, further comprising displaying the site access information on a display screen in conjunction with a graphical map of the web site.\n10. The method of claim 1, wherein the step of running comprises submitting the informational requests to the server application using an implementation of the HTTP protocol.\n11. The method of claim 1, wherein the access log is stored in a standard file format for server access log files.\n12. The method of claim 1, wherein the web site is implemented as an intranet.\n13. A method of testing of a server application that runs on a computer system of a computer network, the method comprising the computer-implemented steps of:\nprocessing client request information stored within an access log to generate at least one data structure, the access log generated by the server application, the server application configured to serve informational content over the computer network in response to requests from client applications, and configured to record requests from the client applications within the access log, the client request information representing requests from multiple users during ordinary, post-deployment usage of the server application within a multi-user network, the data structure including information for performing a load test of the server application; and\nload-testing the server application, the step of load-testing comprising submitting client requests to the server application from a testing application based on the information stored within the at least one data structure.\n14. The method of claim 13, wherein the at least one data structure comprises a sequence of addresses of content entities that are served by the server application, and the step of load-testing comprises using the addresses to request the content entities from the server application.\n15. The method of claim 14, wherein the step of processing comprises preserving a general load distribution represented by the access log, so that the client requests for the content entities are generally distributed among the content entities as in the access log.\n16. The method of claim 13, wherein the step of processing is performed such that the step of load-testing produces a load on the server application that has generally the same distribution as a load represented within the access log.\n17. The method of claim 16, further comprising prompting a user to enter a control parameter, wherein the load has a magnitude which is specified by the control parameter.\n18. The method of claim 13, wherein the step of processing comprises translating access records within the access log into a plurality of test scripts.\n19. The method of claim 18, wherein the step of load-testing comprises running the plurality of test scripts concurrently to emulate multiple concurrent users of the server application.\n20. The method of claim 13, wherein the step of load-testing comprises submitting the client requests from the testing application to the server application using a standard Internet client-server protocol.\n21. A computer-readable medium having stored thereon a computer program which, when executed by a computer, causes the computer to perform the steps of:\n(a) retrieving and processing a standard-format server access log generated by a server of a multi-user network, the server configured to serve informational content to users over the network in response to informational requests, the access log representing informational requests submitted to the server by multiple different users following deployment of the server within the network; and\n(b) using information extracted from the access log in step (a), generating and storing a load test which specifies informational requests to be submitted to the server, the load test adapted to be run using a testing application to apply a load to and test performance of the server.\n22. The computer-readable medium of claim 21, wherein the load test includes a plurality of test scripts.\n23. The computer-readable medium of claim 22, wherein the load test further comprises control parameters which specify, for each respective test script, a number of virtual users that are to play the respective test script.\n24. The computer-readable medium of claim 21, wherein the load test includes a plurality of test scripts, each test script including addresses of content entities served by the server, the addresses extracted from the access log in step (a).\n25. The computer-readable medium of claim 21, wherein the access log represents client accesses to a plurality of content entities that are served by the server, and the load test defines a load which has substantially the same distribution among the content entities as a load represented by the access log.\n26. The computer-readable medium of claim 25, wherein the computer program further causes the computer to prompt a user to enter a control parameter that specifies a magnitude of a load to be applied to the server, and step (b) comprises using the control parameter to generate the load test.\n27. The computer-readable medium of claim 26, wherein the control parameter is a number of virtual users to be included in the load test, wherein each virtual user plays a test script.\n28. The computer-readable medium of claim 21, wherein the server is a web server, and step (a) comprises using timestamps and user identifiers contained within the access log to identify hypertextual navigation paths followed by users.\n29. The computer-readable medium of claim 21, wherein the computer program further causes the computer to run the load test generated in step (b) while monitoring performance of the server.\n30. A method of generating a load test for testing a web site, the method comprising the computer-implemented steps of:\nretrieving a standard-format server access log generated by a web server of the web site during ordinary usage of the web site within a multi-user network, the access log stored within a computer memory and representing accesses to content entities of the web site by multiple users;\nprocessing the access log to identify a plurality of navigation routes followed by a plurality of different users of the web site; and\nincorporating the navigation routes into the load test such that a distribution of access requests among the content entities as reflected within the access log is generally preserved, load test adapted to be run by a testing application to apply a load to and test performance of the web site.\n31. The method of claim 30, wherein the step of identifying a plurality of navigation routes comprises identifying first and second content entities accessed by a user in sequence, and determining whether a navigational link exists between the first and second content entities.\n32. The method of claim 30, wherein the step of incorporating the navigation routes into the load test comprises merging consecutive routes of the plurality of navigation routes.\n33. The method of claim 30, wherein the load test includes a plurality of test scripts.\n34. The method of claim 30, further comprising the running the load test with the testing application to test the performance of the server.\n35. The method of claim 30, further comprising prompting a user to enter a control parameter that specifies a magnitude of a load to be applied to the server by the load test, and incorporating the control parameter into the load test.\n36. The method of claim 35, wherein the control parameter is a number of virtual users to be included in the load test, wherein each virtual user plays a test script during running of the load test.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5295261A",
        "US5303166A",
        "US5388255A",
        "US5446874A",
        "US5515488A",
        "US5524202A",
        "US5544310A",
        "US5546529A",
        "US5590250A",
        "US5657438A",
        "US5787254A",
        "US5812780A",
        "US5819068A"
    ],
    "citations_ftf": [
        "US5537542A",
        "JP3813210B2",
        "US5892917A",
        "US5774123A",
        "US5761673A",
        "US5819066A",
        "US5696701A",
        "US5974572A",
        "US5848415A",
        "US6122740A"
    ],
    "citedby_own": [
        "WO2000045264A1",
        "US6122648A",
        "US6182097B1",
        "US6189142B1",
        "US6192511B1",
        "US6205413B1",
        "US6208991B1",
        "US6212675B1",
        "WO2001035259A2",
        "US6253204B1",
        "WO2001046840A2",
        "WO2001046868A2",
        "WO2001057671A1",
        "US6278966B1",
        "US6279001B1",
        "US6288717B1",
        "US6314565B1",
        "US6314463B1",
        "US20010038394A1",
        "US6317786B1",
        "FR2809199A1",
        "US6338066B1",
        "WO2002010928A1",
        "US6356902B1",
        "US6366909B1",
        "GB2367464A",
        "US20020046273A1",
        "US20020083067A1",
        "US6434513B1",
        "US6446120B1",
        "US20020128925A1",
        "US20020169863A1",
        "US6502091B1",
        "US20030005044A1",
        "US20030009555A1",
        "US6513154B1",
        "US6522995B1",
        "US20030036897A1",
        "US20030043200A1",
        "US20030051031A1",
        "US20030069957A1",
        "US6549944B1",
        "WO2003038678A1",
        "US20030088644A1",
        "US20030103090A1",
        "WO2003050681A1",
        "US20030120463A1",
        "US6601020B1",
        "US6606581B1",
        "US20030154442A1",
        "US20030158953A1",
        "US20030177234A1",
        "US20030182408A1",
        "US20030182417A1",
        "US6631411B1",
        "EP1350160A1",
        "US20030191988A1",
        "US6633912B1",
        "US20030212612A1",
        "US6654761B2",
        "US6654699B2",
        "US6667751B1",
        "US20040019688A1",
        "US20040025143A1",
        "US20040034850A1",
        "US6708172B1",
        "US6708324B1",
        "US20040093593A1",
        "US6754701B1",
        "US6757724B1",
        "US20040143787A1",
        "US6772107B1",
        "US6775824B1",
        "US20040158574A1",
        "US6789050B1",
        "GB2399196A",
        "US6799213B1",
        "US20040205638A1",
        "US20040205529A1",
        "US20040267727A1",
        "US6848077B1",
        "US6859922B1",
        "US20050050320A1",
        "US20050086585A1",
        "US20050091259A1",
        "US20050102318A1",
        "US6901438B1",
        "US6904461B1",
        "US20050138104A1",
        "US20050149254A1",
        "US20050165766A1",
        "US20050170891A1",
        "US6938158B2",
        "US20050198105A1",
        "US20050216234A1",
        "US20050256955A1",
        "US6976093B2",
        "US6981180B1",
        "US20060010155A1",
        "US20060010114A1",
        "US20060010112A1",
        "US20060010058A1",
        "US20060020921A1",
        "US20060020608A1",
        "US20060020620A1",
        "US7000224B1",
        "US7013251B1",
        "US20060085766A1",
        "US7035943B2",
        "US7047277B1",
        "US20060123412A1",
        "US20060123430A1",
        "US20060136579A1",
        "US20060168586A1",
        "US7085820B1",
        "US20060184886A1",
        "US20060195725A1",
        "US20060224375A1",
        "US20060259973A1",
        "US20060265368A1",
        "US7143193B1",
        "US7155713B1",
        "US20070006045A1",
        "US7200645B2",
        "US20070079291A1",
        "US20070079289A1",
        "DE102005043260A1",
        "US20070079290A1",
        "US20070083632A1",
        "US20070083634A1",
        "US20070083633A1",
        "US20070083630A1",
        "US20070083631A1",
        "US20070083793A1",
        "US20070094495A1",
        "US20070094673A1",
        "US20070150568A1",
        "US20070156677A1",
        "US7249313B2",
        "US20070174036A1",
        "US20070192474A1",
        "US7275020B2",
        "US20070233453A1",
        "US20070271273A1",
        "US20070288625A1",
        "US20080021892A1",
        "US20080052690A1",
        "US20080059286A1",
        "US7346678B1",
        "US7370315B1",
        "US7370285B1",
        "US20080109472A1",
        "US20080109762A1",
        "US20080141266A1",
        "US7392321B1",
        "US20080189077A1",
        "US7415697B1",
        "US20080228861A1",
        "US20080244599A1",
        "US20080244507A1",
        "US7447738B1",
        "US20080294743A1",
        "US7478121B1",
        "US7490148B1",
        "US20090077459A1",
        "US20090083421A1",
        "US20090100345A1",
        "US7581006B1",
        "US20090222508A1",
        "US20090235236A1",
        "US20090240759A1",
        "US7596484B1",
        "US20090245106A1",
        "US7600232B2",
        "US20100023644A1",
        "US20100031144A1",
        "US20100106478A1",
        "US20100153529A1",
        "US20100251032A1",
        "US7827487B1",
        "US20110016141A1",
        "US20110029817A1",
        "US7895565B1",
        "EP2290604A1",
        "CN102004776A",
        "US20110106721A1",
        "US7962948B1",
        "US20110238710A1",
        "US8032898B2",
        "US20110246971A1",
        "US20110252003A1",
        "US20120084433A1",
        "US8171509B1",
        "US8180749B1",
        "US8185824B1",
        "US8266270B1",
        "US20130019152A1",
        "US8370420B1",
        "US20130238665A1",
        "US8548978B2",
        "US20130262704A1",
        "US20140068335A1",
        "US8775237B2",
        "CN103995773A",
        "US20140258985A1",
        "US8849968B2",
        "US20140380200A1",
        "US9111037B1",
        "US9122789B1",
        "EP2336970B1",
        "US20160164757A1",
        "US20160196357A1",
        "WO2016141109A1",
        "US20160349312A1",
        "US20170083643A1",
        "CN107609040A",
        "US9880696B2",
        "US10133621B1",
        "US20190004926A1",
        "US10187283B2",
        "US10324609B2",
        "US10437568B1",
        "US10719188B2",
        "US10983856B2",
        "CN113098733A",
        "US11314721B1",
        "US11599369B1"
    ],
    "citedby_ftf": [
        "US6513060B1",
        "US6842782B1",
        "US7779015B2",
        "US6801223B1",
        "US6842877B2",
        "US6513046B1",
        "US6791580B1",
        "US7225229B1",
        "US8225214B2",
        "US7231439B1",
        "US9183306B2",
        "US8181113B2",
        "US6920616B1",
        "US7046263B1",
        "US7114154B1",
        "US6714967B1",
        "US7194681B1",
        "US6622160B1",
        "US7162477B1",
        "US7096417B1",
        "WO2001057721A2",
        "WO2001075676A2",
        "US7464153B1",
        "US8386920B2",
        "US7043546B2",
        "US6842769B1",
        "US7962603B1",
        "US6785666B1",
        "US7006099B2",
        "US7454500B1",
        "US7657629B1",
        "US9130954B2",
        "US20020054130A1",
        "GB2386724A",
        "US8250570B2",
        "US20020083146A1",
        "US7155491B1",
        "US7320019B2",
        "US6854074B2",
        "US7305622B2",
        "US8719703B2",
        "US7426687B1",
        "KR20030094261A",
        "US7647373B2",
        "US7788399B2",
        "US7689711B2",
        "US7516191B2",
        "US9948644B2",
        "US7305454B2",
        "US7249195B2",
        "US7734725B2",
        "US7743147B2",
        "JP3948911B2",
        "US7152106B2",
        "US8560666B2",
        "US20030018584A1",
        "US7254526B2",
        "US7185286B2",
        "AU2002327525A1",
        "US20030120762A1",
        "US7403985B2",
        "US7107338B1",
        "US7660876B2",
        "US7536404B2",
        "US7478170B2",
        "US7200668B2",
        "US7340534B2",
        "US7222170B2",
        "US20030208603A1",
        "US8447963B2",
        "EP1686499B1",
        "US7225407B2",
        "US7086061B1",
        "US7676576B1",
        "US7574508B1",
        "US7853684B2",
        "WO2004036366A2",
        "JP4156911B2",
        "US7877681B2",
        "US20040215701A1",
        "US7385613B1",
        "JP4731120B2",
        "CN101707572B",
        "US7814413B2",
        "US7543051B2",
        "US7451391B1",
        "US9584360B2",
        "US8453196B2",
        "US7904882B2",
        "JP4396242B2",
        "US7739351B2",
        "JP4381861B2",
        "US20050212823A1",
        "US7590685B2",
        "US7496651B1",
        "US7584301B1",
        "US20050257196A1",
        "JP2005332025A",
        "US7802007B2",
        "US8346593B2",
        "US20060004913A1",
        "US7725605B2",
        "US7423977B1",
        "US7940746B2",
        "US8732004B1",
        "US9645712B2",
        "US7721328B2",
        "US7624176B2",
        "US8015239B2",
        "US7617486B2",
        "US8903760B2",
        "US7406626B2",
        "US20070220441A1",
        "US20110208732A1",
        "US20070162298A1",
        "US7962606B2",
        "US7689903B2",
        "CA2543694A1",
        "US7607092B2",
        "US20060277270A1",
        "US20070094380A1",
        "US20070100989A1",
        "US8484324B2",
        "US7590634B2",
        "US20170046458A1",
        "US7941525B1",
        "US20080133549A1",
        "WO2009049323A1",
        "WO2007131213A2",
        "US9122715B2",
        "US20080046218A1",
        "US8255873B2",
        "US8209605B2",
        "US20080177782A1",
        "US20080183858A1",
        "US8504348B2",
        "US8930331B2",
        "US8775603B2",
        "US8229722B2",
        "US8615008B2",
        "US8248928B1",
        "US20090199090A1",
        "US20090228716A1",
        "US20090249794A1",
        "US20090252598A1",
        "US9396099B2",
        "US8429194B2",
        "US20100122313A1",
        "US8645916B2",
        "CA2747816C",
        "US20100257403A1",
        "US8261126B2",
        "US8862574B2",
        "WO2010132492A2",
        "AU2012254861B2",
        "US20110082597A1",
        "US8832101B2",
        "US9152727B1",
        "US8549148B2",
        "US9589254B2",
        "US8521655B2",
        "US9547693B1",
        "US8799240B2",
        "US9092482B2",
        "US9405739B1",
        "US8732574B2",
        "US8504542B2",
        "US8838602B1",
        "US9300545B2",
        "US9021361B1",
        "US20130290441A1",
        "US9223683B1",
        "US9026853B2",
        "US8949795B2",
        "US9348677B2",
        "US9123086B1",
        "US10037314B2",
        "US8909656B2",
        "US10275778B1",
        "US9965937B2",
        "US8818892B1",
        "US8855999B1",
        "US8917274B2",
        "US8903717B2",
        "US8868486B2",
        "US8937619B2",
        "US8930897B2",
        "US9009544B2",
        "US8799799B1",
        "US9223773B2",
        "US9335897B2",
        "US8713467B1",
        "US8689108B1",
        "US9785317B2",
        "US9336287B2",
        "US8938686B1",
        "US8812960B1",
        "US8924872B1",
        "US9116975B2",
        "US9021384B1",
        "US8832594B1",
        "US8868537B1",
        "US9105000B1",
        "US9734217B2",
        "US9552615B2",
        "US9565138B2",
        "US10356032B2",
        "US9043696B1",
        "US8832832B1",
        "US9648542B2",
        "US9483162B2",
        "US9009827B1",
        "US9727376B1",
        "US8935201B1",
        "US9836580B2",
        "US9857958B2",
        "US9009171B1",
        "US11257117B1",
        "US9619557B2",
        "US9535974B1",
        "US9785773B2",
        "US9256664B2",
        "US9202249B1",
        "US10572496B1",
        "US9021260B1",
        "US9251013B1",
        "US9501851B2",
        "US9767172B2",
        "US9785328B2",
        "US9984133B2",
        "US9229952B1",
        "US9043894B1",
        "US10320739B2",
        "US10362133B1",
        "US9348920B1",
        "US9367872B1",
        "US10552994B2",
        "US9817563B1",
        "US9335911B1",
        "US9870205B1",
        "US10372879B2",
        "US11302426B1",
        "US10387834B2",
        "US9727560B2",
        "EP3070622A1",
        "US9886467B2",
        "US10911353B2",
        "US9866478B2",
        "US10771475B2",
        "US10129088B2",
        "US10628834B1",
        "US10530688B2",
        "US10057126B2",
        "US9418337B1",
        "US9454785B1",
        "US9996595B2",
        "US9456000B1",
        "US9600146B2",
        "US10489391B1",
        "US10102369B2",
        "US10853378B1",
        "US11150917B2",
        "US9485265B1",
        "US10706434B1",
        "US9576015B1",
        "US10296617B1",
        "US9767309B1",
        "US9542446B1",
        "US9823818B1",
        "US10089289B2",
        "US9612723B1",
        "US10243813B2",
        "US10698938B2",
        "US10999200B2",
        "US10437840B1",
        "US10678894B2",
        "US10567259B2",
        "US10318630B1",
        "US10460602B1",
        "US20180349436A1",
        "US10956406B2",
        "US10403011B1",
        "US10754822B1",
        "US10885021B1",
        "US11119630B1",
        "US11122084B1",
        "WO2020160021A1",
        "US11297091B2",
        "US11682041B1"
    ]
}