{
    "patent_link": "https://patents.google.com/patent/US4649515A/en",
    "patent_id": "US4649515A",
    "title": "Methods and apparatus for system fault diagnosis and control",
    "abstract": "Method and apparatus for monitoring and diagnosing sensor and interactive based process systems. The knowledge base concerning the process system per se is in the form of a list stored in memory, which list includes domain specific rules in evidence-hypothesis form. This domain dependent information is devoid of means for interconnecting the rules to perform diagnostic services. A completely domain independent set of meta-level rules is stored in memory, which, in response to sensor and/or user input, searches the knowledge base and effectively constructs a rule network through which belief is propagated, to detect and report malfunctions, to output control signals for modifying the operation of the monitored system, and to aid users by providing information relative to malfunctions which pinpoints probable causes. The domain independent rules, in addition to the meta-level rules which search the knowledge base and interconnect domain specific rules, includes procedural rules for choosing which of the meta-level rules to apply when there is a choice. The procedural inference rules are independent and distinct from the meta-level rules which manipulate the knowledge base.",
    "inventors": [
        "Timothy F. Thompson",
        "Robert M. Wojcik"
    ],
    "assignee": "Westinghouse Electric Co LLC",
    "classifications": [
        "G06F11/2257",
        "G01R31/318371",
        "G06N5/04",
        "Y10S706/903",
        "Y10S706/91",
        "Y10S706/911",
        "Y10S706/918"
    ],
    "claims": "\n1. A method of diagnosing faults in a predetermined system, comprising the steps of: providing domain specific rules, including rules in evidence-hypothesis form, to build a knowledge base of assertions relative to the predetermined system,\nmaintaining said knowledge base free of information which makes inferences relative to the knowledge base,\nproviding data relative to the predetermined system,\nproviding inference rules, independent and distinct from said domain specific rules, which make belief propagating inferences in response to the data, by selecting and applying the domain specific rules,\npropagating belief in the hypotheses of selected domain specific rules, in response to the data, by the step of interconnecting the domain specific rules, under the control of the inference rules, into a rule network of hypothesis nodes interconnected by evidence,\nand outputting information in response to the belief propagating step.\n2. The method of claim 1 including the step of dividing the inference rules into two levels, with the first level including task control rules which make inferences for controlling the selection and application of domain specific rules, and with the second level including procedural rules which make inferences for controlling the selection of the task control rules of the first level, when there is a choice.\n3. The method of claim 1 wherein the inference rules include rules for the steps of:\ndetermining when a belief propagating path appears unproductive,\nstoring the information developed for an unproductive path,\nstarting a new belief propagating path,\nand returning to an apparently unproductive path in response to predetermined conditions, using the information previously stored, to start at the point of previous termination.\n4. The method of claim 1 wherein the domain specific rules include confidence factor threshold (CFT) values, and the inference rules include rules for the steps of:\ndeveloping a confidence factor for each hypothesis node in the propagating step, using the confidence factors of supporting nodes,\ncomparing the developed confidence factor for each hypothesis node with an associated CFT value to determine when the present propagating path appears to be unproductive,\nstoring the information relative to an apparently unproductive path,\nand returning to an apparently unproductive path in response to predetermined conditions, using the information previously stored to start at the point of previous termination.\n5. The method of claim 1 wherein the domain specific rules include path factors which assign relative values to alternate paths from a node, which path factors are utilized by the inference rules in selecting domain specific rules.\n6. The method of claim 1 wherein the domain specific rules include forward path factors which assign relative values to alternate paths from a node to supported rules, which path factors are utilized by the inference rules in selecting domain specific rules.\n7. The method of claim 1 wherein the domain specific rules include backward path factors which assign relative values to alternate paths from a node to supporting rules, which path factors are utilized by the inference rules in selecting domain specific rules.\n8. The method of claim 1 wherein the domain specific rules include confidence factor threshold (CFT) values, and the inference rules include rules for establishing the steps of:\ndeveloping a confidence factor for each hypothesis node in the propagating step, utilizing the confidence factors of supporting nodes,\ncomparing the developed confidence factor for each hypothesis node with the CFT values,\nfiring the associated rule, to continue the present propagating path, when the comparison is within the CFT values,\nnoting the relative firing times of the rules in working memory elements (WME),\nterminating the present propagating path when the comparison is outside the CFT values,\nstoring information relative to the terminated path,\nand looking for a new belief propagating path from the hypothesis nodes of fired rules, using the relative firing times stored in the WME's, to select the order.\n9. The method of claim 8 wherein the inference rules include rules for establishing the step of returning to the most recent WME to continue a terminated belief path, in response to predetermined conditions.\n10. The method of claim 9 wherein the step of returning to the most recent WME includes the step of disregarding the CFT comparison step, for at least one rule, to advance belief propagation by firing the associated rule.\n11. The method of claim 1 wherein the domain specific rules include values which assign relative weights to multiple pieces of evidence for a rule, and confidence factor assumption (CFA) values, and the inference rules include rules for propagating belief without obtaining all of the evidence for a hypothesis by the steps of developing a confidence factor CF for each hypothesis node, setting the weight of a missing piece of evidence to zero, comparing the confidence factor CF with the CFA value, and continuing without the missing evidence when CF exceeds the CFA value.\n12. The method of claim 11 wherein the inference rules include rules for establishing the step of returning to rules which were fired with missing pieces of evidence, in response to predetermined conditions.\n13. The method of claim 12 wherein the domain specific rules include rules which have a malfunction hypothesis, with a predetermined condition which will trigger the return to a rule fired with missing evidence is a CF of a malfunction hypothesis being in a predetermined range.\n14. The method of claim 1 wherein the step of providing data includes the step of providing sensor data, the step of providing domain specific rules includes providing values which enable a sufficiency factor SF to be determined for each sensor, and the step of providing inference rules includes the step of determining the SF for each sensor supported rule.\n15. The method of claim 1 wherein the step of providing domain specific rules includes the step of assigning values SF to the rules based upon the confidence that the evidence, when present, supports the hypothesis, and values NF to the rules based upon the necessity of the evidence to the belief of the hypothesis, when substantiating evidence is not present.\n16. The method of claim 1 wherein the step of providing data includes the step of providing sensor inputs, the step of providing domain specific rules includes the step of assigning a confidence factor CF to each sensor, and the inference rules include the steps of developing a sufficiency factor SF relative to the data provided by a sensor based upon its value, and developing a measure of belief MB relative to the sensor data equal to the product of the CF and SF.\n17. The method of claim 15 wherein the step of providing inference rules includes rules for determining a measure of belief MB in the hypothesis, determining a measure of disbelief MD in the hypothesis, by utilizing SF and NF, and for determining a confidence factor in the hypothesis according to the difference between MB and MD.\n18. The method of claim 1 wherein the step of providing data includes the step of providing sensor data, and the step of providing domain specific rules includes malfunction hypotheses, and wherein the inference rules include rules for forward chaining from known sensor inputs, until nodes are reached requiring unknown evidence, and rules for backward chaining to establish additional sensor data required to provide the unknown evidence, with the forward and backward chaining continuing until a malfunction node is reached.\n19. The method of claim 1 wherein the step of providing domain specific rules includes the step of attaching predetermined signals and associated conditions to predetermined hypotheses, and the inference rules include rules for outputting such signals when the associated hypothesis node meets the conditions for outputting the signal.\n20. Apparatus for diagnosing faults in a predetermined system, comprising:\nsensors for providing sensor data relative to the performance of the predetermined system,\na domain specific knowledge base, including a plurality of rules in evidence-hypothesis form, which make assertions relative to the predetermined system,\nsaid knowledge base being free of information which makes inferences relative to the knowledge base,\ndomain independent inference rules, including first and second levels of inference rules,\nmeans interconnecting said sensors, said domain specific knowledge base, and said domain independent inference rules,\nsaid first level of inference rules including means for testing evidence portions of selected rules of said domain specific knowledge base in response to said sensor data, and means responsive to successfully tested (fired) rules for making belief propagating inferences relative to the hypotheses of the domain specific rules,\nsaid second level of inference rules including means for determining which of the first level inference rules to apply when there is a choice,\nand means for outputting signals relative to at least certain of the domain specific rules which fire when their evidence portions are tested.\n21. The apparatus of claim 20 wherein the domain specific knowledge base includes sensor information relative to each sensor, and the inference rules include means responsive to said sensor information for determining the confidence factor CF of the sensor data.\n22. The apparatus of claim 20 wherein the domain specific knowledge base includes values SF assigned to at least certain of the domain dependent rules based upon the confidence that the evidence, when present, supports the hypothesis, and values NF related to the necessity of the evidence to the belief of the hypothesis when it is missing, and the influence rules include means for determining a measure of belief MB and a measure of disbelief MD in the hypotheses of selected domain dependent rules, based upon the CF of the evidence and the SF and NF of the rules, and for developing a confidence factor CF responsive to the difference between MB and MD.\n23. The apparatus of claim 22 wherein the domain specific knowledge base includes confidence factor threshold values CFT, and the inference rules include means for comparing the CF of a rule with a CFT value, firing the rule when the CF is within the CFT, and backing up to start a different path through the domain dependent rules when it is outside the CFT.\n24. The apparatus of claim 23 wherein the inference rules include means for returning to a non-fired rule in response to predetermined conditions, and including means for firing the rule without regard to the CFT.\n25. The apparatus of claim 20 wherein the output signals include control signals which modify the operation of the predetermined system.\n26. The apparatus of claim 22 wherein the domain specific rules include values which assign relative weights to multiple pieces of evidence for a rule, and confidence factor assumption (CFA) values, and the inference rules include means for propagating belief without obtaining all of the evidence for a hypothesis, including means for developing a confidence factor CF for each hypothesis mode, means for setting the weight of a missing piece of evidence to zero, means for comparing the confidence factor CF with the CFA value, and means for continuing to propagate belief without the missing evidence when CF exceeds the CFA value.\n27. The apparatus of claim 26 wherein the inference rules include means for returning to rules which were fired with missing pieces of evidence, in response to predetermined conditions.\n28. The apparatus of claim 20 wherein the inference rules include means for:\ndetermining when a belief propagating path appears unproductive,\nmeans for storing the information developed for an unproductive path,\nmeans for starting a new belief propagating path,\nand means for returning to an apparently unproductive path in response to predetermined conditions, using the information previously stored, to start at the point of previous termination.\n29. The apparatus of claim 20 wherein the domain specific rules include path factors which assign relative values to alternate paths from a node, and the inference rules include means for considering the path factors in selecting domain specific rules.\n30. The apparatus of claim 20 wherein the domain specific rules include malfunction hypotheses, and wherein the inference rules include means for forward chaining from known sensor inputs, until nodes are reached requiring unknown evidence, means for backward chaining to establish additional sensor data required to provide the unknown evidence, and means for continuing forward and backward chaining until a malfunction node is reached.\n31. A method of diagnosing faults in a predetermined system, comprising the steps of: providing domain specific rules having confidence threshold (CFT) values, including rules in evidence-hypothesis form, to build a knowledge base of assertions relative to the predetermined system,\nproviding data relative to the predetermined system,\nproviding inference rules which make belief propagating inferences in response to the data, by selecting and applying the domain specific rules,\npropagating belief in the hypothesis of selected domain specific rules, in response to the data, by the step of interconnecting the domain specific rules, under the control of the inference rules, into a rule network of hypothesis nodes interconnected by evidence,\nsaid step of propagating belief including the steps of:\n(a) developing a confidence factor for each hypothesis node in the propagating step, using the confidence factors developed for supporting nodes,\n(b) comparing the developed confidence factor for each hypothesis node with the associated CFT value to determine when the present propagating path appears to be unproductive,\n(c) storing the information relative to an apparently unproductive path,\nand (d) returning to an apparently unproductive path in response to predetermined conditions, using the information previously stored to start at the point of previous termination,\nand outputting information in response to the belief propagating step.\n32. The method of claim 31 wherein the step of returning to an apparently unproductive path includes the step of disregarding the CFT comparison step (b), for at least one rule, to advance belief propagation by firing the associated rule.\n33. A method of diagnosing faults in a predetermined system, comprising the steps of: providing domain specific rules, including rules in evidence-hypothesis form, to build a knowledge base of assertions relative to the predetermined system, said domain specific rules including values which assign relative weights to multiple pieces of evidence for a rule, and confidence factor assumption (CFA) values,\nproviding data relative to the predetermined system,\nproviding inference rules which make belief propagating inferences in response to the data, by selecting and applying the domain specific rules,\npropagating belief in the hypotheses of selected domain specific rules, in response to the data, by the step of interconnecting the domain specific rules, under the control of the inference rules, into a rule network of hypothesis nodes interconnected by evidence,\nsaid belief propagating step propagating belief without obtaining all of the evidence for a hypothesis of the steps of: (a) developing a confidence factor CF for each hypothesis node, (b) setting the weight of a missing piece of evidence to zero, (c) comparing the confidence factor CF with the CFA value, and (d) continuing without the missing evidence when CF exceeds the CFA value,\nand outputting information in response to the belief propagating step.\n34. The method of claim 33 wherein the domain specific rules include rules which have a malfunction hypothesis, and including the step of returning to a rule which was fired with missing evidence when the CF of a malfunction hypothesis is in a predetermined range.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4561093A",
        "US4567560A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4697243A",
        "US4754410A",
        "WO1988005574A1",
        "US4761746A",
        "US4763277A",
        "US4783752A",
        "US4796206A",
        "US4817092A",
        "US4839822A",
        "US4839823A",
        "US4841456A",
        "US4847795A",
        "US4860213A",
        "US4873687A",
        "US4881230A",
        "US4885705A",
        "US4888771A",
        "US4903215A",
        "EP0355968A2",
        "US4907167A",
        "WO1990002375A1",
        "US4910691A",
        "US4916633A",
        "US4918620A",
        "US4931950A",
        "US4937755A",
        "US4965743A",
        "US4967368A",
        "US4970725A",
        "US4970657A",
        "US4975865A",
        "US4977390A",
        "US5010551A",
        "US5014220A",
        "US5021997A",
        "US5043891A",
        "EP0443212A1",
        "US5051932A",
        "US5058043A",
        "US5058033A",
        "US5067129A",
        "US5067099A",
        "US5070468A",
        "US5081598A",
        "EP0474944A2",
        "US5099436A",
        "US5105220A",
        "US5107500A",
        "US5109380A",
        "US5119318A",
        "US5121496A",
        "US5122976A",
        "US5127006A",
        "US5129043A",
        "US5132920A",
        "US5136523A",
        "US5138694A",
        "US5148378A",
        "US5159685A",
        "US5179633A",
        "US5179632A",
        "US5193143A",
        "US5195029A",
        "US5204968A",
        "US5218669A",
        "US5224206A",
        "US5243732A",
        "US5247447A",
        "US5249260A",
        "US5305426A",
        "US5335339A",
        "US5355444A",
        "US5377308A",
        "US5404292A",
        "US5412802A",
        "US5434971A",
        "US5446575A",
        "US5479560A",
        "US5485409A",
        "US5487134A",
        "US5488697A",
        "US5490089A",
        "US5493729A",
        "US5521844A",
        "US5522014A",
        "WO1996018949A1",
        "US5537644A",
        "US5550751A",
        "US5572670A",
        "US5598511A",
        "US5604841A",
        "US5608845A",
        "US5619621A",
        "US5625574A",
        "US5629878A",
        "US5644686A",
        "US5651100A",
        "US5675521A",
        "EP0767427A3",
        "US5740352A",
        "US5751943A",
        "US5778370A",
        "US5787409A",
        "US5825989A",
        "US5835886A",
        "US5835900A",
        "US5956663A",
        "US5963931A",
        "US6012149A",
        "US6017143A",
        "US6047220A",
        "EP1026589A1",
        "US6125339A",
        "WO2000065415A2",
        "US6144642A",
        "US6144954A",
        "US6249755B1",
        "US6298454B1",
        "US20010042043A1",
        "US20020022894A1",
        "US6356191B1",
        "US6363330B1",
        "US6370448B1",
        "US6405190B1",
        "US20020077711A1",
        "US6415283B1",
        "US6434504B1",
        "US6449574B1",
        "GB2373606A",
        "GB2373607A",
        "US6473710B1",
        "US20020163427A1",
        "US20030004681A1",
        "US6505517B1",
        "US6513024B1",
        "US20030028268A1",
        "US6519546B1",
        "US6539267B1",
        "US6556145B1",
        "US6591166B1",
        "US6601005B1",
        "US20030154051A1",
        "US6611775B1",
        "US20030163431A1",
        "US6615149B1",
        "US6625500B1",
        "US6629059B2",
        "US6633782B1",
        "US20030195934A1",
        "US20030200191A1",
        "US20030200075A1",
        "US20030200189A1",
        "US6654697B1",
        "US6671824B1",
        "US20040019574A1",
        "US20040024568A1",
        "US6701274B1",
        "US6735484B1",
        "US6754601B1",
        "US20040123129A1",
        "US6772036B2",
        "US20040249583A1",
        "US20040260408A1",
        "US20050008227A1",
        "US20050011278A1",
        "US20050033709A1",
        "US20050030185A1",
        "US20050033466A1",
        "US20050071235A1",
        "US20050072239A1",
        "US20050091151A1",
        "US20050096759A1",
        "US6907383B2",
        "US20050132808A1",
        "US6912700B1",
        "US6920799B1",
        "US20050165707A1",
        "US20050177716A1",
        "US20050182956A1",
        "US20050247114A1",
        "US20050251366A1",
        "US20050247113A1",
        "US20050251367A1",
        "US6970003B2",
        "US20060020427A1",
        "US6993396B1",
        "US20060036404A1",
        "US7017080B1",
        "US20060085108A1",
        "US20060095394A1",
        "US20060100829A1",
        "US7046180B2",
        "US7085610B2",
        "US20060206397A1",
        "US20060229777A1",
        "US20060248353A1",
        "US20060277000A1",
        "US20060282580A1",
        "US20070010968A1",
        "US20070050157A1",
        "US20070061594A1",
        "US20070067142A1",
        "US20070064943A1",
        "US20070068225A1",
        "US20070088982A1",
        "US20070150305A1",
        "US20070255666A1",
        "US7321846B1",
        "US20080125884A1",
        "US20080215194A1",
        "US20090043530A1",
        "US20090055457A1",
        "US20090083001A1",
        "US20090102964A1",
        "US20090132858A1",
        "US20090248363A1",
        "US20100073202A1",
        "US7702401B2",
        "US20100100259A1",
        "DE102008043100A1",
        "US7750642B2",
        "US20100223225A1",
        "WO2010101944A1",
        "US20100286798A1",
        "US20100288054A1",
        "US7844835B2",
        "US7953501B2",
        "US20110145082A1",
        "US8005647B2",
        "US8055479B2",
        "US20110286381A1",
        "US8185473B2",
        "US8266025B1",
        "US8307212B2",
        "US20120330875A1",
        "US8429048B2",
        "US8627246B2",
        "US8862433B2",
        "US20150012474A1",
        "US20150013556A1",
        "US8964338B2",
        "US8972831B2",
        "US8974573B2",
        "US9043263B2",
        "US9052240B2",
        "US9121407B2",
        "US9140728B2",
        "US9201113B2",
        "US9201420B2",
        "US9207129B2",
        "US9207670B2",
        "US9218233B2",
        "US9285802B2",
        "US9310439B2",
        "US9310094B2",
        "US9551504B2",
        "US9602122B2",
        "US9638436B2",
        "US9665090B2",
        "US9765979B2",
        "US9803902B2",
        "US9823632B2",
        "US9885507B2",
        "US9912733B2",
        "US9927788B2",
        "US9940235B2",
        "CN110132603A",
        "CN110531742A",
        "US10737904B2",
        "US10829344B2",
        "US11014780B2",
        "US11270216B2"
    ],
    "citedby_ftf": []
}