{
    "patent_link": "https://patents.google.com/patent/US20030055729A1/en",
    "patent_id": "US20030055729A1",
    "title": "Method and system for allocating display space",
    "abstract": "A method and system for allocating display space on web page. In one embodiment, the display space system receives multiple bids each indicating a bid amount and an advertisement. When a request is received to provide a web page that includes the display space, the display space system selects a bid based in part on the bid amount. The display space system then adds the advertisement of the selected bid to the web page. The bid may also include various criteria that specify the web pages on which the advertisement may be placed, the users to whom the advertisement may be presented, and the time when the advertisement may be placed. The bid amount may be a based on an established currency or based on advertising points. The display space system may award advertising points for various activities that users perform. The activities for which advertising points may be awarded may include the listing of an item to be auctioned, the bidding on an item being auctioned, the purchasing of an item at an auction, or the purchasing of an item at a fixed price. The display space system tracks the advertising points that have been allocated to each user. When an advertisement is placed on a web page on behalf of the user, the display space system reduces the number of advertising points allocated to that user. The display space system may also provide an auto bidding mechanism that places bids for display space on behalf of the user.",
    "inventors": [
        "Jeffrey Bezos",
        "Gus Lopez",
        "Joel Spiegel"
    ],
    "assignee": "Individual",
    "classifications": [
        "G06Q30/0277",
        "G06Q30/02",
        "G06Q30/0231",
        "G06Q30/0254",
        "G06Q30/0269",
        "G06Q30/0275",
        "G06Q30/08"
    ],
    "claims": "\n1. A method in a computer system for allocating display space on a web page, the method comprising:\nreceiving multiple bids indicating a bid amount and an advertisement;\nreceiving a request to provide the web page to a user;\nselecting, based at least in part on review of bid amounts, a received bid; and\nadding the advertisement of the selected bid to the web page.\n2. The method of claim 1 wherein the selecting of a received bid is performed after receiving of the request.\n3. The method of claim 1 wherein the selecting of the received bid is based at least in part on demographics of the user.\n4. The method of claim 1 wherein the selecting of the received bid is based at least in part on time at which the request is received.\n5. The method of claim 1 wherein the selecting of the received bid is based at least in part on category to which the web page relates.\n6. The method of claim 1 wherein the selecting of the received bid is based at least in part on a score indicating a likelihood that all the requested advertising of the bid will be placed.\n7. The method of claim 1 wherein the bid amount is based on points received for participating in a commercial transaction.\n8. The method of claim 7 wherein the commercial transaction is an auction.\n9. The method of claim 1 wherein the bid amount is based on points received for clicking through one web page to another web page.\n10. A method in a computer system for allocating advertising space, the method comprising:\ncoordinating participation of a user in a transaction;\nallocating points to the user as a result of participation in the transaction;\nreceiving on behalf of the user a request for allocation of advertising space for a number of allocated points; and\nallocating the advertising space to the user wherein the allocated points of the user is reduced by the number of allocated points.\n11. The method of claim 10 wherein the transaction is an auction.\n12. The method of claim 11 wherein the participation is listing of an item to be auctioned.\n13. The method of claim 11 wherein the participation is placing a bid on an item.\n14. The method of claim 11 wherein the participation is purchasing the item.\n15. The method of claim 10 wherein the participation is providing a web page through which a person selects another web page.\n16. The method of claim 10 wherein the request for allocation is placing a bid specifying the number of allocated points for the advertising space.\n17. The method of claim 10 wherein the request includes an indication of demographics of persons to whom the advertising space is to be displayed.\n18. The method of claim 10 wherein the request includes an indication of time constraints for the requested advertising space.\n19. The method of claim 10 wherein the request includes an indication of a category of items with which the allocated advertising space is to be associated.\n20. The method of claim 10 wherein the request for allocation is derived from a software component that identifies an advertising strategy for the user.\n21. The method of claim 20 wherein the advertising strategy is based at least in part on access patterns of users to categories with which advertising space is associated.\n22. The method of claim 20 wherein the advertising strategy is based on at least in part similarity of an item being advertised to a category with which the advertising space is associated.\n23. The method of claim 20 wherein the advertising strategy is based on at least in part on whether an item being advertised competes with an item associated with the advertising space.\n24. A method in a computer system for selecting an advertisement to present to a user, the method comprising:\nidentifying an advertisement for an item to be presented to the user;\nwhen an advertisement for a related item has previously been presented to the user, analyzing activity of the user associated with the advertisement for the related item; and\nwhen the analysis indicates that the user may not be interested in the item of the identified advertisement, identifying an advertisement for another item.\n25. The method of claim 24 wherein the related item is the same item.\n26. The method of claim 24 wherein the analysis indicates that the user may not be interested in the item of the selected advertisement, when the user did not act on advertisements for related items a certain number of times.\n27. A method in a computer system for selecting an advertisement to present to a user, the method comprising:\nanalyzing activity of the user associated with advertisements for items that were previously presented to the user; and\nwhen the analysis indicates that the user may be interested in a certain item, identifying an advertisement for a related item.\n28. The method of claim 27 wherein the analysis indicates that the user may be interested in a certain item, when the user selects a link provided by the advertisement.\n29. The method of claim 27 wherein the analysis indicates that the user may be interested in a certain item, when the user purchases the item.\n30. The method of claim 27 wherein the related item is the same item in which the user may be interested.",
    "status": "Abandoned",
    "citations_own": [
        "US5794210A",
        "US5974398A",
        "US6178408B1",
        "US6249768B1",
        "US6269361B1",
        "US6285987B1",
        "US6324519B1",
        "US6339438B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20010052000A1",
        "US20020111898A1",
        "US20020194215A1",
        "US20030229531A1",
        "US20040015397A1",
        "US20040143667A1",
        "US20040162757A1",
        "US20040199397A1",
        "US20050021440A1",
        "US20050027619A1",
        "US20050097204A1",
        "US20050137939A1",
        "US20050144067A1",
        "US20050144064A1",
        "US20050144068A1",
        "US20050283420A1",
        "US20060004628A1",
        "US20060015399A1",
        "US20060095281A1",
        "US20060149625A1",
        "US20060184453A1",
        "US20060242016A1",
        "US20070022005A1",
        "US20070112630A1",
        "US20070118432A1",
        "US20070118590A1",
        "US20070143266A1",
        "US20070156757A1",
        "US20070162379A1",
        "US20070179853A1",
        "US20070179847A1",
        "US20070179849A1",
        "US20070179879A1",
        "US7299195B1",
        "WO2007134125A2",
        "US20070300152A1",
        "US7340428B1",
        "US20080109391A1",
        "US20080114651A1",
        "US20080140491A1",
        "US20080154718A1",
        "US20080162282A1",
        "US20080162329A1",
        "US20080208662A1",
        "US20080221982A1",
        "US20080301689A1",
        "US20080301027A1",
        "US20080301026A1",
        "US20080300947A1",
        "US20080301030A1",
        "US20080300949A1",
        "US20080301029A1",
        "US20080300891A1",
        "US20080301024A1",
        "US20080301031A1",
        "US20080301688A1",
        "US20080300948A1",
        "US20080301025A1",
        "US20080300942A1",
        "US20080301028A1",
        "US20080313164A1",
        "US20090011740A1",
        "US20090048977A1",
        "US20090077115A1",
        "US20090083417A1",
        "US20090125321A1",
        "US20090125462A1",
        "US20090157834A1",
        "US20090189930A1",
        "US20090259552A1",
        "US20090259533A1",
        "US20090265622A1",
        "US20090307079A1",
        "US20090313126A1",
        "US20090319329A1",
        "US7668748B1",
        "US20100145803A1",
        "WO2010002594A3",
        "US20100211960A1",
        "US20100257054A1",
        "US7818207B1",
        "US7844493B1",
        "US20110029666A1",
        "US20110040617A1",
        "US7912777B2",
        "US20110093783A1",
        "US20110125573A1",
        "US20110145062A1",
        "US20110173126A1",
        "US8024323B1",
        "US20120109756A1",
        "US8224689B1",
        "US20120265618A1",
        "US20120316954A1",
        "US20120323701A1",
        "US20130006730A1",
        "US20140006135A1",
        "US20140074640A1",
        "US20140089969A1",
        "US8831987B2",
        "US20140257980A1",
        "JP2015005024A",
        "US20150213510A1",
        "JP2015179530A",
        "US9386349B2",
        "US9398340B2",
        "US9514479B2",
        "US9612995B2",
        "US20170154362A1",
        "US20170212957A1",
        "US9807239B1",
        "US20170358000A1",
        "US9872075B2",
        "US9883208B2",
        "US9892430B1",
        "US10475082B2",
        "US10567975B2",
        "US10607248B2",
        "US11037228B1",
        "US11120479B2",
        "US11270346B2",
        "US11288699B2",
        "US11449902B1",
        "US11488191B2"
    ],
    "citedby_ftf": [
        "JP2001291003A",
        "GB2525758A",
        "US20120253964A1",
        "US10176484B2",
        "US9947029B2",
        "US10832313B2",
        "US9552565B2",
        "US9721226B2",
        "US20150206177A1",
        "US10417659B1",
        "US20160071167A1",
        "US10528986B2",
        "US10892968B2",
        "US10277650B1"
    ]
}