{
    "patent_id": "US-10872186-B2",
    "title": "Tool to create a reconfigurable interconnect framework ",
    "assignee": "Stmicroelectronics S.R.L., Stmicroelectronics International N.V.",
    "publication_date": "2020-12-22",
    "patent_link": "https://patents.google.com/patent/US10872186B2/en",
    "inventors": [
        "Thomas Boesch",
        "Giuseppe Desoli"
    ],
    "classifications": [
        "G06F30/327",
        "G06N3/063",
        "G06F30/34",
        "G06N20/00",
        "G06N20/10",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/084",
        "G06T1/20",
        "G06F13/4022",
        "G06F15/7817",
        "G06F2115/08",
        "G06F9/44505",
        "G06N3/04",
        "G06N3/044",
        "G06N3/0445",
        "G06N3/047",
        "G06N3/0472",
        "G06N3/08",
        "G06N7/005",
        "G06N7/01"
    ],
    "abstract": "Embodiments are directed towards a method to create a reconfigurable interconnect framework in an integrated circuit. The method includes accessing a configuration template directed toward the reconfigurable interconnect framework, editing parameters of the configuration template, functionally combining the configuration template with a plurality of modules from an IP library to produce a register transfer level (RTL) circuit model, generating at least one automated test-bench function, and generating at least one logic synthesis script. Editing parameters of the configuration template includes confirming a first number of output ports of a reconfigurable stream switch and confirming a second number of input ports of the reconfigurable stream switch. Each output port and each input port has a respective architectural composition. The output port architectural composition is defined by a plurality of N data paths including A data outputs and B control outputs. The input port architectural composition is defined by a plurality of M data paths including A data inputs and B control inputs.",
    "claims": "\n1. A system, comprising:\na computing server;\na database communicatively coupled to the computing server; and\nat least one memory communicatively coupled to the computing server, the at least one memory storing a user-editable configuration template, the configuration template defining parameters including:\na first number of reconfigurable stream switch output ports, each output port having an output port architectural composition, wherein the output port architectural composition is defined by a plurality of N data paths, the plurality of N data paths including A data outputs and B control outputs, wherein N, A, and B are non-zero integers; and\na second number of reconfigurable stream switch input ports, each input port having an input port architectural composition, wherein the input port architectural composition is defined by a plurality of M data paths, the plurality of M data paths including A data inputs and B control inputs, wherein the computing server, in operation, generates a register transfer level (RTL) circuit model including a model of a reconfigurable interconnect framework based on the stored user-editable configuration template.\n2. The system of claim 1 wherein the computing server, in operation:\nsimulates circuitry based on the RTL circuit model.\n3. The system of claim 1 wherein the computing server, in operation:\ncombines the user-edited configuration template with a plurality of modules from a logic block (IP) library to produce the RTL circuit model.\n4. The system of claim 3, comprising:\nintegrated circuit fabrication machinery coupled to the computing server, wherein the integrated circuit fabrication machinery, in operation, fabricates a reconfigurable interconnect framework based on the RTL circuit model.\n5. The system of claim 3 wherein the user-editable configuration template defines parameters of an accelerator framework and the RTL circuit model includes a model of an accelerator framework based on the stored user-editable configuration template.\n6. The system of claim 5 wherein the accelerator framework is a kernel accelerator framework.\n7. The system of claim 5 wherein the accelerator framework is a pre-processing accelerator framework.\n8. The system of claim 5 wherein the accelerator framework is a neural accelerator framework.\n9. The system of claim 5 wherein the accelerator framework is a convolutional accelerator framework.\n10. The system of claim 1 wherein the RTL circuit model is a model of a system on a chip (SoC) including the reconfigurable interconnect framework model.\n11. The system of claim 10 wherein the SoC model includes a model of smartphone circuitry.\n12. A method, comprising:\naccessing, using processing circuitry, a configuration template of a reconfigurable interconnect framework;\nediting, using the processing circuitry, parameters of the configuration template, the editing including:\nsetting a first number of output ports of a reconfigurable stream switch, each output port having an output port architectural composition, wherein the output port architectural composition is defined by a plurality of N data paths, the plurality of N data paths including A data outputs and B control outputs, wherein N, A, and B are non-zero integers; and\nsetting a second number of input ports of the reconfigurable stream switch, each input port having an input port architectural composition, wherein the input port architectural composition is defined by a plurality of M data paths, the plurality of M data paths including A data inputs and B control inputs; and\nfunctionally combining, using the processing circuitry, the configuration template with a plurality of modules from a logic block (IP) library to produce a register transfer level (RTL) circuit model including a model of a reconfigurable interconnect framework.\n13. The method of claim 12 wherein the configuration template defines parameters of an accelerator framework, the editing includes setting the parameters of the accelerator framework, and the RTL circuit model includes a model of an accelerator framework.\n14. The method of claim 12 wherein the accelerator framework includes one or more of a kernel accelerator framework, a pre-processing accelerator framework, a neural accelerator framework or a convolutional accelerator framework.\n15. The method of claim 12 wherein editing parameters of the configuration template comprises:\nsetting a number of external device interfaces; and\nsetting a communication protocol for at least some of the selected number of external device interfaces.\n16. The method of claim 12 wherein editing parameters of the configuration template comprises:\nsetting a number of processing modules; and\nsetting operational parameter of at least some of the number of processing modules.\n17. The method of claim 12, comprising:\nperforming at least one automated test-bench function on the RTL circuit model.\n18. The method of claim 13, comprising:\nfabricating an integrated circuit including a reconfigurable interconnect framework and an accelerator framework based on the RTL circuit model.\n19. A non-transitory computer-readable medium storing computer-executable instructions, which when executed by one or more processing devices cause the one or more processing devices to perform a method, the method comprising:\naccessing a configuration template of a reconfigurable interconnect framework;\nediting parameters of the configuration template, the editing including:\nsetting a first number of output ports of a reconfigurable stream switch, each output port having an output port architectural composition, wherein the output port architectural composition is defined by a plurality of N data paths, the plurality of N data paths including A data outputs and B control outputs, wherein N, A, and B are non-zero integers; and\nsetting a second number of input ports of the reconfigurable stream switch, each input port having an input port architectural composition, wherein the input port architectural composition is defined by a plurality of M data paths, the plurality of M data paths including A data inputs and B control inputs; and\nfunctionally combining, using the processing circuitry, the configuration template with a plurality of modules from a logic block (IP) library to produce a register transfer level (RTL) circuit model including a model of a reconfigurable interconnect framework.\n20. The non-transitory computer-readable medium of claim 19 wherein the configuration template defines parameters of an accelerator framework, the editing includes setting the parameters of the accelerator framework, and the RTL circuit model includes a model of an accelerator framework.\n21. The non-transitory computer-readable medium of claim 20 wherein the method comprises:\nfabricating an integrated circuit including a reconfigurable interconnect framework and an accelerator framework based on the RTL circuit model.\n22. The system of claim 1 wherein the parameters of the configuration template include stream link configuration parameters, which define a reconfigurable stream switch output port associated with a stream link and one or more reconfigurable stream switch input ports associated with the stream link.\n23. The system of claim 22 wherein the stream link configuration parameters associated with the stream link define a number of communication paths of the stream link and a direction of each communication path.\n24. The method of claim 12 wherein the parameters of the configuration template include stream link configuration parameters, which define a reconfigurable stream switch output port associated with a stream link and one or more reconfigurable stream switch input ports associated with the stream link.\n25. The method of claim 24 wherein the stream link configuration parameters associated with the stream link define a number of communication paths of the stream link and a direction of each communication path.",
    "status": "Active",
    "citations_own": [
        "US5189665A",
        "WO1996002895A1",
        "US5506815A",
        "US6011779A",
        "EP1087533A1",
        "US20020145779A1",
        "US6668290B1",
        "US20040158623A1",
        "US20050138582A1",
        "US20050183055A1",
        "US20100005238A1",
        "US20100061726A1",
        "US20100077079A1",
        "US7737994B1",
        "US7840403B2",
        "US20110029471A1",
        "US20120287344A1",
        "US20120303932A1",
        "US20130156278A1",
        "US9020276B2",
        "US20150170021A1",
        "US20150261702A1",
        "US9294097B1",
        "US20160092484A1",
        "US20160148004A1",
        "US20160179434A1",
        "US20160217101A1",
        "US9436637B2",
        "US20160379115A1",
        "US20160379109A1",
        "US20170011006A1",
        "US20170262407A1",
        "US20180121796A1",
        "US20180189641A1",
        "WO2018120019A1",
        "US20180189231A1",
        "US20180189981A1",
        "US20180336468A1",
        "CN109255429A",
        "WO2019045883A1",
        "WO2019093234A1",
        "US20190266485A1",
        "US20190266784A1",
        "US20190266479A1",
        "US20190340488A1"
    ],
    "citations_ftf": [
        "US5768613A",
        "US5794062A",
        "US5996058A",
        "US7310319B2",
        "US7782873B2",
        "CN101578590A",
        "EP1864682A1",
        "JP4934356B2",
        "US8131659B2",
        "US8082426B2",
        "CN101739241A",
        "US11163984B2",
        "US8860682B1",
        "WO2014209347A1",
        "US9727113B2",
        "US9442869B2",
        "US9652390B2",
        "US9854221B2",
        "CN104615488B",
        "CN109144688B",
        "US10116557B2",
        "US11074492B2",
        "US10664751B2",
        "JP6700712B2",
        "CN105892989B",
        "EP3265907B1",
        "CN107341547B",
        "US10546211B2",
        "US11334768B1",
        "CN106228240B",
        "US10891538B2",
        "US10528864B2",
        "CN107239823A",
        "US10128971B2",
        "US11003985B2",
        "KR20180060149A",
        "US10417560B2",
        "US10438115B2",
        "IT201600122898A1",
        "US10394929B2",
        "US10416999B2",
        "US10482155B2",
        "EP3563304B1",
        "US10586148B2",
        "CN207517054U",
        "KR102592721B1",
        "CN108304922B",
        "KR102457463B1",
        "CN106951961B",
        "US10295751B2",
        "US20180336469A1",
        "CN111373751B",
        "US11265540B2",
        "EP3735658A1",
        "US10674152B2",
        "US11025907B2",
        "US11803507B2",
        "US11388416B2",
        "US11729406B2",
        "US10909728B1",
        "US11514136B2",
        "CN114390296A",
        "KR102287947B1",
        "US11599367B2",
        "US11604975B2",
        "US11488021B2",
        "IT202000018043A1"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US10417364B2",
        "CN207517054U",
        "TWI638553B",
        "TWI607389B",
        "US10699189B2",
        "US11354577B2",
        "EP3596660A1",
        "US10475174B2",
        "US10614357B2",
        "WO2018193377A1",
        "US10795836B2",
        "US11488004B2",
        "WO2018194270A1",
        "US11164071B2",
        "CN107679621B",
        "US11797837B2",
        "WO2018195848A1",
        "US11429861B1",
        "US10796141B1",
        "US10582250B2",
        "CN111149166A",
        "US10474610B1",
        "US10949328B2",
        "CN108228696B",
        "JP7065877B2",
        "US10860618B2",
        "US20190045361A1",
        "GB2568081B",
        "US11528400B2",
        "US11521046B2",
        "US11227214B2",
        "US10725789B2",
        "US10579908B2",
        "US11645059B2",
        "US10572250B2",
        "US20190205736A1",
        "EP3514733A1",
        "US10997180B2",
        "US20190244080A1",
        "US11769042B2",
        "US11164074B2",
        "US11586907B2",
        "US10977854B2",
        "US11687762B2",
        "CN108446096B",
        "US11783167B1",
        "US11568227B1",
        "US11468145B1",
        "US11586910B1",
        "US11501138B1",
        "US10956785B2",
        "US11252429B2",
        "US11783174B2",
        "US20190385046A1",
        "US11481637B2",
        "US20190392287A1",
        "EP3598315B1",
        "US11429850B2",
        "US10380997B1",
        "US11775799B2",
        "CN110858323A",
        "WO2020044152A1",
        "US11321087B2",
        "US11328208B2",
        "EP3617947A1",
        "US11367498B2",
        "CN109359732B",
        "RU2704751C1",
        "CN109376843B",
        "CN109308689B",
        "US11443165B2",
        "US11769041B2",
        "US11503310B2",
        "US10936585B1",
        "US11354888B2",
        "KR102107077B1",
        "US10657617B1",
        "US11604973B1",
        "CN109583507B",
        "CN109740731B",
        "CN111338974A",
        "CN111353575A",
        "CN111191788A",
        "US11315344B2",
        "US11501134B2",
        "US11321819B2",
        "CN109858621B",
        "CN109784483B",
        "US20200250517A1",
        "WO2020160653A1",
        "US10747516B1",
        "CN113396425B",
        "US10929058B2",
        "US11354573B2",
        "US11783176B2",
        "CN110046704B",
        "US11671111B2",
        "US11211944B2",
        "CN110084363B",
        "US11663485B2",
        "US11625585B1",
        "US11132569B2",
        "US11610142B2",
        "KR102260882B1",
        "US11210199B2",
        "US11687789B2",
        "US11551147B2",
        "US11551118B2",
        "TWI719512B",
        "CN110727634B",
        "CN112286578A",
        "CN110446173B",
        "EP3987394A1",
        "CN110751280A",
        "CN110718211B",
        "KR20210037569A",
        "US11443243B2",
        "US11709712B2",
        "US11775347B2",
        "US11537689B2",
        "US11645116B2",
        "US11645586B2",
        "US11740940B2",
        "US11113782B2",
        "CN110782012A",
        "US11475283B2",
        "US20230071424A1",
        "US11513799B2",
        "US11507702B2",
        "WO2021091401A1",
        "CN110956122B",
        "US11070829B2",
        "KR20210079785A",
        "CN111158790B",
        "CN111240743B",
        "US11687778B2",
        "CN111259785B",
        "CN113222126B",
        "US20210241806A1",
        "US11593609B2",
        "US11323391B1",
        "US10706857B1",
        "US11614923B2",
        "US11574100B2",
        "US11531873B2",
        "CN112152947B",
        "US20220066776A1",
        "CN112200301A",
        "US20220092382A1",
        "CN112162942B",
        "US20220101086A1",
        "CN112261308A",
        "CN112308000B",
        "KR20220090104A",
        "US11785068B2",
        "US11698870B2",
        "CN112732637B",
        "US11650995B2",
        "WO2022183068A1",
        "CN112948293A",
        "CN112968968B",
        "US20220383732A1",
        "US11687487B1",
        "CN113269316B",
        "US11675722B2",
        "US11663219B1",
        "US20230053530A1",
        "US20230090429A1",
        "CN114398693B",
        "CN114821478B",
        "CN116596043B"
    ]
}