{
    "patent_id": "US-11373748-B2",
    "title": "System, method and article for controlling the dispensing of insulin ",
    "assignee": "Dexcom, Inc.",
    "publication_date": "2022-06-28",
    "patent_link": "https://patents.google.com/patent/US11373748B2/en",
    "inventors": [
        "Robert C. Kircher, Jr.",
        "Richard S. Mauseth",
        "Jason N. Bishop",
        "Donald P. Matheson",
        "Suray Bhatia",
        "Jeff A. Bilmes"
    ],
    "classifications": [
        "G16H20/17",
        "A61B5/14532",
        "A61M5/1723",
        "G06N5/048",
        "G16H20/10",
        "G16H20/13",
        "G16H50/50",
        "A61M2230/005",
        "A61M2230/201"
    ],
    "abstract": "An integrated circuit includes circuitry to control a process. The process includes adjusting fuzzy-logic control parameters based on received and retrieved blood glucose-related data, predicting blood glucose levels based on the received blood-glucose-related data, and generating control signals to control dispensing of insulin based on the received blood glucose-related data and the fuzzy-logic control parameters. The process may include predicting blood glucose levels based on the retrieved blood glucose-related data. The process may include transitioning between a post-meal correction protocol and a fasting protocol. The process may include transitioning from a post-meal correction protocol to a fasting protocol when a fasting criteria is satisfied.",
    "claims": "\n1. An integrated circuit including circuitry to control a process, the process comprising:\nadjusting fuzzy-logic control parameters based on blood-glucose-related data;\npredicting blood glucose levels based on the blood-glucose-related data; and\ngenerating control signals to control dispensing of insulin based on the blood glucose-related data and the fuzzy-logic control parameters.\n2. The integrated circuit of claim 1 wherein the process comprises predicting blood glucose levels based on the blood-glucose-related data.\n3. The integrated circuit of claim 1 wherein the process comprises selectively transitioning between a post-meal correction protocol and a fasting protocol.\n4. The integrated circuit of claim 1 wherein the process comprises transitioning from a post-meal correction protocol to a fasting protocol when a fasting criteria is satisfied.\n5. The integrated circuit of claim 1 wherein the process comprises transitioning from a fasting protocol to a post-meal correction protocol when a prandial event is detected.\n6. The integrated circuit of claim 1 wherein the process comprises transitioning from a fasting protocol to a user-input protocol when a prandial event is detected.\n7. The integrated circuit of claim 1 wherein the fuzzy-logic control parameters comprise fuzzy-logic multipliers.\n8. The integrated circuit of claim 1 wherein the predicting blood glucose levels comprises predicting a subsequent blood glucose level based on a previously predicted blood glucose level.\n9. The integrated circuit of claim 1 wherein the process comprises implementing at least one of a neural network and a dynamic Bayesian network.\n10. The integrated circuit of claim 1 wherein the circuitry comprises a memory storing instructions, and the integrated circuit, in operation, executes the instructions."
}