{
    "patent_id": "US-11757185-B2",
    "title": "Cellular system ",
    "assignee": "Bao Tran, Ha Tran",
    "publication_date": "2023-09-12",
    "patent_link": "https://patents.google.com/patent/US11757185B2/en",
    "inventors": [
        "Bao Tran",
        "Ha Tran"
    ],
    "classifications": [
        "H04B17/318",
        "H01Q3/46",
        "F21S8/086",
        "F21V23/045",
        "G06N20/10",
        "G06N3/04",
        "G06N3/045",
        "G06N3/08",
        "G06N3/088",
        "G10L25/51",
        "H01Q1/04",
        "H01Q1/246",
        "H01Q1/44",
        "H01Q19/09",
        "H01Q21/28",
        "H01Q3/20",
        "H01Q3/44",
        "H04B7/024",
        "H04B7/0617",
        "H04W16/28",
        "H04W4/027",
        "H04W4/40",
        "H04W4/44",
        "F21W2131/103",
        "G06V40/172",
        "G06V40/25",
        "H04B17/309",
        "H04L67/10",
        "H04L67/12",
        "H04W4/38",
        "H04W4/70"
    ],
    "abstract": "A system includes a distributed ledger storing one or more smart contracts; one or more 5G small cells, each having one or more antennas mounted on a housing, each small cell sending packets of data trackable with the distributed ledger; and a processor to control a directionality of the antennas in communication with a predetermined target using 5G protocols.",
    "claims": "\n1. A system, comprising:\na distributed ledger storing one or more smart contracts;\none or more 5G small cells, each having one or more antennas mounted on a housing, each small cell sending packets of data trackable with the distributed ledger; and\na processor to control communication with a predetermined target using 5G protocols, wherein the predetermined target communicates with one of the 5G small cells via a smart contract accessible through the distributed ledger and complies with one or more smart contract conditions before the predetermined target accesses the 5G network, wherein the distributed ledger stores immutable device data fingerprints and wireless devices store private keys in key-storage hardware and public keys in the blockchain, wherein hosts join the 5G network by asserting host locations from a positioning system or a predetermined source, wherein hosts stake host deposits and receive payment for data transport or Proof-of-Location services.\n2. The system of claim 1, wherein the processor calibrates a radio link between a transceiver in the housing and a client device.\n3. The system of claim 1, wherein the processor is coupled to fiber optics cable to communicate with a cloud-based radio access network (RAN) or a remote RAN.\n4. The system of claim 1, wherein the processor calibrates a connection by analyzing RSSI and TSSI and moves the antennas until predetermined cellular parameters are reached.\n5. The system of claim 1, comprising a smart contract provided by the predetermined target to access the 5G small cell.\n6. The system of claim 5, wherein the smart contract specifies predetermined rules and tokens to pay the small cell in exchange for network access.\n7. The system of claim 1, wherein the processor moves actuators coupled to the antennas.\n8. The system of claim 1, wherein the distributed ledger stores location data of the small cell and the predetermined target obtains the location of the small cell.\n9. The system of claim 1, comprising one or more Fresnel lenses to improve SNR.\n10. The system of claim 1, wherein processor focuses 5G signals to the target with iterative changes in orientations of the antennas by changing a curvature or a shape of the surface to meet predetermined criteria.\n11. The system of claim 1, comprising a neural network coupled to a control plane, a management plane, and a data plane to optimize 5G parameters.\n12. The system of claim 1, comprising one or more cameras and sensors in the housing to capture security information.\n13. The system of claim 1, wherein the housing is a drop in replacement for an existing housing to upgrade existing lights and add 5G or 6G active antennas.\n14. The system of claim 1, comprising a camera and a processor for individual identification stored on the blockchain.\n15. The system of claim 1, wherein the processor analyzes sound captured using a microphone to determine events in progress.\n16. The system of claim 1, comprising an edge learning machine in the housing to provide local edge processing for Internet-of-Things (IOT) sensors with reduced off-chip memory access.\n17. The system of claim 1, wherein the comprising an edge learning machine uses pre-trained models and modifies the pre-trained models for a selected task.\n18. The system of claim 1, comprising a smart contract for the predetermined target to access a learning machine.\n19. The system of claim 1, comprising a cloud trained neural network whose network parameters are down-sampled and filter count reduced before transferring to the edge neural network.\n20. A system, comprising:\na distributed ledger;\none or more 5G small cells, each having one or more antennas mounted on a housing, each small cell sending packets of data trackable with the distributed ledger; and\na processor to control communication with a predetermined target using 5G protocols, wherein the predetermined target accesses the 5G network after authenticating and making a payment for network usage by accessing the distributed ledger, wherein the distributed ledger stores immutable device data fingerprints and an immutable append-only list of transactions which achieves, wherein wireless devices store private keys in key-storage hardware and public keys in the blockchain, wherein hosts join the 5G network by asserting proven host locations, and staking a fee deposit, wherein hosts receive payment for data transport or Proof-of-Location services."
}