{
    "patent_id": "US-11580261-B2",
    "title": "Automated honeypot creation within a network ",
    "assignee": "Capital One Services, Llc",
    "publication_date": "2023-02-14",
    "patent_link": "https://patents.google.com/patent/US11580261B2/en",
    "inventors": [
        "Austin Walters",
        "Jeremy Goodsitt",
        "Vincent Pham",
        "Kate Key"
    ],
    "classifications": [
        "G06F9/541",
        "G06F11/3608",
        "G06F11/3628",
        "G06F11/3636",
        "G06F11/3684",
        "G06F11/3688",
        "G06F16/215",
        "G06F16/2237",
        "G06F16/2264",
        "G06F16/2423",
        "G06F16/24568",
        "G06F16/248",
        "G06F16/254",
        "G06F16/258",
        "G06F16/283",
        "G06F16/285",
        "G06F16/288",
        "G06F16/335",
        "G06F16/35",
        "G06F16/90332",
        "G06F16/90335",
        "G06F16/9038",
        "G06F16/906",
        "G06F16/93",
        "G06F17/15",
        "G06F17/16",
        "G06F17/18",
        "G06F18/2115",
        "G06F18/213",
        "G06F18/214",
        "G06F18/2148",
        "G06F18/217",
        "G06F18/2193",
        "G06F18/22",
        "G06F18/23",
        "G06F18/24",
        "G06F18/2411",
        "G06F18/2415",
        "G06F18/285",
        "G06F18/40",
        "G06F21/552",
        "G06F21/60",
        "G06F21/6245",
        "G06F21/6254",
        "G06F30/20",
        "G06F40/117",
        "G06F40/166",
        "G06F40/20",
        "G06F8/71",
        "G06F9/54",
        "G06F9/547",
        "G06K9/6215",
        "G06K9/6218",
        "G06K9/6227",
        "G06K9/6231",
        "G06K9/6232",
        "G06K9/6253",
        "G06K9/6256",
        "G06K9/6257",
        "G06K9/6262",
        "G06K9/6265",
        "G06K9/6267",
        "G06K9/6269",
        "G06K9/6277",
        "G06N20/00",
        "G06N20/10",
        "G06N20/20",
        "G06N3/04",
        "G06N3/044",
        "G06N3/0445",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/047",
        "G06N3/06",
        "G06N3/08",
        "G06N3/084",
        "G06N3/088",
        "G06N5/00",
        "G06N5/01",
        "G06N5/02",
        "G06N5/022",
        "G06N5/04",
        "G06N7/00",
        "G06N7/005",
        "G06N7/01",
        "G06Q10/04",
        "G06T11/001",
        "G06T7/194",
        "G06T7/246",
        "G06T7/248",
        "G06T7/254",
        "G06V10/768",
        "G06V10/993",
        "G06V30/194",
        "G06V30/1985",
        "H04L63/1416",
        "H04L63/1491",
        "H04L67/306",
        "H04L67/34",
        "G06T2207/10016",
        "G06T2207/10024",
        "G06T2207/20081",
        "G06T2207/20084",
        "H04N21/23412",
        "H04N21/8153"
    ],
    "abstract": "Systems and methods for managing Application Programming Interfaces (APIs) are disclosed. Systems may involve automatically generating a honeypot. For example, the system may include one or more memory units storing instructions and one or more processors configured to execute the instructions to perform operations. The operations may include receiving, from a client device, a call to an API node and classifying the call as unauthorized. The operation may include sending the call to a node-imitating model associated with the API node and receiving, from the node-imitating model, synthetic node output data. The operations may include sending a notification based on the synthetic node output data to the client device.",
    "claims": "\n1. A system comprising:\none or more memory units storing instructions; and\none or more processors that execute the instructions to perform operations comprising:\npredicting, based on call data of a call associated with a first API version, a routing path for (i) the call and (ii) one or more outputs to be derived from the call, the routing path comprising a first API node and a second API node after the first API node on the routing path;\ntranslating the call into a translated call for the first API node based on (i) the routing path indicating the call to be directed to the first API node and (ii) the first API node being associated with a second API version different from the first API version;\nobtaining, based on a processing of the translated call by the first API node, a node output indicated by the routing path as being directed to the second API node;\ncomparing the node output to an expected node output to determine whether the node output is in accordance with an API version associated with the second API node and whether the node output will cause one or more errors at the second API node; and\ntransmitting the node output to the second API node, without translating the node output for the API version associated with the second API node, in response to (i) the comparison indicating that the node output is not in accordance with the API version associated with the second API node and (ii) the comparison indicating that the node output will not cause one or more errors of a set of errors at the second API node.\n2. The system of claim 1, wherein translating the call further comprises:\nselecting, based on the call data of the call associated with the first API version and the routing path, a translation model to translate the call; and\nusing the translation model to translate the call.\n3. The system of claim 2, wherein selecting the translation model further comprises:\ndetermining, based on an API identifier included in the call data of the call associated with the first API version, the API version of the call;\ndetermining, based on the routing path, the API version of the first API node; and\nselecting, based on (i) the API version of the call and (ii) the API version of the first API node, the translation model to translate the call.\n4. The system of claim 1, wherein the operations further comprise:\nproviding training information to a translation model, the training information comprising (i) the call data, (ii) the translated call, (iii) the first API version, (iv) the second API version, (v) the routing path data, and (vi) the comparison; and\ntraining the translation model based on the provided information.\n5. The system of claim 4, wherein the operations further comprise:\npredicting, based on second call data of a second call associated with a third API version, a second routing path for the second call, wherein the second routing path comprises a third API node after the second API node;\nproviding, the second call data and the second routing path, to the translation model to determine whether the second call is in accordance with the API version of the third API node and whether the second call will cause one or more errors at the third API node; and\ntransmitting the second call to the third API node, without translating the second call, in response to (i) the determination indicating that the second call is not in accordance with the API version associated with the third API node and (ii) the determination indicating that the second call will not cause one or more errors of the set of errors at the third API node.\n6. A method, comprising:\ntranslating a call associated with a first API version into a translated call for a first API node based on the first API node being associated with a second API version different from the first API version;\nobtaining, based on a processing of the translated call by the first API node, a node output directed to a second API node;\ndetermining whether the node output is in accordance with an API version associated with the second API node and whether the node output will cause one or more errors at the second API node; and\ntransmitting the node output to the second API node in response to a determination that the node output will not cause one or more errors at the second API node, despite a determination that the node output is not in accordance with the API version associated with the second API node.\n7. The method of claim 6, wherein translating the call further comprises:\nselecting, based on call data of the call associated with the first API version and the second API version of the first API node, a translation model to translate the call; and\nusing the translation model to translate the call.\n8. The method of claim 7, wherein selecting the translation model further comprises:\ndetermining, based on an API identifier included in the call data of the call, the first API version;\ndetermining, based on the call data of the call, the second API version of the first API node; and\nselecting, based on (i) the first API version of the call and (ii) the API version of the first API node, the translation model to translate the call.\n9. The method of claim 7, wherein the translation model comprises a machine learning model.\n10. The method of claim 6, further comprising:\nproviding training information to a translation model, the training information comprising (i) call data of the call associated with the first API version, (ii) the translated call, (iii) the first API version, (iv) the second API version, (v) the determination of whether the node output is in accordance with the API version associated with the second API node, and (vi) the determination of whether the node output will cause one or more errors at the second API node; and\ntraining the translation model based on the provided information.\n11. The method of claim 10, further comprising:\nobtaining second call data of a second call associated with a third API version, the second call being directed to a third API node;\nproviding the second call data to the translation model to determine whether the second call is in accordance with the API version of the third API node and whether the second call will cause one or more errors at the third API node; and\ntransmitting the second call to the third API node, without translating the second call, in response to (i) the determination indicating that the second call is not in accordance with the API version associated with the third API node, and (ii) the determination indicating that the second call will not cause one or more errors at the third API node.\n12. The method of claim 11, further comprising:\nin response to (i) the determination indicating that the second call is not in accordance with the API version associated with the third API node, and (ii) the determination indicating that the second call will cause one or more errors at the third API node:\nproviding second training information to the translation model, the second training information comprising (i) the second call data of the second call, (ii) the third API version, (iii) the API version of the third API node, (iv) and the determination indicating that the second call is not in accordance with the API version associated with the third API node, and (v) the determination indicating that the second call will cause one or more errors at the third API node; and\ntraining the translation model based on the second training information.\n13. The method of claim 6, wherein determining whether the node output is in accordance with an API version associated with the second API node is based on a test criterion, the test criterion comprising a percent match between a schema of the node output and an expected schema of the API version of the second API node.\n14. A non-transitory computer readable media comprising instructions that, when executed by one or more processors, cause operations comprising:\ntranslating a call associated with a first API version into a translated call for a first API node based on the first API node being associated with a second API version different from the first API version;\nobtaining, based on a processing of the translated call by the first API node, a node output directed to a second API node;\ndetermining whether the node output is in accordance with an API version associated with the second API node and whether the node output will cause one or more errors at the second API node; and\ntransmitting the node output to the second API node in response to a determination that the node output will not cause one or more errors at the second API node, despite a determination that the node output is not in accordance with the API version associated with the second API node.\n15. The non-transitory computer readable media of claim 14, wherein translating the call further comprises:\nselecting, based on call data of the call associated with the first API version and the second API version of the first API node, a translation model to translate the call; and\nusing the translation model to translate the call.\n16. The non-transitory computer readable media of claim 15, wherein selecting the translation model further comprises:\ndetermining, based on an API identifier included in the call data of the call, the first API version;\ndetermining, based on the call data of the call, the second API version of the first API node; and\nselecting, based on (i) the first API version of the call and (ii) the API version of the first API node, the translation model to translate the call.\n17. The non-transitory computer readable media of claim 15, wherein the translation model comprises a machine learning model.\n18. The non-transitory computer readable media of claim 14, further causing operations comprising:\nproviding training information to a translation model, the training information comprising (i) call data of the call associated with the first API version, (ii) the translated call, (iii) the first API version, (iv) the second API version, (v) the determination of whether the node output is in accordance with the API version associated with the second API node, and (vi) the determination of whether the node output will cause one or more errors at the second API node; and\ntraining the translation model based on the provided information.\n19. The non-transitory computer readable media of claim 18, further causing operations comprising:\nobtaining second call data of a second call associated with a third API version, the second call being directed to a third API node;\nproviding the second call data to the translation model to determine whether the second call is in accordance with the API version of the third API node and whether the second call will cause one or more errors at the third API node; and\ntransmitting the second call to the third API node, without translating the second call, in response to (i) the determination indicating that the second call is not in accordance with the API version associated with the third API node, and (ii) the determination indicating that the second call will not cause one or more errors at the third API node.\n20. The non-transitory computer readable media of claim 19, further causing operations comprising:\nin response to (i) the determination indicating that the second call is not in accordance with the API version associated with the third API node, and (ii) the determination indicating that the second call will cause one or more errors at the third API node:\nproviding second training information to the translation model, the second training information comprising (i) the second call data of the second call, (ii) the third API version, (iii) the API version of the third API node, (iv) and the determination indicating that the second call is not in accordance with the API version associated with the third API node, and (v) the determination indicating that the second call will cause one or more errors at the third API node; and\ntraining the translation model based on the second training information.",
    "status": "Active",
    "citations_own": [
        "US5974549A",
        "US20070169017A1",
        "US20080141374A1",
        "US20090055331A1",
        "US20100251340A1",
        "US20120174224A1",
        "US20130246944A1",
        "US8782744B1",
        "US20150220734A1",
        "US9171146B2",
        "US20150350234A1",
        "US20160057107A1",
        "US9274935B1",
        "US20160162688A1",
        "US20160308900A1",
        "US20170331858A1",
        "US9912698B1",
        "US20180115523A1",
        "US20180262529A1",
        "US10200401B1",
        "US20200167686A1"
    ],
    "citations_ftf": [
        "US1028290A",
        "US1021242A",
        "US1012296A",
        "JP3420621B2",
        "US5911139A",
        "US5832212A",
        "DE19703965C1",
        "US7117188B2",
        "US6269351B1",
        "US6137912A",
        "US6922699B2",
        "US7630986B1",
        "US20020103793A1",
        "US6920458B1",
        "US20030003861A1",
        "US20090055477A1",
        "JP2003256443A",
        "US20040059695A1",
        "WO2004061702A1",
        "US20040172637A1",
        "US20080288889A1",
        "US20060031622A1",
        "GB0428191D0",
        "JP4591148B2",
        "US7752233B2",
        "US7774288B2",
        "US8392418B2",
        "US20080168339A1",
        "EP2111593A2",
        "US20080270363A1",
        "US20090305790A1",
        "JP2009111691A",
        "US20090158302A1",
        "US8781989B2",
        "US9305180B2",
        "US8375014B1",
        "KR100915832B1",
        "US20100036884A1",
        "US8112414B2",
        "KR101789608B1",
        "JP5222205B2",
        "JP5621773B2",
        "US8554801B2",
        "WO2011042889A1",
        "US7996723B2",
        "US8438122B1",
        "US8820088B2",
        "EP2434411A1",
        "US9436502B2",
        "JP5608575B2",
        "CA2829569C",
        "US8533224B2",
        "US20130015931A1",
        "US20130097103A1",
        "US8914859B2",
        "US8897542B2",
        "US9367814B1",
        "US20130167192A1",
        "US9542536B2",
        "US11282287B2",
        "US9311283B2",
        "US9165328B2",
        "EP2701020A1",
        "US9461876B2",
        "US9916538B2",
        "US20180173730A1",
        "JP6029683B2",
        "JP5971115B2",
        "WO2014110167A2",
        "US9311359B2",
        "US11074495B2",
        "EP2967322A4",
        "US20140278339A1",
        "US10514977B2",
        "US9191411B2",
        "US20140310208A1",
        "US20140324760A1",
        "US9658899B2",
        "US10102581B2",
        "US9716842B1",
        "US10120838B2",
        "US9600503B2",
        "US9740662B2",
        "US9465857B1",
        "US20150100537A1",
        "US20150134413A1",
        "CN103559504B",
        "US20150128103A1",
        "US9830376B2",
        "JP6149710B2",
        "US9531609B2",
        "US20150309987A1",
        "US9521122B2",
        "WO2015172374A1",
        "US10496927B2",
        "US10528872B2",
        "US10445341B2",
        "US10318882B2",
        "US11640498B2",
        "US9785719B2",
        "US11122058B2",
        "US9549188B2",
        "US10452793B2",
        "US9954893B1",
        "EP3197384A4",
        "US10210246B2",
        "US10296192B2",
        "US9672248B2",
        "US20160110657A1",
        "US20160110810A1",
        "US9560075B2",
        "US9886247B2",
        "US20160132787A1",
        "US9607217B2",
        "US9678999B1",
        "US9544301B2",
        "WO2016122591A1",
        "US9608810B1",
        "US20160232575A1",
        "US20160259841A1",
        "CN107924384A",
        "GB201604672D0",
        "US9462013B1",
        "JP6511951B2",
        "US10163061B2",
        "US10452522B1",
        "US9946705B2",
        "US11567962B2",
        "US10750161B2",
        "US10628521B2",
        "JP2017041022A",
        "US10536449B2",
        "US9953176B2",
        "US20180253894A1",
        "US20170134405A1",
        "JP2019507444A",
        "US9934397B2",
        "US10740335B1",
        "US10031745B2",
        "US11769193B2",
        "JP6874757B2",
        "US10867421B2",
        "CN107292326A",
        "US10824629B2",
        "US10403043B2",
        "US10515101B2",
        "US11698990B2",
        "EP3869357A1",
        "US10532268B2",
        "US11295336B2",
        "US10778647B2",
        "US10572641B1",
        "US10733534B2",
        "MX2019000713A",
        "WO2018052587A1",
        "US11080616B2",
        "US20180100894A1",
        "CA2981555C",
        "US10043095B2",
        "JP2018067115A",
        "US10609284B2",
        "US11610148B2",
        "US10769721B2",
        "US10346223B1",
        "US10621210B2",
        "US9754190B1",
        "US20180150609A1",
        "US20180158052A1",
        "US10713384B2",
        "US11068949B2",
        "CN106650806B",
        "US10430661B2",
        "US10163003B2",
        "US10970605B2",
        "US11496286B2",
        "US10212428B2",
        "US10448054B2",
        "US10192016B2",
        "US10235622B2",
        "US10360517B2",
        "US10554607B2",
        "US20180247078A1",
        "EP3590244B1",
        "JP6931290B2",
        "US10733482B1",
        "US10891545B2",
        "US20180260474A1",
        "US11574164B2",
        "US10692000B2",
        "US20200311572A1",
        "EP4159871A1",
        "US11734584B2",
        "KR102309031B1",
        "US10541981B1",
        "US20180336463A1",
        "RU2652461C1",
        "IL252657A0",
        "US10348658B2",
        "CN107633317B",
        "KR101970008B1",
        "EP3646560A4",
        "CN109214238B",
        "US10565434B2",
        "US10182303B1",
        "US10929945B2",
        "US10599460B2",
        "US20190050600A1",
        "US10929987B2",
        "US20190228037A1",
        "GB2578700B",
        "GB2566257A",
        "US10225289B1",
        "EP3451190B1",
        "US20190080063A1",
        "US10949614B2",
        "US10380236B1",
        "EP3462412B1",
        "US10510358B1",
        "US11720813B2",
        "TWI662511B",
        "CA3115898C",
        "US11120337B2",
        "US10489690B2",
        "US10984905B2",
        "CN109784325A",
        "US10990901B2",
        "US11257002B2",
        "KR102486395B1",
        "US10235533B1",
        "US11393587B2",
        "US10122969B1",
        "US10380260B2",
        "WO2019114982A1",
        "US20190188605A1",
        "US11048334B2",
        "US11043006B1",
        "US20190212977A1",
        "US10706267B2",
        "US10817749B2",
        "US20190228310A1",
        "US20190244138A1",
        "US10303771B1",
        "US10867214B2",
        "US10043255B1",
        "US11347969B2",
        "KR20200123858A",
        "CN110298219A",
        "US10860629B1",
        "CN108596895B",
        "US10169315B1",
        "US10915798B1",
        "CN110335269A",
        "US20190354836A1",
        "US10628708B2",
        "US20190354810A1",
        "US20190362222A1",
        "US10713569B2",
        "JP7035827B2",
        "US10699055B2",
        "US10460235B1",
        "US20210209339A1",
        "CN109784186B",
        "US20210049499A1",
        "US11736764B2"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US11210604B1",
        "US10127240B2",
        "US11443206B2",
        "US10678846B2",
        "US10699139B2",
        "US10839291B2",
        "WO2019026702A1",
        "US10935940B2",
        "KR101977174B1",
        "US10860618B2",
        "US11120337B2",
        "JP2021503134A",
        "US11727286B2",
        "US11669769B2",
        "US11640561B2",
        "US11676069B2",
        "US10817402B2",
        "US10997180B2",
        "EP3528435B1",
        "US10783660B2",
        "KR102532230B1",
        "US10762669B2",
        "US20190294927A1",
        "US11205121B2",
        "US10672174B2",
        "US10621764B2",
        "US10460235B1",
        "US11741398B2",
        "US11315039B1",
        "EP3618287B1",
        "US20200089999A1",
        "US10978051B2",
        "WO2020077163A1",
        "US10747642B2",
        "US11556746B1",
        "US11537506B1",
        "US11568235B2",
        "US11366704B2",
        "US20200175390A1",
        "US20200175383A1",
        "US10839208B2",
        "WO2020123999A1",
        "US20200220869A1",
        "US11514330B2",
        "US10798386B2",
        "CN109829849B",
        "US11663493B2",
        "US20200251007A1",
        "US11423035B2",
        "US10776720B2",
        "US10832734B2",
        "US11710034B2",
        "US10878298B2",
        "JP7276757B2",
        "SG10201903611RA",
        "US11676063B2",
        "CN109951743A",
        "US11475247B2",
        "US11562134B2",
        "US20200319857A1",
        "US11290492B2",
        "GB201905966D0",
        "US11580442B2",
        "WO2020227434A1",
        "US11328313B2",
        "US11531875B2",
        "US20200371778A1",
        "US11205138B2",
        "US11657118B2",
        "US20200372402A1",
        "US11704494B2",
        "US11321771B1",
        "US11568310B2",
        "US11379348B2",
        "US11243746B2",
        "FR3098941B1",
        "US11500829B2",
        "US11321284B2",
        "US11762853B2",
        "US11609885B2",
        "US11373104B2",
        "US11537880B2",
        "US11531883B2",
        "US10831566B1",
        "US11128737B1",
        "US11522881B2",
        "US10885343B1",
        "US11509674B1",
        "US11108780B2",
        "US10970136B1",
        "US11544604B2",
        "US11593511B2",
        "US11347613B2",
        "US11308284B2",
        "US20210142224A1",
        "US11429386B2",
        "WO2021091918A1",
        "US11275972B2",
        "US11132512B2",
        "US11657302B2",
        "US11423250B2",
        "US11158090B2",
        "CN111159501B",
        "US11763138B2",
        "US11551652B1",
        "US20230010686A1",
        "CN111026664B",
        "US11216922B2",
        "US11551159B2",
        "CN111181671B",
        "CN113055017A",
        "US11086829B2",
        "US11687778B2",
        "US20210216902A1",
        "GB2590967A",
        "US11657292B1",
        "US11671506B2",
        "US11645543B2",
        "JP7298494B2",
        "US11169786B2",
        "US11508253B1",
        "US11636202B2",
        "US20210273962A1",
        "EP3872584A1",
        "US11206316B2",
        "US11128724B1",
        "US11734849B2",
        "US11475364B2",
        "US10860466B1",
        "US11221846B2",
        "CN111429006A",
        "US11604871B2",
        "CN111489802B",
        "CN111459820B",
        "US11675921B2",
        "US11429582B2",
        "CN111553408B",
        "US11580456B2",
        "US20210334694A1",
        "US20210342339A1",
        "CN111523668B",
        "US20230186093A1",
        "US11349957B2",
        "US11797340B2",
        "US20210365478A1",
        "CN111444721B",
        "US11321158B2",
        "US20210374128A1",
        "US11474596B1",
        "CN111639143B",
        "US11551429B2",
        "KR102226292B1",
        "US11651378B2",
        "KR102417131B1",
        "US11151480B1",
        "US20210406302A1",
        "US11580425B2",
        "WO2022006344A1",
        "US20220012220A1",
        "US11288797B2",
        "US20220019933A1",
        "US11443143B2",
        "US20220024032A1",
        "US11468999B2",
        "CN111782550B",
        "US11531903B2",
        "KR102491753B1",
        "KR102491755B1",
        "US11763084B2",
        "CN111813921B",
        "CN111767326B",
        "JP7041374B2",
        "US20220076157A1",
        "US20220092470A1",
        "CN111968744B",
        "US11182275B1",
        "CN112272177B",
        "US20220138437A1",
        "US20220138556A1",
        "US11455492B2",
        "US11520801B2",
        "US11392487B2",
        "US11544281B2",
        "US11720962B2",
        "FR3116926A1",
        "CN112364828B",
        "US20220172064A1",
        "US11720709B1",
        "KR102484316B1",
        "CN112486719B",
        "US11687620B2",
        "GB202020155D0",
        "WO2022139642A1",
        "US20220198278A1",
        "US11516240B2",
        "CN112674734B",
        "KR102568011B1",
        "US11354597B1",
        "WO2022150343A1",
        "US11588911B2",
        "CN112765319B",
        "US20220229569A1",
        "US11568320B2",
        "CN112463546B",
        "EP4033411A1",
        "US20220254098A1",
        "US20220253856A1",
        "WO2022177448A1",
        "US20220272124A1",
        "US20220277327A1",
        "US11368521B1",
        "US20220303288A1",
        "EP4060677A1",
        "US11550991B2",
        "CN113109869A",
        "US11567739B2",
        "US11336698B1",
        "US11647052B2",
        "US11303647B1",
        "US11178188B1",
        "US11663219B1",
        "US11271972B1",
        "US11271973B1",
        "CN113392412B",
        "US11470490B1",
        "US11500844B1",
        "US20220405386A1",
        "US11675817B1",
        "US11720400B2",
        "US20230004991A1",
        "CN113407458B",
        "CN113282961A",
        "US11797574B2",
        "US20230047057A1",
        "US20230060957A1",
        "US20230084532A1",
        "CN113515464B",
        "US11734156B2",
        "US11681445B2",
        "US20230107337A1",
        "US11294937B1",
        "WO2023080276A1",
        "KR20230065037A",
        "CN113806338B",
        "CN114116870B",
        "US20230186307A1",
        "CN113934453B",
        "US20230195734A1",
        "US11768753B2",
        "US11797408B2",
        "US20230214368A1",
        "CN114048856B",
        "WO2023146549A1",
        "US11468369B1",
        "US20230252040A1",
        "US20230251953A1",
        "US20230306281A1",
        "CN114612967B",
        "EP4243341A1",
        "US20230334169A1",
        "US11743552B1",
        "CN115080450B",
        "CN115546652B",
        "US11704540B1",
        "US11736580B1"
    ]
}