{
    "patent_link": "https://patents.google.com/patent/US5315633A/en",
    "patent_id": "US5315633A",
    "title": "Digital video switch for video teleconferencing",
    "abstract": "A digital video switch system comprising a smart control terminal is coupled to a digital access controller and to a multipoint control unit. The smart control terminal is provided with a plurality of function keys, each of which is designed to provide automatic interconnection of input and output ports of the digital access controller and the multipoint control unit so that a predetermined interconnection of video and audio signals from remote conferencing sites are interconnected via input/output ports of the digital access controller with each other in a desired format to provide central teleconferencing control of a plurality of sites from a central control site.",
    "inventors": [
        "John J. Champa"
    ],
    "assignee": "Unisys Corp",
    "classifications": [
        "H04N7/152",
        "H04N7/15"
    ],
    "claims": "\n1. A programmable digital video switch for controlling video teleconferencing comprising;\na plurality of conferencing sites,\neach of said sites having a plurality of video monitors, at least one monitor for active on-site monitoring and at least one monitor for displaying a video signal generated at a remote side,\neach of said conferencing sites having at least one video camera for generating on-site video and audio camera signals,\nCompression/Decompression (CODEC) means coupled to said at least one video camera for converting said on-site video and audio camera signals to a predetermined compressed digital format for transmission to a central control site and for decompressing the digital format video and audio camera signals received at said central control site,\ndigital transmission/receiving means coupled to said CODEC means for transmitting and receiving the predetermined compressed digital format audio and video camera signals to and from said central control site, and\ndigital video switch means located at said control central site comprising:\ndigital port interconnection means having a plurality of duplex input/output ports for connecting to said transmission/receiving means coupled to said CODEC means from each of said conferencing sites,\nsaid digital port interconnection means further having a plurality of output only ports and a plurality of input only ports,\nmultiport control means for connecting the input only ports to a plurality of said output only ports, and\nsmart terminal control means coupled to said multiport control means for automatically selecting one of said plurality of input only ports and for connecting the selected port to a plurality of said output only ports in response to a predetermined condition remotely programmable at said smart terminal, whereby a combined digital video and audio signal generated at the remote site is selected as an input to said multiport control means and is further selected as a digital output to said plurality of conferencing sites.\n2. A programmable digital video switch as set forth in claim 1 wherein said remotely programmable predetermined condition is selectable from a plurality of function keys on a keyboard of said smart terminal.\n3. A programmable digital switch as set forth in claim 1 wherein said smart terminal control means is coupled to said multiport control means through a first standard digital interface.\n4. A programmable digital switch as set forth in claim 1 which further includes a second standard digital interface connected between said digital port interconnection means and said smart terminal control means.\n5. A programmable digital switch as set forth in claim 3 wherein said first standard digital interface is coupled to said port interconnection means for selecting said plurality of output and corresponding input ports for interconnection.\n6. A programmable digital switch as set forth in claim 1 wherein all said input and output ports are formatted to be compatible with a digital T-1 format input.\n7. A programmable digital switch as set forth in claim 6 wherein at least one of said digital ports further comprises a multiplexer at the input/output port for dividing a digital T-1 input line into a plurality of fractional T-1F lines.\n8. A programmable digital switch as set forth in claim 1 wherein there is provided a plurality of different video format signals from said conferencing sites to be connected to said port interconnection means in digital T-1 format, and at least one of said input ports is provided with a CODEC connected in series with said video format signal for converting said video format signal from analog to digital format.\n9. A programmable digital switch as set forth in claim 8 wherein at least one of said input ports is provided with a channel serving unit connected in series with a plurality of video format signals for converting fractional T-1 format signals to full T-1 format signals.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4105973A",
        "US4456789A",
        "US4477900A",
        "US4516156A",
        "US4645872A",
        "US4682349A",
        "US4710917A",
        "US4730312A",
        "US5003532A",
        "US5062136A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5434913A",
        "US5453780A",
        "US5490247A",
        "US5493568A",
        "US5506954A",
        "US5509009A",
        "US5557725A",
        "US5566238A",
        "US5574934A",
        "US5579389A",
        "US5594725A",
        "US5600646A",
        "US5600797A",
        "US5617539A",
        "US5631967A",
        "US5633891A",
        "EP0780044A1",
        "US5673393A",
        "US5729684A",
        "US5751337A",
        "US5751791A",
        "US5754765A",
        "US5768513A",
        "US5784561A",
        "US5793415A",
        "US5809237A",
        "US5838368A",
        "US5838664A",
        "US5850250A",
        "US5862388A",
        "US5909543A",
        "US5936662A",
        "US5949891A",
        "WO1999053691A2",
        "US5999966A",
        "US6125398A",
        "US6163798A",
        "US6414707B1",
        "US20020124051A1",
        "US6608636B1",
        "US6707434B1",
        "US6744460B1",
        "US6812956B2",
        "US6898620B1",
        "US20050144284A1",
        "US20050151836A1",
        "US20050207433A1",
        "US20050235014A1",
        "US20050232168A1",
        "US20050232260A1",
        "US20060002315A1",
        "US20060031779A1",
        "US20070011356A1",
        "US20070033529A1",
        "US7185054B1",
        "US20070093672A1",
        "US20070211141A1",
        "US7546374B2",
        "US7689704B2",
        "US20100121972A1",
        "US7747702B2",
        "US20110187814A1",
        "USRE44814E1",
        "CN110166824A"
    ],
    "citedby_ftf": []
}