{
    "patent_link": "https://patents.google.com/patent/US6308072B1/en",
    "patent_id": "US6308072B1",
    "title": "Method and apparatus for controlling a wireless communication system",
    "abstract": "A simulator/controller (113) performs real-time simulation for system control in a code-division multiple access (CDMA) wireless communication system (100). The simulator/controller (113) simulates the effects of interfering AMPS wireless communication systems which coexist with CDMA wireless communication systems and also aids in the placement of new CDMA base-stations in the presence of existing AMPS base-stations. When system parameters are input to the simulator/controller (113), real-time simulation of the CDMA wireless communication system (100) predicts potential problem areas of the CDMA wireless communication system (100) and controls the CDMA wireless communication system (100) to avoid the problems before they occur.",
    "inventors": [
        "Gerald Paul Labedz",
        "Khalid Abdul-Aziz Hamied"
    ],
    "assignee": "Motorola Solutions Inc",
    "classifications": [
        "H04W16/18",
        "H04W16/14",
        "H04W36/18"
    ],
    "claims": "\n1. A method of controlling a code-division multiple access (CDMA) wireless communication system, the CDMA wireless communication system including a mobile station responsive to a plurality of base-stations, the method comprising the steps of:\n2. The method of claim 1, wherein the parameters related to the CDMA wireless communication system include parameters related to forward link coverage, forward link power level, frame erasure rate (FER), reverse link coverage, reverse link power level, reverse link FER and the quality of a forward link control signal.\n3. The method of claim 1, wherein the step of controlling further comprises comparing, in a base-station, information related to the location of the mobile station with the location information related to an analog wireless communication system which is a potential source of interference.\n4. The method of claim 3, wherein the information related to the location of the mobile station is either transmitted to the base-station from the mobile station, determined solely by the base-station, or a combination of the two.\n5. A method of placing a new base-station in a wireless communication system, the method comprising the steps of:\n6. The method of claim 5, wherein the step of placing the new base-station further comprises placing the new base-station such that a circle having the first radius and centered at the new base-station encompasses an interfering base-station.\n7. The method of claim 5, wherein the step of placing the new base-station further comprises placing the new base-station such that a circle having the second radius and centered at the new base-station encompasses an interfering base-station.\n8. A method of mitigating interference in a wireless communication system, the wireless communication system including a mobile station responsive to any one of a plurality of base-stations, the method comprising the steps of:\n9. The method of claim 8, wherein the step of determining further comprises simulating where, based on geographic location, the mobile station will incur interference.\n10. The method of claim 9, wherein the step of simulating further comprises simulating where, based on geographic location, a CDMA mobile station will incur interference from an analog wireless communication system.\n11. The method of claim 10, wherein the step of controlling further comprises transmitting a message to a CDMA mobile station to enable a receiver front-end attenuator in the CDMA mobile station before the interference from the analog wireless communication system occurs.\n12. The method of claim 10, wherein the step of controlling further comprises transmitting a message to a CDMA mobile station to force the CDMA mobile station into soft handoff before the interference from the analog wireless communication system occurs.\n13. The method of claim 10, wherein the step of controlling further comprises the step of adjusting parameters related to the forward link of the CDMA wireless communication system.\n14. The method of claim 10, wherein the step of controlling further comprises the step of adjusting parameters related to the forward link of the CDMA wireless communication system.\n15. A method of performing soft handoff in a spread spectrum wireless communication system, the spread spectrum wireless communication system including a mobile station responsive to any one of a plurality of base-stations compatible with the spread spectrum wireless communication system, the method comprising the steps of:\n16. The method of claim 15, wherein the plurality of signals are a plurality of received pilot signals.\n17. An apparatus for controlling a code-division multiple access (CDMA) wireless communication system, the CDMA wireless communication system including a mobile station responsive to a plurality of base-stations, the apparatus comprising:\n18. The apparatus of claim 17, wherein the parameters related to the CDMA wireless communication system include parameters related to forward link coverage, forward link power level, frame erasure rate (FER), reverse link coverage, reverse link power level, reverse link FER and the quality of a forward link control signal.\n19. The apparatus of claim 17, wherein the means for controlling further comprises means, in a base-station, for comparing information related to the location of the mobile station with the location information related to an analog wireless communication system which is a potential source of interference.\n20. The apparatus of claim 19, wherein the information related to the location of the mobile station is either transmitted to the base-station from the mobile station, determined solely by the base-station, or a combination of the two.\n21. An apparatus for mitigating interference in a wireless communication system, the wireless communication system including a mobile station responsive to any one of a plurality of base-stations, the apparatus comprising:\n22. The apparatus of claim 21, wherein the means for determining further comprises means for simulating where, based on geographic location, the mobile station will incur interference.\n23. The apparatus of claim 22, wherein the means for simulating further comprises means for simulating where, based on geographic location, a CDMA mobile station will incur interference from an analog wireless communication system.\n24. The apparatus of claim 23, wherein the means for controlling further comprises means for transmitting a message to a CDMA mobile station to enable a receiver front-end attenuator in the CDMA mobile station before the interference from the analog wireless communication system occurs.\n25. The apparatus of claim 23, wherein the means for controlling further comprises means for transmitting a message to a CDMA mobile station to force the CDMA mobile station into soft handoff before the interference from the analog wireless communication system occurs.\n26. The apparatus of claim 23, wherein the means for controlling further comprises means for adjusting parameters related to the forward link of the CDMA wireless communication system.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US5293640A",
        "US5465393A",
        "US5465390A",
        "US5561841A",
        "US5596570A"
    ],
    "citations_ftf": [
        "US5410737A",
        "US5497503A",
        "KR960011868B1"
    ],
    "citedby_own": [
        "US20020022501A1",
        "US6397068B1",
        "US20020090957A1",
        "WO2002065346A1",
        "US20030014233A1",
        "US6526103B1",
        "US20030064735A1",
        "US6571082B1",
        "US20030101034A1",
        "US6584081B1",
        "US20030137958A1",
        "WO2003077060A2",
        "US20040008644A1",
        "US20040022302A1",
        "US6711416B1",
        "US6724730B1",
        "WO2004040847A1",
        "US20040120304A1",
        "US20040220966A1",
        "US6842442B2",
        "US20050008109A1",
        "US20050020235A1",
        "US6856945B2",
        "US20050053008A1",
        "US6873614B2",
        "US20050090243A1",
        "US6903910B1",
        "US20050271071A1",
        "WO2006075051A1",
        "WO2006079252A1",
        "US7130634B1",
        "US7200183B2",
        "US20070099606A1",
        "US20070127559A1",
        "US20070177565A1",
        "US20070202866A1",
        "US20080004028A1",
        "US20080020746A1",
        "US20080045233A1",
        "US20080056340A1",
        "US20080096543A1",
        "US20080214208A1",
        "US7453844B1",
        "US20080299993A1",
        "US20080305754A1",
        "US7680644B2",
        "US7714778B2",
        "US7715461B2",
        "US7764231B1",
        "US7787572B2",
        "US7787518B2",
        "CN101137183B",
        "US20100245115A1",
        "US7812766B2",
        "US20100285753A1",
        "US7848284B2",
        "US20100323715A1",
        "US7903029B2",
        "US7933605B2",
        "US8005128B1",
        "US8064409B1",
        "US8082096B2",
        "US8085889B1",
        "US8135413B2",
        "US8179946B2",
        "US8503336B2",
        "US8654689B2",
        "US8694025B2",
        "US8761321B2",
        "US8811200B2",
        "US20150111591A1",
        "US9107109B2",
        "US9118387B2",
        "US9134398B2",
        "US9172456B2",
        "US9426821B2",
        "US9538493B2",
        "US9730146B2",
        "US9735816B2",
        "US9875492B2",
        "US10641861B2",
        "US10684350B2",
        "US10943273B2"
    ],
    "citedby_ftf": [
        "FI107219B",
        "GB2337415A",
        "US6862449B1",
        "GB2337416B",
        "GB2337414A",
        "US6119010A",
        "US6940838B1",
        "AU6920400A",
        "CN1435066A",
        "KR100672463B1",
        "CN101365202B",
        "CN102034070B",
        "US11799569B2",
        "JP7127599B2"
    ]
}