{
    "patent_link": "https://patents.google.com/patent/US20050147032A1/en",
    "patent_id": "US20050147032A1",
    "title": "Apportionment of traffic management functions between devices in packet-based communication networks",
    "abstract": "In a packet-based network node, traffic management functions are apportioned between an upstream device and a connected queuing device. The upstream device is responsible for receiving packets and optionally discarding them. The queuing device is responsible for enqueuing undiscarded packets into queues pending transmission, computing the congestion states of the queues, and communicating the congestion states to the upstream device. The upstream device bases its optional discarding on these computed congestion states and, optionally, on discard probabilities and an aggregate congestion level, which may also be computed by the queuing device. The upstream device may additionally mark packets as having experienced congestion based on congestion indication states, which may further be computed by the queuing device. Any statistics maintained by the upstream device may reflect packets discarded for any reason (e.g. at both OSI layers 2 and 3).",
    "inventors": [
        "Norman Lyon",
        "Scott Mason"
    ],
    "assignee": "Nortel Networks Ltd",
    "classifications": [
        "H04L47/10",
        "H04L47/125",
        "H04L47/16",
        "H04L47/326",
        "H04L49/501",
        "H04L2012/5648",
        "H04L2012/5679"
    ],
    "claims": "\n1. A method of managing traffic in a packet-based network, comprising:\nat an upstream device:\nreceiving packets;\nfor a received packet:\nidentifying a queue of a separate queuing device into which said packet is enqueueable, said identifying resulting in an identified queue;\nretrieving congestion state information received from said separate queuing device; and\noptionally discarding said packet based on said retrieved congestion state information; and\nforwarding undiscarded packets towards said separate queuing device; and at said separate queuing device:\nenqueuing packets forwarded by said upstream device into a plurality of queues;\nmaintaining congestion state information for each of said plurality of queues; and\ncommunicating said congestion state information to said upstream device.\n2. The method of claim 1 wherein said congestion state information includes congestion state notification information for said identified queue.\n3. A method of managing traffic at a device in a packet-based network, comprising:\nreceiving packets;\nfor a received packet:\nidentifying a queue of a separate queuing device into which said packet is enqueueable, said identifying resulting in an identified queue;\nretrieving congestion state information received from said separate queuing device; and\noptionally discarding said packet based on said retrieved congestion state information; and\nforwarding undiscarded packets towards said separate queuing device.\n4. The method of claim 3 wherein said congestion state information includes congestion state notification information for said identified queue.\n5. A method of managing traffic at a device in a packet-based network, comprising:\nenqueuing packets forwarded by a separate upstream device into a plurality of queues;\nmaintaining congestion state information including congestion notification state information for each of said plurality of queues; and\ncommunicating said congestion state information to said separate upstream device for use in the optional discarding of packets.\n6. A device in a packet-based network, comprising:\nan input for receiving packets; and\ncircuitry for, for a received packet:\nidentifying a queue of a separate queuing device into which said packet is enqueueable, said identifying resulting in an identified queue;\nretrieving congestion state information received from said separate queuing device; and\noptionally discarding said packet based on said retrieved congestion state information.\n7. The device of claim 6 wherein said congestion state information includes congestion notification state information for said identified queue of said separate queuing device\n8. The device of claim 6, further comprising:\ncircuitry for, upon said identifying, sending a request to said separate queuing device for congestion state information for said identified queue.\n9. The device of claim 6 further comprising:\ncircuitry for receiving congestion state information for a plurality of queues maintained at said separate queuing device;\na cache for caching said congestion state information.\n10. The device of claim 6 wherein said congestion state information further includes congestion indication state information, and further comprising circuitry for optionally marking a received packet as having experienced congestion based on said congestion indication state information.\n11. The device of claim 10 further comprising circuitry for maintaining statistics based on said optionally marking\n12. The device of claim 6 further comprising circuitry for maintaining statistics based on said optional discarding.\n13. The device of claim 12 wherein said statistics are in respect of Open Systems Interconnection Reference Model layer 3 flows.\n14. The device of claim 6 further comprising circuitry for, for a received packet, storing the identity of said identified queue in said packet.\n15. The device of claim 6 further comprising:\ncircuitry for, for a received packet:\ndetermining a type of said packet; and\nbypassing said retrieving and said optional discarding if said determined packet type is one of a predetermined set of packet types.\n16. The device of claim 15 further comprising circuitry for, for a received packet, setting a discard check indicator associated with said packet to indicate that no discard check has been performed on said packet if said determined packet type is one of said predetermined set of packet types.\n17. The device of claim 15 further comprising circuitry for, for a received packet, setting a discard check indicator associated with said packet to indicate that a discard check has been performed on said packet if said determined packet type is not one of said predetermined set of packet types.\n18. The device of claim 6 further comprising:\ncircuitry for retrieving a discard probability for said identified queue of said separate queuing device; and\ncircuitry for further optionally discarding said packet based on said discard probability.\n19. The device of claim 18 wherein said discard probability is in respect of the Random Early Detection scheme.\n20. The device of claim 18 further comprising circuitry for maintaining statistics based on said optional discarding.\n21. The device of claim 6 further comprising circuitry for retrieving an aggregate congestion level of said separate queuing device, wherein said circuitry for optionally discarding said packet further bases said optional discarding on said aggregate congestion level.\n22. The device of claim 21 wherein said circuitry for optionally discarding said packet performs said optional discarding based on whichever of said congestion state information for said identified queue and said aggregate congestion level represents a greater degree of congestion.\n23. A device in a packet-based network, comprising:\na plurality of queues for enqueuing packets;\ncircuitry for maintaining congestion state information including congestion notification state information for each of said plurality of queues; and\ncircuitry for communicating said congestion state information to a separate upstream device for use in the optional discarding of packets.\n24. The device of claim 23 further comprising circuitry for triggering said circuitry for communicating to communicate said congestion state information periodically.\n25. The device of claim 23 further comprising circuitry for triggering said circuitry for communicating to communicate congestion state information for a queue into which a packet was most recently enqueued in addition to triggering said circuitry for communicating to communicate congestion state information for other queues.\n26. The device of claim 23 further comprising circuitry for triggering said circuitry for communicating to communicate congestion state information for a queue from which a packet was most recently dequeued in addition to triggering said circuitry for communicating to communicate congestion state information for other queues.\n27. The device of claim 23 further comprising circuitry for receiving a request from said separate upstream device for congestion state information for a specified queue, and wherein said circuitry for communicating communicates the congestion state information for said specified queue in response to said request.\n28. The device of claim 23 further comprising:\ncircuitry for maintaining discard probability information for each of said plurality of queues; and\ncircuitry for communicating said discard probability information to said separate upstream device.\n29. The device of claim 23 further comprising:\ncircuitry for determining an aggregate congestion level at said queuing device; and\ncircuitry for communicating said aggregate congestion level to said separate upstream device.\n30. The device of claim 23 further comprising:\ncircuitry for receiving packets;\ncircuitry for inspecting a discard check indicator associated with a received packet; and\ncircuitry for optionally discarding the received packet based on said discard check indicator.\n31. A computer-readable medium storing instructions which, when performed by an upstream device in a packet-based network, cause said device to:\nreceive packets;\nfor a received packet:\nidentify a queue of a separate queuing device into which said packet is enqueueable, said identifying resulting in an identified queue;\nretrieve congestion state information received from said separate queuing device; and\noptionally discard said packet based on said retrieved congestion state information; and\nforward undiscarded packets towards said separate queuing device.\n32. The computer-readable medium of claim 31 wherein said congestion state information includes congestion state notification information for said identified queue.\n33. The computer-readable medium of claim 31 wherein said instructions further cause said device to:\nupon said identifying, send a request to said separate queuing device for congestion state information for said identified queue.\n34. The computer-readable medium of claim 31 wherein said instructions further cause said device to maintain statistics based on said optional discard.\n35. The computer-readable medium of claim 34 wherein said statistics are in respect of Open Systems Interconnection Reference Model layer 3 flows.\n36. The computer-readable medium of claim 31 wherein said instructions further cause said device to, for a received packet, store an identifier of said identified queue in said packet.\n37. The computer-readable medium of claim 31 wherein said instructions further cause said device to:\nfor a received packet:\ndetermine a type of said packet; and\nbypass said retrieve and said optional discard if said determined packet type is one of a predetermined set of packet types.\n38. The computer-readable medium of claim 37 wherein said predetermined set of packet types includes Asynchronous Transfer Mode (ATM) bearer service packets.\n39. The computer-readable medium of claim 37 wherein said instructions further cause said device to:\nfor a received packet, if said determined packet type is one of said predetermined set of packet types, set a discard check indicator associated with said packet to indicate that said packet is discardable by said separate queuing device.\n40. The computer-readable medium of claim 37 wherein said instructions further cause said device to:\nfor a received packet, if said determined packet type is not one of said predetermined set of packet types, set said discard check indicator associated with said packet to indicate that said packet is not discardable by said separate queuing device.\n41. The computer-readable medium of claim 31 wherein said congestion state information further includes congestion indication state information.\n42. The computer-readable medium of claim 31 wherein said instructions further cause said device to:\nfor a received packet:\nretrieve a discard probability for said identified queue; and\nfurther optionally discard said packet based on said discard probability.\n43. The computer-readable medium of claim 31 wherein said instructions further cause said device to retrieve an aggregate congestion level of said separate queuing device, and wherein said optional discard is further based on said aggregate congestion level.\n44. The computer-readable medium of claim 43 wherein said optional discard is governed by whichever of said congestion state information for said identified queue and said aggregate congestion level represents a greater degree of congestion.\n45. A computer-readable medium storing instructions which, when performed by a queuing device in a packet-based network, cause said device to:\nenqueue packets forwarded by a separate upstream device into a plurality of queues;\nmaintain congestion state information including congestion notification information for each of said plurality of queues; and\ncommunicate said congestion state information to said separate upstream device for use in the optional discarding of packets.\n46. The computer-readable medium of claim 45 wherein said instructions cause said communicate to occur periodically for each of said plurality of queues.\n47. The computer-readable medium of claim 45 wherein said instructions cause said communicate to be triggered for a queue which has most recently enqueued a packet before it is triggered for other queues.\n48. The computer-readable medium of claim 45 wherein said instructions cause said communicate to be triggered for a queue which has most recently dequeued a packet before it is triggered for other queues.\n49. The computer-readable medium of claim 45 wherein said instructions further cause said device to receive requests for congestion state information for a specified queue from said separate upstream device, and wherein said communicate communicates congestion state information for said specified queue in response to said request.\n50. The computer-readable medium of claim 45 wherein said enqueue comprises, for a particular packet, identify from a queue identifier in said packet one of said plurality of queues into which said packet is enqueueable.\n51. The computer-readable medium of claim 45 wherein said instructions further cause said device to optionally discard packets having a discard check indicator indicating that said packet is discardable.\n52. The computer-readable medium of claim 45 wherein said instructions further cause said device to:\nmaintain a discard probability for each of said plurality of queues; and\nfurther communicate said discard probability to said upstream device.\n53. The computer-readable medium of claim 52 wherein said discard probability is calculated according to the Random Early Detection scheme.\n54. The computer-readable medium of claim 45 wherein said instructions further cause said device to:\ndetermine an aggregate congestion level; and\ncommunicate said aggregate congestion level to said upstream device.\n55. The computer-readable medium of claim 45 wherein said congestion state information further includes congestion indication state information.",
    "status": "Abandoned",
    "citations_own": [
        "US6091709A",
        "US6163528A",
        "US6333917B1",
        "US20020089931A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20050141427A1",
        "US20060195590A1",
        "US20080137534A1",
        "US20080253289A1",
        "EP2070270A2",
        "GB2458952A",
        "US20090268614A1",
        "US7644147B1",
        "US20100040059A1",
        "US20100142539A1",
        "US7739736B1",
        "US20110051604A1",
        "US8238298B2",
        "US8238942B2",
        "US20120236715A1",
        "US8340110B2",
        "US8514827B2",
        "US8638762B2",
        "US8818322B2",
        "US20140328175A1",
        "US8902904B2",
        "US8966018B2",
        "US8978105B2",
        "US9014005B2",
        "US9258702B2",
        "US20160380895A1",
        "US9674104B1",
        "CN108259355A",
        "US20180205648A1",
        "CN108322390A",
        "US20190140893A1",
        "US20190342199A1",
        "CN114301851A",
        "US20230028832A1"
    ],
    "citedby_ftf": []
}