{
    "patent_link": "https://patents.google.com/patent/US6654825B2/en",
    "patent_id": "US6654825B2",
    "title": "Peripheral video conferencing system with control unit for adjusting the transmission bandwidth of the communication channel",
    "abstract": "A peripheral video conferencing system is housed in a peripheral housing and adapted for communication with an analog or digital communication channel and a separate host computer system. Audio, video, and data file information is transmitted to and received from a remote conferencing site over the communication channel. A plurality of audio, video, and communication channel connectors provide means for acquiring source audio and video signals, and respectively displaying on a separate monitor and broadcasting over an internal or separate external speaker remote video images and audio. A high-speed output interface provides connectivity with the separate host computer system for coordinating, in cooperation with video conferencing application software operating thereon, the presentation of local and remote NTSC or PAL video images on a display coupled to the computer system.",
    "inventors": [
        "Doug Clapp",
        "David Mulder"
    ],
    "assignee": "RSI Systems Inc",
    "classifications": [
        "H04N7/142",
        "H04M3/56",
        "H04N7/147",
        "H04N7/148",
        "H04M2203/2044",
        "H04M2203/5063",
        "H04M3/4931"
    ],
    "claims": "\n1. A video-conferencing system comprising:\n2. The video-conferencing system of claim 1, further comprising:\n3. The video-conferencing system according to claim 2, wherein the control unit is disposed in the housing.\n4. The video-conferencing system according to claim 2, wherein the control unit is controlled by a user interface device.\n5. The video-conferencing system according to claim 4, wherein the user interface device is separate from the housing.\n6. The video-conferencing system according to claim 5, wherein the user interface device is selected from the group consisting essentially of a separate host computer, a telephone, a numeric keyboard, and a mouse.\n7. The video-conferencing system according to claim 2, wherein the control unit displays a video image associated with the remote video signal within a video window displayed on the display device.\n8. The video-conferencing system according to claim 7, wherein the control unit modifies the size of the video window displayed on the video signal display device.\n9. The video-conferencing system according to claim 8, wherein the system further comprises software that cooperates with the control unit to display a video image associated with the remote video signal within a video window displayed on the video signal display device; and modifies the size of the video window displayed on the video signal display device.\n10. The video-conferencing system according to claim 8, wherein the control unit is adapted to simultaneously display on the video signal display device video images associated with the remote and local video signals.\n11. The video-conferencing system according to claim 10, wherein the system further comprises software that cooperates with the control unit to simultaneously display on the video signal display device video images associated with the remote and local video signals.\n12. The video-conferencing system according to claim 2, wherein the control unit coordinates communication of the remote video signal between the second receive unit and the output interface.\n13. The video-conferencing system according to claim 12, wherein the system further comprises software that cooperates with the control unit for coordinating communication of the remote video signal between the second receive unit and the output interface.\n14. The video-conferencing system according to claim 2, wherein the system further comprises software that cooperates with the control unit to adjust the transmission bandwidth of the communication channel.\n15. The video-conferencing system according to claim 2, wherein the video signal display device is a television.\n16. The video-conferencing system according to claim 1, wherein the video signal display device is a video monitor.\n17. The video-conferencing system according to claim 16, wherein the video monitor is coupled to a host computer.\n18. The video-conferencing system according to claim 2, wherein the video signal display device is arranged and configured to receive an analog signal.\n19. The video-conferencing system according to claim 2, wherein the video signal display device is arranged and configured to receive a digital signal.\n20. The video-conferencing system according to claim 2, wherein the control unit is a separate host computer.\n21. The video-conferencing system according to claim 2, wherein the first receive unit is adapted to receive the local video signal in one of a plurality of predetermined video formats.\n22. The video-conferencing system according to claim 2, wherein the first receive unit is adapted to receive the local audio signal from a microphone and the local video signal from at least one of a video camera and a video media player.\n23. The video-conferencing system according to claim 2, further comprising a channel selection device for selectably transmitting the local audio signal or local video signal over the communication channel.\n24. The video-conferencing system according to claim 2, wherein the communication channel can be either an analog communication channel or a digital communication channel.\n25. The video-conferencing system according to claim 2, wherein the local transmission unit comprises a data file processor that transmits a data file over the communication channel.\n26. The video-conferencing system according to claim 25, wherein:\n27. The video-conferencing system according to claim 2, further comprising a detection device that detects an incoming communication.\n28. The video-conferencing system according to claim 27, wherein the control unit produces a detection signal in response to the detection device detecting an incoming communication.\n29. The video-conferencing system according to claim 28, wherein the control unit generates an alert message displayed on the video signal display device in response to the detection signal.\n30. The video-conferencing system according to claim 2, further comprising video conferencing software.\n31. The video-conferencing system according to claim 2, wherein the video conferencing software operates on a separate host computer system.\n32. The video-conferencing system according to claim 2, wherein the local transmission unit converts the local video signal in at least one of an NTSC format and a PAL format to an associated coded local video signal.\n33. The video-conferencing system according to claim 2, wherein the audio signal output device is a plurality of audio speakers.\n34. The video-conferencing system according to claim 2, wherein the audio signal output device is an audio amplifier coupled to a plurality of speakers.\n35. The video-conferencing system according to claim 34, wherein the audio amplifier is controlled by the control unit.\n36. The video-conferencing system according to claim 2, wherein the audio source signal generating device is a plurality of audio microphones.\n37. The video-conferencing system according to claim 2, wherein the audio source signal generating device is an audio input amplifier/multiplexer coupled to a plurality of audio microphones.\n38. The video-conferencing system according to claim 2, wherein the audio input amplifier/multiplexer is controlled by the control unit.\n39. The video-conferencing system according to claim 2, wherein the video source signal generating device is a video camera.\n40. The video-conferencing system according to claim 2, wherein the video source signal generating device is a video camcorder.\n41. The video-conferencing system according to claim 2, wherein the video source signal generating device part of a video camcorder and the video source signal generating device is also part of the video camcorder.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4004084A",
        "US4258357A",
        "US4258387A",
        "US4430526A",
        "US4449144A",
        "US4460918A",
        "US4485400A",
        "US4493021A",
        "US4499568A",
        "US4531024A",
        "US4710917A",
        "US4710813A",
        "US4785472A",
        "US4796833A",
        "US4797750A",
        "US4805205A",
        "US4847829A",
        "US4878242A",
        "US4893326A",
        "US4928300A",
        "US4932047A",
        "US4931872A",
        "US4949169A",
        "US4992866A",
        "US5014267A",
        "US5025314A",
        "US5027198A",
        "US5038224A",
        "US5061992A",
        "US5062136A",
        "US5117372A",
        "US5134611A",
        "US5142562A",
        "US5142361A",
        "US5164980A",
        "US5191601A",
        "US5192999A",
        "US5202961A",
        "US5204768A",
        "US5206721A",
        "US5226117A",
        "US5230063A",
        "US5257306A",
        "USD341848S",
        "US5280275A",
        "US5280540A",
        "US5283819A",
        "US5283638A",
        "US5287448A",
        "US5309509A",
        "US5315633A",
        "US5317405A",
        "US5318257A",
        "US5323445A",
        "US5325194A",
        "US5343240A",
        "US5347305A",
        "US5351076A",
        "US5357281A",
        "US5367331A",
        "US5369617A",
        "US5371534A",
        "US5373316A",
        "US5375068A",
        "US5374952A",
        "US5382972A",
        "US5384588A",
        "US5392284A",
        "US5396269A",
        "US5397133A",
        "US5400069A",
        "US5400068A",
        "US5402418A",
        "US5408261A",
        "US5412418A",
        "US5418560A",
        "US5430473A",
        "US5432900A",
        "US5434913A",
        "US5444476A",
        "US5444477A",
        "US5446491A",
        "US5448285A",
        "US5453792A",
        "US5473366A",
        "US5473367A",
        "US5477546A",
        "US5479405A",
        "US5483530A",
        "US5490247A",
        "US5491797A",
        "US5495485A",
        "US5506954A",
        "US5510829A",
        "US5512938A",
        "US5515296A",
        "US5515423A",
        "US5515099A",
        "USD370010S",
        "US5524110A",
        "US5532940A",
        "US5535138A",
        "US5534914A",
        "US5541639A",
        "US5550649A",
        "US5550754A",
        "US5572248A",
        "US5579301A",
        "US5585839A",
        "US5587735A",
        "US5587928A",
        "US5589873A",
        "US5594725A",
        "US5594495A",
        "US5594859A",
        "US5600646A",
        "US5608450A",
        "US5611038A",
        "US5619528A",
        "US5627978A",
        "US5638114A",
        "US5657246A",
        "US5659692A",
        "US5675375A",
        "US5675511A",
        "US5675374A",
        "US5675512A",
        "US5684527A",
        "US5689641A",
        "US5717857A",
        "US5740163A",
        "US5764278A",
        "US5767897A",
        "US5784572A",
        "US5802281A",
        "US5818513A",
        "US5818514A",
        "US5821985A",
        "US5835129A",
        "US5844599A",
        "US5852466A",
        "US5861907A",
        "US5862388A",
        "US5867653A",
        "US5872923A",
        "US5877755A",
        "US5900907A",
        "US5907604A",
        "US5917543A",
        "US5926208A",
        "US5930473A",
        "US5929897A",
        "US5936662A",
        "US5953050A",
        "US5963246A",
        "US5983261A",
        "US5991373A",
        "US5995490A",
        "US6008838A",
        "US6011579A",
        "US6025870A",
        "US6037970A",
        "US6049694A",
        "US6072522A",
        "US6078350A"
    ],
    "citations_ftf": [
        "CA1318381C",
        "AU645914B2",
        "US5392223A"
    ],
    "citedby_own": [
        "US20010000539A1",
        "US20020188691A1",
        "US20020194606A1",
        "US20030001968A1",
        "US20030171938A1",
        "US20030220971A1",
        "US20040080526A1",
        "US20040179591A1",
        "US20040225794A1",
        "US20050151833A1",
        "US20050268068A1",
        "WO2007035353A2",
        "US7209972B1",
        "US7328004B1",
        "US20080037777A1",
        "US20080068444A1",
        "US20080091747A1",
        "US20080267069A1",
        "US7861050B2",
        "US7890718B2",
        "US7924306B2",
        "US7962709B2",
        "US7962455B2",
        "US7975061B1",
        "US20110181686A1",
        "US8024294B2",
        "US8041673B2",
        "US8078583B2",
        "US8086809B2",
        "US8103829B2",
        "US8103670B2",
        "US8121983B2",
        "US8156086B2",
        "US8190565B2",
        "US8204859B2",
        "US8214444B2",
        "US8271830B2",
        "US8285684B2",
        "US8290808B2",
        "US8296475B2",
        "US8312323B2",
        "US8346825B2",
        "US8352422B2",
        "US8352433B2",
        "US8370542B2",
        "US20130100231A1",
        "US8434131B2",
        "US8433679B2",
        "CN103136150A",
        "US8489656B2",
        "US8504517B2",
        "US8504515B2",
        "US20130293668A1",
        "US8655850B2",
        "US8725698B2",
        "US8726242B2",
        "US9021198B1",
        "US9262435B2",
        "US9495382B2",
        "US9898213B2",
        "US9904481B2",
        "US11010261B2",
        "US11042318B2",
        "US11238064B2",
        "US11269543B2",
        "US11422732B2",
        "US11507470B2",
        "US11809285B2"
    ],
    "citedby_ftf": [
        "US5802281A",
        "US6791623B1",
        "US6628325B1",
        "US6750902B1",
        "US6891567B2",
        "US5956491A",
        "US6128033A",
        "US6070247A",
        "US5999598A",
        "US7071971B2",
        "US6085257A",
        "US6061747A",
        "US6847403B1",
        "US6392704B1",
        "US6038616A",
        "US6012101A",
        "CA2318395C",
        "US6119146A",
        "US6611503B1",
        "US6286063B1",
        "CA2338195C",
        "US7075564B1",
        "US6839734B1",
        "US7151970B1",
        "US7324133B2",
        "US6615255B1",
        "US6502142B1",
        "US7000106B2",
        "US6446255B1",
        "US6708247B1",
        "US6373500B1",
        "US20040193722A1",
        "US7089285B1",
        "US6618703B1",
        "US6928655B1",
        "WO2001047251A2",
        "US7012576B2",
        "TW559699B",
        "US7057635B1",
        "JP2001224003A",
        "US7573497B2",
        "US6590604B1",
        "AU2001274972A1",
        "US6636259B1",
        "US8224776B1",
        "US6529233B1",
        "US6944880B1",
        "US6735658B1",
        "US7287088B1",
        "US20020054206A1",
        "US20050039214A1",
        "US20040244056A1",
        "US20020126201A1",
        "US20020149672A1",
        "US7272232B1",
        "RU2240599C2",
        "EP1411723A4",
        "EP1292141A1",
        "JP4288879B2",
        "US7328261B2",
        "US7051125B1",
        "SE521657C2",
        "CN1213605C",
        "US8154581B2",
        "US7761505B2",
        "US20040158627A1",
        "CN100344140C",
        "US20040212737A1",
        "US7359004B2",
        "US20050021620A1",
        "US7353284B2",
        "US20050024487A1",
        "US20050024486A1",
        "US7552389B2",
        "CN100388781C",
        "CN100403796C",
        "US7483694B2",
        "WO2005109815A1",
        "US7176957B2",
        "JP2006101496A",
        "US7627033B2",
        "US8171169B2",
        "US8423673B2",
        "US7986335B2",
        "US7644309B2",
        "CN1893626B",
        "JP2007124090A",
        "US7924884B2",
        "US20070248328A1",
        "US8068716B2",
        "US20070274230A1",
        "US7634540B2",
        "US7583191B2",
        "US20080122934A1",
        "US20080307324A1",
        "CA2645942A1",
        "US8723756B2",
        "US20090185792A1",
        "US20090248919A1",
        "US8237624B2",
        "US8125559B2",
        "US8237742B2",
        "US8259992B2",
        "US8589579B2",
        "FR2943871B1",
        "US9854254B2",
        "CN102197647A",
        "TW201120741A",
        "CN102243856B",
        "WO2012051590A1",
        "US9560314B2",
        "US8838854B2",
        "JP5427911B2",
        "USD720752S1",
        "US9160987B1",
        "US8872915B1",
        "US9013575B2",
        "US9196133B2",
        "US20170263067A1",
        "US9172920B1",
        "US9235943B2",
        "US9237318B2",
        "US9172922B1",
        "US9060103B2",
        "US9060104B2",
        "US9179109B1",
        "US9179108B1",
        "US9094584B2",
        "US9113051B1",
        "US11651665B2",
        "US9179107B1",
        "US8941736B1",
        "US9065987B2",
        "US9769435B2",
        "US20180343141A1",
        "US9247219B2",
        "US10733823B2",
        "US9172921B1",
        "US8947530B1",
        "US10204467B2",
        "US9197867B1",
        "US10044519B2",
        "US10672238B2",
        "US8953040B1",
        "US8780201B1",
        "US10440165B2",
        "US10708404B2",
        "US9113052B1",
        "US9165444B2",
        "US9058738B1",
        "US9142214B2",
        "US11004312B2",
        "US9736284B2",
        "US9342936B2",
        "US9053622B2",
        "US9049352B2",
        "US9118819B1",
        "US9230424B1",
        "US8937659B1",
        "USD747733S1",
        "USD737283S1",
        "USD747732S1",
        "US9743049B2",
        "US9253455B1",
        "US9786133B2",
        "US9799183B2",
        "RU2580396C2",
        "USD762688S1",
        "US10687029B2",
        "US9888216B2",
        "US11184589B2",
        "US20170085843A1",
        "US9997036B2",
        "CN104360655B",
        "US10742938B2",
        "US11575537B2",
        "US11381686B2",
        "US20180047269A1",
        "US10706702B2",
        "US10043332B2",
        "US10909825B2",
        "CN110191366B",
        "CN110337044A",
        "US11074790B2"
    ]
}