{
    "patent_id": "US-10706284-B2",
    "title": "Semantic representation module of a machine-learning engine in a video analysis system ",
    "assignee": "Avigilon Patent Holding 1 Corporation",
    "publication_date": "2020-07-07",
    "patent_link": "https://patents.google.com/patent/US10706284B2/en",
    "inventors": [
        "John Eric Eaton",
        "Wesley Kenneth Cobb",
        "Dennis G. Urech",
        "David S. Friedlander",
        "Gang Xu",
        "Ming-Jung Seow",
        "Lon W. Risinger",
        "David M. Solum",
        "Tao Yang",
        "Rajkiran K. Gottumukkal",
        "Kishor Adinath Saitwal"
    ],
    "classifications": [
        "G06N3/006",
        "G06K9/00718",
        "G06F16/285",
        "G06K9/00335",
        "G06K9/00751",
        "G06K9/00771",
        "G06K9/66",
        "G06N20/00",
        "G06N3/042",
        "G06N3/0427",
        "G06N3/044",
        "G06N3/0445",
        "G06N3/08",
        "G06V20/41",
        "G06V20/47",
        "G06V20/52",
        "G06V40/20",
        "G06F18/22",
        "G06K2009/00738",
        "G06K9/6215",
        "G06V20/44"
    ],
    "abstract": "A machine-learning engine is disclosed that is configured to recognize and learn behaviors, as well as to identify and distinguish between normal and abnormal behavior within a scene, by analyzing movements and/or activities (or absence of such) over time. The machine-learning engine may be configured to evaluate a sequence of primitive events and associated kinematic data generated for an object depicted in a sequence of video frames and a related vector representation. The vector representation is generated from a primitive event symbol stream and a phase space symbol stream, and the streams describe actions of the objects depicted in the sequence of video frames.",
    "claims": "\n1. A computer-implemented method for processing data related to a scene depicted in a sequence of video frames, the method comprising:\nreceiving input data describing an object detected in the scene, wherein the input data comprises at least a classification for the object;\nidentifying one or more primitive events, related to a behavior engaged in by the object detected in the scene and wherein each primitive event has an assigned primitive event symbol;\ngenerating, for the object, a primitive event symbol stream;\nforming a first vector representing the object; and\ncomparing the first vector to a stored vector to define a similarity measure.\n2. The computer-implemented method of claim 1, further comprising, applying a singular value decomposition (SVD) to the first vector to generate a second vector from the first vector, wherein the second vector reduces the dimensionality of the first vector.\n3. The computer-implemented method of claim 1, wherein the classification for the object specifies that the object depicts one of a vehicle object, a person object, or an unknown object.\n4. The computer-implemented method of claim 3, wherein the object is classified as a person, and wherein the input data further includes a posture of the person as depicted in the scene.\n5. The computer-implemented method of claim 3, wherein the object is classified as a vehicle, and wherein the input data further comprises behavior engaged in by the vehicle that includes one or more of appearing, moving, turning and stopping.\n6. The computer-implemented method of claim 3, wherein the object is classified as a person, and wherein the input data further comprises behavior engaged in by the person that includes one or more of appearing, moving, turning and stopping.\n7. The computer-implemented method of claim 3, wherein the object is classified as an unknown object, and wherein the input data further comprises behavior engaged in by the unknown object that includes one or more of appearing, moving, turning and stopping.\n8. The computer-implemented method of claim 1, wherein the first vector is generated by a machine learning engine.\n9. A non-transitory computer-readable medium containing a program, which, when executed on a processor is configured to perform an operation for processing data related to a scene depicted in a sequence of video frames, comprising:\nreceiving input data describing an object detected in the scene, wherein the input data comprises at least a classification for the object;\nidentifying one or more primitive events, related to a behavior engaged in by the object detected in the scene and wherein each primitive event has an assigned primitive event symbol;\ngenerating, for the object, a primitive event symbol stream;\nforming a first vector representing the object; and\ncomparing the first vector to a stored vector to define a similarity measure.\n10. The non-transitory computer-readable medium of claim 9, further comprising, applying a singular value decomposition (SVD) to the first vector to generate a second vector from the first vector, wherein the second vector reduces the dimensionality of the first vector.\n11. The non-transitory computer-readable medium of claim 9, wherein the classification for the object specifies that the object depicted in the scene depicts one of a vehicle object, a person object, or an unknown object.\n12. The non-transitory computer-readable medium of claim 11, wherein the object is classified as a person, and wherein the input data further includes a posture of the person as depicted in the scene.\n13. The computer-implemented method of claim 9, wherein the first vector is generated by a machine learning engine.\n14. A system, comprising:\na video input source;\na processor; and\na memory storing computer instructions, which, when executed on the processor configure the processor to:\ninput data describing a scene depicted in a sequence of video frames, the input data comprises at least a classification for an object in a scene;\nidentify one or more primitive events, wherein each primitive event provides a semantic value describing a behavior engaged in by the object depicted in the scene and wherein each primitive event has an assigned primitive event symbol;\ngenerate, for the object, a primitive event symbol;\nform a first vector representing the object; and\ncompare the first vector to a stored vector to define a similarity measure.\n15. The system of claim 14, wherein the processor is further configured to apply a singular value decomposition (SVD) to the first vector to generate a second vector from the first vector, wherein the second vector reduces the dimensionality of the first vector representation.\n16. The system of claim 14, wherein the classification for the object specifies that the object depicted in the scene depicts one of a vehicle object, a person object, or an unknown object.\n17. The system of claim 16, wherein the object is classified as a person, and wherein the input data further includes a posture of the person as depicted in the scene.\n18. The system of claim 16, wherein the object is classified as a vehicle, and wherein the behavior engaged in by the vehicle includes one or more of appearing, moving, turning and stopping.\n19. The system of claim 16, wherein the object is classified as a person, and wherein the behavior engaged in by the person includes one or more of appearing, moving, turning and stopping.\n20. The system of claim 14, wherein the first vector is generated by a machine learning engine.",
    "status": "Active",
    "citations_own": [
        "US4679077A",
        "US5113507A",
        "US5323470A",
        "US5748775A",
        "US5751378A",
        "US5969755A",
        "US6252974B1",
        "US6263088B1",
        "US6570608B1",
        "US20030107650A1",
        "US20030113017A1",
        "US20030184844A1",
        "US6661918B1",
        "US6674877B1",
        "US6678413B1",
        "US20040151342A1",
        "US20050001759A1",
        "US6856249B2",
        "US20050105765A1",
        "US20050175219A1",
        "US6940998B2",
        "US20050240629A1",
        "US20060018516A1",
        "US7076102B2",
        "US20060165386A1",
        "US20060190419A1",
        "US20060222206A1",
        "US7123783B2",
        "US7136525B1",
        "US7158680B2",
        "US7200266B2",
        "US7227893B1",
        "US7251637B1",
        "US20080002856A1",
        "US20080181499A1",
        "US20080181453A1",
        "US20080193010A1",
        "US20080240496A1",
        "US7436887B2",
        "US20080252723A1",
        "US20090022364A1",
        "US20090067716A1",
        "WO2009049314A2",
        "US7545954B2",
        "US7551801B2",
        "US20090210367A1",
        "US20090297023A1",
        "US20090324107A1",
        "US20100063949A1",
        "US7825954B2",
        "US7864980B2",
        "US7868912B2",
        "US8411935B2"
    ],
    "citations_ftf": [
        "US4379077A",
        "US7136252B2"
    ],
    "citedby_own": [
        "CN111814775A",
        "US11495119B1"
    ],
    "citedby_ftf": [
        "US9378203B2",
        "US8189905B2",
        "KR101425605B1",
        "CA2988181C",
        "US11004093B1",
        "US8358834B2",
        "US8285060B2",
        "US9292855B2",
        "US8540518B2",
        "AU2009243442B2",
        "US8594482B2",
        "US8548203B2",
        "US20120209796A1",
        "US8855361B2",
        "JP5969502B2",
        "WO2012112756A1",
        "US8903128B2",
        "US8660368B2",
        "US9235499B2",
        "US8891872B2",
        "US20130173523A1",
        "IN2014DN08349A",
        "US9396621B2",
        "US20140328570A1",
        "EP2689650B1",
        "US9589190B2",
        "CN103150546B",
        "CN105518656A",
        "KR102016545B1",
        "US10354281B2",
        "CN103761532B",
        "US10186123B2",
        "US10708550B2",
        "US11297284B2",
        "US9530080B2",
        "US9354794B2",
        "US10140827B2",
        "US10127783B2",
        "US9082018B1",
        "US9501915B1",
        "US9449229B1",
        "US10747812B1",
        "USD782495S1",
        "US9913095B2",
        "US10409910B2",
        "US10409909B2",
        "CN104598889B",
        "US9576250B2",
        "US10176365B1",
        "US9613273B2",
        "CN104954741B",
        "US9715695B2",
        "GB201509636D0",
        "US9361011B1",
        "US10657543B2",
        "CN106327517B",
        "GB201512283D0",
        "US10692286B2",
        "US11601632B2",
        "US9818032B2",
        "EP3369252B1",
        "US10242455B2",
        "CN105740402B",
        "US10867216B2",
        "US9892326B2",
        "US10853661B2",
        "US9858340B1",
        "USD854074S1",
        "US10506237B1",
        "JP6928616B2",
        "US10606952B2",
        "US10380429B2",
        "US10957171B2",
        "US9916493B2",
        "US10055667B2",
        "CN106339667B",
        "US11681942B2",
        "WO2018084577A1",
        "US9852377B1",
        "JP7182554B2",
        "GB201620820D0",
        "US11205103B2",
        "US10044980B1",
        "CN110383291B",
        "WO2018191555A1",
        "EP3407273A1",
        "US11783010B2",
        "US11256951B2",
        "US10599950B2",
        "CN107330372B",
        "EP3432099B1",
        "CN107798047B",
        "USD855684S1",
        "US11330804B2",
        "CN109409165A",
        "US10664688B2",
        "US11134227B2",
        "WO2019090264A1",
        "CN108021865B",
        "US10824647B2",
        "EP3713487A4",
        "CN109918906B",
        "US10586044B2",
        "US20190236305A1",
        "US11455986B2",
        "US11308312B2",
        "WO2019161237A1",
        "US10162850B1",
        "US11568979B1",
        "US10621990B2",
        "US11157524B2",
        "US10733885B2",
        "US11159798B2",
        "US11633860B2",
        "US11185465B2",
        "US11151169B2",
        "US11312594B2",
        "FR3091111B1",
        "US10936974B2",
        "US11790245B2",
        "USD900428S1",
        "USD900431S1",
        "USD900430S1",
        "USD900429S1",
        "US10726374B1",
        "US11687795B2",
        "US11620557B2",
        "US11561983B2",
        "US11604867B2",
        "US11157475B1",
        "US11783005B2",
        "USD913194S1",
        "US11673657B2",
        "US10956181B2",
        "WO2020247800A1",
        "EP4004809A4",
        "CN110472531B",
        "US11386667B2",
        "US11699306B2",
        "US10930032B1",
        "CN110517506B",
        "US11423231B2",
        "US11526804B2",
        "US11449559B2",
        "US11556711B2",
        "WO2021050810A1",
        "US20210182387A1",
        "SE1951488A1",
        "US20210279619A1",
        "US11373069B2",
        "CN112115827B",
        "US11741588B2",
        "US11336789B1",
        "CN113033504B",
        "DE102021205480A1",
        "US11551407B1",
        "US11361034B1"
    ]
}