{
    "patent_id": "US-2019392328-A1",
    "title": "Cognitive computing systems and services utilizing internet of things environment ",
    "assignee": "International Business Machines Corporation",
    "publication_date": "2019-12-26",
    "patent_link": "https://patents.google.com/patent/US20190392328A1/en",
    "inventors": [
        "Francisco J. Gil Bulacio",
        "Patrick R. Madrones Rodriguez",
        "Javier E. A. Burgos Duran",
        "Juan P. Soto Gomez",
        "Juan C. Renzulli"
    ],
    "classifications": [
        "G06N5/022",
        "G06F15/173",
        "G06N5/025",
        "G06N5/041",
        "G06N5/046",
        "H04L41/14",
        "H04L41/16",
        "H04L41/40",
        "H04L63/16",
        "H04L67/12",
        "H04L41/0668",
        "H04L41/0677",
        "H04L41/5019",
        "H04L63/20"
    ],
    "abstract": "A system and method provide cognitive computing services, comprising: one or more Internet of Things (IoT) sensors; an edge analytics device that performs a preliminary analysis of the IoT sensor data; a cloud computing device of the cloud environment that stores a set of application programming interfaces (APIs) for interfacing between the cloud environment and the IoT sensors and an underlying infrastructure; an analytics device that performs analytics on the IoT sensor data; and a cognitive computing device that regulates one or more of the IoT sensors or the edge analytics device by modifying one or more rules performed by the one or more of the IoT sensors or the edge analytics device.",
    "claims": "\n1. A system for providing cognitive computing services in a decentralized computing infrastructure in which sensor data is distributable between one or more sensors and a set of remote computer servers hosted in a computer network, comprising:\na computing device at an edge of the computer network that is configured to receive the sensor data from the one or more sensors, and that is further configured to perform a preliminary analysis of the sensor data to validate the data to determine whether (i) the sensor data is to be transmitted across the computer network to the set of remote computer servers for further use by at least one computer selected from the group consisting of a first special-purpose computer and a second special-purpose computer or (ii) an analytics operation is to be generated on the sensor data at the edge of the computer network;\nthe first special-purpose computer that is configured to perform analytics on the sensor data by implementing an algorithmic process stored at the remote computer servers, wherein the process includes an analysis of data received by the remote computer servers; and\nthe second special-purpose computer that is configured to regulate rules performed by at least one device selected from the group consisting of the one or more sensors and the computing device at the edge of the computer network by generating an instruction to modify one or more of the rules according to a result of the analytics of the sensor data performed by the first special-purpose computer.\n2. The system of claim 1, wherein the computing device at the edge of the computer network device generates and outputs an early alert or notification in response to receiving and analyzing the sensor data.\n3. The system of claim 1, further comprising an Internet of Things (IoT) computer platform that executes a publish-subscribe framework for processing data exchanged with the first special purpose computer, wherein applications registered for a collection receives messages regarding the exchanged data, and is stored in a source repository connected to the first special purpose computer, wherein the first special purpose computer executes training data between the IoT platform and the first special purpose computer.\n4. The system of claim 1, wherein the computing device at the edge of the computer network device executes a business rule of the one or more rules to identify elements of the data to process locally.\n5. The system of claim 4, wherein the business rule is modified according to a current analysis performed by the computing device at the edge of the computer network device, the first special purpose computer, or the second special purpose computer.\n6. The system of claim 1, further comprising a security layer, monitoring layer, and governance and compliance layer that communicates with each of the computing device, remote servers, the first special purpose computer, and the second special purpose computer to provide security extending from the computing device to at least a cloud that includes at least one of the remote servers, the first special purpose computer, and the second special purpose computer.\n7. The system of claim 1, wherein the sensors are at an internal network of the edge of the network, and wherein the computing device determines a destination of the sensor data depending on whether a network failure is detected.\n8. The system of claim 1, wherein the computing device extends between the sensors and a backend computing system that includes an analytics system of the first special purpose computer so that the sensors generate signals that trigger early alerts or notifications from the rules that are processed by the computing device at the edge of the computer network and therefore does not extend to the backend system.\n9. A system for providing cognitive computing services, comprising:\na computing device that receives data from one or more Internet of Things (IoT) sensors and that performs a preliminary analysis of the IoT sensor data to validate the data to determine whether the data is to be transmitted across a network and receiving cognitive data to generate cognitive analytics locally at an edge of the network or whether the data, in response to a receipt of information regarding a failure whether to output the data to an auxiliary computing location, wherein in response to a receipt of a call complies with the a preprocessing of warning parameters; and\na special-purpose computer that uses the IoT sensor data to process a set of data analytics based on a corpus in which patterns and trends are established that incorporate artificial intelligence from the special-purpose computer.\n10. The system of claim 9, wherein the auxiliary computing location includes a cloud computing or support computing environment.\n11. The system of claim 9, further comprising a set of application programming interfaces (APIs) for establish a communication between the the IoT sensors and the special-purpose computer.\n12. The system of claim 11, further comprising another special-purpose computer that provides data analysis on the IoT sensor data at a remote storage location of the cloud APIs.\n13. The system of claim 12, further comprising an IoT platform that executes a publish-subscribe framework for processing data exchanged with the other special-purpose computer.\n14. The system of claim 11, further comprising a security layer that executes a security process that is applied to electronic devices of the system extending from the computing device to at least a cloud computing device, the electronic devices further including storage devices, network devices, and security devices.\n15. The system of claim 9, wherein the sensors are at an internal network of the edge of the network, and wherein the computing device determines a destination of the IoT sensor data.\n16. The system of claim 9, wherein the computing device extends between the IoT sensor devices and a backend computing system that includes an analytics device so that the IoT sensor devices generate signals that trigger early alerts or notifications from the rules that are processed by the computing device and therefore does not extend to the backend system.\n17. A method for cognitive computing, comprising:\nreceiving, by a processor of a computing system, data from one or more Internet of Things (IoT) sensors;\nperforming, by the processor, analytics at a network edge to match contents of the data with a predetermined business rule to involve an early action on the data;\nexecuting, by the processor, a cognitive process to address received inquiries related to the IoT sensor data; and\nchanging, by the processor, the business rule in real-time at the network edge in response to a result of the cognitive process.\n18. The method of claim 17, further comprising forming a subset of the IoT devices using a plurality of network topologies, protocols, and data formats.\n19. The method of claim 17, further comprising transporting a result of the data processed at the network edge over a network transmission between the network edge and a cloud computing system that provides an intelligent interconnection platform that executes the cognitive process.\n20. The method of claim 19, further comprising performing data analytics according to an algorithmic process executed by the cloud computing system."
}