{
    "patent_link": "https://patents.google.com/patent/US5737536A/en",
    "patent_id": "US5737536A",
    "title": "System and methods for optimized access in a multi-user environment",
    "abstract": "A client/server system providing methods of utilizing information stored locally on a client even after the client has modified data on the server is described. A client stores data from the server in a local \"read-only\" buffer(s), to speed up access to the data and reduce network traffic. Since the buffer is treated as a \"read only\" buffer, no locks are taken out at the server by the client. Accesses to particular data records are satisfied by looking first to the local buffer or cache. The client may proceed to modify the data records and commit changes back to the server. Moreover, the client updates or \"writes through\" the \"read-only\" buffer(s) with the changes so that the local buffer remains valid. The methods of updating data stored locally on the client provide significant performance increases as the client does not have to refresh data from the server.",
    "inventors": [
        "Conrad Herrmann",
        "Randolph T. Solton",
        "Raymond Shigeru Kiuchi"
    ],
    "assignee": "Borland Software Corp",
    "classifications": [
        "G09G5/393",
        "G06F16/24552"
    ],
    "claims": "\n1. In a system comprising a computer network comprising a server for storing information records which may be shared among a plurality of client workstations, each of said client workstations having a processor and a memory, a method for providing a client access to information records stored on the server, the method comprising the steps of:\nreceiving from a process executing at the client a request for access to particular records stored on the server;\nallocating a buffer in the memory of the client, said buffer for storing copies of said particular records;\ntransferring copies of said particular records from the server into the buffer of the client, said transferring step being performed with shared access to said particular records;\nsatisfying said request by providing said process access to said copies of said particular records from said buffer;\nreceiving at the client input for modifying at least one of said particular records;\ntransferring said modified at least one of said particular records from the client to the server;\nupdating copies of records in the buffer which correspond to said modified at least one of said particular records so that said step of transferring said modified at least one of said particular records from the client to the server does not render the buffer invalid; and\nperiodically marking the buffer as invalid regardless of whether modifications have been posted from clients to the server, upon expiration of a pre-selected time interval.\n2. The method of claim 1, wherein said particular records on the server includes database records stored in at least one record block on the server.\n3. The method of claim 2, wherein said step of transferring said modified at least one of said particular records from the client to the server includes transferring said at least one record block to the client.\n4. The method of claim 1, further comprising the step of marking the buffer as valid upon completion of said updating step.\n5. The method of claim 1, further comprising:\nreceiving a subsequent request from a process executing at the client for access to records stored on the server; and\nif the records of the subsequent request are in the buffer, satisfying said request by providing access to said copies of said particular records from said buffer.\n6. The method of claim 1, further comprising:\nreceiving a query condition for selecting particular records;\ncreating a filter bitmap of those records which meet the query condition; and\nupon occurrence of said step of transferring said modified at least one of said particular records from the client to the server, updating portions of said bitmap which correspond to said modified at least one of said particular records so that said transfer step does not render the bitmap invalid.\n7. The method of claim 6, wherein said step of creating a filter bitmap of those records which meet the query condition comprises setting a bit for each record which meets the query condition and resetting the bit for each record which does not meet the query condition.\n8. The method of claim 7, wherein said step of updating portions of said bitmap comprises:\nre-applying the query condition to each modified record, and setting a bit for each record which now meets the query condition and resetting the bit for each record which no longer meets the query condition.\n9. The method of claim 1, wherein said satisfying step includes:\nproviding said process executing at the client access to said copies of said particular records from said buffer by copying the records to a region in the memory of the client other than the buffer.\n10. A server-based networking system with improved data access, comprising:\na server having a storage device for storing records in blocks;\nat least one client operably coupled to said server through a communication line, each said at least one client having a processor and a memory;\nmeans for copying at least one of the blocks from the server into a local buffer in the memory of a client;\nmeans for accessing records from said local buffer;\nmeans, responsive to input at said client, for modifying records which are accessed from said local buffer;\nmeans for posting modified records to said server;\nmeans for determining whether any modified records posted to said server exist in said local buffer;\nmeans for updating copies of records in the local buffer which correspond to said records posted to said server from said client; and\nmeans for periodically marking said local buffer as invalid regardless of whether modifications have been posted from clients to the server, upon expiration of a preselected time interval.\n11. The system of claim 10, further comprising means for marking the buffer as valid when the buffer is updated.\n12. The system of claim 10, further comprising:\nmeans for receiving a query condition for selecting particular records;\nmeans for creating a filter bitmap of those records which meet the query condition; and\nmeans for updating portions of said bitmap which correspond to said modified at least one of said particular records so that said transfer step does not render the bitmap invalid, upon occurrence of said step of transferring said modified at least one of said particular records from the client to the server.\n13. The system of claim 10, wherein said means for copying at least one of the blocks from the server into a local buffer in the memory of the client includes:\nmeans for copying without exclusive access at least one of the blocks from the server into a local buffer in the memory of the client.\n14. A server-based networking system with improved data access comprising:\n(a) a server having a storage device;\n(b) at least one client operably coupled to said server through a communication line, each said at least one client having a processor and a memory;\n(c) means for transferring a valid copy of data from the storage device of the server to memory of a client;\n(d) means, responsive to a request for data, for providing access to the valid copy of the data in the memory of the client;\n(e) time-based means for periodically marking the copy as invalid regardless of whether modifications have been posted from clients to the server;\n(f) modification means for creating a modified copy of the data and posting the modified copy to the server; and\n(g) update means for updating the copy of the data in the memory of the client, upon posting the modified copy to the server.\n15. The system of claim 14, wherein said processor is an Intel® 80×86 class microprocessor and wherein said time-based means includes a real-time clock (RTC) capable of generating preemptive interrupts.\n16. The system of claim 15, wherein said time-based means includes means responsive to interrupts from the RTC for transferring a new copy of the data from the storage device of the server to the memory of the client.\n17. The system of claim 14, wherein said time interval is empirically selected to optimize data access.\n18. The system of claim 14, wherein the time interval is selected from a range of about 1 to 4 seconds.\n19. The system of claim 14, wherein the time interval substantially equals about 2 seconds.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4594656A",
        "US4714996A",
        "US4887204A",
        "US4897781A",
        "WO1991003024A1",
        "US5113519A",
        "US5133075A",
        "US5151989A",
        "US5265235A",
        "US5434994A",
        "US5493728A",
        "US5581704A",
        "US5603019A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5822764A",
        "WO1998054662A1",
        "US5898833A",
        "US5913213A",
        "US5913033A",
        "US5930472A",
        "US5933825A",
        "US5950203A",
        "US6003087A",
        "US6006238A",
        "US6026433A",
        "US6035324A",
        "US6041351A",
        "US6070184A",
        "US6081807A",
        "US6088694A",
        "US6098096A",
        "US6122637A",
        "WO2000058853A1",
        "US6169988B1",
        "US6233569B1",
        "US6243706B1",
        "US6330560B1",
        "US20020048269A1",
        "US20020052850A1",
        "US6401103B1",
        "US20020143973A1",
        "US20030046230A1",
        "US20030110159A1",
        "US20030145199A1",
        "US20030163748A1",
        "US20030218466A1",
        "US6658417B1",
        "US6665671B2",
        "US6691070B1",
        "US6694317B1",
        "EP1430419A2",
        "US6772220B1",
        "US20040186840A1",
        "US20040220940A1",
        "US6823337B2",
        "US20040236913A1",
        "US20040249902A1",
        "US20040260828A1",
        "US6865541B1",
        "US20050262103A1",
        "US6978272B1",
        "US6990659B1",
        "US20060142874A1",
        "US20060242390A1",
        "US7171913B1",
        "US20070033143A1",
        "US7181507B1",
        "US20070276916A1",
        "US20070282853A1",
        "US20080307005A1",
        "US20090046344A1",
        "US7577721B1",
        "US20090234917A1",
        "US7698274B1",
        "US20100223362A1",
        "US7856493B1",
        "US7860832B2",
        "US20130254246A1",
        "US8554684B2",
        "US8595502B2",
        "CN103955486A",
        "CN105260475A",
        "US9245260B2",
        "US20160028823A1",
        "US20170322734A1",
        "US20180175771A1",
        "US20180175768A1",
        "US20180175772A1",
        "EP3227789A4",
        "EP3642828A4"
    ],
    "citedby_ftf": []
}