{
    "patent_link": "https://patents.google.com/patent/US20100138360A1/en",
    "patent_id": "US20100138360A1",
    "title": "Financial market replicator and simulator",
    "abstract": "A financial market replicator, simulator, and trainer/annotator (FMRS) intermixes and records data streams of real time financial market data from a variety of sources. The FMRS replays such recorded data to simulate the real time financial market(s) in a manner that represents substantially the entirety of information relating to the financial market(s) such that an observer would have difficulty differentiating between the simulator playback of the data and real time data. A user may employ the playback of the recorded market data stream as a research and training tool for developing and executing trading strategies. For example, a user may input simulated trades of securities to test a trading strategy. The simulator would apply those trades to the recorded data to generate simulated trades and simulated profit and loss results. A user may then determine if the trading strategy would have been successful. In addition, a user may alter the recording and playback parameters to provide various opportunities for studying market activity and/or altering the level of challenge of the simulation. A user may also freeze the simulator playback in order to explore the interactive and collective behaviors of the market's participants and the securities they trade.",
    "inventors": [
        "Stephen Cutler",
        "William MacKenzie, III",
        "Evan Karl Cutler",
        "Steven Davis"
    ],
    "assignee": "Advanced Intellectual Property Group LLC",
    "classifications": [
        "G06Q40/04",
        "G06F3/0481",
        "G06Q40/06"
    ],
    "claims": "\n1. A method for replicating activity occurring in connection with at least one financial market comprising:\nreceiving a market data stream with an electronic receiver over a network interface for a predetermined symbol set containing symbols that are traded over the at least one financial market, wherein:\nthe predetermined symbol set includes symbols to which a user of the system has a subscription to receive financial market data as the financial market data becomes available; and\nthe market data stream includes market activity data items for the symbols in the predetermined symbol set;\nmaintaining a time order of time values associated with each data item so that is the time order of the data items replicates a time order of market events represented by the data items with respect to that at least one financial market; and\nrecording all of the time-ordered data items from the market data stream onto a computer readable medium so that the recorded data, when played back, represents a playback of the entirety of the market data pertaining to the predetermined symbol set.\n2. The method of claim 1, wherein the received market data stream comprises market activity data items for the symbols in the predetermined symbol set received from plural sources, and the maintaining step includes:\nintermixing data items from the plural sources so as to maintain the time order of time values associated with each data item so that the time order of the data items replicates a time order of market events represented by the data items, and recording the market data stream as intermixed.\n3. The method of claim 1, wherein the received market activity data items include at least Level I market activity data items for the symbols in the predetermined symbol set.\n4. The method of claim 1, wherein the received market activity data items include at least Level II market activity data items for the symbols in the predetermined symbol set.\n5. The method of claim 1, wherein the received market activity data items include at least news market activity data items for the symbols in the predetermined symbol set.\n6. The method of claim 1, wherein the predetermined symbol set contains symbols for substantially all symbols traded over one or more predetermined financial markets and the recorded data, when played back, represents substantially the entirety of the activity occurring in connection with the one or more predetermined financial markets.\n7. The method of claim 1, wherein the predetermined symbols and the subscription contain fewer symbols than substantially all symbols traded over one or more predetermined financial markets and the recorded data, when played back, represents a playback of the entirety of the market data that the user is entitled to track through the subscription.\n8. The method of claim 1, wherein the recording step comprises encoding the market data stream into data blocks for controlling the recording and parsing the market data stream.\n9. The method according to claim 8, wherein the data blocks comprise at least one of initialization blocks, market waypoint blocks, market streaming blocks, cache blocks, user waypoint blocks, freeze point blocks, alert blocks, user settings blocks, replay information blocks, or user metadata blocks.\n10. The method of claim 8, wherein the data blocks comprise at least Level I market activity data items for the predetermined symbol set at a known point in time and incremental changes to the data items from the known point in time to a subsequent point in time.\n11. The method of claim 8, wherein the data blocks comprise at least Level II market activity data items for the predetermined symbol set at a known point in time and incremental changes to the data items from the known point in time to a subsequent point in time.\n12. The method of claim 1, further comprising recording at least one waypoint to mark the recorded data stream at a corresponding market time.\n13. The method of claim 12, wherein when the recorded data stream is played back, the playback at least one of starts at a waypoint, ends at a waypoint, or plays between two waypoints.\n14. The method of claim 12, wherein when the recorded data stream is played back, the playback starts at a waypoint and plays back in a manner that is indistinguishable from a playback that starts prior to the waypoint.\n15. The method of claim 1, wherein when the recorded data stream is played back, the playback is substantially indistinguishable from a live market data stream for the market time period corresponding to the recorded market data stream.\n16. A method for replicating activity occurring in connection with at least one financial market comprising:\nreceiving a market data stream with an electronic receiver from a data source for a predetermined symbol set containing symbols that are traded over the at least one financial market, wherein:\nthe predetermined symbol set includes symbols to which a user of the system has a subscription to receive financial market data as the financial market data becomes available; and\nthe market data stream includes market activity data items for the symbols in the predetermined symbol set;\nmaintaining a time order of time values associated with each data item so that the time order of the data items replicates a time order of market events represented by the data items with respect to that at least one financial market; and\nplaying back the time-ordered data items from the market data stream through a financial market analytics and charting user interface so that the playback represents the entirety of the market data pertaining to the predetermined symbol set.\n17. The method of claim 16, wherein the received market activity data items include at least Level I market activity data items for the symbols in the predetermined symbol set.\n18. The method of claim 16, wherein the received market activity data items include at least Level II market activity data items for the symbols in the predetermined symbol set.\n19. The method of claim 16, wherein the received market activity data items include at least news market activity data items for the symbols in the predetermined symbol set.\n20. The method of claim 16, wherein the market data stream is received from a data source comprising a market data stream received over a network interface in real time, and the playback occurs substantially simultaneously with the receiving of the data.\n21. The method of claim 20, further comprising freezing the playback playback of the time-ordered data items from the market data stream.\n22. The method of claim 21, wherein the financial market analytics and charting user interface remains active for analyzing the market data stream at the point in market at which the playback of the market data stream is frozen.\n23. The method of claim 21, further comprising, while the playback is frozen, recording all of the time-ordered data items from the market data stream onto a computer readable medium so that the recorded data, when played back, represents a playback of the entirety of the market data pertaining to the predetermined symbol set.\n24. The method of claim 16, further comprising recording all of the time-ordered data items from the market data stream onto a computer readable medium so that the recorded data, when played back, represents a playback of the entirety of the market data pertaining to the predetermined symbol set.\n25. The method of claim 24, further comprising switching between a real-time mode in which the financial market analytics and charting user interface displays data in accordance with live market events, and a playback mode in which the financial market analytics and charting user interface displays the playback of the recorded data.\n26. The method of claim 16, wherein the market data stream is received from a data source comprising a computer readable medium storing a recording of all of the time-ordered data items from the market data stream so that the recorded data, when played back, represents a playback of the entirety of the market data pertaining to the predetermined symbol set.\n27. The method claim of 26, wherein the playback comprises decoding the recorded market data stream from data blocks for controlling the playback and parsing the market data stream.\n28. The method of claim 27, wherein the data blocks comprise at least one of initialization blocks, market waypoint t blocks, market streaming blocks, cache blocks, user waypoint blocks, freeze point blocks, alert blocks, user settings blocks, replay information blocks, and user metadata blocks.\n29. The method of claim 27, wherein the data blocks comprise at least the Level I market activity data items for the predetermined symbol set at a known point in time and incremental changes to the data items from the known point in time to a subsequent point in time.\n30. The method of claim 27, wherein the data blocks comprise at least the Level II market activity data items for the predetermined symbol set at a known point in time and incremental changes to the data items from the known point in time to a subsequent point in time.\n31. The method of claim 27, wherein the data blocks comprise at least the news market activity data items for the predetermined symbol set at a known point in time and incremental changes to the data items from the known point in time to a subsequent point in time.\n32. The method of claim 26, further comprising receiving a user input.\n33. The method of claim 32, wherein the user input is a trade associated with a symbol selected from the set of predetermined symbols, and the method further comprises simulating the execution of the trade.\n34. The method of claim 32, wherein the user input is criteria for triggering an alert, and the method further comprises generating an alert indicator when the data in the recorded market data stream satisfies the criteria of the alert.\n35. The method of claim 32, wherein the user input is criteria for triggering an alert, and the method further comprises generating an alert indicator when live market data being received by the financial market analytics and charting user interface satisfies the criteria of the alert.\n36. The method of claim 32, wherein the user input is a user note pertaining to a data item in the market data stream, and the method further comprises incorporating the note into the market data stream.\n37. The method of claim 36, wherein the user note is at least one of a text note, audio recording, video recording, metadata, or still image.\n38. The method of claim 32, further comprising recording results of the user input so that when the recorded market data stream is played back, the playback includes the results of the user input.\n39. The method of claim 26, further comprising altering a speed of the playback to speed up, slow down, or freeze the playback.\n40. The method of claim 39, further comprising receiving a user input.\n41. The method of claim 40, further comprising time-synchronizing the user input in accordance with the altered playback speed so that the user input is matched to the corresponding market time in the market data stream.\n42. The method of claim 41, wherein, when the playback is frozen, the user input is time-synchronized to correspond to the market time in the market data stream at which the playback is frozen.\n43. The method of claim 40, wherein the user input is a trade associated with a symbol selected from the set of predetermined symbols, and the method further comprises simulating the execution of the trade.\n44. The method of claim 40, wherein the user input is criteria for triggering an alert, and the method further comprises generating an alert indicator when the data in the recorded market data stream satisfies the criteria of the alert.\n45. The method of claim 26, further comprising controlling the playback in accordance with a user input, including at least one of freezing the playback, rewinding is the playback, fast-forwarding the playback, jumping to a point of the playback, or altering a speed of the playback to speed up or slow down the playback.\n46. The method of claim 26, wherein the recorded data stream includes at least one waypoint to mark the recorded data stream at a corresponding market time, and the playback at least one of starts at a waypoint, ends at a waypoint, or plays between two waypoints.\n47. The method of claim 26, wherein the recorded data stream includes at least one waypoint to mark the recorded data stream at a corresponding market time, and the playback starts at the waypoint and plays back in a manner that is indistinguishable from a playback that starts prior to the waypoint.\n48. The method of claim 16, wherein the playback is substantially indistinguishable from a live market data stream for the market time period corresponding to the recorded market data stream.\n49. A system for replicating activity occurring in connection with at least one financial market comprising:\nan electronic data receiver receiving a market data stream over a network interface for a predetermined symbol set containing symbols that are traded over the at least one financial market, wherein:\nthe predetermined symbol set includes symbols to which a user of the system has a subscription to receive financial market data as the financial market data becomes available; and\nthe market data stream includes market activity data items for the symbols in the predetermined symbol set; and\nan electronic processor configured to:\nmaintain a time order of time values associated with each data item so that the time order of the data items replicates a time order of market events represented by the data items with respect to that at least one financial market; and\nrecord all of the time-ordered data items from the market data stream onto a computer readable medium so that the recorded data, when played back, represents a playback of the entirety of the market data pertaining to the predetermined symbol set.\n50. The system of claim 49, wherein the received market data stream comprises market activity data items for the symbols in the predetermined symbol set received from plural sources, and the electronic process is configured to:\nmaintain the time order by intermixing data items from the plural sources so as to maintain the time order of time values associated with each data item so that the time order of the data items replicates a time order of market events represented by the data items; and\nrecord the market data stream as intermixed.\n51. The system of claim 49, wherein the received market activity data items include at least Level I market activity data items for the symbols in the predetermined symbol set.\n52. The system of claim 49, wherein the received market activity data items include at least Level II market activity data items for the symbols in the predetermined symbol set.\n53. The system of claim 49, wherein the received market activity data items include at least news market activity data items for the symbols in the predetermined symbol set.\n54. The system of claim 49, wherein the predetermined symbol set contains symbols for substantially all symbols traded over one or more predetermined financial markets and the recorded data, when played back, represents substantially the entirety of the activity occurring in connection with the one or more predetermined financial markets.\n55. The system of claim 49, wherein the predetermined symbols and the subscription contain fewer symbols than substantially all symbols traded over one or more predetermined financial markets and the recorded data, when played back, represents a playback of the entirety of the market data that the user is entitled to track through the subscription.\n56. The system of claim 49, wherein the electronic processor is configured to record the market data stream by encoding the market data stream into data blocks for controlling the recording and parsing the market data stream.\n57. The system of claim 56, wherein the data blocks comprise at least one of initialization blocks, market waypoint blocks, market streaming blocks, cache blocks, user waypoint blocks, freeze point blocks, alert blocks, user settings blocks, replay information blocks, or user metadata blocks.\n58. The system of claim 56, wherein the data blocks comprise at least Level I market activity data items for the predetermined symbol set at a known point in time and incremental changes to the data items from the known point in time to a subsequent point in time.\n59. The system of claim 56, wherein the data blocks comprise at least Level II market activity data items for the predetermined symbol set at a known point in time and incremental changes to the data items from the known point in time to a subsequent point in time.\n60. The system of claim 49, wherein the electronic processor is further configured to record at least one waypoint to mark the recorded data stream at a corresponding market time.\n61. The system of claim 60, wherein when the recorded data stream is played back, the playback at least one of starts at a waypoint, ends at a waypoint, or plays between two waypoints.\n62. The system of claim 60, wherein when the recorded data stream is played back, the playback starts at a waypoint and plays back in a manner that is indistinguishable from a playback that starts prior to the waypoint.\n63. The system of claim 49, wherein when the recorded data stream is played back, the playback is substantially indistinguishable from a live market data stream for the market time period corresponding to the recorded market data stream.\n64. A system for replicating activity occurring in connection with at least one financial market comprising:\nan electronic data receiver for receiving a market data stream from a data source for a predetermined symbol set containing symbols that are traded over the at least one financial market, wherein:\nthe predetermined symbol set includes symbols to which a user of the system has a subscription to receive financial market data as the financial market data becomes available; and\nthe market data stream includes market activity data items for the symbols in the predetermined symbol set; and\nand electronic processor configured to:\nmaintain a time order of time values associated with each data item so that the time order of the data items replicates a time order of market events represented by the data items with respect to that at least one financial market; and\nplay back the time-ordered data items from the market data stream through a financial market analytics and charting user interface so that the playback represents the entirety of the market data pertaining to the predetermined symbol set.\n65. The system of claim 64, wherein the received market activity data items include at least Level I market activity data items for the symbols in the predetermined symbol set.\n66. The system of claim 64, wherein the received market activity data items include at least Level II market activity data items for the symbols in the predetermined symbol set.\n67. The system of claim 64, wherein the received market activity data items include at least news market activity data items for the symbols in the predetermined symbol set.\n68. The system of claim 64, wherein the market data stream is received from a data source comprising a market data stream received over a network interface in real time, and the playback occurs substantially simultaneously with the receiving of the data.\n69. The system of claim 64, wherein the electronic processor is further configured to freeze the playback of the time-ordered data items from the market data stream.\n70. The system of claim 69, wherein the financial market analytics and charting user interface remains active for analyzing the market data stream at the point at which the playback of the market data stream is frozen.\n71. The method of claim 69, wherein the electronic processor is further configured to, while the playback is frozen, record all of the time-ordered data items from the market data stream onto a computer readable medium so that the recorded data, when played back, represents a playback of the entirety of the market data pertaining to the predetermined symbol set.\n72. The system of claim 64, wherein the electronic processor is further configured to record all of the time-ordered data items from the market data stream onto a computer readable medium so that the recorded data, when played back, represents a playback of the entirety of the market data pertaining to the predetermined symbol set.\n73. The system of claim 72, wherein the electronic data processor is further configured to switch between a real-time mode in which the financial market analytics and charting user interface displays data in accordance with live market events, and a playback mode in which the financial market analytics and charting user interface displays the playback of the recorded data.\n74. The system of claim 64, wherein the market data stream is received from a data source comprising a computer readable medium storing a recording of all of the time-ordered data items from the market data stream so that the recorded data, when played back, represents a playback of the entirety of the market data pertaining to the predetermined symbol set.\n75. The system claim of 74, wherein the electronic processor is configured to playback the recorded market data stream by decoding the recorded market data stream from data blocks for controlling the playback and parsing the market data stream.\n76. The system of claim 75, wherein the data blocks comprise at least one of initialization blocks, market waypoint t blocks, market streaming blocks, cache blocks, user waypoint blocks, freeze point blocks, alert blocks, user settings blocks, replay information blocks, and user metadata blocks.\n77. The system of claim 75, wherein the data blocks comprise at least the Level I market activity data items for the predetermined symbol set at a known point in time and incremental changes to the data items from the known point in time to a subsequent point in time.\n78. The system of claim 75, wherein the data blocks comprise at least the Level II market activity data items for the predetermined symbol set at a known point in time and incremental changes to the data items from the known point in time to a subsequent point in time.\n79. The system of claim 75, wherein the data blocks comprise at least the news market activity data items for the predetermined symbol set at a known point in time and incremental changes to the data items from the known point in time to a subsequent point in time.\n80. The system of claim 74, wherein the electronic processor is further configured to receive a user input.\n81. The system of claim 80, wherein the user input is a trade associated with a symbol selected from the set of predetermined symbols, and the electronic processor is further configured to simulate the execution of the trade.\n82. The system of claim 80, wherein the user input is criteria for triggering an alert, and the electronic processor is further configured to generate an alert indicator when the data in the recorded market data stream satisfies the criteria of the alert.\n83. The system of claim 80, wherein the user input is criteria for triggering an alert, and the electronic processor is further configured to generate an alert indicator when live market data being received by the financial market analytics and charting user interface satisfies the criteria of the alert.\n84. The system of claim 80, wherein the user input is a user note pertaining to a data item in the market data stream, and the electronic processor is further configured to incorporate the note into the market data stream.\n85. The system of claim 84, wherein the user note is at least one of a text note, audio recording, video recording, metadata, or still image.\n86. The system of claim 80, wherein the electronic processor is further configured to record results of the user input so that when the recorded market data stream is played back, the playback includes the results of the user input.\n87. The system of claim 74, wherein the electronic processor is further configured to alter a speed of the playback to speed up, slow down, or freeze the playback.\n88. The system of claim 87, wherein the electronic processor is further configured to receive a user input.\n89. The system of claim 88, wherein the electronic processor is further configured to time-synchronize the user input in accordance with the altered playback speed so that the user input is matched to the corresponding market time in the market data stream.\n90. The system of claim 89, wherein, when the playback is frozen, the user input is time-synchronized to correspond to the market time in the market data stream at which the playback is frozen.\n91. The system of claim 88, wherein the user input is a trade associated with a symbol selected from the set of predetermined symbols, and the electronic processor is further configured to simulate the execution of the trade.\n92. The system of claim 88, wherein the user input is criteria for triggering an alert, and the electronic processor is further configured to generate an alert indicator when the data in the recorded market data stream satisfies the criteria of the alert.\n93. The system of claim 74, wherein the electronic processor is further configured to control the playback in accordance with a user input, including at least one of freezing the playback, rewinding the playback, fast-forwarding the playback, jumping to a point of the playback, or altering a speed of the playback to speed up or slow down the playback.\n94. The system of claim 74, wherein the recorded data stream includes at least one waypoint to mark the recorded data stream at a corresponding market time, and the playback at least one of starts at a waypoint, ends at a waypoint, or plays between two waypoints.\n95. The system of claim 74, wherein the recorded data stream includes at least one waypoint to mark the recorded data stream at a corresponding market time, and the playback starts at the waypoint and plays back in a manner that is indistinguishable from a playback that starts prior to the waypoint.\n96. The system of claim 64, wherein the playback is substantially indistinguishable from a live market data stream for the market time period corresponding to the recorded market data stream.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "WO1999022323A2",
        "US20040064395A1",
        "US20040254876A1",
        "US20070203783A1",
        "US20080027880A1",
        "US20080243572A1",
        "US20090132335A1",
        "US7774257B2",
        "US20110060677A1",
        "US7958043B2"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20080294985A1",
        "US20090103769A1",
        "US20110022964A1",
        "US20110153520A1",
        "US7990383B1",
        "US20120191627A1",
        "US20120198420A1",
        "US20130036353A1",
        "US20130151391A1",
        "US20130204602A1",
        "US20130346274A1",
        "US20140297742A1",
        "US20140359036A1",
        "US20150025873A1",
        "US20150066573A1",
        "US20150074017A1",
        "US20150127513A1",
        "US20150278950A1",
        "US20150356062A1",
        "US20160224995A1",
        "US20170236437A1",
        "US20170236438A1",
        "WO2017160992A1",
        "US9786014B2",
        "US10326862B2",
        "US20190213678A1",
        "CN110072129A",
        "CN110363619A",
        "WO2020023647A1",
        "WO2020232294A1",
        "US10915954B2",
        "US11551302B2",
        "US20230120849A1",
        "US11669347B2"
    ],
    "citedby_ftf": [
        "US9053196B2",
        "GB201020138D0",
        "JP5537454B2",
        "US20130185223A1",
        "US20140100989A1",
        "US10248962B2",
        "US9501611B2",
        "US10740292B2",
        "US10185996B2",
        "WO2017079447A1",
        "EP3529769A4",
        "US10497060B2",
        "US10812613B2",
        "CN107480988A"
    ]
}