{
    "patent_link": "https://patents.google.com/patent/US5991743A/en",
    "patent_id": "US5991743A",
    "title": "System and method for proactively monitoring risk exposure",
    "abstract": "The present invention discloses a system and method for proactively monitoring risk exposure. In this invention, risk related information is received at an input knowledge source. A shared database stores the risk related information received at the input knowledge source. A plurality of domain knowledge sources formulates a decision on how the risk related information in the shared database affects a predetermined risk category. An output knowledge source generates a risk related report in response to the decisions formulated by each of the plurality of domain knowledge sources. A risk analytics router routes the risk related information in the input knowledge source to the shared database, the risk related information in the shared database to at least one of the domain knowledge sources, the decisions formulated from the domain knowledge sources to the shared database, and the decisions from the shared database to the output knowledge source.",
    "inventors": [
        "Russell Robert Irving",
        "Angelika Dorothea Linden",
        "James Patrick Quaile"
    ],
    "assignee": "General Electric Co",
    "classifications": [
        "G06Q40/08",
        "G06Q40/06"
    ],
    "claims": "\n1. A system for monitoring risk exposure, comprising:\nan input knowledge source for receiving risk related information from a plurality of data sources;\na shared database for storing the risk related information received at the input knowledge source;\na plurality of domain knowledge sources for formulating a decision on how the risk related information in the shared database affects a predetermined risk category;\nan output knowledge source for generating a risk related report in response to the decisions formulated by each of the plurality of domain knowledge sources; and\na risk analytics router for routing the risk related information in the input knowledge source to the shared database, routing the risk related information in the shared database to at least one of the plurality of domain knowledge sources, routing the decisions formulated from the domain knowledge sources to the shared database, and routing the decisions from the shared database to the output knowledge source, the risk analytics router comprising means for notifying the plurality of domain knowledge sources that risk related information is being stored in the shared database and means for polling the plurality of domain knowledge sources to act on the risk related information in the shared database.\n2. The system according to claim 1, wherein the input knowledge source comprises means for notifying the risk analytics router that risk related information has been received and is being stored in the shared database.\n3. The system according to claim 1, wherein the input knowledge source comprises means for translating the risk related information from the plurality of data sources into data objects.\n4. The system according to claim 1, wherein each of the plurality of domain knowledge sources comprises means for generating a bid to act on the risk related information in response to the polling from the risk analytics router.\n5. The system according to claim 4, wherein the shared database comprises a bid list for receiving bids generated from the plurality of domain knowledge sources.\n6. The system according to claim 5, wherein the risk analytics router further comprises a scheduler for prioritizing the bids and assigning tasks to be performed by the plurality of domain knowledge sources.\n7. The system according to claim 6, wherein the risk analytics router further comprises a dispatcher for dispatching the assigned tasks to the plurality of domain knowledge sources.\n8. The system according to claim 7, wherein each of the plurality of domain knowledge sources comprises means for updating the risk related information in the shared database according to the formulated decisions.\n9. The system according to claim 1, wherein the output knowledge source comprises means for sending the risk related report to a risk manager for proactively monitoring the risk exposure of a portfolio of clients.\n10. A method for monitoring risk exposure, comprising the steps of:\nreceiving risk related information from a plurality of data sources with an input knowledge source;\nstoring the risk related information received at the input knowledge source with a shared database;\nnotifying a risk analytics router that risk related information has been received and is being stored in the shared database;\nnotifying the plurality of domain knowledge sources with the risk analytics router that risk related information is being stored in the shared database;\npolling the plurality of domain knowledge sources with the risk analytics router to act on the risk related information;\nrouting the risk related information in the shared database to at least one of a plurality of the polled domain knowledge sources with the risk analytics router;\nformulating a decision on how the risk related information in the shared database affects a predetermined risk category with at least one of the plurality of domain knowledge sources;\nrouting the decisions formulated from the domain knowledge sources to the shared database with the risk analytics router;\nrouting the decisions from the shared database to an output knowledge source with the risk analytics router; and\ngenerating a risk related report from the decisions with an output knowledge source.\n11. The method according to claim 10, further comprising translating the risk related information received at the input knowledge source into data objects.\n12. The method according to claim 10, further comprising generating a bid from the plurality of domain knowledge sources to act on the risk related information in response to the polling from the risk analytics router.\n13. The method according to claim 12, further comprising generating a bid list for receiving bids generated from the plurality of domain knowledge sources.\n14. The method according to claim 13, further comprising prioritizing the bids and assigning tasks to be performed by the plurality of domain knowledge sources with a scheduler.\n15. The method according to claim 14, further comprising dispatching the assigned tasks to the plurality of domain knowledge sources with a dispatcher.\n16. The method according to claim 15, further comprising updating the risk related information in the shared database according to the formulated decisions.\n17. The method according to claim 10, further comprising sending the risk related report to a risk manager for proactively monitoring the risk exposure of a portfolio of clients.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US5101362A",
        "US5448722A",
        "US5506999A",
        "US5644727A",
        "US5696907A",
        "US5701400A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20010037284A1",
        "US20010051960A1",
        "US20020103747A1",
        "US20020120560A1",
        "US20020129221A1",
        "US20020138417A1",
        "US20020165841A1",
        "US20020178046A1",
        "US20020188556A1",
        "US20020188543A1",
        "US20030040955A1",
        "US20030046128A1",
        "US20030069742A1",
        "US20030088492A1",
        "US20030093347A1",
        "US20030163405A1",
        "US20030177087A1",
        "US20030187766A1",
        "US20030233319A1",
        "US20030233260A1",
        "US20040006532A1",
        "US20040024694A1",
        "US20040024693A1",
        "US20040024667A1",
        "WO2004021102A2",
        "US20040049473A1",
        "US20040083165A1",
        "US20040103050A1",
        "US6757668B1",
        "US20040138998A1",
        "US20040153330A1",
        "US20040164961A1",
        "US20050044037A1",
        "US20050055300A1",
        "US20050086155A1",
        "US20050091151A1",
        "US20050125259A1",
        "US20050131796A1",
        "US20050144114A1",
        "US20050154617A1",
        "US6925443B1",
        "SG114635A1",
        "US20050216008A1",
        "US20050251470A1",
        "US20050267835A1",
        "US20050267832A1",
        "US20060004719A1",
        "US20060004878A1",
        "US20060002387A1",
        "US7003483B1",
        "US7089207B1",
        "US7113914B1",
        "WO2006110121A1",
        "US20070055708A1",
        "US7213002B2",
        "US7249138B1",
        "US7263503B1",
        "US20070276744A1",
        "US7305351B1",
        "US7308427B1",
        "US7337134B1",
        "US7343332B1",
        "US7349875B1",
        "US7349874B1",
        "US7373324B1",
        "US7383214B1",
        "US7409365B1",
        "US7418415B1",
        "US20080249788A1",
        "US7461025B1",
        "US20090043712A1",
        "US7512554B1",
        "US7584112B1",
        "US20090248363A1",
        "US20090292648A1",
        "US7660763B1",
        "US7676425B1",
        "US7680709B1",
        "US7707111B2",
        "US20100138354A1",
        "US7747463B1",
        "US7752100B1",
        "US7756896B1",
        "US7753259B1",
        "US7778909B2",
        "US7784682B2",
        "US7801816B2",
        "US7805368B2",
        "US7809595B2",
        "US7809641B2",
        "US7835959B1",
        "US7835958B1",
        "US7844526B1",
        "US7844515B1",
        "US7844516B1",
        "US7860789B2",
        "US20110040665A1",
        "US7899722B1",
        "US7904361B2",
        "US20110066590A1",
        "US20110066457A1",
        "US20110066589A1",
        "US7941355B1",
        "US7953663B1",
        "US7958027B2",
        "US7970722B1",
        "US7970681B1",
        "US20110196808A1",
        "US8020754B2",
        "US8033451B2",
        "US8069105B2",
        "US8121937B2",
        "US8140415B2",
        "US8145549B2",
        "US8234156B2",
        "US8239323B2",
        "US8266025B1",
        "US8408455B1",
        "US8417601B1",
        "US8533111B1",
        "US8630898B1",
        "US8635130B1",
        "US8676642B1",
        "US8719085B2",
        "US8751391B2",
        "US8762191B2",
        "US8781905B2",
        "US8793160B2",
        "US8800857B1",
        "US8949163B2",
        "US8996481B2",
        "US9240089B2",
        "US9990642B2",
        "US20180211312A1",
        "US10282536B1"
    ],
    "citedby_ftf": []
}