{
    "patent_link": "https://patents.google.com/patent/US4438497A/en",
    "patent_id": "US4438497A",
    "title": "Adaptive strategy to control internal combustion engine",
    "abstract": "This specification discloses a method for adaptively controlling engine calibration control values. The strategy includes the steps of (1) predicting a driving pattern based on analysis of recent past driving patterns and (2) selecting engine control values appropriate for the predicted driving pattern and a desired emission constraint. The adaptive strategy adjusts spark timing and magnitude of EGR as a function of engine energy usage per distance traveled while maintaining feedgas emissions at a constant level over a wide variety of driving patterns including urban, suburban and highway. A plurality of driving cycle segments are analyzed to generate a table of engine calibration control values for the adaptive spark and EGR control strategy. This adaptive strategy has fuel consumption characteristics which are most advantageous at the most constrained feedgas levels. Drivability can be enhanced because of the greater calibration flexibility inherent to the adaptive technique.",
    "inventors": [
        "Frederick G. Willis",
        "Richard R. Radtke",
        "Joseph Ellison",
        "Steven R. Fozo",
        "Glenn A. Kern"
    ],
    "assignee": "Ford Motor Co",
    "classifications": [
        "F02P5/1455",
        "F02B2075/027",
        "Y02T10/40"
    ],
    "claims": "\n1. A method for controlling the performance of a spark ignited automobile internal combustion engine using exhaust gas recirculation, the engine being responsive to the magnitude of engine control parameters, said method including the steps of:\nestablishing a duration of time to determine the frequency of updating the engine control parameters;\ndetermining the energy density output of the engine over the first duration of time, wherein energy density output is the energy output divided by the distance traveled during the first duration of time;\nmaintaining a history of distance traveled and energy output during a plurality of successive consecutive durations of time;\nestimating the magnitude of energy density output of the engine during the next duration of time;\nestablishing a lookup table for EGR and spark advance as functions of engine torque, engine speed, and engine energy density;\nselecting a value from the table as a function of the estimated energy density for use during the next duration of time; and\ncontrolling the engine EGR and engine spark advance in accordance with the value selected from the table as a function of the estimated energy density thereby improving engine operation for higher efficiency.\n2. A method as recited in claim 1 wherein said step of establishing a lookup table includes the steps of:\ngenerating a plurality of vehicle driving cycle segments relating vehicle speed with time;\nassociating vehicle speed versus time coordinates of a vehicle driving cycle segment with corresponding points of a discrete engine matrix of engine load versus engine speed thus describing engine operation during a driving cycle segment;\nselecting a target emission value;\ndetermining for each vehicle driving cycle, at each point of the discrete engine matrix, an optimal calibration of engine control variables including percent EGR and spark advance wo that fuel economy is maximized at the selected target emission value;\ncalculating for each vehicle driving segment one energy density representative of energy usage divided by distance traveled during the vehicle driving segment;\ncorrelating each point on the discrete engine matrix of a driving cycle segment with the energy density of the driving cycle segment; and\neliminating all but one when there is a plurality of the optimal calibrations of engine control variables associated with a point of a discrete engine matrix as a result of having a plurality of vehicle driving cycle segments to obtain a suggested tag group of engine control variables to be used with the associated energy density thereby defining each suggested tag group of engine control variables as a point on a three dimensional matrix having axes of energy, engine torque and engine speed.\n3. A method as recited in claim 2 further comprising the step of:\ncomparing the magnitudes of engine control variables associated with adjacent points on the discrete engine matrix; and\nadjusting the magnitudes of the engine control variables if the magnitudes are not sufficiently close together to permit desirable drivability characteristics of the vehicle engine.\n4. A method as recited in claim 2 further comprising:\nsimulating vehicle operation with an engine having a table of engine control variables as developed in claim 1;\ngenerating a predicted energy density for use with the table of engine control variables;\ncalculating a predicted fuel economy and emissions level;\ncomparing the predicted fuel economy and emission level to a desired fuel economy and emission level; and\nadjusting the magnitudes of the engine control variables to minimize the differences between the predicted and desired fuel economy and emission level.\n5. A method as recited in claim 4 wherein the step of generating a plurality of vehicle driving cycle segments includes:\ngenerating a plurality of driving cycles representing at least typical urban, suburban and highway driving patterns;\nsplitting each driving cycle into a plurality of driving cycle segments of approximately 45 seconds each;\ncalculating the engine speed and engine torque at about 1 second intervals during each driving cycle segment;\nreducing the number of engine speed and torque points to facilitate calculation; and\nthe number of driving cycles being sufficient so that at each point of the discrete engine matrix more than one calibration of engine control variables is generated, selection of the optimal calibration being based on the associated energy density.\n6. A method as recited in claim 4 wherein the step of generating a plurality of vehicle driving cycle segments includes:\ngenerating a plurality of driving cycles representing typical urban, suburban and highway driving patterns and the driving cycles being sufficient in number so that at each point of the discrete engine matrix more than one optimal calibration of engine control variables is generated;\nsplitting each driving cycle into segments; and\ncalculating the engine speed and torque at a plurality of periodic intervals during each driving cycle segment.\n7. A method as recited in claim 4 wherein the step of generating a predicted energy density includes the step of:\nsolving the following equation with the weighting factors A, B, and C as defined below:\nEstimated Cycle Energy/Mile=A(45 sec.energy/mil)+B(6 min.energy/mile)+C(22 min. energy/mile)\nNote: Assume that segment n below is the most recent completed segment, segment n-1 precedes n, and n-2 precedes n-1.\n______________________________________                                    \nCriterion              A       B     C                                    \n______________________________________                                    \n1.    Highly variable driving:                                            \n                           0       0   1                                  \n      Energy density (n-1) differs                                        \n      from energy density (n) by                                          \n      more than 25%.                                                      \n2.    Consistent Driving: Energy                                          \n                           0.5     0.5 0                                  \n      density (n-1) differs from                                          \n      energy (n) by less than 25%                                         \n      AND (n-2) differs from (n-1)                                        \n      by more than 25%.                                                   \n3.    Consistent Driving: Energy                                          \n                           0.4     0.6 0                                  \n      density (n-1) differs from                                          \n      energy density (n) by less                                          \n      than 25% AND (n-2) differs                                          \n      from (n-1) by less than 25%.                                        \n______________________________________                                    \n8. A method as recited in claim 6 wherein said step of generating a plurality of vehicle driving cycles includes generating a sufficient number of diversity of driving cycle segments so that the energy densities corresponding to the driving cycles have at least one entry in each of the following energy density ranges.\n>0.7\n>0.7 and ≦0.8\n>0.8 and ≦0.9\n>0.9 and ≦1.0\n>1.0 and ≦1.1\n>1.1 and ≦1.2\n>1.2\nwherein the unit for the energy density are HP-hours/mile.\n9. A method as recited in claim 8 wherein said step of determining the engine operating characteristics includes:\ncalculating the energy density from the engine energy output during a driving cycle, velocity parameters, and time parameters; and\napplying a desired torque and RPM to the engine and then evaluating the corresponding percent EGR, spark advance and emission levels.\n10. A method as recited in claim 9 wherein the step of associated vehicle speed versus time coordinates of a driving cycle segment with corresponding points of a discrete engine matrix includes:\nsimulating the characteristic of a vehicle powertrain coupled to the vehicle engine, the powertrain characteristics including the vehicle characteristic of weight, transmission characteristics and road load; and\nthe step of determining engine characteristics includes using dynamic programming.\n11. A method as recited in claim 1 wherein the step of estimating the magnitude of energy density output includes the steps of:\ngenerating a short term energy output average during a relatively short duration length of time;\ngenerating a medium term energy output average during a medium duration length of time, said medium duration being longer than said short duration;\ngenerating a long term energy output average during a relatively long duration of time, said long duration being longer than said medium duration;\ngenerating an estimated future energy output by combining a weighted sum of the short term, medium term and long term energy outputs, the weighting being a coefficient A for the short term output, a coefficient B for the medium term output and a coefficient C for the long term output.\n12. A method as recited in claim 11 wherein generating the estimated future energy output includes the steps of generating short term, medium term and long term energy outputs at least about every 45 seconds.\n13. A method as recited in claim 11 wherein:\nsaid short term output is an average over about 45 seconds;\nsaid medium term output is an average over about 6 minutes; and\nsaid long term output is an average over about 22 minutes.\n14. A method as recited in claim 11 wherein generating an estimated future energy output includes the steps of:\nstoring three sequential short term energy output averages, a first short term average, a second short term average, and a third short term average, the third short term average being the energy usage signal most recent in time; and\nsetting coefficient C for the long term energy output to be greater than the sum of coefficients A and B when the magnitude of the second short term average differs from the magnitude of the third short term average by more than 25% of the magnitude of the second short term average thereby indicating highly variable driving and achieving engine control stability by an increased weighting of the long term energy output average.\n15. A method as recited in claim 11 wherein generating an estimated future energy usage includes the steps of:\nstoring three sequential short term energy output averages, a first short term average, a second short term average, and a third short term average, the third short term average being the energy output signal most recent in time; and\nsetting coefficients A and B substantially equal to each other when the magnitude of the second short term average differs from the magnitude of the third short term average by less than 25% of the magnitude of the second short term average and the first short term average differs from the magnitude of the second short term average by more than 25% of the magnitude of the first short term average thus providing a first indication of consistent driving.\n16. A method as recited in claim 11 wherein generating an estimated future energy output includes the steps of:\nstoring three sequential short term energy output averages, a first short term average, a second short term average, and a third short term average, the third short term average being the energy output signal most recent in time; and\nsetting coefficient B to be greater than coefficient A when the magnitude of the second short term average differs from the magnitude of the third short term average by less than 25% of the magnitude of the second short term average, and the magnitude of the first short term average differs from the magnitude of the second short term average by less than 25% of the magnitude of the first short term average.\n17. A method as recited in claim 11 wherein coefficients A=0.5, B=0, C=1.\n18. A method as recited in claim 11 wherein coefficients A=0.5, B=0.5, C=0.\n19. A method as recited in claim 11 wherein coefficient A=0.4, B=0.6, C=0.\n20. A method of controlling the performance of a spark ignited automobile internal combustion engine using exhaust gas recirculating, said method including the steps of:\ngenerating an electrical signal representative of engine revolution speed;\ngenerating an electrical signal representative of engine manifold absolute pressure;\ngenerating an electrical signal representative of energy density which includes energy output as a function of distance traveled of the automobile internal combustion engine;\nselecting a spark angle from a set of spark angles arranged as a function of engine revolution speed, manifold absolute pressure and energy consumption;\nselecting a percent of exhaust gas recirculation (EGR) from a set of EGR percents arranged as a function of engine revolution speed, manifold absolute pressure and energy consumption; and\ncontrolling the engine spark angle and engine percent of EGR by using the selected spark angle and percent EGR selected thereby operating the engine as a function of engine energy consumption.\n21. A method of controlling performance as recited in claim 20 wherein generation of different energy output signals can result in the same relationship between revolution speed and engine torque.\n22. A method of controlling performance as recited in claim 20 wherein generation of the signal representative of energy output includes the steps of:\ngenerating a signal representative of power consumed;\ngenerating a signal representative of time elapsed; and\ngenerating a signal representative of distance traveled.\n23. A method as recited in claim 20 wherein the steps of selecting a spark angle and percent EGR as a function of engine rotation speed, manifold absolute pressure and energy consumption includes the steps of:\ngenerating a sufficiently large number of driving cycle segments relating vehicle speed with time, each driving cycle segment being approximately 45 seconds in duration, so that at each point in a control parameter matrix there is at least one entry (tag) representing engine calibration control values including spark advance and percent EGR, the control parameter matrix being defined by a first axis representing energy density in a plurality of ranges and a second axis representing a plurality of different combinations of engine load and engine speed;\nselecting a target emission value; and\noptimizing the engine calibration control values at the points on the control parameter matrix having more than one set of engine calibration control values so as to maximize fuel economy while maintaining emissions below the target value.\n24. A method as recited in claim 20 wherein the steps of selecting a spark angle and percent EGR as a function of engine rotation speed, manifold absolute pressure and energy consumption includes the steps of:\ngenerating a sufficiently large number of driving cycle segments relating vehicle speed with time, each driving cycle segment being approximately 45 seconds, in duration, so that at each point in a control parameter matrix there is at least one entry (tag) representing engine calibration control values including spark advance and percent EGR, the control parameter matrix being defined by a first axis representing energy density in a plurality of ranges and a second axis representing a plurality of different combinations of engine load and engine speed;\nselecting a target emission value; and\noptimizing the engine calibration control values at the points on the control parameter matrix having more than one set of engine calibration control values so as to; maximize fuel economy while maintaining emissions below the target value;\nestablishing an association between energy densities and a representation in an engine speed versus load plane, defined by axes of engine speed and load, of a plurality of automobile velocities as a function of time;\nestablishing for each speed load point an association between operating conditions (spark advance and EGR) and energy densities, emissions and fuel economy;\nselecting a desired target value for emissions; and\nselecting operating conditions which maximize fuel economy at the desired target value for emissions.\n25. A method as recited in claim 20 wherein the steps of selecting a spark angle and percent EGR as a; function of engine rotation speed, manifold absolute pressure and energy consumption includes the steps of:\ngenerating a sufficiently large number of driving cycle segments relating vehicle speed with time, each driving cycle segment being approximately 45 seconds in duration, so that at each point in a control parameter matrix there is at least one entry (tag) representing engine calibration control values including spark advance and percent EGR, the control parameter matrix being defined by a first axis representing energy density in a plurality of ranges and a second axis representing a plurality of different combinations of engine load and engine speed;\nselecting a desired value for emission;\ndeveloping an optimized first set of calibration values for a first driving cycle relating velocity and time, the first set of calibration values being a function of engine torque, RPM and energy density; and\nselecting between calibration values of the first set and calibration values of the second set at any point of engine torque, RPM and energy density where the calibration values of the first and second sets are different, said selecting between the first and second sets including selecting operating conditions which maximize fuel economy at the desired target value for emissions.\n26. A method as recited in claim 25 wherein generation of the signal representative of energy consumed includes the steps of:\ngenerating a signal representative of torque;\ngenerating a signal representative of engine speed;\ngenerating a signal representative of time elapsed; and\ngenerating a signal representative of distance traveled.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US3816717A",
        "US3835819A",
        "US3846760A",
        "US3862404A",
        "US3888220A",
        "US3906205A",
        "US3916170A",
        "US3969614A",
        "US4026251A",
        "US4038526A",
        "US4086884A",
        "US4098243A",
        "US4099495A",
        "US4309971A",
        "US4322800A",
        "US4353272A",
        "US4379333A"
    ],
    "citations_ftf": [
        "US4130863A",
        "US4234850A",
        "JPS55148937A"
    ],
    "citedby_own": [
        "US4852010A",
        "US5270935A",
        "US5273019A",
        "US5293553A",
        "US5528929A",
        "US5539638A",
        "WO1998003782A1",
        "WO1999002835A1",
        "US5899189A",
        "US6079258A",
        "US6151547A",
        "AU741457B2",
        "US20020179068A1",
        "US20030200191A1",
        "US20030200075A1",
        "US20030200189A1",
        "US20040019574A1",
        "US6757606B1",
        "US20040128058A1",
        "US20050008227A1",
        "US20050033709A1",
        "US20060101812A1",
        "US20060117750A1",
        "US20060137335A1",
        "US20060137347A1",
        "US20060137340A1",
        "US20060168945A1",
        "US20060213184A1",
        "US20060282197A1",
        "US20060287795A1",
        "US7155334B1",
        "US20070089715A1",
        "US20070089399A1",
        "US20070101977A1",
        "US20070144149A1",
        "US20070156363A1",
        "US7328577B2",
        "US7389773B2",
        "US20110071653A1",
        "US8265854B2",
        "US8504175B2",
        "US8602772B2",
        "US20130345925A1",
        "US20140081563A1",
        "US8949008B2",
        "US9650934B2",
        "US9677493B2",
        "US9704305B2",
        "CN108150333A",
        "US10036338B2",
        "US10124750B2",
        "US10235479B2",
        "US10272779B2",
        "US10309287B2",
        "US10415492B2",
        "US10423131B2",
        "US10503128B2",
        "US10621291B2",
        "CN112682200A",
        "US11057213B2",
        "US11156180B2",
        "WO2023109236A1"
    ],
    "citedby_ftf": [
        "DE3408215C2",
        "DE3408223C2",
        "GB8521663D0",
        "JP3951967B2",
        "AT518677B1"
    ]
}