{
    "patent_id": "US-11514915-B2",
    "title": "Global-to-local memory pointer networks for task-oriented dialogue ",
    "assignee": "Salesforce.Com, Inc.",
    "publication_date": "2022-11-29",
    "patent_link": "https://patents.google.com/patent/US11514915B2/en",
    "inventors": [
        "Chien-Sheng Wu",
        "Caiming Xiong",
        "Richard Socher"
    ],
    "classifications": [
        "G10L15/285",
        "G06F40/35",
        "G06F16/3329",
        "G06F16/3347",
        "G06F16/335",
        "G06N3/042",
        "G06N3/044",
        "G06N3/045",
        "G06N3/08",
        "G06N5/00",
        "G06N5/022",
        "G06N5/041",
        "G10L15/22",
        "G10L2015/225"
    ],
    "abstract": "A system and corresponding method are provided for generating responses for a dialogue between a user and a computer. The system includes a memory storing information for a dialogue history and a knowledge base. An encoder may receive a new utterance from the user and generate a global memory pointer used for filtering the knowledge base information in the memory. A decoder may generate at least one local memory pointer and a sketch response for the new utterance. The sketch response includes at least one sketch tag to be replaced by knowledge base information from the memory. The system generates the dialogue computer response using the local memory pointer to select a word from the filtered knowledge base information to replace the at least one sketch tag in the sketch response.",
    "claims": "\n1. A method for generating responses for a dialogue between a user and a computer, the method comprising:\nstoring a dialogue history and a knowledge base in a memory, wherein the dialogue history comprises information for a sequence of user utterances and computer responses exchanged during the dialogue, wherein the knowledge base comprises information that can be used in a dialogue computer response;\nreceiving, at the computer, a new utterance from the user;\ngenerating, in response to the new utterance, a global memory pointer comprising a vector of probabilities that corresponding object words exist in an expected system response based on a last hidden state of an encoder that encodes the dialogue history;\ngenerating a sketch response for the new utterance, the sketch response comprising at least one sketch tag to be replaced by knowledge base information from the memory;\nfiltering the knowledge base information in the memory using the global memory pointer;\ngenerating, by a decoder, at least one local memory pointer comprising a sequence of pointers into the knowledge base based on a global contextual representation of the new utterance modified by the global memory pointer; and\ngenerating the dialogue computer response using the local memory pointer to select a word from the filtered knowledge base information to replace the at least one sketch tag in the sketch response.\n2. The method of claim 1, wherein the dialogue history comprises a set of embedding matrices for the dialogue history information.\n3. The method of claim 1, wherein the knowledge base comprises a set of embedding matrices for the knowledge base information.\n4. The method of claim 1, wherein generating the global memory pointer comprises:\nencoding the new utterance to generate one or more hidden states; and\nquerying, using the one or more hidden states, the knowledge base information in the memory.\n5. The method of claim 1, wherein the global memory pointer comprises a vector having a plurality of elements, each element associated with an independent probability.\n6. The method of claim 1, wherein the local memory pointer comprises a sequence of pointers, each pointer for selecting a respective word from the filtered knowledge base information to replace a respective sketch tag in the sketch response.\n7. A non-transitory machine-readable medium comprising executable code which when executed by one or more processors associated with a computer are adapted to cause the one or more processors to perform a method comprising:\nstoring a dialogue history and a knowledge base in a memory, wherein the dialogue history comprises information for a sequence of user utterances and computer responses exchanged during the dialogue, wherein the knowledge base comprises information that can be used in a dialogue computer response;\nreceiving, at the computer, a new utterance from a user;\ngenerating, in response to the new utterance, a global memory pointer comprising a vector of probabilities that corresponding object words exist in an expected system response based on a last hidden state of an encoder that encodes the dialogue history;\ngenerating a sketch response for the new utterance, the sketch response comprising at least one sketch tag to be replaced by knowledge base information from the memory;\nfiltering the knowledge base information in the memory using the global memory pointer;\ngenerating, by a decoder, at least one local memory pointer comprising a sequence of pointers into the knowledge base based on a global contextual representation of the new utterance modified by the global memory pointer; and\ngenerating the dialogue computer response using the local memory pointer to select a word from the filtered knowledge base information to replace the at least one sketch tag in the sketch response.\n8. The non-transitory machine readable medium of claim 7, wherein the dialogue history comprises a set of embedding matrices for the dialogue history information.\n9. The non-transitory machine readable medium of claim 7, wherein the knowledge base comprises a set of embedding matrices for the knowledge base information.\n10. The non-transitory machine readable medium of claim 7, wherein generating the global memory pointer comprises:\nencoding the new utterance to generate one or more hidden states; and\nquerying, using the one or more hidden states, the knowledge base information in the memory.\n11. The non-transitory machine readable medium of claim 7, wherein the global memory pointer comprises a vector having a plurality of elements, each element associated with an independent probability.\n12. The non-transitory machine readable medium of claim 7, wherein the local memory pointer comprises a sequence of pointers, each pointer for selecting a respective word from the filtered knowledge base information to replace a respective sketch tag in the sketch response.\n13. A system for generating responses for a dialogue between a user and a computer, the system comprising:\na memory storing a dialogue history and a knowledge base, wherein the dialogue history comprises information for a sequence of user utterances and computer responses exchanged during the dialogue, wherein the knowledge base comprises information that can be used in a dialogue computer response;\nan encoder capable of receiving a new utterance from the user and generating, in response to the new utterance, a global memory pointer comprising a vector of probabilities that corresponding object words exist in an expected system response based on a last hidden state of an encoder that encodes the dialogue history, wherein the global memory pointer is used for filtering the knowledge base information in the memory; and\na decoder capable of generating at least one local memory pointer comprising a sequence of pointers into the knowledge base based on a global contextual representation of the new utterance modified by the global memory pointer and a sketch response for the new utterance, the sketch response comprising at least one sketch tag to be replaced by knowledge base information from the memory;\nwherein the system generates the dialogue computer response using the local memory pointer to select a word from the filtered knowledge base information to replace the at least one sketch tag in the sketch response.\n14. The system of claim 13, wherein the dialogue history comprises a set of embedding matrices for the dialogue history information.\n15. The system of claim 13, wherein the knowledge base comprises a set of embedding matrices for the knowledge base information.\n16. The system of claim 13, wherein the global memory pointer comprises a vector having a plurality of elements, each element associated with an independent probability.\n17. The system of claim 13, wherein the local memory pointer comprises a sequence of pointers, each pointer for selecting a respective word from the filtered knowledge base information to replace a respective sketch tag in the sketch response.\n18. The system of claim 13, wherein the memory comprises an end-to-end memory network.\n19. The system of claim 13, wherein the encoder comprises a context recurrent neural network.\n20. The system of claim 13, wherein the decoder comprises a sketch recurrent neural network.",
    "status": "Active",
    "citations_own": [
        "US20160350653A1",
        "US20170024645A1",
        "US20170032280A1",
        "US20170140240A1",
        "US9715496B1",
        "US20170243112A1",
        "US20170352347A1",
        "US20180060301A1",
        "US20180082171A1",
        "US20180121788A1",
        "US20180129931A1",
        "US20180129938A1",
        "US20180144208A1",
        "US20180268287A1",
        "US20180300317A1",
        "US20180300400A1",
        "US20180336453A1",
        "US20180336198A1",
        "US20180349359A1",
        "US20180373987A1",
        "US20190130897A1",
        "US20190130249A1",
        "US20190130248A1",
        "US20190130273A1",
        "US20190130312A1",
        "US20190130206A1",
        "US20190130896A1",
        "US10282663B2",
        "US20190149834A1",
        "US20190188568A1",
        "US10346721B2",
        "US20190251168A1",
        "US20190258939A1",
        "US20190258714A1",
        "US20190286073A1",
        "US20190295530A1",
        "US20190362020A1",
        "US20190362246A1"
    ],
    "citations_ftf": [
        "JP2569415B2",
        "WO2016151700A1",
        "JP2017224155A",
        "JP6218057B1"
    ],
    "citedby_own": [
        "US20210312265A1"
    ],
    "citedby_ftf": [
        "US10817650B2",
        "US11748414B2",
        "US11144542B2",
        "US10963652B2",
        "KR102281581B1",
        "US11537899B2",
        "US11573957B2",
        "US11640505B2",
        "US11487999B2",
        "US11416688B2",
        "US11256754B2",
        "US11669745B2",
        "US11562147B2",
        "US20210256069A1",
        "US11263476B2",
        "US11328731B2",
        "JP7367609B2",
        "US11625543B2",
        "US11720559B2",
        "US11625436B2",
        "US20220277186A1",
        "CN113076758B"
    ]
}