{
    "patent_link": "https://patents.google.com/patent/US7451123B2/en",
    "patent_id": "US7451123B2",
    "title": "Probability estimate for K-nearest neighbor",
    "abstract": "Systems and methods are disclosed that facilitate producing probabilistic outputs also referred to as posterior probabilities. The probabilistic outputs include an estimate of classification strength. The present invention intercepts non-probabilistic classifier output and applies a set of kernel models based on a softmax function to derive the desired probabilistic outputs. Such probabilistic outputs can be employed with handwriting recognition where the probability of a handwriting sample classification is combined with language models to make better classification decisions.",
    "inventors": [
        "John C. Platt",
        "Christopher J. C. Burges"
    ],
    "assignee": "Microsoft Technology Licensing LLC",
    "classifications": [],
    "claims": "\n1. A computer-implemented method of training a K nearest neighbor classifier, comprising:\nobtaining a set of data comprising a first subset of training data and a second subset of training data;\ntraining the K nearest neighbor classifier on the first subset of training data via receiving feature vectors of objects to be classified;\nsequentially processing the second subset of training data to compute K nearest neighbor classifier outputs for respective points of the second set of training data via outputting a classifier output vector and transforming distances between respective points of the first set and second set of training data, wherein transforming comprises a kernel function for taking an exponential of a negative of a scaled Euclidean distance between respective points of the first set and the second set to produce an associated Gaussian similarity measure;\ndetermining parameters for a parametric model according to the K nearest neighbor classifier outputs, and true outputs of respective points of the second set of training data, the K nearest neighbor classifier outputs indicate: a distance of an input to K nearest points, classes of the K nearest points, and identities of the K nearest points, wherein the parameters are trained via a second training set disjoint from a first training set used to train the K nearest neighbor classifier;\nconverting the computed classifier outputs to probabilistic outputs using a probability model, wherein the probability model is built with the classifier outputs and trained via processing various inputs and outputs so as to provide probabilistic outputs from within acceptable error thresholds;\nemploying the probabilistic outputs for recognition of at least one of: handwriting samples; medical images; faces; fingerprints; signals; automatic control phenomena; natural phenomena; and nucleotide sequences; and\nemploying a class of the K nearest neighbor classifier outputs to determine a class of the first subset of training data, the K nearest neighbor classifier outputs indicate at least one of: a distance of an input to K nearest points, classes of the K nearest points, and identities of the K nearest points.\n2. The method of claim 1, the training of the K nearest neighbor classifier comprises training with an error metric that is P-admissible in accordance with a P-admissible loss function L(y,y′) which, for any given x, is minimized at y′=Ε[y|x], where Ε[y|x] denotes the expectation of y for a fixed, given value of x.\n3. The method of claim 2, for a case of a single classifier output, minimizing an expectation of a P-admissible loss function over a joint distribution of x and y by replacing y by Ε[y|x] and then minimizing the expectation of the loss function over a marginal distribution p(x).\n4. The method of claim 1, training the K nearest neighbor classifier comprising a softmax function.\n5. The method of claim 1, training the K nearest neighbor classifier is performed in accordance with a trained parametric model for performing a plurality of rank-class computations.\n6. The method of claim 5, the rank-class computations comprising a comparison between a class output produced by a classifier and a second class.\n7. The method of claim 5, performing the rank-class computations comprises utilizing a lookup table having an index dependent on a class output produced by the classifier and the second class.\n8. The method of claim 5, performing the rank-class computations comprises utilizing a lookup table having an index dependent on an index output produced by the classifier.\n9. The method of claim 1, training the K nearest neighbor classifier using a trained parametric model comprising one lookup table per rank, the lookup table containing one entry for each example in a training set.\n10. A computer-implemented method of training a K nearest neighbor classifier, comprising:\nobtaining a set of data comprising a first subset of training data and a second subset of training data;\ntraining the K nearest neighbor classifier on the first subset of training data;\nsequentially processing the second subset of training data to compute K nearest neighbor classifier outputs for respective points of the second set of training data; and\ndetermining parameters for a parametric model according to the K nearest neighbor classifier outputs, and true outputs of respective points of the second set of training data, the K nearest neighbor classifier outputs indicate: a distance of an input to K nearest points, classes of the K nearest points, and identities of the K nearest points, wherein the parameters are trained via a second training set disjoint from a first training set used to train the K nearest neighbor classifier;\nconverting the computed classifier outputs to probabilistic outputs using a probability model, wherein the probability model is built with the classifier outputs and trained via processing various inputs and outputs so as to provide probabilistic outputs from within acceptable error thresholds; and\nemploying the probabilistic outputs for recognition of at least one of: handwriting samples; medical images; faces; fingerprints; signals; automatic control phenomena; natural phenomena; and nucleotide sequences.\n11. A system for performing handwriting recognition employing the method of claim 10.\n12. A computer readable medium storing computer executable instructions for performing the method of claim 10.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US5594807A",
        "US5880738A",
        "US5903884A",
        "US5943661A",
        "US6003027A",
        "US6038337A",
        "US6061472A",
        "US6151424A",
        "US6192360B1",
        "US6233575B1",
        "US6324532B1",
        "US6327581B1",
        "US6347309B1",
        "US20020150295A1",
        "US6519368B1",
        "US6629937B2",
        "US6728690B1",
        "US6732083B2",
        "US6782373B2",
        "US6895338B2",
        "US7003158B1",
        "US7107254B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20110188715A1",
        "US8903748B2",
        "US8942917B2",
        "US9268903B2",
        "US11215711B2",
        "US11710309B2",
        "US11817180B2"
    ],
    "citedby_ftf": [
        "US7711155B1",
        "US7266536B2",
        "US7421415B2",
        "JP4368767B2",
        "US7634405B2",
        "GB2429544A",
        "US8024282B2",
        "US7736905B2",
        "JP4603512B2",
        "US7860818B2",
        "US20080140399A1",
        "JP4241818B2",
        "US20080221395A1",
        "US8085186B1",
        "DE102008039199A1",
        "US7996343B2",
        "US8035549B1",
        "CN102770760A",
        "US8605093B2",
        "US9396545B2",
        "US8983940B2",
        "US8805116B2",
        "US9031331B2",
        "WO2014022441A1",
        "US8880563B2",
        "CN105308679A",
        "US9378466B2",
        "US10289962B2",
        "JP6122516B2",
        "US11334789B2",
        "US10546066B2",
        "US10733482B1",
        "CN107578014B",
        "US10721475B2",
        "US11366874B2",
        "US10803182B2",
        "CN110059766A",
        "US11568212B2",
        "US11429908B2",
        "CN112148909A"
    ]
}