{
    "patent_id": "US-2019080799-A1",
    "title": "Identifying and targeting personality types and behaviors ",
    "assignee": "Sony Interactive Entertainment LLC",
    "publication_date": "2019-03-14",
    "patent_link": "https://patents.google.com/patent/US20190080799A1/en",
    "inventors": [
        "Albhy Galuten"
    ],
    "classifications": [
        "G16H50/20",
        "G06N20/00",
        "G06N5/04",
        "G06N99/005",
        "G06Q30/0269",
        "G16H15/00",
        "G16H40/63",
        "G16H50/30",
        "G16H50/50"
    ],
    "abstract": "The present invention is a method and system for determining the behavioral type of individuals or groups of individuals based on the psychological models of Jung, Keirsey, Myers and Briggs and using that information to make informed suggestions, optimizations and advertising targeting about those individuals. Moreover, this system may use various types of artificial intelligence to create arbitrarily granular detail of psychological typing so as to be able to apply it broadly. This modeling may be continuously updated and refined as the system learns about the degree of success of each of its recommendations.",
    "claims": "\n1. A system for identifying and targeting personality types and behaviors, the system comprising:\na memory that stores information regarding a subject, the stored information for the subject including a plurality of personality categories, each category associated with a starting percentage;\na communication interface that receives behavioral information from a plurality of sources regarding the subject, wherein the received behavioral information associates one of the personality categories with an observed behavior by the subject; and\na processor that executes instructions stored in memory, wherein execution of the instructions by the processor:\nanalyzes the behavioral information, wherein analyzing the behavioral information includes identifying a weight for the observed behavior based on the associated personality category,\nupdates the stored information regarding the subject based on the starting percentage of the observed behavior as weighted by the identified weight; and\ngenerates a report based on an analysis of the updated stored information, the report including a plurality of personality axes, each axis reflecting a weighted percentage for an associated personality category.\n2. The system of claim 1, wherein the received behavioral information includes information regarding Internet usage by the subject.\n3. The system of claim 1, wherein the received behavioral information includes information regarding commercial activity by the subject.\n4. The system of claim 1, wherein the received behavioral information includes information regarding professional activity by the subject.\n5. The system of claim 1, wherein the report further includes a recommendation for optimizing a user experience for the subject.\n6. The system of claim 5, wherein the recommendation is based on filtering a plurality of user experience options using at least one associated personality category of the subject.\n7. The system of claim 5, wherein the communication interface further receives information regarding the optimized user experience that includes an observed interaction by the subject.\n8. The system of claim 7, wherein the processor further executes instructions stored in memory to adjust the user experience based on the observed interaction by the subject.\n9. The system of claim 7, wherein the memory is further updated regarding the observed interaction by the subject, and wherein the processor generates a report for another subject having a common weighted percentage for a common personality category based on the observed interaction by the subject.\n10. A method for identifying and targeting personality types and behaviors, the method comprising:\nstoring information in memory regarding a subject, the stored information for the subject including a plurality of personality categories, each category associated with a starting percentage;\nreceiving behavioral information via a communication interface from a plurality of sources regarding the subject, wherein the received behavioral information associates one of the personality categories with an observed behavior by the subject; and\nexecuting instructions stored in memory, wherein execution of the instructions by a processor:\nanalyzes the behavioral information, wherein analyzing the behavioral information includes identifying a weight for the observed behavior based on the associated personality category,\nupdates the stored information regarding the subject based on the starting percentage of the observed behavior as weighted by the identified weight; and\ngenerates a report based on an analysis of the updated stored information, the report including a plurality of personality axes, each axis reflecting a weighted percentage for an associated personality category.\n11. The method of claim 10, wherein the received behavioral information includes information regarding Internet usage by the subject.\n12. The method of claim 10, wherein the received behavioral information includes information behavioral information regarding commercial activity by the subject.\n13. The method of claim 10, wherein the received behavioral information includes information regarding professional activity by the subject.\n14. The method of claim 10, wherein the report further includes a recommendation for optimizing a user experience for the subject.\n15. The method of claim 14, wherein the recommendation is based on filtering a plurality of user experience options using at least one associated personality category of the subject.\n16. The method of claim 14, further comprising receiving information regarding the optimized user experience that includes an observed interaction by the subject.\n17. The method of claim 16, further comprising executing instructions stored in memory to adjust the user experience based on the observed interaction by the subject.\n18. The method of claim 16, further comprising updating the memory regarding the observed interaction by the subject, wherein generating a report for another subject having a common weighted percentage for a common personality category based on the observed interaction by the subject.\n19. A non-transitory computer-readable storage medium, having embodied thereon a program executable by a processor to perform a method for identifying and targeting personality types and behaviors, the method comprising:\nstoring information regarding a subject, the stored information for the subject including a plurality of personality categories, each category associated with a starting percentage;\nreceiving behavioral information from a plurality of sources regarding the subject, wherein the received behavioral information associates one of the personality categories with an observed behavior by the subject;\nanalyzing the behavioral information, wherein analyzing the behavioral information includes identifying a weight for the observed behavior based on the associated personality category;\nupdating the stored information regarding the subject based on the starting percentage of the observed behavior as weighted by the identified weight; and\ngenerating a report based on an analysis of the updated stored information, the report including a plurality of personality axes, each axis reflecting a weighted percentage for an associated personality category."
}