{
    "patent_id": "US-2022358379-A1",
    "title": "System, apparatus and method of managing knowledge generated from technical data ",
    "assignee": "Samyak Jain, Vinay Jayant Mundada, Chetan Jaydeep Ravada, Kaushik S Kalmady, Divja Nagaraju, Amlan Praharaj, Vinay Shankar Bhat, Shailesh Vishvakarma, Srinidhi Kulkarni",
    "publication_date": "2022-11-10",
    "patent_link": "https://patents.google.com/patent/US20220358379A1/en",
    "inventors": [
        "Samyak Jain",
        "Vinay Jayant Mundada",
        "Chetan Jaydeep Ravada",
        "Kaushik S Kalmady",
        "Divja Nagaraju",
        "Amlan Praharaj",
        "Vinay Shankar Bhat",
        "Shailesh Vishvakarma",
        "Srinidhi Kulkarni"
    ],
    "classifications": [
        "G06N5/04",
        "G06F16/3335",
        "G06F16/383",
        "G06F16/906",
        "G06F40/30",
        "G06N5/022"
    ],
    "abstract": "System, apparatus and method for managing knowledge generated from technical data are disclosed. The method comprising receiving a user query for technical data stored as a knowledge base (842A) on a knowledge-based system (842); determining, by an inference engine (822), a contextual relevance between the user query and the knowledge base (842A), wherein the knowledge base (842A) comprises a query-able framework of the technical data including processed textual sections and indexed images; identifying textual sections and images of the knowledge base (842A) associated with the user query based on the contextual relevance; determining, by the inference engine (822), relevancy of the identified textual sections and indexed images based on frequency of terms in the query with respect to the identified textual sections and the indexed images; and generating, by the inference engine (822), a response (818A) to the user query including extracted textual sections and indexed images having a relevancy score that exceeds a threshold.",
    "claims": "\n1. A computer-based method for managing knowledge generated from technical data, the computer-based method comprising:\nreceiving a user query for technical data stored as a knowledge base on a knowledge-based system;\ndetermining, by an inference engine, a contextual relevance between the user query and the knowledge base, wherein the knowledge base comprises a queryable framework of the technical data including processed textual sections and indexed images;\nidentifying textual sections and images of the knowledge base associated with the user query based on the contextual relevance;\ndetermining, by the inference engine, a relevancy score for each of the identified textual sections and indexed images based on frequency of terms in the query with respect to the identified textual sections and the indexed images; and\ngenerating, by the inference engine, a response to the user query including extracted textual sections and indexed images having a relevancy score that exceeds a threshold.\n2. The computer-based method of claim 1, further comprising:\n3. The computer-based method of claim 2, wherein extracting the textual sections in the technical data based on semantic parsing of the technical data comprises:\nidentifying ambiguous terms in the textual sections and the indexed images; and\nco-referencing, by the inference engine, the ambiguous terms, the co-referencing of the ambiguous terms comprising mapping the ambiguous terms to non-ambiguous terms in the technical data.\n4. The computer-based method of claim 3, further comprising:\nextracting triples for the technical data with the non-ambiguous terms, wherein the triples reflect the technical data as subject-verb-object; and\ndetermining term frequency and inverse document frequency for the triples.\n5. The computer-based method of claim 2, wherein extracting the indexed images by modifying the images in the technical data to identify regions of interest in the images comprises:\nmodifying the images in the technical data to enhance contours of the images while reducing dimensions of the images; and\nclassifying the images into types of images using a convolutional neural network, the types of images being charts, graphs, 3-dimensional images, or 2-dimensional images.\n6. The computer-based method of claim 5, further comprising:\nidentifying the image-text in each of the images in the technical data, wherein the image-text includes text associated with the images in the technical data;\ndetermining the coordinates of the image-text in the image;\ndetermining relevancy of the image-text to the textual section based on the coordinates of the image-text; and\npredicting the regions of interest in the images based on image-text identified on each of the images.\n7. The computer-based method of claim 6, wherein modifying the images in the technical data to enhance contours of the images while reducing the dimensions of the images comprises:\nnormalizing the images to a standard size while preserving aspect ratio of the images.\n8. The computer-based method of claim 4, further comprising:\ndetermining noun-phrases in the user query based on Parts of Speech (POS) tagging and noun chunking, such that the context relevancy is determined; and\ngenerating the relevancy score, the generating of the relevancy score comprising comparing the triples in the knowledge base with the noun-phrases.\n9. The computer-based method according to claim 8, wherein generating the relevancy score by comparing the triples in the knowledge base with the noun-phrases comprises:\ndetermining a semantic similarity between the noun-phrases in the question with noun-phrases in the triples; and\nidentifying the matching triples having noun-phrases that have similarity above the threshold.\n10. The computer-based method of claim 9, further comprising:\ndetermining query-term frequency and query-inverse document frequency for the user query; and\ncomparing the query-term frequency and query-inverse document frequency with the term frequency and the inverse document frequency of the triples.\n11. The computer-based method of claim 1, wherein generating the response to the user query comprises:\ngenerating one or more sub-queries for the user query;\ngenerating a sub-response for each of the one or more sub-queries; and\ngenerating the response to the user query based on the sub-response.\n12. The computer-based method of claim 1, wherein generating the response to the user query comprises:\nvisualizing the matching triples as a knowledge graph and a knowledge panel; and\nrendering the knowledge graph and the knowledge panel as the response to the user query.\n13. The computer-based method of claim 1, further comprising:\nmanaging the knowledge base on a distributed consensus-based ledger.\n14. An apparatus for managing knowledge generated from technical data, the apparatus comprising:\none or more processing units; and\na memory unit communicatively coupled to the one or more processing units, wherein the memory unit comprises a knowledge management module stored in the form of machine-readable instructions executable by the one or more processing units, wherein the knowledge management module is configured to manage knowledge generated from technical data, the management of the knowledge generated from the technical data comprising:\nreceipt of a user query for technical data stored as a knowledge base on a knowledge-based system;\ndetermination, by an inference engine, of a contextual relevance between the user query and the knowledge base, wherein the knowledge base comprises a queryable framework of the technical data including processed textual sections and indexed images;\nidentification of textual sections and images of the knowledge base associated with the user query based on the contextual relevance;\ndetermination, by the inference engine, of a relevancy score for each of the identified textual sections and indexed images based on frequency of terms in the query with respect to the identified textual sections and the indexed images; and\ngeneration, by the inference engine, of a response to the user query including extracted textual sections and indexed images having a relevancy score that exceeds a threshold.\n15. A system for managing knowledge generated from technical data, the system comprising:\na cloud computing platform comprising:\na knowledge management module configured to manage knowledge generated from technical data, the management of the knowledge generated from the technical data comprising:\nreceipt of a user query for technical data stored as a knowledge base on a knowledge-based system;\ndetermination, by an inference engine, of a contextual relevance between the user query and the knowledge base, wherein the knowledge base comprises a queryable framework of the technical data including processed textual sections and indexed images;\nidentification of textual sections and images of the knowledge base associated with the user query based on the contextual relevance;\ndetermination, by the inference engine, of a relevancy score for each of the identified textual sections and indexed images based on frequency of terms in the query with respect to the identified textual sections and the indexed images; and\ngeneration, by the inference engine, of a response to the user query including extracted textual sections and indexed images having a relevancy score that exceeds a threshold.\n16. (canceled)",
    "status": "Pending",
    "citations_own": [],
    "citations_ftf": [
        "US6076088A",
        "US8819006B1",
        "US11080295B2"
    ],
    "citedby_own": [
        "US20220253645A1"
    ],
    "citedby_ftf": [
        "CN112948508A",
        "WO2022250354A1",
        "US11687583B2"
    ]
}