{
    "patent_link": "https://patents.google.com/patent/US20030004850A1/en",
    "patent_id": "US20030004850A1",
    "title": "Auction management",
    "abstract": "A computer-implemented method for determining an optimal award schedule for at least partial satisfaction of a requisition includes receiving from a buyer over a computer network, public buyer constraints representative of the requisition. These public buyer constraints are made available to prospective suppliers over the computer network. Candidate suppliers from the set of prospective suppliers then submit bids for analysis by the buyer. This is followed by the determination of an optimal award schedule for at least partial satisfaction of the buyer's requisition.",
    "inventors": [
        "Ge Li",
        "Michael McCart",
        "Charles Rosa",
        "Avner Schneur",
        "Rina Schneur"
    ],
    "assignee": "International Business Machines Corp",
    "classifications": [
        "G06Q30/08",
        "G06Q40/04"
    ],
    "claims": "\n1. A computer-implemented method for determining an optimal award schedule for at least partial satisfaction of a requisition, said method comprising:\n2. 2. The method of claim 1, wherein receiving said public buyer-constraints from said buyer comprises receiving a list of items to be supplied.\n3. 3. The method of claim 2, wherein receiving said list of items comprises receiving a list in which at least one item in said list is a logical item that includes a list of items.\n4. 4. The method of claim 1, wherein receiving said public buyer-constraints comprises receiving a constraint from a group consisting of:\n5. 5. The method of claim 4, wherein said non-price constraint is selected from the group consisting of\n6. 6. The method of claim 1, wherein receiving said bid comprises receiving a bid including a proposed price for at least partial satisfaction of said requisition.\n7. 7. The method of claim 1, wherein receiving said bid comprises receiving a bid including a proposed price having a volume discount dependent on an extent to which said requisition is to be at least partially satisfied.\n8. 8. The method of claim 1, wherein receiving said bid comprises receiving a bid including a fixed charge independent of an extent to which said requisition is to be at least partially satisfied.\n9. 9. The method of claim 2, wherein receiving said bid comprises receiving a bundled bid offering to at least partially satisfy, for a bundled price, a requisition for a selection of items from said list of items.\n10. 10. The method of claim 1, further comprising facilitating an exchange of messages between a buyer and a candidate supplier.\n11. 11.The method of claim 10, further comprising facilitating the multi-casting of a message sent by said buyer to all candidate suppliers.\n12. 12.The method of claim 1, wherein determining an optimal award schedule comprises considering a performance attribute for a candidate supplier.\n13. 13.The method of claim 12, wherein considering a performance attribute comprises selecting an attribute from the group consisting of\n14. 14.The method of claim 12, wherein considering a performance attribute comprises considering a weight supplier by said buyer, said weight being indicative of an extent to which said performance attribute is to be considered in determining said optimal award schedule.\n15. 15.The method of claim 14, wherein considering a performance attribute comprises determining a price penalty on the basis of said weight and incorporating said price penalty in a bid received from said candidate supplier.\n16. 16.The method of claim 1, wherein determining an optimal award schedule comprises applying a private buyer-constraint.\n17. 17.The method of claim 16, wherein applying a private buyer-constraint comprises applying a business rule.\n18. 18.The method of claim 17, wherein applying a business rule comprises selecting a business rule from the group consisting of:\n19. 19.The method of claim 18, wherein placing a limit comprises selecting a limit from the group consisting of an upper bound and a lower bound.\n20. 20.The method of claim 18, wherein the extent to which a selected supplier satisfies said requisition is measured by a monetary value of said extent.\n21. 21.The method of claim 16, wherein applying a private buyer-constraint comprises rejecting any bundled bid.\n22. 22.The method of claim 16, wherein applying a private buyer-constraint comprises manually selecting a supplier for inclusion in said list of selected suppliers.\n23. 23.The method of claim 22, wherein applying a private buyer-constraint further comprises manually specifying an extent to which said manually selected supplier is to at least partially satisfy said requisition.\n24. 24.The method of claim 1, further comprising generating a code indicative of at least one reason for rejecting a losing bid.\n25. 25.The method of claim 24, wherein generating said code comprises incorporating into said code information indicative of whether said losing bid was rejected on the basis of a reason selected from a group consisting of an excessive price and an inadequate performance attribute.\n26.The method of claim 1, further comprising selecting said requisition from the group consisting of\n26.The method of claim 1, further comprising selecting said requisition from the group consisting of\na purchase of an item,\na purchase of a group of items,\na performance of a service, and\na performance of a group of services.\n26.The method of claim 1, further comprising selecting said requisition from the group consisting of\n27. 27.Computer-readable media having encoded thereon software for determining an optimal award schedule for at least partial satisfaction of a requisition, said software comprising instructions for:\n28. 28.The computer-readable media of claim 27, wherein said instructions for receiving said public buyer-constraints from said buyer comprise instructions for receiving a list of items to be supplied.\n29. 29.The computer-readable media of claim 28, wherein said instructions for receiving said list of items comprise instructions for receiving a list in which at least one item in said list is a logical item that includes a list of items.\n30. 30.The computer-readable media of claim 27, wherein said instructions for receiving said public buyer-constraints comprise instructions for receiving a constraint from a group consisting of:\n31. 31.The computer-readable media of claim 30, wherein said non-price constraint is selected from the group consisting of\n32. 32.The computer-readable media of claim 27, wherein said instructions for receiving said bid comprise instructions for receiving a bid including a proposed price for at least partial satisfaction of said requisition.\n33. 33.The computer-readable media of claim 27, wherein said instructions for receiving said bid comprise instructions for receiving a bid including a proposed price having a volume discount dependent on an extent to which said requisition is to be at least partially satisfied.\n34. 34.The computer-readable media of claim 27, wherein said instructions for receiving said bid comprise instructions for receiving a bid including a fixed charge independent of an extent to which said requisition is to be at least partially satisfied.\n35. 35.The computer-readable media of claim 28, wherein said instructions for receiving said bid comprise instructions for receiving a bundled bid offering to at least partially satisfy, for a bundled price, a requisition for a selection of items from said list of items.\n36. 36.The computer-readable media of claim 27, wherein said software further comprises instructions for facilitating an exchange of messages between a buyer and a candidate supplier.\n37. 37.The computer-readable media of claim 36, wherein said software further comprises instructions for facilitating the multi-casting of a message sent by said buyer to all candidate suppliers.\n38. 38.The computer-readable media of claim 27, wherein said instructions for determining an optimal award schedule comprise instructions for considering a performance attribute for a candidate supplier.\n39. 39.The computer-readable media of claim 38, wherein said instructions for considering a performance attribute comprise instructions for selecting an attribute from the group consisting of\n40. 40.The computer-readable media of claim 38, wherein said instructions for considering a performance attribute comprise instructions for considering a weight supplier by said buyer, said weight being indicative of an extent to which said performance attribute is to be considered in determining said optimal award schedule.\n41. 41.The computer-readable media of claim 40, wherein said instructions for considering a performance attribute comprise instructions for determining a price penalty on the basis of said weight and incorporating said price penalty in a bid received from said candidate supplier.\n42. 42.The computer-readable media of claim 27, wherein said instructions for determining an optimal award schedule comprise instructions for applying a private buyer-constraint.\n43. 43.The computer-readable media of claim 42, wherein said instructions for applying a private buyer-constraint comprise instructions for applying a business rule.\n44. 44.The computer-readable media of claim 43, wherein said instructions for applying a business rule comprise instructions for selecting a business rule from the group consisting of:\n45. 45.The computer-readable media of claim 44, wherein said instructions for placing a limit comprise instructions for selecting a limit from the group consisting of an upper bound and a lower bound.\n46. 46.The computer-readable media of claim 44, further comprising instructions for measuring the extent to which a selected supplier satisfies said requisition by measured by a monetary value of said extent.\n47. 47.The computer-readable media of claim 42, wherein said instructions for applying a private buyer-constraint comprise instructions for rejecting any bundled bid.\n48. 48.The computer-readable media of claim 42, wherein said instructions for applying a private buyer-constraint comprise instructions for enabling manual selection of a supplier for inclusion in said list of selected suppliers.\n49. 49.The computer-readable media of claim 48, wherein said instructions for applying a private buyer-constraint further comprise instructions for enabling manual specification of an extent to which said manually selected supplier is to at least partially satisfy said requisition.\n50. 50.The computer-readable media of claim 27, wherein said software further comprises instructions for generating a code indicative of at least one reason for rejecting a losing bid.\n51. 51.The computer-readable media of claim 50, wherein said instructions for generating said code comprise instructions for incorporating into said code information indicative of whether said losing bid was rejected on the basis of a reason selected from a group consisting of an excessive price and an inadequate performance attribute.\n52.The computer-readable media of claim 27, wherein said software further comprises instructions for selecting said requisition from the group consisting of\na purchase of an item,\na purchase of a group of items,\na performance of a service, and\na performance of a group of services.\n52.The computer-readable media of claim 27, wherein said software further comprises instructions for selecting said requisition from the group consisting of\n53.",
    "status": "Abandoned",
    "citations_own": [
        "US5615109A",
        "US5890138A",
        "US6058379A",
        "US6260024B1",
        "US20010032170A1",
        "US20010032117A1",
        "US20010039528A1",
        "US20010049634A1",
        "US20020026429A1",
        "US6366891B1",
        "US20020065764A1",
        "US6415270B1",
        "US20020103746A1",
        "US20020111897A1",
        "US6449601B1",
        "US20020143692A1",
        "US20020147674A1",
        "US20020165814A1",
        "US20020165813A1",
        "US20030004784A1",
        "US20030028473A1",
        "US20030033236A1",
        "US20030041014A1",
        "US20030088494A1",
        "US6598026B1",
        "US6631356B1",
        "US6647373B1",
        "US20040039680A1",
        "US20050044032A1",
        "US6871191B1",
        "US7010511B1",
        "US7587336B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20020069085A1",
        "US20020093808A1",
        "US20020111897A1",
        "US20020152182A1",
        "US20030014349A1",
        "US20030028473A1",
        "US20030101068A1",
        "US20030130927A1",
        "US20030135444A1",
        "US20030184588A1",
        "US20030195835A1",
        "US20030200168A1",
        "US20030204439A1",
        "US20030212604A1",
        "US20040059664A1",
        "US20040073507A1",
        "US20040083156A1",
        "US20040210510A1",
        "US20040260601A1",
        "US20050177424A1",
        "US20050182716A1",
        "US20050240507A1",
        "US20050262008A1",
        "US20060080221A1",
        "US20060149636A1",
        "US20070088654A1",
        "US20070174180A1",
        "US20070179942A1",
        "US20070294349A1",
        "US20080004880A1",
        "US20080005011A1",
        "US20080010124A1",
        "US20080091511A1",
        "US20080249896A1",
        "US20080270313A1",
        "US7464051B1",
        "US20090094040A1",
        "US7523060B1",
        "US20090276329A1",
        "US20100049622A1",
        "US20100121733A1",
        "US20100161388A1",
        "US20100268651A1",
        "US20110040695A1",
        "US7899759B1",
        "US20110082770A1",
        "US7925568B2",
        "US20110087554A1",
        "US20110125470A1",
        "US7953655B1",
        "US7996298B1",
        "US8036950B1",
        "US8086518B1",
        "US20120072297A1",
        "US8165921B1",
        "US8244621B1",
        "US20150058153A1",
        "US20190071306A1"
    ],
    "citedby_ftf": [
        "US6671676B1"
    ]
}