{
    "patent_id": "US-11262737-B2",
    "title": "Systems and methods for monitoring a vehicle steering system ",
    "assignee": "Strong Force Iot Portfolio 2016, Llc",
    "publication_date": "2022-03-01",
    "patent_link": "https://patents.google.com/patent/US11262737B2/en",
    "inventors": [
        "Charles Howard Cella",
        "Gerald William Duffy, JR.",
        "Jeffrey P. McGuckin",
        "Mehul Desai"
    ],
    "classifications": [
        "G06N3/006",
        "B62D15/0215",
        "G01M13/028",
        "G01M13/04",
        "G01M13/045",
        "G05B13/028",
        "G05B19/4183",
        "G05B19/4184",
        "G05B19/41845",
        "G05B19/4185",
        "G05B19/41865",
        "G05B19/41875",
        "G05B23/0221",
        "G05B23/0229",
        "G05B23/024",
        "G05B23/0264",
        "G05B23/0283",
        "G05B23/0286",
        "G05B23/0289",
        "G05B23/0291",
        "G05B23/0294",
        "G05B23/0297",
        "G06F18/2178",
        "G06K9/6263",
        "G06N20/00",
        "G06N3/02",
        "G06N3/044",
        "G06N3/0445",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/047",
        "G06N3/0472",
        "G06N3/084",
        "G06N3/088",
        "G06N5/046",
        "G06N7/005",
        "G06Q10/04",
        "G06Q10/0639",
        "G06Q30/02",
        "G06Q30/0278",
        "G06Q30/06",
        "G06Q50/00",
        "G06V10/7784",
        "G16Z99/00",
        "H02M1/12",
        "H03M1/12",
        "H03M13/353",
        "H04B17/23",
        "H04B17/26",
        "H04B17/29",
        "H04B17/309",
        "H04B17/318",
        "H04B17/345",
        "H04L1/0002",
        "H04L1/0041",
        "H04L1/18",
        "H04L1/1854",
        "H04L1/1874",
        "H04L67/1097",
        "H04L67/12",
        "H04W4/35",
        "H04W4/38",
        "H04W4/70",
        "H04W4/80",
        "B62D5/0463",
        "G05B19/042",
        "G05B2219/32287",
        "G05B2219/35001",
        "G05B2219/37337",
        "G05B2219/37351",
        "G05B2219/37434",
        "G05B2219/37537",
        "G05B2219/40115",
        "G05B2219/45004",
        "G05B2219/45129",
        "G05B23/02",
        "G05B23/0208",
        "G06F17/18",
        "G06F18/21",
        "G06F18/217",
        "G06F18/25",
        "G06F2218/00",
        "G06K9/6217",
        "G06K9/6262",
        "G06K9/6288",
        "G06N3/042",
        "G06N3/126",
        "G06N7/01",
        "H01B17/40",
        "H03M13/1102",
        "H04B17/40",
        "H04L1/0009",
        "H04L1/0057",
        "H04L1/0076",
        "H04L5/0064",
        "H04L67/306",
        "H04L67/565",
        "H04L69/163",
        "H04L69/164",
        "Y02P80/10",
        "Y02P90/02",
        "Y02P90/80",
        "Y04S40/18",
        "Y04S50/00",
        "Y04S50/12",
        "Y10S707/99939"
    ],
    "abstract": "Systems and methods for monitoring a vehicle steering system are disclosed. An example monitoring system for a vehicle steering system may include a vehicle steering system comprising a rack, a pinion, and a steering column; a data acquisition circuit structured to interpret a plurality of detection values corresponding input sensors operationally coupled to the rack, the pinion, or the steering column; a data storage circuit structured to store specifications, and to buffer the plurality of detection values for a predetermined length of time. The example system may further include a timer circuit structured to generate a timing signal based on a first detected value of the plurality of detection values; a steering system analysis circuit to determine a steering system performance parameter in response to a relative phase difference and a response circuit structured to perform at least one operation in response to the steering system performance parameter.",
    "claims": "\n1. A monitoring system for a vehicle steering system, the monitoring system comprising:\na vehicle steering system comprising a rack, a pinion, and a steering column;\na data acquisition circuit structured to interpret a plurality of detection values, each of the plurality of detection values corresponding to at least one of a plurality of input sensors, each of the plurality of input sensors operationally coupled to the rack, the pinion, or the steering column, and communicatively coupled to the data acquisition circuit;\na data storage circuit structured to store specifications, system geometry, and anticipated state information for the vehicle steering system, to store historical vehicle steering system performance, and to buffer the plurality of detection values for a predetermined length of time;\na timer circuit structured to generate a timing signal based on a first detected value of the plurality of detection values;\na steering system analysis circuit comprising:\na phase detection circuit structured to determine a relative phase difference between a second detection value of the plurality of detection values and the timing signal; and\na signal evaluation circuit structured to obtain at least one of a vibration amplitude, a vibration frequency, or a vibration phase location corresponding to the second detection value, and to determine a steering system performance parameter in response to the relative phase difference and the at least one of the vibration amplitude, the vibration frequency, or the vibration phase location; and\na response circuit structured to perform at least one operation in response to the steering system performance parameter,\nwherein the response circuit is further structured to perform the at least one operation in response to a change in a frequency or the relative phase difference of at least one of the plurality of detection values, and\nwherein the signal evaluation circuit is further structured to utilize a phase lock loop (PLL) to determine the change in the frequency or the relative phase difference of at least one of the plurality of detection values.\n2. The monitoring system of claim 1, wherein the signal evaluation circuit is further structured to utilize a band pass filter to determine the change in the frequency or the relative phase difference of the at least one of the plurality of detection values.\n3. The monitoring system of claim 2, wherein the at least one operation comprises enabling or disabling processing of at least one of the plurality of detection values by the data acquisition circuit further in response to the change in the frequency or the relative phase difference of the at least one of the plurality of detection values.\n4. The monitoring system of claim 2, wherein the at least one operation comprises switching a utilized one of the plurality of input sensors further in response to the change in the frequency or the relative phase difference of the at least one of the plurality of detection values.\n5. The monitoring system of claim 2, wherein the at least one operation comprises providing an alert further in response to the change in the frequency or the relative phase difference of the at least one of the plurality of detection values.\n6. The monitoring system of claim 1, wherein the response circuit is further structured to perform the at least one operation further in response to a transition event of at least one of the plurality of detection values.\n7. The monitoring system of claim 1, wherein the at least one operation comprises enabling or disabling processing of at least one of the plurality of detection values by the data acquisition circuit.\n8. The monitoring system of claim 1, wherein the at least one operation comprises switching a utilized one of the plurality of input sensors.\n9. The monitoring system of claim 1, wherein the at least one operation comprises providing an alert.\n10. A method for monitoring a vehicle steering system, the method comprising:\ninterpreting a plurality of detection values, each of the plurality of detection values corresponding to at least one of a plurality of input sensors operationally coupled to a rack, a pinion, or a steering column of the vehicle steering system;\ngenerating at least one timing signal based on a first detected value of the plurality of detection values;\ndetermining a relative phase difference between a second detected value of the plurality of detection values and the at least one timing signal;\nutilizing a phase lock loop (PLL) to determine a change in a frequency or the relative phase difference of the at least one of the plurality of detection values; and\nperforming at least one operation in response to the relative phase difference,\nwherein the at least one operation is performed further in response to the change in the frequency of at least one of the plurality of detection values, and\nwherein the at least one operation comprises enabling or disabling processing of at least one of the plurality of detection values in response to the change in the frequency or the relative phase difference of the at least one of the plurality of detection values.\n11. The method of claim 10, further comprising generating a steering system performance parameter by analyzing the plurality of detection values for at least one of a vibration amplitude, a vibration frequency, or a vibration phase location.\n12. The method of claim 11, further comprising generating the steering system performance parameter by further analyzing at least one of buffered detection values, specifications, or anticipated state information.\n13. The method of claim 10, further comprising utilizing a band pass filter to determine the change in the frequency or the relative phase difference of at least one of the plurality of detection values.\n14. The method of claim 10, wherein the at least one operation comprises switching a utilized one of the plurality of input sensors in response to the change in the frequency or the relative phase difference of the at least one of the plurality of detection values.\n15. The method of claim 10, further comprising performing the at least one operation further in response to a transition event of at least one of the plurality of detection values.\n16. The method of claim 15, wherein the transition event comprises a slow phase change event.\n17. A monitoring system for a vehicle steering system, the monitoring system comprising:\na vehicle steering system comprising a rack, a pinion, and a steering column;\na data acquisition circuit structured to interpret a plurality of detection values, each of the plurality of detection values corresponding to at least one of a plurality of input sensors, each of the plurality of input sensors operationally coupled to the rack, the pinion, or the steering column, and communicatively coupled to the data acquisition circuit;\na data storage circuit structured to store specifications, system geometry, and anticipated state information for the vehicle steering system, to store historical vehicle steering system performance, and to buffer the plurality of detection values for a predetermined length of time;\na timer circuit structured to generate a timing signal based on a first detected value of the plurality of detection values;\na steering system analysis circuit comprising:\na phase detection circuit structured to determine a relative phase difference between a second detection value of the plurality of detection values and the timing signal; and\na signal evaluation circuit structured to obtain at least one of a vibration amplitude, a vibration frequency, or a vibration phase location corresponding to the second detection value, and to determine a steering system performance parameter in response to the relative phase difference and the at least one of the vibration amplitude, the vibration frequency, or the vibration phase location; and\na response circuit structured to perform at least one operation in response to the steering system performance parameter,\nwherein the at least one operation comprises enabling or disabling processing of at least one of the plurality of detection values by the data acquisition circuit.\n18. The monitoring system of claim 17, wherein the response circuit is further structured to perform the at least one operation in response to a change in a frequency or the relative phase difference of at least one of the plurality of detection values.\n19. The monitoring system of claim 18, wherein the signal evaluation circuit is further structured to utilize a phase lock loop (PLL) to determine the change in the frequency or the relative phase difference of at least one of the plurality of detection values.\n20. The monitoring system of claim 19, wherein the signal evaluation circuit is further structured to utilize a band pass filter to determine the change in the frequency or the relative phase difference of the at least one of the plurality of detection values.\n21. The monitoring system of claim 20, wherein the at least one operation comprises enabling or disabling processing of at least one of the plurality of detection values by the data acquisition circuit further in response to the change in the frequency or the relative phase difference of the at least one of the plurality of detection values.\n22. The monitoring system of claim 20, wherein the at least one operation comprises switching a utilized one of the plurality of input sensors further in response to the change in the frequency or the relative phase difference of the at least one of the plurality of detection values.\n23. The monitoring system of claim 20, wherein the at least one operation comprises providing an alert further in response to the change in the frequency or the relative phase difference of the at least one of the plurality of detection values.\n24. The monitoring system of claim 17, wherein the response circuit is further structured to perform the at least one operation further in response to a transition event of at least one of the plurality of detection values.\n25. The monitoring system of claim 17, wherein the at least one operation comprises switching a utilized one of the plurality of input sensors.\n26. The monitoring system of claim 17, wherein the at least one operation comprises providing an alert.\n27. A monitoring system for a vehicle steering system, the monitoring system comprising:\na vehicle steering system comprising a rack, a pinion, and a steering column;\na data acquisition circuit structured to interpret a plurality of detection values, each of the plurality of detection values corresponding to at least one of a plurality of input sensors, each of the plurality of input sensors operationally coupled to the rack, the pinion, or the steering column, and communicatively coupled to the data acquisition circuit;\na data storage circuit structured to store specifications, system geometry, and anticipated state information for the vehicle steering system, to store historical vehicle steering system performance, and to buffer the plurality of detection values for a predetermined length of time;\na timer circuit structured to generate a timing signal based on a first detected value of the plurality of detection values;\na steering system analysis circuit comprising:\na phase detection circuit structured to determine a relative phase difference between a second detection value of the plurality of detection values and the timing signal; and\na signal evaluation circuit structured to obtain at least one of a vibration amplitude, a vibration frequency, or a vibration phase location corresponding to the second detection value, and to determine a steering system performance parameter in response to the relative phase difference and the at least one of the vibration amplitude, the vibration frequency, or the vibration phase location; and\na response circuit structured to perform at least one operation in response to the steering system performance parameter,\nwherein the at least one operation comprises switching a utilized one of the plurality of input sensors.\n28. The monitoring system of claim 27, wherein the response circuit is further structured to perform the at least one operation in response to a change in a frequency or the relative phase difference of at least one of the plurality of detection values.\n29. The monitoring system of claim 28, wherein the signal evaluation circuit is further structured to utilize a phase lock loop (PLL) to determine the change in the frequency or the relative phase difference of at least one of the plurality of detection values.\n30. The monitoring system of claim 29, wherein the signal evaluation circuit is further structured to utilize a band pass filter to determine the change in the frequency or the relative phase difference of the at least one of the plurality of detection values.\n31. The monitoring system of claim 30, wherein the at least one operation comprises enabling or disabling processing of at least one of the plurality of detection values by the data acquisition circuit further in response to the change in the frequency or the relative phase difference of the at least one of the plurality of detection values.\n32. The monitoring system of claim 30, wherein the at least one operation comprises switching the utilized one of the plurality of input sensors further in response to the change in the frequency or the relative phase difference of the at least one of the plurality of detection values.\n33. The monitoring system of claim 30, wherein the at least one operation comprises providing an alert further in response to the change in the frequency or the relative phase difference of the at least one of the plurality of detection values.\n34. The monitoring system of claim 27, wherein the response circuit is further structured to perform the at least one operation further in response to a transition event of at least one of the plurality of detection values.\n35. The monitoring system of claim 27, wherein the at least one operation comprises enabling or disabling processing of at least one of the plurality of detection values by the data acquisition circuit.\n36. The monitoring system of claim 27, wherein the at least one operation comprises providing an alert.\n37. A method for monitoring a vehicle steering system, the method comprising:\ninterpreting a plurality of detection values, each of the plurality of detection values corresponding to at least one of a plurality of input sensors operationally coupled to a rack, a pinion, or a steering column of the vehicle steering system;\ngenerating at least one timing signal based on a first detected value of the plurality of detection values;\ndetermining a relative phase difference between a second detected value of the plurality of detection values and the at least one timing signal;\ndetermining a change in a frequency or the relative phase difference of the at least one of the plurality of detection values; and\nperforming at least one operation in response to the relative phase difference,\nwherein the at least one operation is performed further in response to the change in the frequency of at least one of the plurality of detection values, and\nwherein the at least one operation comprises switching a utilized one of the plurality of input sensors in response to the change in the frequency or the relative phase difference of the at least one of the plurality of detection values.\n38. The method of claim 37, further comprising generating a steering system performance parameter by analyzing the plurality of detection values for at least one of a vibration amplitude, a vibration frequency, or a vibration phase location.\n39. The method of claim 38, further comprising generating the steering system performance parameter by further analyzing at least one of buffered detection values, specifications, or anticipated state information."
}