{
    "patent_id": "US-9563745-B2",
    "title": "Medical care treatment decision support system ",
    "assignee": "Wisercare, Inc., The Regents Of The University Of California",
    "publication_date": "2017-02-07",
    "patent_link": "https://patents.google.com/patent/US9563745B2/en",
    "inventors": [
        "Christopher Sharad Saigal",
        "Hollis Leech"
    ],
    "classifications": [
        "G16H50/20",
        "G06F19/345",
        "G06N5/048",
        "G16Z99/00"
    ],
    "abstract": "Exemplary embodiments of the present invention will assist patients with their investigation of, and decision making about, the treatments that are available to them using conjoint analysis methods that measure individual preferences for risk-associated treatment options, while maintaining an acceptable interview length. In exemplary embodiments, such individual preferences, known as “utilities” in economics literature, will be combined with evidence-based outcomes data regarding the probabilities of treatment outcomes; exemplary embodiments will use “decision analysis” and modified “conjoint analysis” methods, to dynamically generate for patients real-time individualized, evidence-based feedback, rankings and recommendations regarding medical treatment alternatives that are available to the patient based on the patient's medical condition and prognostic indicators.",
    "claims": "\n1. An Internet-based computer system for generating an individualized medical treatment decision analysis, said Internet-based computer system comprising at least one computer device programmed to:\nin response to a particular user's input of a particular patient's patient-specific medical condition, patient-specific prognostic indicators for the particular patient, and preferences by the particular user regarding treatment attributes related to a plurality of treatment alternatives available to the particular patient for treating the particular patient's patient-specific medical condition in view of said patient-specific prognostic indicators:\nderive conjoint-analysis-based, part-worth utility values for said treatment attributes from an individualized conjoint analysis of the particular user's input of preferences regarding said treatment attributes;\nintegrate said conjoint-analysis-based, part-worth utility values with a probability model of medical treatment outcome data for treatment alternatives available to said particular patient for said particular patient's patient-specific medical condition according to said patient-specific prognostic indicators and determine, according to said individualized conjoint analysis, a respective patient-specific expected value for each medical treatment alternative available to the particular patient for treating the particular patient's patient-specific medical condition in view of said patient-specific prognostic indicators; and\ngenerate an individualized decision analysis of medical treatment alternatives available to said particular patient according to said individualized conjoint analysis of the particular user's input of preferences, said conjoint-analysis-based, part-worth utility values, said probability model, and said patient-specific expected values.\n2. The Internet-based computer system of claim 1, wherein said treatment attributes comprise risk-based treatment attributes.\n3. The Internet-based computer system of claim 1, wherein said treatment attributes comprise treatment factors selected from the group comprising: cost, insurance coverage, medical provider availability, medical provider quality, physician availability, and physician quality.\n4. The Internet-based computer system of claim 1, wherein said treatment attributes comprise risk-based treatment attributes and treatment factors selected from the group comprising: cost, insurance coverage, medical provider availability, medical provider quality, physician availability, and physician quality.\n5. The Internet-based computer system of claim 1, said generate an individualized decision analysis of medical treatment alternatives available to said particular patient comprising generating a display of said individualized decision analysis of medical treatment alternatives.\n6. The Internet-based computer system of claim 1, said at least one computer device further programmed to:\ngenerate a display of said individualized decision analysis of medical treatment alternatives available to said particular patient.",
    "status": "Active",
    "citations_own": [
        "US20030110059A1",
        "US20030163353A1",
        "US20040111291A1",
        "US20080172214A1",
        "US20100217650A1",
        "US20110230360A1"
    ],
    "citations_ftf": [
        "US4528643A",
        "US4733354A",
        "US5005143A",
        "US4872122A",
        "US4839822A",
        "US5025374A",
        "US5225976A",
        "US5299121A",
        "CA2121245A1",
        "US6283761B1",
        "US5517405A",
        "US5594638A",
        "US5724968A",
        "US5660176A",
        "US5471382A",
        "US5586024A",
        "EP0846296A4",
        "US5664109A",
        "US5716382A",
        "US5757917A",
        "US6148814A",
        "US6678669B2",
        "US5768528A",
        "US6102855A",
        "US5954641A",
        "US5915240A",
        "WO1999052025A2",
        "WO1999059673A1",
        "US6584445B2",
        "US6581038B1",
        "US7062076B1",
        "US7464040B2",
        "US20010037215A1",
        "US7110990B2",
        "EP1381972A4",
        "US6928434B1",
        "US7398270B1",
        "US6745184B1",
        "US6533724B2",
        "US6735596B2",
        "US6802810B2",
        "AU2003268339A1",
        "US7392231B2",
        "US8171022B2",
        "US20070156453A1",
        "US8200506B2",
        "US7877346B2",
        "US8548823B2"
    ],
    "citedby_own": [
        "US20180322252A1",
        "US11583646B2",
        "US11590306B2"
    ],
    "citedby_ftf": [
        "US20120089421A1",
        "US10431336B1",
        "US10734115B1",
        "US11398310B1",
        "US10628553B1",
        "US9202012B2",
        "US9844417B2",
        "US8856156B1",
        "US8751261B2",
        "US20150095051A1",
        "US9058354B2",
        "US20130226612A1",
        "US10249385B1",
        "AU2015218497B2",
        "US8751429B2",
        "AU2015271952B1",
        "US20140039913A1",
        "CA2881011A1",
        "US20140058738A1",
        "US8762177B2",
        "US20140081659A1",
        "US11081213B2",
        "US9525753B2",
        "US10946311B1",
        "US10769241B1",
        "EP2956896A4",
        "US20140236025A1",
        "US20140244362A1",
        "US10242157B1",
        "CN105144176A",
        "US9292599B2",
        "US10412028B1",
        "EP3014500A1",
        "US10483003B1",
        "US11581092B1",
        "WO2015054794A1",
        "US11568982B1",
        "US10977254B2",
        "US20170124268A1",
        "US10691774B2",
        "US20180294051A1",
        "US10546102B2",
        "WO2017136603A1",
        "US11594310B1",
        "US11547616B2",
        "US20180004901A1",
        "US10971254B2",
        "US10818394B2",
        "US10593429B2",
        "WO2018074924A1",
        "US10607736B2",
        "US11663670B1",
        "US11790454B1",
        "US11017906B2",
        "US11257574B1",
        "WO2018183358A1",
        "US10832308B2",
        "US11176318B2",
        "US20180357383A1",
        "US10937551B2",
        "US10650928B1",
        "US20210248568A1",
        "US11694800B2",
        "US10811139B1",
        "US10970089B2",
        "CN109062546A",
        "US11120912B2",
        "US11763950B1",
        "US11263405B2",
        "US20210398671A1",
        "US20200176127A1",
        "US11177028B2",
        "US11605469B2",
        "US11204691B2",
        "US11289203B2",
        "WO2020180679A1",
        "US10553319B1",
        "US11625789B1",
        "US11621085B1",
        "CN110046170B",
        "US11238469B1",
        "US11538586B2",
        "US20210043292A1",
        "US10726359B1",
        "US10643751B1",
        "US10643749B1",
        "US11270785B1",
        "US11730420B2",
        "US20210241909A1",
        "US11610679B1",
        "CN116997974A",
        "EP4256075A1"
    ]
}