{
    "patent_link": "https://patents.google.com/patent/US5914946A/en",
    "patent_id": "US5914946A",
    "title": "TDM-based fixed wireless loop system",
    "abstract": "A time-division-multiplexed fixed wireless loop system and methods therefor are disclosed. The system comprises a plurality of cells each having a base station and a plurality of terminals. The base station includes a steerable and adjustable multibeam antenna for communicating with each of the terminals, which have fixed antennas. A cell controller associated with each base station allocates communication time slots so as to minimize mutual interference between base station/terminal links sharing the same time slot. Slot assignment is based on regional, periodically updated interference measurements that are stored in data bases.",
    "inventors": [
        "Dan Avidor",
        "Sanjay Kasturia",
        "II Theodore Sizer",
        "Reinaldo A. Valenzuela",
        "Gregory Alan Wright"
    ],
    "assignee": "Nokia of America Corp",
    "classifications": [
        "H04W16/28",
        "H04W72/54",
        "H04W84/14"
    ],
    "claims": "\n1. A method for beam forming, wherein the beam supports a communications link and wherein a specific group of strong interferers cause significant interference with and experience significant interference from the communications link, comprising the steps of:\n(A) retrieving data from storage pertaining to mutual interference levels experienced by and caused by the communications link, which data is periodically updated by interference measurements;\n(B) calculating a first optimal weighting vector that optimizes the signal to total interference ratio of an antenna beam at an antenna output based on the data retrieved in step (A), the first optimal weighting vector comprised of a number, K, of components, the number K being equal to a number of active radiating antenna elements involved in forming the antenna beam; and\n(C) multiplying each one of a plurality of signals received from or intended for each one of the K active radiating antenna elements by a corresponding component of the first optimal weighting vector.\n2. The method of claim 1 wherein, in step (A), a cell controller retrieves the data from storage and provides it to beam formers.\n3. The method of claim 2 wherein, in step (B), the beam formers calculate the first optimal weighting vector.\n4. The method of claim 3 wherein step (B) further comprises generating a plurality of sine waves corresponding in number to the plurality of signals, wherein, the amplitude and phase of each sine wave is determined by the corresponding component of the first optimal weighting vector.\n5. The method of claim 1 wherein, in step (B), the first optimal weighting vector, Wopt, is calculated according to the expression:\nW.sub.opt =M.sup.-1 S(Φ)\nwhere: M is the covariance matrix of the interference sources;\nS(Φ) is a vector, each component of which corresponds to a signal received by or delivered to one of the active radiating antenna elements; and Φ is the direction of the desired main lobe.\n6. The method of claim 5 wherein, after calculating the first optimal weighting vector, one interferer is added to or substracted from the specific group of interferers, and a second optimal weighting vector is calculated based on the first optimal weighting vector according to the expression:\nW.sup.(k) =W.sup.(k-1) -λαYconj(Y')conj(S(Φ.sub.j),\nwhere:\nW.sup.(k) is the optimal weighting vector after accounting for the one interferer;\nW.sup.(k-1) is the first optimal weighting vector,\nM.sup.(k)-1 =M.sup.(k-1) -λαYconj(Y'), λ=1/ 1+αconj(Y')U!, Y=M.sup.(k-1)-1 U, α=βk nj 2,\nU=conj(S(Φj), S(Φj)= S1 (Φj) S2 (Φj) . . . SK (Φj)!',\nS(Φj) is a vector, each component of which corresponds to a signal received by or\ndelivered to one of the active radiating antenna elements,\nΦj =azimuth of the interferer,\nconj(S) is the complex conjugate of S.\nβk =+1 if one interferer is added and -1 if one interferer is substracted, and\nnj 2 is the power of the interferer.\n7. An article comprising:\na processor; and\na computer-readable storage medium having computer-readable program code embodied therein for causing the processor to optimize a signal to total interference ratio of an antenna beam generated by a phased-array antenna, the program code comprising:\ncode segment for causing the processor to calculate a first optimal weighting vector based on information pertaining to a group of interferers;\ncode segment for causing the processor to multiply the first optimal weighting vector by corresponding signals received from or delivered to radiators of the phased-array antenna.\n8. The article of claim 7, wherein the program code further comprises:\ncode segment for causing the processor to calculate a second optimal weighting vector using information developed during the calculation of the first optimal weighting vector and information pertaining to the addition or deletion of one interferer to the group of interferers.\n9. A method for generating an uplink beam at a base station to facilitate a terminal's uplink transmission to the base station in a first communications link, comprising the steps of:\n(A) receiving a request to generate the uplink beam in a first time slot allotted to the first communications link based on interference caused by and experienced by the uplink of the first communications link;\n(B) obtaining the terminal's azimuth, a list of phase offsets, measured with reference to a main lobe of the uplink beam, corresponding to the received direction of interference from interferers, and further receiving the anticipated power of every interferer represented in the list of phase offsets; and\n(C) generating a beam with notches for attenuating the interference received from the interferers.\n10. The method of claim 9 further comprising generating a downlink beam at the base station to facilitate the base station's transmission to the terminal, comprising the steps of:\n(D) receiving a request to generate the downlink beam in a second time slot allotted to the first communications link based on interference caused by and experienced by the downlink of the first communications link;\n(E) obtaining the terminal's azimuth, a list of phase offsets to avoid, and further receiving a quantity representative of the relative importance of transmission suppression on each phase offset; and\n(F) generating a beam with notches for attenuating the signal transmitted toward the phase offsets listed in step (E).",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5313461A",
        "US5448753A",
        "US5515378A",
        "US5742252A"
    ],
    "citations_ftf": [
        "WO1986001057A1",
        "US5592490A",
        "US5274844A",
        "US5260968A"
    ],
    "citedby_own": [
        "WO2000018038A1",
        "WO2000027139A1",
        "US6185440B1",
        "US6188913B1",
        "US6205441B1",
        "US6289211B1",
        "US6339708B1",
        "US20020013164A1",
        "US6345188B1",
        "US6349217B1",
        "US6360094B1",
        "US6438741B1",
        "US20020126640A1",
        "US6463295B1",
        "US6463301B1",
        "US20020199015A1",
        "US20030017853A1",
        "US20030022636A1",
        "US6580926B1",
        "US6600914B2",
        "US6615024B1",
        "US20040009755A1",
        "US6690747B2",
        "US6711416B1",
        "US20040072545A1",
        "US6771969B1",
        "US6775552B2",
        "US6775551B1",
        "US6795409B1",
        "US20050064872A1",
        "US20050064908A1",
        "US20050079823A1",
        "US6952585B1",
        "US6961325B1",
        "US6993343B2",
        "US7031652B2",
        "US20060198339A1",
        "US20070014307A1",
        "US20070082674A1",
        "US20070096788A1",
        "US20070173277A1",
        "US7299071B1",
        "US20080159122A1",
        "US20080212517A1",
        "US7460835B1",
        "US20090305710A1",
        "US20100105403A1",
        "US20100220597A1",
        "US20110222495A1",
        "US8140872B1",
        "US20120077504A1",
        "US20130260706A1",
        "US8760992B2",
        "US9935705B2",
        "US10009085B2",
        "US10117234B2"
    ],
    "citedby_ftf": [
        "JP3323438B2",
        "JP2002532959A",
        "CN1242632C",
        "US6778507B1",
        "KR20020010023A",
        "FR2821514B1",
        "FR2821513B1",
        "JP4754103B2",
        "JP4578346B2",
        "CN101729163B",
        "EP2337418A1",
        "JP6541783B2",
        "EP4271093A2",
        "CN109644026B",
        "US10524273B2",
        "CN110121854B"
    ]
}