{
    "patent_id": "US-2023034330-A1",
    "title": "Distributed relationship reasoning engine for generating analytics for hemodynamic instability ",
    "assignee": "Nant Holdings Ip, Llc",
    "publication_date": "2023-02-02",
    "patent_link": "https://patents.google.com/patent/US20230034330A1/en",
    "inventors": [
        "Patrick Soon-Shiong"
    ],
    "classifications": [
        "G06N5/043",
        "G06F16/951",
        "G06F16/9537",
        "G06N5/022",
        "G06N5/025",
        "G06N5/04",
        "G06N5/041",
        "G06N5/046",
        "G06Q30/0241",
        "G06T9/00",
        "G06V20/00",
        "G16H50/20",
        "H04M3/2254",
        "H04M3/247",
        "Y04S10/50"
    ],
    "abstract": "A reasoning engine is disclosed. Contemplated reasoning engines acquire data relating to one or more aspects of various environments. Inference engines within the reasoning engines review the acquire data, historical or current, to generate one or more hypotheses about how the aspects of the environments might be correlated, if at all. The reasoning engine can attempt to validate the hypotheses through controlling acquisition of the environment data.",
    "claims": "\n1-30. (canceled)\n31. A patient data analysis engine system, comprising:\nat least one computer readable memory storing software reasoning instructions;\na data interface coupled with at least one sensor associated with a patient;\nat least one processor coupled with the data interface and the at least one computer readable memory, and upon execution of the software reasoning instructions performs the following steps:\nacquiring environmental data associated with the patient and at least partially including sensor data from the at least one sensor acquired via the data interface;\nrecognizing aspects from the environmental data as target objects;\ngenerating at least one hypothesis regarding a correlation among the target objects with respect to an outcome; and\ncausing an output device to present the at least one hypothesis as relating to the outcome.\n32. The system of claim 31, wherein the patient data analysis engine comprises a virtual machine.\n33. The system of claim 31, wherein the environmental data represents at least in part the patient's body.\n34. The system of claim 31, wherein the environmental data further comprises multiple data modalities.\n35. The system of claim 31, wherein the environmental data further comprises at least one of the following data modalities: biometric data, medical data, demographic data, a trend in a body temperature, and identity data.\n36. The system of claim 31, wherein the environmental data further comprises at least one observed change with respect to the patient.\n37. The system of claim 36, wherein the at least one observed change with respect to the patient includes a body change with respect at least one of the following: a pressure point, airway patency, respiration, blood pressure, perspiration, a body fluid, and perfusion.\n38. The system of claim 31, wherein the environmental data further comprises at least one of the following observed changes with respect an electrical characteristic: a resistance, a current, a voltage, capacitance, a reactance, an inductance, a permeability, and a permittivity.\n39. The system of claim 31, wherein the step of generating the hypothesis occurs in real-time relative to acquiring the environment data.\n40. The system of claim 31, wherein the environmental data comprises ambient data associated with the patient.\n41. The system of claim 31, wherein the environmental data comprises a digital representation of a scene associated with the patient.\n42. The system of claim 31, further comprising a knowledge base storing object information for known target objects, wherein the knowledge base is coupled with the at least one processor.\n43. The system of claim 42, wherein the knowledge base is personalized to the patient.\n44. The system of claim 31, wherein the step of generating the at least one hypothesis further includes forming the at least one hypothesis according to a least one reasoning rules set.\n45. The system of claim 44, wherein the step of generating the at least one hypothesis further includes selecting the rules set based on the environment data.\n46. The system of claim 45, wherein the rules set includes at least one of the following types of rules sets: deductive rules, abductive rules, inductive rules, ampliative reasoning rules, case-based reasoning rules, metaphorical mapping rules, forward chaining rules, backward chaining rules, analogical reasoning rules, cause-and-effect reasoning rules, defeasible or indefeasible reasoning rules, comparative reasoning rules, conditional reasoning rules, decompositional reasoning rules, exemplar reasoning, modal logic rules, set-based reasoning rules, systemic reasoning rules, syllogistic reasoning rules, probabilistic reasoning rules, paraconsistent reasoning rules and fuzzy logic rules.\n47. The system of claim 31, wherein the outcome comprises a negative outcome.\n48. The system of claim 31, wherein the outcome comprises a positive outcome.\n49. The system of claim 31, wherein the step of presenting the at least one hypothesis comprises offering a recommendation on a change to a treatment protocol related to the outcome.\n50. A computer-based reasoning system for providing recommendations based on observed objects in an environment, comprising:\na data interface configured to receive sensor data representing a digital representation of a scene of the environment having at least one object;\nat least one inference engine coupled within the data interface and configured to:\nacquire environmental data associated with the patient and at least partially including sensor data from the at least one sensor acquired via the data interface;\nrecognize aspects from the environmental data as target objects;\ngenerate at least one hypothesis regarding a correlation among the target objects with respect to an outcome; and\ncause an output device to present the at least one hypothesis as relating to the outcome.\n51. A computer program product embedded in a non-transitory computer readable medium comprising instructions executable by a computer processor to perform operations comprising:\nacquiring environmental data associated with the patient and at least partially including sensor data from the at least one sensor acquired via the data interface;\nrecognizing aspects from the environmental data as target objects;\ngenerating at least one hypothesis regarding a correlation among the target objects with respect to an outcome; and\ncausing an output device to present the at least one hypothesis as relating to the outcome."
}