{
    "patent_id": "US-2018096307-A1",
    "title": "Adaptive, hybrid reasoning decision support system for personnel hiring and inter-connected business strategic evolution ",
    "assignee": "Massachusetts, University Of, Aretisoft, Llc",
    "publication_date": "2018-04-05",
    "patent_link": "https://patents.google.com/patent/US20180096307A1/en",
    "inventors": [
        "Paul J. Fortier",
        "Theophano Mitsa"
    ],
    "classifications": [
        "G06Q10/1053",
        "G06N5/022",
        "G06N5/04",
        "G06N5/048"
    ],
    "abstract": "A method of providing decision support for personnel hiring, the method comprises receiving a list of one or more mandatory hiring criteria and one or more desirable hiring criteria for a position, retrieving a profile of a job candidate from a candidate case base, computing a suitability of the job candidate for the position by determining if the job candidate profile includes all mandatory hiring criteria, and responsive to the job candidate profile including all mandatory hiring criteria, computing a suitability ranking of the job candidate based on a degree of similarity of the one or more mandatory hiring criteria and one or more desirable hiring criteria to qualifications in the job candidate profile, and ranking the job candidate against other job candidates based on the suitability ranking of the job candidate and suitability rankings of the other job candidates.",
    "claims": "\n1. A method of providing decision support for personnel hiring, the method comprising:\nreceiving a list of one or more mandatory hiring criteria and one or more desirable hiring criteria for a position;\nretrieving a profile of a job candidate from a candidate case base;\ncomputing a suitability of the job candidate for the position by determining if the job candidate profile includes all mandatory hiring criteria, and responsive to the job candidate profile including all mandatory hiring criteria, computing a suitability ranking of the job candidate based on a degree of similarity of the one or more mandatory hiring criteria and one or more desirable hiring criteria to qualifications in the job candidate profile; and\nranking the job candidate against other job candidates based on the suitability ranking of the job candidate and suitability rankings of the other job candidates.\n2. The method of claim 1, wherein the suitability of the job candidate for the position is calculated in accordance with the formula\n3. The method of claim 2, wherein si for a hiring criterion is calculated in accordance with the formula\n\ns i=1−(jr min −eq i)/range(jr i)\n4. The method of claim 1, further comprising computing correlations of hiring criteria with business metrics.\n5. The method of claim 1, further comprising assessing a change in mandatory and/or desired hiring criteria specified in hiring requests over time.\n6. The method of claim 1, further comprising assessing importance of hiring criteria by changing a minimum acceptable value for a hiring criteria and determining a change in a number of high value employees that would have been selected for hiring if the hiring criteria included the changed minimum acceptable value.\n7. The method of claim 1, further comprising assessing importance of hiring criterion as indicated by its correlation with a business metric.\n8. The method of claim 1, further comprising performing a skill questions assessment based on how candidate scores, degree of difficulty, and number of questions correlate with employee review ratings.\n9. The method of claim 1, further comprising assessing importance of hiring criteria by reclassifying a hiring criterion from desirable to mandatory and determining a change in a number of high value employees that would have been selected for hiring if the hiring criteria was mandatory.\n10. A decision support system for personnel hiring comprising:\nan employee case base including profiles of current employees;\nan external candidate case base including profiles of external job applicants;\na rule engine including rules specifying hiring criteria for at least one position; and\nan inference engine configured to search the employee case base and the external case base and to identify and present profiles of candidates having attributes showing correlations with attributes specified by a hiring manager for a position.\n11. The system of claim 10, wherein the profiles of the current employees include data regarding the qualifications of the current employees and the profiles of the external job applicants include data regarding the qualifications of the external job applicants.\n12. The system of claim 10, wherein the inference engine is further configured to search the employee case base and the external case base and to compute similarity of a candidate with an employee paradigm, the employee paradigm including an employee profile representing an ideal solution to a hiring need.\n13. The system of claim 10, further comprising a hiring search case base including at least one hiring case representing hiring search criteria for a position.\n14. The system of claim 13, wherein hiring cases in the hiring search case base include an indication of whether the hiring case is a hiring case for a strategic position.\n15. The system of claim 13, wherein hiring cases in the hiring search case base include an indication of whether the hiring case is a hiring case for an unfilled position or for a filled position.\n16. The system of claim 13, further comprising a user interface configured to receive a search query including a job description and to present a list of one or more hiring cases from the hiring search case base associated with the job description, the list generated by a hiring case search engine of the system.\n17. The system of claim 16, wherein the user interface is further configured to receive an indication from a user whether a hiring case from the list of one or more hiring cases is useful to the user.\n18. The system of claim 17, wherein the hiring search case base is configured to increase a usefulness rating of the hiring case responsive to the user providing the indication that the hiring case is useful.\n19. The system of claim 18, wherein the hiring case search engine is configured to present the list of one or more hiring cases in the user interface ranked according to one or more of the usefulness ratings of the respective one or more hiring cases or creation dates of the respective one or more hiring cases.\n20. The system of claim 13, further comprising a user interface configured to receive a search query including a job description and a job attribute and to present a list of one or more hiring cases from the hiring search case base associated with the job description and job attribute, the list generated by a hiring case search engine of the system.\n21. The system of claim 10, further comprising an aggregate hiring search case base including all hiring criteria that have been specified in previous hiring searches for at least one job description.\n22. The system of claim 21, wherein each skill question in the aggregate hiring search case base has an associated usefulness rating.\n23. The system of claim 21, wherein each hiring criterion in the aggregate hiring search case base has an associated usefulness rating.\n24. The system of claim 23, further comprising a user interface configured to receive an indication of a job description from a user and to display all hiring criteria in the aggregate hiring search case base associated with the job description to the user, the hiring criteria ordered according to one or more of the usefulness ratings of the respective hiring criteria or creation dates of the respective hiring criteria.\n25. The system of claim 23, further comprising a user interface configured to receive an indication of a plurality of job descriptions from a user and to display all hiring criteria in the aggregate hiring search case base associated with the plurality of job descriptions to the user, the hiring criteria ordered according to one or more of the usefulness ratings of the respective hiring criteria or creation dates of the respective hiring criteria.\n26. The system of claim 10, further comprising an intelligent agent including autonomous software configured to search for suitable candidates in the employee case base and/or external candidate case base as long as a hiring search remains open.\n27. The system of claim 10, wherein the rules specifying the hiring criteria for the at least one position include a list of one or more mandatory qualifications and one or more preferable, but non-mandatory, qualifications.\n28. The system of claim 10, further comprising a user interface configured to present a user with a menu of job descriptions, receive a selection of a job description from the user, present the user with a listing of qualifications, and receive an indication from the user of which qualifications in the list of qualifications are mandatory and which qualifications in the list of qualifications are optional for a hiring search.\n29. The system of claim 28, further comprising functionality to provide for the user to add a job description to the menu of job descriptions.\n30. The system of claim 28, further comprising functionality to provide for the user to add a qualification to the list of qualifications.\n31. The system of claim 10, configured to perform the method of claim 1.",
    "status": "Abandoned",
    "citations_own": [],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": []
}