{
    "patent_link": "https://patents.google.com/patent/US6038598A/en",
    "patent_id": "US6038598A",
    "title": "Method of providing one of a plurality of web pages mapped to a single uniform resource locator (URL) based on evaluation of a condition",
    "abstract": "A content author generates multiple sets of web pages and associated conditions which map to a specified uniform resource locator (URL). The web page sets, associated conditions, and a state information database are installed on a server system. A state setting device, which may be the content author's personal computer, sets the current state of the state information database associated with the web page sets within the server system. Upon receipt of a request for access to a selected web page identified by the URL, the server system evaluates the conditions based on the associated state to determine which one of the web page sets to return in response to a user's request. The state setting device updates the state, thereby dynamically affecting web page set selection, based on factors internal or external to the server system.",
    "inventors": [
        "Gunner D. Danneels"
    ],
    "assignee": "Intel Corp",
    "classifications": [],
    "claims": "\n1. A method of providing a web page by a server comprising:\nmapping a plurality of web pages to a single uniform resource locator (URL), the web pages each having at least one associated condition, such that a request for a web page indicated by the URL results in returning only one of the plurality of web pages mapped to the URL;\nsetting a state corresponding to the plurality of web pages in a database;\naccepting a request for a web page specified by the URL;\nselecting one of the plurality of web pages mapped to the URL;\nevaluating the at least one condition associated with the selected web page based on the state; and\nsending the selected web page when the at least one condition is met.\n2. The method of claim 1, wherein the plurality of web pages comprise a plurality of web page sets, each web page set comprising a plurality of web pages and having one entry web page, each web page set being associated with at least one condition, and wherein the sending step sends the entry web page for a web, page set corresponding to the selected web page.\n3. The method of claim 1, wherein the setting step comprises setting the state according to a current operating load of the server.\n4. The method of claim 1, wherein the setting step comprises setting the state according to a current operating status of an external device.\n5. The method of claim 4, wherein the external device is an environmental sensor.\n6. The method of claim 4, wherein the external device is a personal computer.\n7. The method of claim 1, wherein the setting step comprises setting the state according to a language selected by a user sending the request to the server.\n8. The method of claim 1, wherein the setting step comprises setting the state according to whether an author of the plurality of web pages is logged on to a network coupled to the server.\n9. The method of claim 1, further comprising creating the plurality of web pages and associated conditions and installing the plurality of web pages and associated conditions on the server.\n10. The method of claim 1, further comprising repeating the selecting and evaluating steps until at least one condition is met.\n11. A server system coupled to a computer network for conditionally providing a web page comprising:\nmeans for mapping a plurality of web pages to a single uniform resource locator (URL), the web pages each having at least one associated condition, such that a request for a web page indicated by the URL results in returning only one of the plurality of web pages mapped to the URL;\nmeans for setting a state corresponding to the plurality of web pages in a database;\nmeans for accepting a request for a web page specified by the URL;\nmeans for selecting one of the plurality of web pages mapped to the URL;\nmeans for evaluating the at least one condition associated with the selected web page based on the state; and\nmeans for sending the selected web page when the at least one condition is met.\n12. The server system of claim 11, wherein the plurality of web pages comprise a plurality of web page sets, each web page set comprising a plurality of web pages and having one entry web page, each web page set being associated with at least one condition, and wherein the sending means sends the entry web page for a web page set corresponding to the selected web page.\n13. The server system of claim 11, wherein the setting means comprises means for setting the state according to a current operating load of the server.\n14. The server system of claim 11, wherein the setting means comprises means for setting the state according to a current operating status of an external device.\n15. The server system of claim 14, wherein the external device is an environmental sensor.\n16. The server system of claim 14, wherein the external device is a personal computer.\n17. The server system of claim 11, wherein the setting means comprises means for setting the state according to a language selected by a user sending the request to the server.\n18. The server system of claim 11, wherein the setting means comprises means for setting the state according to whether an author of the plurality of web pages is logged on to the computer network coupled to the server.\n19. The server system of claim 11, further comprising means for creating the plurality of web pages and associated conditions and means for installing the plurality of web pages and associated conditions on the server.\n20. A server for providing conditional access to a web page comprising:\na plurality of web pages mapped to a single uniform resource locator (URL), the web pages each having at least one associated condition, such that a request for a web page indicated by the URL results in returning only one of the plurality of web pages mapped to the URL;\na database to store at least one state corresponding to the plurality of web pages in a database; and\na URL-to-file mapping function to accept a request for a web page specified by the URL, to select one of the plurality of web pages mapped to the URL, to evaluate the at least one condition associated with the selected web page based on the state; and to send the selected web page when the at least one condition is met.\n21. The server of claim 20, wherein the plurality of web pages comprise a plurality of web page sets, each web page set comprising a plurality of web pages and having one entry web page, each web page set being associated with at least one condition, and wherein the URL-to-file mapping function sends the entry web page for a web page set corresponding to the selected web page.\n22. The server of claim 20, further comprising means for setting the state according to a current operating load of the server.\n23. The server of claim 20, further comprising means for setting the state according to a current operating status of an external device.\n24. The server of claim 23, wherein the external device is an environmental sensor.\n25. The server of claim 23, wherein the external device is a personal computer.\n26. The server of claim 20, further comprising means for setting the state according to a language selected by a user sending the request to the server.\n27. The server of claim 20, further comprising means for setting the state according to whether an author of the plurality of web pages is logged on to a network coupled to the server.\n28. The server of claim 20, further comprising means for creating the plurality of web pages and associated conditions and means for installing the plurality of web pages and associated conditions on the server.\n29. A machine readable medium having stored therein a plurality of machine readable instructions designed to be executed by a processing unit, the machine readable instructions for mapping a plurality of web pages to a single uniform resource locator (URL), the web pages each having at least one associated condition, such that a request for a web page indicated by the URL results in returning only one of the plurality of web pages mapped to the URL, for setting a state corresponding to the plurality of web pages in a database, for accepting a request for a web page specified by the URL, for selecting one of the plurality of web pages mapped to the URL, for evaluating the at least one condition associated with the selected web page based on the state, and for sending the selected web page when the at least one condition is met.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5761662A",
        "US5774670A",
        "US5894554A",
        "US5918228A",
        "US5930792A",
        "US5933827A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6182116B1",
        "US6182125B1",
        "US6243761B1",
        "WO2001054034A1",
        "US6267672B1",
        "WO2001065373A1",
        "KR20010109046A",
        "WO2002023365A1",
        "GB2367665A",
        "US20020059223A1",
        "US20020087660A1",
        "US20020103876A1",
        "US20020112096A1",
        "US6438125B1",
        "US6442603B1",
        "US20020120644A1",
        "US20020156688A1",
        "US20020165940A1",
        "US20020169802A1",
        "US20020194382A1",
        "US20020198961A1",
        "US20030046343A1",
        "US6535889B1",
        "US20030055874A1",
        "US6549949B1",
        "US6557006B1",
        "US6565608B1",
        "US6571282B1",
        "WO2003044695A1",
        "US6578068B1",
        "US6601234B1",
        "US6601192B1",
        "US6615253B1",
        "US20030182449A1",
        "US20030182357A1",
        "US6636242B2",
        "US6640249B1",
        "US6640238B1",
        "US6640244B1",
        "US20030206189A1",
        "US20030219018A1",
        "US6662233B1",
        "GB2392744A",
        "US6715145B1",
        "US20040062369A1",
        "US6742015B1",
        "US6748386B1",
        "US20040122731A1",
        "US6757868B1",
        "US20040139192A1",
        "US20040153498A1",
        "US20040199497A1",
        "US6820111B1",
        "US20040268253A1",
        "US6842906B1",
        "US20050010577A1",
        "US20050015512A1",
        "US20050050021A1",
        "US20050086634A1",
        "US20050091224A1",
        "US20050177401A1",
        "US6954901B1",
        "US6954220B1",
        "US20050229252A1",
        "US20050228781A1",
        "US6957233B1",
        "US20050273718A1",
        "US6976070B1",
        "US20060010396A1",
        "US6992687B1",
        "US20060047847A1",
        "US7015949B1",
        "US20060070022A1",
        "US7024488B1",
        "US7076085B1",
        "US20060168290A1",
        "US20060178952A1",
        "US7096417B1",
        "US20060190534A1",
        "US20060229952A1",
        "US20060277286A1",
        "US7177448B1",
        "US7185274B1",
        "US20070055663A1",
        "US7191168B1",
        "US7194678B1",
        "US7219160B1",
        "US20070124479A1",
        "US7234108B1",
        "US7243299B1",
        "US7289964B1",
        "US20080033860A1",
        "US7337389B1",
        "US7401115B1",
        "US7458014B1",
        "US20080320077A1",
        "US20090055290A1",
        "US20090234907A1",
        "US7650304B1",
        "US20100031137A1",
        "US20100100442A1",
        "US20100299406A1",
        "US20110145590A1",
        "US8026944B1",
        "US20110307334A1",
        "US8166155B1",
        "US8185608B1",
        "US8200837B1",
        "US20130047065A1",
        "US8429005B2",
        "US20130174000A1",
        "WO2014035870A1",
        "US8732528B1",
        "US8904277B2",
        "US20160191522A1",
        "US9424240B2",
        "US20190121863A1",
        "CN110377849A",
        "US10469561B2",
        "US10979235B2",
        "US11113411B2"
    ],
    "citedby_ftf": []
}