{
    "patent_link": "https://patents.google.com/patent/US4908761A/en",
    "patent_id": "US4908761A",
    "title": "System for identifying heavy product purchasers who regularly use manufacturers' purchase incentives and predicting consumer promotional behavior response patterns",
    "abstract": "There is provided a system and methodology for identifying the heaviest product purchasers who regularly use coupons and determining their promotional behavior response patterns of which involves initially preparing a list of names and addresses of consumers who are the most likely heaviest product purchasers who are regular coupon users and then delivering to them a plurality of product purchase incentives such as cents off coupons. The delivery of the coupons to the selected consumer households would also include at least one and preferably a plurality of consumer activated encoding devices each of which being designed to be attached to a coupon. The at least one consumer activated encoding device delivered to each consumer includes the name and address of the receiving consumer in machine readable language. Those coupons having the attached encoding devices are received for redemption like other coupons, however, the names and addresses of the consumers submitting the encoded coupons received for redemption are read and recorded and a refined list of consumer names and addresses that actually redeem cents-off coupons is created from the initial prepared list of consumers. Additionally, by including machine readable data relative to the product, such as size, price, etc., on every coupon and by periodically delivering additional coupons and consumer-activated encoding devices to the refined list of consumer names and addresses and analyzing the redemption characteristics of the various coupons, the consumer promotional behavior response can be determined and thus consumer promotional behaviour response patterns can be predicted with a high degree of accuracy.",
    "inventors": [
        "Roland Tai"
    ],
    "assignee": "GFG Corp",
    "classifications": [
        "G06Q30/02",
        "G06Q20/387",
        "G06Q30/0225",
        "G06Q30/0236",
        "G06Q30/0241"
    ],
    "claims": "\n1. A system for identifying by name and address those consumers who redeem redeemable product purchase incentives such as cents off coupons, said system comprising:\n(a) preparing an initial list of names and addresses of consumers who are to receive redeemable product purchase incentives;\n(b) delivering to those consumers on said initial list a plurality of redeemable product purchase incentives in a unit on a plurality of consumer products with at least one consumer activated encoding device indicating the name and address of the receiving consumer in machine readable language, each of said at least one consumer activated encoding device being adapted for physical association with a product purchase incentive;\n(c) receiving for redemption from receiving consumers those product purchase incentives submitted for redemption including those product purchase incentives physically associated with said consumer activated encoding devices;\n(d) machine reading and recording the names and addresses of receiving consumers that redeem the redeemable product purchase incentives physically associated with said consumer activated encoding devices; and\n(e) recreating out of said initial list a list of names and addresses of receiving consumers that actually redeem redeemable product purchase incentives.\n2. The system as defined in claim 1, wherein the number of redeemable product purchase incentives delivered in a unit to each consumer is greater than the number of consumer activated encoding devices in said unit.\n3. The system as defined in claim 1, wherein the step of delivering to those consumers on said initial list a plurality of redeemable product purchase incentives in a unit comprises mailing the units of product purchase incentives to the names and addresses of consumers on said initial list.\n4. The system as defined in claim 1, which further comprises the step of providing an incentive to the receiving consumer to physically associate said at least one consumer activated encoding device received by said consumer with a redeemable product purchase incentive.\n5. The system as defined in claim 4, wherein the step of providing an incentive to the receiving consumer comprises indicating on said consumer activated encoding device a value multiplier of the redeemable product purchase incentive when the consumer activated encoding device is physically associated with a redeemable product purchase incentive.\n6. A system for identifying by name and address those consumers who are the heaviest product purchasers who regularly use cents-off coupons, said system comprising:\n(a) preparing an initial list of names and addresses of consumers who are the most likely heaviest product purchasers who are regular cents-off coupon users;\n(b) delivering to those consumers on said initial list a plurality of redeemable cents-off coupons in a unit on a plurality of consumer products with at least one consumer activated encoding device indicating the name and address of the receiving consumer in machine readable language, each of said at least one consumer activated encoding device being adapted for physical association with a cents-off coupon;\n(c) receiving for redemption from receiving consumers those cents-off coupons submitted for redemption including those physically associated with said consumer activated encoding devices;\n(d) machine reading and recording the names and addresses of receiving consumers that redeem the cents-off coupons physically associated with said consumer activated encoding devices; and\n(e) recreating out of said initial list a list of names and addresses of the heaviest product purchasers who regularly use cents-off coupons.\n7. The system as defined in claim 6, wherein the number of redeemedable cents-off coupons delivered in a unit to each consumer is greater than the number of consumer activated encoding devices in said unit.\n8. The system as defined in claim 6, wherein the step of delivering to those consumers on said initial list a plurality of redeemable cents-off coupons in a unit comprises mailing the units of cents-off coupons to the names and addresses of consumers on said initial list.\n9. The system as defined in claim 6, which further comprises the step of providing an incentive to the receiving consumer to physically associate said at least one consumer activated encoding device received by said consumer with a redeemable cents-off coupon.\n10. The system as defined in claim 9, wherein the step of providing an incentive to the receiving consumer comprises indicating on said consumer activated encoding device a value multiplier of the redeemable cents-off coupon when the consumer activated encoding device is physically associated with a redeemable cents-off coupon.\n11. The system as defined in claim 6, which further comprises dividing said initial list into two equal groups on an alternate name-address basis and performing steps b to e on a first group and delivering regular coupons to a second group.\n12. The system as defined in claim 6, wherein the step of preparing an initial list of names and addresses of consumers who are the most likely heaviest product purchasers who are regular cents-off coupon users comprises:\n(a) geo-demographically analyzing the U.S. population utilizing U.S. Census data in order to segment all U.S. neighborhoods into homogeneous categories;\n(b) determining by means of an omnibus survey which of said homogeneous categories contain heavy product purchasers who regularly use cents-off coupons;\n(c) correlating a comprehensive geo-coded list of U.S. consumer household names and addresses with the homogeneously categorized neighborhoods to derive consumer names and addresses corresponding to the categorized neighborhoods; and\n(d) selecting those categorized neighborhoods which have been determined to include heavy product purchasers who regularly use cents-off coupons to derive a list of names and addresses of consumers who are the most likely heaviest product purchasers who are regular cents-off coupon users.\n13. The system as defined in claim 12, which further includes the step of continually updating said prepared initial list of names and addresses by comparing the U.S. Postal Service's annual change-of-address file to said list.\n14. The system as defined in claim 12, which further includes the step of purging said initial list of names and addresses of those who do not demographically fit the homogeneous set of the selected categorized neighborhoods by comparing a list of such consumers with the initial list.\n15. The system as defined in claim 12, wherein said list of consumers who do not fit the homogeneous set of the selected categorized neighborhoods is a list of retirees.\n16. A system for determining with a high degree of accuracy predictable consumer promotional behavior response patterns of heavy product purchasers who regularly use cents-off coupons, said system comprising:\n(a) preparing an initial list of names and addresses of consumers who are the most likely heaviest product purchasers who are regular cents-off coupon users;\n(b) delivering to those consumers on said initial list a plurality of redeemable cents-off coupons in a unit on a plurality of consumer products with at least one consumer activated encoding device indicating the name and address of the receiving consumer in machine readable language, each coupon having machine readable information thereon relating to product, value and product size, and each of said at least one consumer activated encoding device being adapted for physical association with a cents-off coupon;\n(c) receiving for redemption from receiving consumers those cents-off coupons submitted for redemption including those physically associated with said consumer activated encoding devices;\n(d) machine reading and recording the names and addresses of receiving consumers that redeem the cents-off coupons physically associated with said consumer activated encoding devices and reading and recording the machine readable information on said cents-off coupons;\n(e) recreating out of said initial list a list of names and addresses of the heaviest product purchasers who regularly use cents-off coupons, by eliminating from said initial list the names and addresses of those who do not redeem coupons which are physically associated with said consumer activated encoding devices;\n(f) repeating steps b to c utilizing the recreated list in place of the initial list at least once to form a database; and\n(g) analyzing said database to determine individual consumer's redemption frequency, specific product preference and coupon face value elasticity so as to determine promotional behavior response patterns of heavy product purchasers who regularly use cents-off coupons and thus predict such patterns with a high degree of accuracy.\n17. The system as defined in claim 16, which further comprises dividing said initial list into two equal groups on an alternate name-address basis and performing steps b to f on a first group and delivering regular coupons to a second group and alternating this sequence with each delivery program.\n18. The system as defined in claim 17, wherein said first and second groups are further subdivided into a plurality of equal cells and subsequent to a second delivery program the delivery of regular coupons among the various cells is rotated among all the cells.\n19. The system as defined in claim 16, wherein the number of redeemedable cents-off coupons delivered in a unit to each consumer is greater than the number of consumer activated encoding devices in said unit.\n20. The system as defined in claim 16, wherein the step of delivering to those consumers on said initial list a plurality of redeemable cents-off coupons in a unit comprises mailing the units of cents-off coupons to the names and addresses of consumers on said initial list.\n21. The system as defined in claim 16, which further comprises the step of providing an incentive to the receiving consumer to physically associate said at least one consumer activated encoding device received by said consumer with a redeemable cents-off coupon.\n22. The system as defined in claim 16, wherein the step of providing an incentive to the receiving consumer comprises indicating on said consumer activated encoding device a value multiplier of the redeemable cents-off coupon when the consumer activated encoding device is physically associated with a redeemable cents-off coupon.\n23. The system as defined in claim 16, wherein the step of preparing an initial list of names and addresses of consumers who are the most likely heaviest product purchasers who are regular cents-off coupon users comprises:\n(a) geo-demographically analyzing the U.S. population utilizing U.S. Census data in order to segment all U.S. neighborhoods into homogeneous categories;\n(b) determining by means of an omnibus survey which of said homogeneous categories contain heavy product purchasers who regularly use cents-off coupons;\n(c) correlating a comprehensive geo-coded list of U.S. consumer household names and addresses with the homogeneously categorized neighborhoods to derive consumer names and addresses corresponding to the categorized neighborhoods; and\n(d) selecting those categorized neighborhoods which have been determined to include heavy product purchasers who regularly use cents-off coupons to derive a list of names and addresses of consumers who are the most likely heaviest product purchasers who are regular cents-off coupon users.\n24. The system as defined in claim 23, which further includes the step of continually updating said prepared initial list of names and addresses by comparing the U.S. Postal Service's annual change-of-address file to said list.\n25. The system as defined in claim 23, which further includes the step of purging said initial list of names and addresses of those who do not demographically fit the homogeneous set of the selected categorized neighborhoods by comparing a list of such consumers with the initial list.\n26. The system as defined in claim 25, wherein said list of consumers who do not fit the homogeneous set of the selected categorized neighborhoods is a list of retirees.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4355372A",
        "US4554446A",
        "US4723212A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5053955A",
        "US5056019A",
        "US5085470A",
        "EP0491318A2",
        "WO1992010371A1",
        "US5137304A",
        "WO1992014213A1",
        "US5161109A",
        "EP0512413A2",
        "WO1992020030A1",
        "US5208445A",
        "US5227874A",
        "US5256863A",
        "WO1994003865A1",
        "US5305197A",
        "US5305196A",
        "US5314176A",
        "US5325303A",
        "US5353218A",
        "WO1994027231A1",
        "US5369571A",
        "US5368129A",
        "US5377095A",
        "WO1995003570A2",
        "US5388165A",
        "US5459306A",
        "WO1995027950A1",
        "US5467269A",
        "US5502636A",
        "US5504675A",
        "US5508731A",
        "WO1996030851A1",
        "US5581064A",
        "US5621812A",
        "FR2740074A1",
        "US5628004A",
        "US5642485A",
        "US5649114A",
        "WO1997035272A1",
        "US5689100A",
        "US5697844A",
        "US5708782A",
        "US5713795A",
        "US5774868A",
        "US5787156A",
        "US5832457A",
        "WO1998049640A1",
        "WO1998021713A3",
        "US5883940A",
        "US5898762A",
        "US5905246A",
        "US5915243A",
        "US5917893A",
        "WO1999039295A1",
        "WO1999042941A1",
        "US5956693A",
        "US5956695A",
        "US5974396A",
        "US5999908A",
        "US6016344A",
        "US6035280A",
        "US6039244A",
        "US6044135A",
        "US6055513A",
        "US6061660A",
        "US6064987A",
        "US6067524A",
        "US6070147A",
        "US6076068A",
        "US6098052A",
        "US6105000A",
        "US6119099A",
        "US6131101A",
        "US6138105A",
        "US6138906A",
        "WO2000074002A1",
        "US6223163B1",
        "US6230143B1",
        "US6237145B1",
        "US6240394B1",
        "US6278980B1",
        "US6292786B1",
        "US6292785B1",
        "US6298329B1",
        "US6298331B1",
        "US20010027409A1",
        "WO2001075726A1",
        "WO2001077856A1",
        "US20010037279A1",
        "US6321208B1",
        "US20010044739A1",
        "US6332126B1",
        "US6334108B1",
        "US6334109B1",
        "US20010056376A1",
        "US20020052776A1",
        "US20020052825A1",
        "US6397193B1",
        "US6415262B1",
        "US20020095333A1",
        "US6421986B1",
        "US20020100254A1",
        "US6430539B1",
        "US20020107739A1",
        "US6434223B2",
        "US20020116286A1",
        "US6449346B1",
        "US20020133407A1",
        "US20020161643A1",
        "US20020161653A1",
        "US20020161764A1",
        "US20020161670A1",
        "US20020169664A1",
        "WO2002095535A2",
        "US20020188510A1",
        "US6496804B2",
        "US6512415B1",
        "US6516302B1",
        "US6561426B1",
        "US6567786B1",
        "US6570967B2",
        "US6582304B2",
        "US6584753B2",
        "US20030126006A1",
        "US20030126146A1",
        "US20030130933A1",
        "US20030135442A1",
        "US20030135414A1",
        "US20030144933A1",
        "US20030149627A1",
        "US6622125B1",
        "US20030197710A1",
        "US20030204457A1",
        "US20030204444A1",
        "US20030216966A1",
        "US20030222096A1",
        "US6662525B2",
        "US6678360B1",
        "US6684195B1",
        "US6687679B1",
        "US20040024608A1",
        "US20040030662A1",
        "US6694300B1",
        "US20040032083A1",
        "US20040039679A1",
        "US20040039645A1",
        "US20040054593A1",
        "US20040076275A1",
        "US20040088325A1",
        "US20040084892A1",
        "US20040088312A1",
        "US20040088275A1",
        "US20040088322A1",
        "US20040088303A1",
        "US20040088287A1",
        "US20040088323A1",
        "US20040094614A1",
        "US20040111322A1",
        "US20040138953A1",
        "US20040143496A1",
        "US20040171378A1",
        "US20040177004A1",
        "US20040186802A1",
        "US20040217585A1",
        "US6820062B1",
        "US20050027601A1",
        "US20050027721A1",
        "US20050027622A1",
        "US20050043994A1",
        "US6862575B1",
        "US20050060062A1",
        "US6876978B1",
        "US6885994B1",
        "US20050109842A1",
        "US6922672B1",
        "US6932270B1",
        "US20050218216A1",
        "US6954732B1",
        "US6957189B2",
        "US6965868B1",
        "US20050261973A1",
        "US6980968B1",
        "US20060004642A1",
        "US6988077B1",
        "US20060020507A1",
        "US6993498B1",
        "US6993887B2",
        "US20060047573A1",
        "US20060069615A1",
        "US20060069606A1",
        "US7054830B1",
        "US20060122881A1",
        "US20060143073A1",
        "US20060157370A1",
        "US7103609B2",
        "US20060211488A1",
        "US20060218049A1",
        "US20060229946A1",
        "US20060235755A1",
        "US20060241965A1",
        "US7133834B1",
        "US7136634B1",
        "US20060271441A1",
        "US20070055708A1",
        "US7194423B2",
        "US20070064891A1",
        "US20070132836A1",
        "US7236942B1",
        "US20070174119A1",
        "US7251617B1",
        "US7272617B1",
        "US7272569B1",
        "US7296734B2",
        "US7299194B1",
        "US7308254B1",
        "US20080077484A1",
        "US20080091508A1",
        "US7364068B1",
        "US20080120155A1",
        "US7386485B1",
        "US20080142394A1",
        "US7392224B1",
        "US7401032B1",
        "US20080172145A1",
        "US7437313B1",
        "US20080263000A1",
        "US20080263065A1",
        "US20080319829A1",
        "US20090015652A1",
        "US20090018996A1",
        "US20090087520A1",
        "US20090138365A1",
        "US7542919B1",
        "US7546277B1",
        "US7546947B1",
        "US7587333B1",
        "US20090228343A1",
        "US20090224038A1",
        "US20090288012A1",
        "US20090327139A1",
        "US20090327016A1",
        "US7739162B1",
        "US20100205034A1",
        "US7827057B1",
        "US7826923B2",
        "US20100280880A1",
        "US7831467B1",
        "US20110029390A1",
        "US7899710B1",
        "US20110071874A1",
        "US20110082731A1",
        "US7954698B1",
        "US20110137718A1",
        "US7996260B1",
        "US20110238522A1",
        "US8059796B2",
        "US8175921B1",
        "US8175908B1",
        "US8225995B1",
        "US20120265628A1",
        "US8306908B1",
        "US8315909B1",
        "US8407095B2",
        "US8473341B1",
        "US8473342B1",
        "US8489532B2",
        "US8540574B1",
        "US8626581B2",
        "US8700458B2",
        "US8712857B1",
        "US8769567B1",
        "US8775245B2",
        "US8923766B2",
        "US9077460B2",
        "US9098859B2",
        "US9311383B1",
        "US9785995B2",
        "US9799041B2",
        "US10118099B2",
        "US10147108B2",
        "US10284454B2",
        "US10286326B2",
        "US10315113B2",
        "US10354263B2",
        "US10376793B2",
        "US10471348B2",
        "US10500498B2",
        "US10561945B2",
        "US10627983B2",
        "US10765948B2",
        "US10974150B2",
        "US11040286B2",
        "US11097193B2",
        "US11351459B2",
        "US11524234B2",
        "US11679330B2",
        "US11712627B2"
    ],
    "citedby_ftf": []
}