{
    "patent_link": "https://patents.google.com/patent/US20050271071A1/en",
    "patent_id": "US20050271071A1",
    "title": "Method and system for accurately calculating latency variation on an end-to-end path in a network",
    "abstract": "A high-resolution, per-packet measurement tool for analyzing a computer network that operates by sending a predetermined number of packets from a sender machine to a receiver machine with measurement information inserted into the packet. The system kernel at the sending machine stamps a sequence number and the sender's local time into the data section of each packet. When packets arrive at the receiver machine, they are similarly stamped by the receiving machine's kernel with the receiving machine's local time. The maintained packet information serves as the basis for latency analysis. For example, one set of latencies can be obtained with QoS mechanisms turned on, and another set with QoS mechanisms turned off, whereby the benefits of the QoS mechanisms can be accurately determined. To analyze the latencies, the present invention normalizes each time and each latency into relative latency information. Clock skew and timer jumps may be handled as part of the normalization.",
    "inventors": [
        "Shreedhar Madhavapeddi",
        "Yoram Bernet",
        "Rajesh Sundaram",
        "John Holmes"
    ],
    "assignee": "Microsoft Technology Licensing LLC",
    "classifications": [],
    "claims": "\n1. A system for obtaining information transmitted over a network, comprising:\na network sender system, including:\na sender process configured to cause transmission of a plurality of selected packets on the network; and\na sender component configured to associate a sender timestamp of the sender with each selected packet;\nand,\na network receiver system configured to receive each selected packet transmitted on the network, the receiver system including:\na receiver component configured to associate a receiver timestamp with each selected packet received; and\na receiver process, the receiver process maintaining information corresponding to the sender timestamp and receiver timestamp in association with each selected packet.\n2. The system of claim 1 further comprising, a process that normalizes the sender timestamp and receiver timestamp associated with each selected packet.\n3. The system of claim 1 further comprising a process that determines a latency for each selected packet based on the information corresponding to the sender and receiver timestamps.\n4. The system of claim 3 wherein the receiver process includes the process that determines each latency.\n5. The system of claim 3 further comprising, a process that normalizes each latency.\n6. The system of claim 3 wherein the sender system includes a sender clock that maintains time at a first rate and the receiver system includes a receiver clock that maintains time at a second rate, and further comprising, a process that adjusts each latency to compensate for a difference between the first rate and second rate.\n7. The system of claim 3 further comprising, a process that compensates for a timer jump.\n8. The system of claim 1 further comprising a noise generator connected to the network, and a noise sink connected to the network.\n9. The system of claim 1 wherein the sender component runs in a kernel mode of the sender and wherein the receiver component runs in a kernel mode of the receiver.\n10. At least one computer-readable medium having computer-executable instructions, which when executed perform steps, comprising:\ntransmitting a plurality of test packets from a sender to a receiver, and for each transmitted packet:\nwriting a sequence number into a first field; and\nwriting a sender-relative timestamp into a second field;\nand,\nreceiving at least some of the plurality of test packets, and for each packet received:\nwriting a receiver-relative timestamp into a third field; and\nmaintaining information corresponding to the sequence number, the sender-relative timestamp and the receiver-relative timestamp.\n11. The computer-readable medium of claim 10 wherein the information corresponding to the sender-relative timestamp and the receiver-relative timestamp includes a value indicative of a latency.\n12. The computer-readable medium of claim 11 wherein the value indicative of the latency is normalized relative to at least one other latency.\n13. A computer-readable medium having stored thereon a data structure, comprising:\na first field comprising data representative of a packet sequence number;\na second field comprising data representative of a packet send time; and\na third field comprising data representative of a packet time or a packet latency time, the latency time processed to be relative to the packet send time and a packet receive time.\n14. The computer-readable medium of claim 13 wherein the computer-readable medium comprises a data transmission medium.\n15. The computer-readable medium of claim 13 further comprising, a fourth field comprising data representative of the packet receive time.\n16. The computer-readable medium of claim 13 wherein the packet latency time is normalized relative to another packet latency time.\n17. The computer-readable medium of claim 13 wherein the packet send time is normalized relative to another packet send time.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US5477531A",
        "US5675581A",
        "US6112323A",
        "US6308072B1",
        "US20010043586A1",
        "US6327274B1",
        "US6377579B1",
        "US6678268B1",
        "US6714898B1",
        "US6975656B1",
        "US6977929B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20020049849A1",
        "US20070183330A1",
        "US20090124250A1",
        "US20100080143A1",
        "US20100323689A1",
        "US20110164625A1",
        "US20130077500A1",
        "US20130100816A1",
        "US20140173090A1",
        "US20140359036A1",
        "WO2015147713A1",
        "US20150319213A1",
        "US20150358480A1",
        "WO2016175957A1",
        "US10326862B2",
        "US11233719B1"
    ],
    "citedby_ftf": [
        "US6731600B1",
        "US6975656B1",
        "US7127422B1",
        "US20030117959A1",
        "US7114091B2",
        "US7747729B2",
        "US7296083B2",
        "US7397877B2",
        "US8149880B1",
        "US7792158B1",
        "US7693082B2",
        "US7843815B2",
        "US7822073B2",
        "US8997076B1",
        "US7970946B1",
        "US8224624B2",
        "US20090307347A1",
        "US8130752B2",
        "US8165011B2",
        "US9122859B1",
        "US8108557B2",
        "US8966110B2",
        "DE102010020663A1",
        "DE102010020662A1",
        "WO2013158149A1",
        "US9131010B2",
        "US20150286416A1",
        "CN106487608B",
        "US20170093677A1"
    ]
}