{
    "patent_link": "https://patents.google.com/patent/US5732397A/en",
    "patent_id": "US5732397A",
    "title": "Automated decision-making arrangement",
    "abstract": "An automated system for use in decision-making, comprises input, output processing and storage capabilities. The storage and processing portions of the system include a number of components which receive information and data specific to a selected topic of decision-making. The components perform data collection, screening and decision-making functions. The system compares received data to previously stored data and identifies received data which does and does not correspond to the previously stored data. If the data does correspond, the system implements a first decision operation. If the received data does not correspond, the system determines the nature and degree of such non-correspondence, and implements a decision operation which is reflective of the nature and degree of the non-correspondence. If the nature and degree of non-correspondence cannot be determined, additional data pertaining to the selected topic is requested and compared to the previously stored data in an iterative manner. Discrepancies existing between corresponding elements of data are identified. The system also identifies a plurality of alternative options for the first and second decision operations, each of which may alternatively be selected to form at least a part of the decision operation. Data relating to the decision operations implemented are stored and compared to subsequently received data relating to outcomes. The system may be modified based on this comparison.",
    "inventors": [
        "Arthur W. DeTore",
        "Russell D. Suever"
    ],
    "assignee": "Swiss Re AG",
    "classifications": [
        "G06Q10/06",
        "G06Q40/00",
        "G16H50/20"
    ],
    "claims": "\n1. An automated system for use in decision-making processes, comprising information processing means and storage means, input and output means for receiving and communicating data and processed information to and from said processing means and storage means, said storage means comprising a plurality of components, each component containing selected elements of declarative background knowledge specific to a selected decision-making process screening means for comparing selected elements of data received from the input means to defined elements of the background knowledge stored in the storage means and for implementing a first decision operation if the inputted data corresponds to respective elements of the background knowledge, decision-making means for identifying inputted data which does not correspond to respective elements of the background knowledge, means for determining the nature and degree of said non-correspondence, and means for comparing additional elements of data received from the input means, reflective of the nature and degree of said non-correspondence, to additional elements of the background knowledge and for implementing a second decision operation based on said comparison.\n2. An automated system according to claim 1, wherein said means for determining the nature of said non-correspondence comprises means for reviewing the non-corresponding data and comparing that data to previously stored data to determine the nature of said non-correspondence.\n3. An automated system according to claim 2, wherein the non-corresponding data is compared to data representative of at least one of a plurality of previously stored model data sets to determine the nature of non-correspondence existing between the inputted data and the background knowledge.\n4. An automated system according to claim 2, wherein said means for determining the degree of non-correspondence comprises means for reviewing the non-corresponding data and comparing that data to previously stored data to determine the degree of said non-correspondence.\n5. An automated system according to claim 4, wherein the non-corresponding data is compared to a previously stored range of data values to determine the degree of non-correspondence existing between the data and the background knowledge.\n6. An automated system according to claim 1, wherein said decision-making component further comprises means for identifying elements of the inputted data which do not correspond to respective elements of the background knowledge and for which the nature and degree of non-correspondence cannot be determined.\n7. An automated system according to claim 6, wherein said means for implementing at least one of the first and second decision operations comprises means for identifying a plurality of alternative options, each of which are alternatively selected to form at least a part of said decision operation, means for comparing expected outcomes of said options, and means for selecting from among said options.\n8. An automated system according to claim 7, further comprising means for storing data relating to the decision operations implemented, means for comparing said data to subsequently received data relating to an outcome of the decision-making process, and means for adding to, deleting from or modifying at least one of the components of the storage means based on said comparison.\n9. An automated system according to claim 6, further comprising means for requesting additional data pertaining to the selected decision-making process, means for comparing the additional data to additional elements of the background knowledge, and means for implementing one of said first and second decision operations.\n10. An automated system according to claim 9, further comprising means for comparing the additional data to the previously inputted data, and for identifying discrepancies existing between corresponding elements of said data.\n11. An automated system according to claim 1, wherein said means for implementing at least one of the first and second decision operations comprises means for identifying a plurality of alternative options, each of which are alternatively selected to form at least a part of said decision operation, means for comparing expected outcomes of said options, and means for selecting from among said options.\n12. An automated system according to claim 1, further comprising means for storing data relating to the decision operations implemented, means for comparing said data to subsequently received data relating to an outcome of the decision-making process, and means for adding to, deleting from or modifying at least one of the components of the storage means based on said comparison.\n13. An automated system according to claim 1, further comprising means for selectively compiling data relating to the decision operations implemented for purposes of evaluating the quality and consistency of decisions made.\n14. An automated method for use in decision-making processes using a system having information processing means and storage means, input and output means for receiving and communicating data and processed information to and from said processing means and storage means, said storage means comprising a plurality of components, each component containing selected elements of declarative background knowledge specific to a selected decision-making process, said automated method comprising the steps of:\n(a) inputting data pertaining to the selected decision-making process;\n(b) comparing selected elements of the inputted data to defined elements of the background knowledge stored in the storage means and implementing a first decision operation if the inputted data corresponds to respective elements of the background knowledge;\n(c) identifying elements of the inputted data which do not correspond to respective elements of the background knowledge;\n(d) determining the nature and degree of said non-correspondence; and\n(e) comparing additional elements of data received from the input means, based upon the nature and degree of said non-correspondence, to elements of the background knowledge and implementing a second decision operation based upon said comparison.\n15. The method of claim 14, further comprising the step of reviewing the non-corresponding data and comparing that data to previously stored data to determine the nature of said non-correspondence.\n16. The method of claim 15, wherein the non-correspondence data is compared to data representative of at least one of a plurality of previously stored model data sets to determine the nature of non-correspondence existing between the inputted data and the background knowledge.\n17. The method of claim 15, further comprising the step of reviewing the non-corresponding data and comparing said non-corresponding data to previously stored data to determine the degree of said non-correspondence.\n18. The method of claim 17, wherein the non-corresponding data is compared to a previously stored range of data values to determine the degree of non-correspondence existing between the inputted data and the background knowledge.\n19. The method of claim 14, further comprising the step of identifying elements of the inputted data which do not correspond to respective elements of the background knowledge and for which the nature and degree of non-correspondence cannot be determined.\n20. The method of claim 19, further comprising the additional steps of identifying a plurality of alternative options, each of which are alternatively selected to form at least a part of said decision operation, comparing expected outcomes of said options, and selecting from among said options.\n21. The method of claim 19, further comprising the steps of storing data relating to the decision operations implemented, comparing said data to subsequently inputted data relating to an outcome of the decision-making process, and adding, deleting, or modifying the background knowledge in at least one of the components based on said comparison.\n22. The method of claim 19, further comprising the steps of requesting additional data pertaining to the selected decision-making process, inputting and comparing the additional data to additional elements of the background knowledge, and implementing one of said first and second decision operations.\n23. The method of claim 22, further comprising the additional step of comparing the additional data to the previously inputted data, and identifying discrepancies existing between corresponding elements of said data.\n24. The method of claim 14, comprising the additional steps of identifying a plurality of alternative options, each of which are alternatively selected to form at least a part of said decision operation, comparing expected outcomes of said options, and selecting from among said options.\n25. The method of claim 14, further comprising the additional steps of storing data relating to the decision operations implemented, comparing said data to subsequently received data relating to an outcome of the decision-making process, and adding, deleting or modifying the background knowledge in at least one of the components based on said comparison.\n26. The method of claim 14, further comprising the additional step of selectively compiling data relating to the decision operations implemented for purposes of evaluating the quality and consistency of decisions made.\n27. An automated system according to claim 1, wherein said components of the storage means comprise two or more of a group which includes a data base, an installation specific data base, topical decision-making information, a decision-making file, and a management information data base.\n28. An automated system according to claim 27, wherein said data base contains general background knowledge relevant to the selected decision-making process.\n29. An automated system according to claim 27, wherein said installation specific data base contains rules, guidelines, procedures and related information specific to a particular system user.\n30. An automated system according to claim 27, wherein said topical decision-making information comprises at least one of structural elements, functional elements, problem elements and decision-making reference material relating to the selected decision-making process.\n31. An automated system according to claim 30, wherein said structural elements include major components of declarative background knowledge used in the selected decision-making process.\n32. An automated system according to claim 30, wherein said functional elements comprise elements of knowledge which relate to how the structure elements function.\n33. An automated system according to claim 30, wherein said problem elements include statements or definitions of problems which may occur with the structural elements or the functional elements.\n34. An automated system according to claim 30, wherein said decision-making reference material includes at least one of a library of abbreviations and a dictionary of terms.\n35. An automated system according to claim 30, wherein at least one of said structural, functional and problem elements includes a programmed knowledge base having one or more expert modules relating to the selected decision-making process.\n36. An automated system according to claim 27, wherein said decision-making file includes at least one of criteria, alternatives, weighing functions, and utilities for use in the selected decision-making process.\n37. An automated system according to claim 27, wherein said management information data base comprises results of selected decisions made by the system and each user of the system.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4346442A",
        "US4376978A",
        "US4591983A",
        "US4595982A",
        "US4597046A",
        "US4622013A",
        "US4642768A",
        "US4648044A",
        "US4658370A",
        "US4674044A",
        "US4722055A",
        "US4741043A",
        "US4754410A",
        "US4766539A",
        "US4829426A",
        "US4831526A",
        "US4884218A",
        "US4975840A",
        "US5005143A",
        "US5065338A",
        "US5131074A",
        "US5278751A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5819238A",
        "WO1999033390A2",
        "WO2000041714A1",
        "WO2000046651A2",
        "US6105007A",
        "US6112190A",
        "US6154731A",
        "WO2001033316A2",
        "US6253186B1",
        "US20010029477A1",
        "US20010037334A1",
        "US6330546B1",
        "US20010054022A1",
        "US20020007342A1",
        "US20020013716A1",
        "US20020029157A1",
        "US20020042731A1",
        "US20020046067A1",
        "WO2002039362A1",
        "US20020062238A1",
        "US20020068857A1",
        "US20020133384A1",
        "US20020138417A1",
        "US20020143562A1",
        "US20020147669A1",
        "US20020194098A1",
        "US20020198926A1",
        "US6523044B1",
        "US20030046170A1",
        "US20030050803A1",
        "US20030069742A1",
        "US20030083908A1",
        "US20030083760A1",
        "US20030101128A1",
        "US20030120537A1",
        "US20030130920A1",
        "US6594643B1",
        "US6601034B1",
        "US20030167219A1",
        "US20030167185A1",
        "US20030167221A1",
        "US6622137B1",
        "US20030177087A1",
        "EP1358606A2",
        "US20030208385A1",
        "US6647410B1",
        "US20030225687A1",
        "US20030233319A1",
        "US20030233260A1",
        "US20030236742A1",
        "US20040006532A1",
        "US20040006533A1",
        "US20040024671A1",
        "WO2004023329A1",
        "US6725209B1",
        "US20040078321A1",
        "US20040083165A1",
        "US20040088195A1",
        "US20040088198A1",
        "US20040088197A1",
        "US20040088199A1",
        "US20040085357A1",
        "US20040088196A1",
        "US20040111278A1",
        "US20040117215A1",
        "US20040133508A1",
        "US20040138998A1",
        "US20040148241A1",
        "US20040148566A1",
        "US20040162773A1",
        "US20040186804A1",
        "US20040193532A1",
        "US6801885B1",
        "US20040199448A1",
        "US6823319B1",
        "US20040236647A1",
        "US20050060204A1",
        "US20050060252A1",
        "US6901393B1",
        "US20050144124A1",
        "US6925468B1",
        "US20050182713A1",
        "US6934687B1",
        "US20050187840A1",
        "US20050187847A1",
        "US20050187848A1",
        "US20050187849A1",
        "US20050187846A1",
        "US20050187844A1",
        "US20050192881A1",
        "US6952741B1",
        "US20050257220A1",
        "US20050276401A1",
        "US20060004719A1",
        "US20060004878A1",
        "US20060004701A1",
        "US20060004814A1",
        "US20060004866A1",
        "US7009610B1",
        "US20060059021A1",
        "US20060085338A1",
        "US7039623B1",
        "US7050999B1",
        "US20060112046A1",
        "US20060116915A1",
        "US20060117046A1",
        "US7089205B1",
        "US7095426B1",
        "US20060190372A1",
        "US20060218010A1",
        "US20060230010A1",
        "US20060259417A1",
        "US20060282379A1",
        "US20070022076A1",
        "US20070021856A1",
        "US7184963B1",
        "US7212996B1",
        "US20070156574A1",
        "US7251624B1",
        "US20070192128A1",
        "US20070198116A1",
        "US20070198516A1",
        "US20070239650A1",
        "US7295999B1",
        "US20080045811A1",
        "US20080059746A1",
        "US7343307B1",
        "US7353196B1",
        "US7356499B1",
        "US7359863B1",
        "US20080091471A1",
        "US7363264B1",
        "US20080109341A1",
        "US7376489B1",
        "US7398219B1",
        "US7401059B1",
        "US20080172324A1",
        "US7409364B1",
        "US7418400B1",
        "US7430514B1",
        "US7430515B1",
        "US20080254421A1",
        "US20080255429A1",
        "US20080312513A1",
        "US20080319922A1",
        "US20090006137A1",
        "US20090006138A1",
        "US20090006140A1",
        "US7480631B1",
        "US20090063234A1",
        "US20090099862A1",
        "US7526487B1",
        "WO2009061514A1",
        "US7542921B1",
        "US7546304B1",
        "US20090187428A1",
        "US7571171B1",
        "US7571107B1",
        "US7580878B1",
        "US7584138B2",
        "US7593880B2",
        "US7624068B1",
        "US20090299767A1",
        "US20090313163A1",
        "US7668777B2",
        "US7685064B1",
        "US7693731B1",
        "US7693844B1",
        "US7707192B1",
        "US20100114604A1",
        "US7756896B1",
        "US20100199279A1",
        "US7780595B2",
        "US7831509B2",
        "US7831451B1",
        "US7890343B1",
        "US7895098B2",
        "US7895064B2",
        "US7899722B1",
        "US7925578B1",
        "US7953663B1",
        "US20110131136A1",
        "US7962396B1",
        "US20110161958A1",
        "US7974895B1",
        "US8010390B2",
        "US8015138B2",
        "US8095392B1",
        "US8140415B2",
        "USRE43433E1",
        "US8209246B2",
        "US20120179501A1",
        "US8285615B2",
        "US8337409B2",
        "US8429006B1",
        "US8433634B1",
        "US8478637B1",
        "US8489497B1",
        "US8533030B1",
        "US8612263B1",
        "US8635130B1",
        "US8701047B2",
        "US8751391B2",
        "US8762245B1",
        "US9005119B2",
        "US9081879B2",
        "US20150356685A1",
        "US20170278208A1",
        "US9965741B2",
        "US10169608B2",
        "US20190095899A1",
        "US10445795B2",
        "US10614452B2",
        "US10755350B1"
    ],
    "citedby_ftf": []
}