{
    "patent_id": "US-10505616-B1",
    "title": "Method and apparatus for machine learning based wide beam optimization in cellular network ",
    "assignee": "Samsung Electronics Co., Ltd.",
    "publication_date": "2019-12-10",
    "patent_link": "https://patents.google.com/patent/US10505616B1/en",
    "inventors": [
        "Hao Chen",
        "Young Han Nam",
        "Rubayet Shafin",
        "Jianzhong Zhang"
    ],
    "classifications": [
        "H04B7/0639",
        "H04B7/0695",
        "G06N3/006",
        "G06N3/02",
        "G06N3/045",
        "G06N3/08",
        "G06N3/126",
        "H04B17/309",
        "H04B17/318",
        "H04B17/336",
        "H04B7/0632",
        "H04W24/02",
        "H04W88/02",
        "H04W88/12",
        "G06N3/044",
        "G06N3/048"
    ],
    "abstract": "An apparatus and method for controlling and optimizing the broadcast beam for base stations (BS) using user equipment (UE) measurements with machine learning is provided. The apparatus and method is configured to select a first beam for each BS, send selected beams for each BS, receive measurement information of a first beam from UEs via BSs, preprocess the measurement results, use a neural network or a table for each BS to give a score for each broadcast beam in the beam pool, select a second beam with the highest score for each BS either from a neural network or a table, train the neural network for broadcast beam optimization offline based on a UE distribution pattern and ray-tracing data, identify typical UE distribution patterns based on AI classification algorithms and UE history measurement and location information, and create scenario-specific ray-tracing data based on typical UE distribution patterns.",
    "claims": "\n1. A user equipment (UE) in a wireless communication system, the UE comprising:\na transceiver configured to:\nreceive, from a central controller (CC) via a base station (BS), information of a first beam that is used in a measurement report; and\ntransmit, to the CC via the BS, the measurement report including a measurement result of the first beam,\nwherein:\nthe first beam for the BS is selected, by the CC, from a set of beams in a candidate beam pool including predetermined candidate beams, the set of beams being allocated to the BS;\nconsecutive measurement results corresponding to the set of beams in the candidate beam pool along with the measurement result of the first beam are preprocessed by the CC;\nbeam scores for the first beam based on the measurement result of the first beam are calculated by the CC; and\na second beam based on the beam scores is selected by the CC, the second beam being determined as a beam including a highest score among the set of beams in the candidate beam pool.\n2. The UE of claim 1, wherein the consecutive measurement results comprise at least one of a reference signal received power (RSRP), a reference signal received quality (RSRQ), a signal to interference and noise ratio (SINR), an identification (ID), or location information of the UEs.\n3. The UE of claim 1, wherein:\nacceptability of the measurement result of the first beam is determined, by the CC, based on a threshold;\na UE connection vector based on the measurement result and the threshold is determined by the CC;\nthe UE connection vector to a two-dimensional connection (2D) map based on location information of the UEs is reshaped by the CC; and\nthe beam scores based on previous beam scores and the consecutive measurement results is calculated by the CC.\n4. The UE of claim 1, wherein:\na deep neural network to select a best beam is configured by the CC;\nthe best beam using the deep neural network is selected by the CC;\nthe preprocessed consecutive measurement results within a time window from the each of the BSs is inputted, by the CC, to the deep neural network of the BSs;\na one-hot output of the deep neural network is identified, by the CC, as an indicator for the best beam; and\nweights of the deep neural network are updated, by the CC, based on the preprocessed consecutive measurement results.\n5. The UE of claim 1, wherein:\nUE distribution patterns are obtained, by the CC, based on a history of measurement results from a UE;\nray-tracing data with the UE distribution patterns is combined, by the CC, to obtain scenario-specific ray-tracing data; and\na best beam based on the scenario-specific ray-tracing data is searched, by the CC, for each of the UE distribution patterns.\n6. The UE of claim 5, where:\nthe measurement results are classified, by the CC, into the UE distribution patterns; and\nthe best beam for the UE distribution patterns is selected, by the CC, based on the scenario-specific ray-tracing data.\n7. The UE of claim 1, wherein each of the BSs comprises a data unit/multi-input-multi-out (DU/MMU).\n8. A central controller (CC) in a wireless communication system, the CC comprising:\na processor configured to:\nselect, from a set of beams in a candidate beam pool including predetermined candidate beams, a first beam for each of base stations (BSs), wherein the set of beams is allocated to the BSs; and\ninstruct each of the BSs to transmit, to user equipments (UEs) belonging to each of the BSs, signals with the first beam that is used in a measurement report by the UEs; and\na transceiver operably connected to the processor, the transceiver configured to:\ntransmit, to each of the BSs, information of the first beam;\nreceive, from the UEs via the BSs, the measurement report including a measurement result of the first beam,\nwherein the processor is further configured to:\npreprocess, for each of the BSs, consecutive measurement results that correspond to the set of beams in the candidate beam pool along with the measurement result of the first beam;\ncalculate, for each of the BSs, beam scores for the first beam based on the consecutive measurement results of the first beam; and\nselect, for each of the BSs, a second beam based on the beam scores,\nwherein, for each of the BSs, the second beam is determined as a beam including a highest score among the set of beams in the candidate beam pool.\n9. The CC of claim 8, wherein the consecutive measurement results comprise at least one of a reference signal received power (RSRP), a reference signal received quality (RSRQ), a signal to interference and noise ratio (SINR), an identification (ID), or location information of the UEs.\n10. The CC of claim 8, wherein the processor is further configured to:\ndetermine whether the measurement result of the first beam is acceptable based on a threshold;\nidentify a UE connection vector based on the determined measurement result and the threshold;\nreshape the UE connection vector to a two-dimensional connection (2D) map based on location information of the UEs; and\ncalculate, for each of the BSs, the beam scores based on previous beam scores and the consecutive measurement results.\n11. The CC of claim 8, wherein the processor is further configured to:\nconfigure, for each of the BSs, a deep neural network to generate a score on each beam for each cell and to select a best beam;\nselect, for each of the BSs, the best beam using the deep neural network;\ninput, to the deep neural network of the BSs, the preprocessed consecutive measurement results within a time window from the each of the BSs;\nidentify a one-hot output of the deep neural network as an indicator for the best beam; and\nupdate, for each of the BSs, weights of the deep neural network based on the preprocessed consecutive measurement results.\n12. The CC of claim 8, wherein the processor is further configured to:\nobtain, for each of the BSs, UE distribution patterns based on a history of measurement results from a UE;\ncombine, for each of the BSs, ray-tracing data with the UE distribution patterns to obtain scenario-specific ray-tracing data; and\nsearch a best beam based on the scenario-specific ray-tracing data for each of the UE distribution patterns.\n13. The CC of claim 12, where the processor is further configured to:\nclassify the measurement results into the UE distribution patterns; and\nselect the best beam for the UE distribution patterns based on the scenario-specific ray-tracing data.\n14. The CC of claim 8, wherein each of the BSs comprises a data unit/multi-input-multi-out (DU/MMU).\n15. A method of a central controller (CC) in a wireless communication system, the method comprising:\nselecting, from a set of beams in a candidate beam pool including predetermined candidate beams, a first beam for each of base stations (BSs), wherein the set of beams is allocated to the BSs;\ninstructing each of the BSs to transmit, to user equipments (UEs) belonging to each of the BSs, signals with the first beam that is used in a measurement report by the UEs;\ntransmitting, to each of the BSs, information of the first beam;\nreceiving, from the UEs via the BSs, the measurement report including a measurement result of the first beam;\npreprocessing, for each of the BSs, consecutive measurement results that correspond to the set of beams in the candidate beam pool along with the measurement result of the first beam;\ncalculating, for each of the BSs, beam scores for the first beam based on the consecutive measurement results of the first beam; and\nselecting, for each of the BSs, a second beam based on the beam scores,\nwherein, for each of the BSs, the second beam is determined as a beam including a highest score among the set of beams in the candidate beam pool.\n16. The method of claim 15, wherein the consecutive measurement results comprise at least one of a reference signal received power (RSRP), a reference signal received quality (RSRQ), a signal to interference and noise ratio (SINR), an identification (ID), or location information of the UEs.\n17. The method of claim 15, further comprising:\ndetermining whether the measurement result of the first beam is acceptable based on a threshold;\nidentifying a UE connection vector based on the determined measurement result and the threshold;\nreshaping the UE connection vector to a two-dimensional connection (2D) map based on location information of the UEs; and\ncalculating, for each of the BSs, the beam scores based on previous beam scores and the consecutive measurement results.\n18. The method of claim 15, wherein:\nconfiguring, for each of the BSs, a deep neural network to select a best beam;\ngenerating, for each of the BSs, a score on each beam for each cell;\nselecting, for each of the BSs, the best beam using the deep neural network;\ninputting, to the deep neural network of the BSs, the preprocessed consecutive measurement results within a time window from the each of the BSs;\nidentifying a one-hot output of the deep neural network as an indicator for the best beam; and\nupdating for each of the BSs, weights of the deep neural network based on the preprocessed consecutive measurement results.\n19. The method of claim 15, further comprising:\nobtaining, for each of the BSs, UE distribution patterns based on a history of measurement results from a UE;\ncombining, for each of the BSs, ray-tracing data with the UE distribution patterns to obtain scenario-specific ray-tracing data; and\nsearching a best beam based on the scenario-specific ray-tracing data for each of the UE distribution patterns.\n20. The method of claim 19, further comprising:\nclassifying the measurement results into the UE distribution patterns; and\nselecting the best beam for the UE distribution patterns based on the scenario-specific ray-tracing data.",
    "status": "Active",
    "citations_own": [
        "US20030224828A1",
        "US20140073337A1",
        "US20150257073A1",
        "US20160065284A1",
        "US20160323075A1",
        "US20160330643A1",
        "US20170208496A1",
        "US20170265111A1",
        "US20190116605A1",
        "US20190230544A1",
        "US20190281511A1",
        "US20190280836A1",
        "US20190281587A1"
    ],
    "citations_ftf": [
        "KR102158151B1",
        "US20190110210A1",
        "CN108183739B"
    ],
    "citedby_own": [
        "US10742282B2",
        "KR102154481B1",
        "US11304066B1",
        "US11546033B2",
        "US11576109B2"
    ],
    "citedby_ftf": [
        "CN112368950A",
        "WO2020078590A1",
        "KR102195570B1",
        "WO2021045748A1",
        "CN112953601B",
        "US11689940B2",
        "CN111277308A",
        "CN111182511B",
        "CN111446999A",
        "WO2021191176A1",
        "US20210326701A1",
        "US11424791B2",
        "US11438050B2",
        "CN111654342B",
        "CN111770546B",
        "US11663472B2",
        "KR102204783B1",
        "KR20230066316A",
        "CN114390580A",
        "CN112566253B",
        "CN112367683B",
        "CN114531698A",
        "CN112911613A",
        "CN112822781B",
        "WO2022161599A1",
        "FI20215133A1",
        "WO2022184282A1",
        "CN113316174B",
        "CN113316154B",
        "CN113489521B",
        "TWI769911B",
        "CN113709701B",
        "WO2023071760A1",
        "EP4184804A1",
        "CN115882916A",
        "WO2023115437A1",
        "CN114466386B",
        "WO2023139487A1",
        "TWI801102B",
        "CN115102589B",
        "US11784693B1",
        "CN115426007B"
    ]
}