{
    "patent_link": "https://patents.google.com/patent/US6990628B1/en",
    "patent_id": "US6990628B1",
    "title": "Method and apparatus for measuring similarity among electronic documents",
    "abstract": "A method and apparatus are provided for determining when electronic documents stored in a large collection of documents are similar to one another. A plurality of similarity information is derived from the documents. The similarity information may be based on a variety of factors, including hyperlinks in the documents, text similarity, user click-through information, similarity in the titles of the documents or their location identifiers, and patterns of user viewing. The similarity information is fed to a combination function that synthesizes the various measures of similarity information into combined similarity information. Using the combined similarity information, an objective function is iteratively maximized in order to yield a generalized similarity value that expresses the similarity of particular pairs of documents. In an embodiment, the generalized similarity value is used to determine the proper category, among a taxonomy of categories in an index, cache or search system, into which certain documents belong.",
    "inventors": [
        "Michael E. Palmer",
        "Gordon G. Sun",
        "Hongyuan Zha"
    ],
    "assignee": "Altaba Inc",
    "classifications": [
        "G06F40/194",
        "G06F16/10",
        "Y10S707/99933",
        "Y10S707/99936"
    ],
    "claims": "\n1. A computer implemented method of categorizing a plurality of new electronic documents into a set of categories, comprising the steps of:\nestablishing a plurality of training sets, wherein each training set is associated with a category and includes training documents that have been classified as belonging to said associated category;\ndetermining how strongly each document of said plurality of documents corresponds to each of said plurality of categories by determining similarity between said each document and the training documents that belong to the training set of said category; and\nwherein the step of determining similarity is performed using a matrix representing document similarity that is derived by combining two or more measures of document similarity.\n2. A method as recited in claim 1, wherein the measures of document similarity include hyperlink similarity.\n3. A method as recited in claim 2, in which two documents among the plurality of documents are considered similar to each other when there is a link from one to the other, or when the two documents link to, or are linked to by, a set of other associated documents.\n4. A method as recited in claim 3, in which certain hyperlinks have greater or lesser similarity weight than other hyperlinks, based on other features of the links or their source or destination documents.\n5. A method as recited in claim 1, wherein the measures of document similarity include a similarity of text of the documents.\n6. A method as recited in claim 5, wherein two documents are considered similar based on a comparison of word vectors derived from the text of each of the two documents.\n7. A method as recited in claim 5, wherein text similarity is determined in part based upon weight values assigned to words of the text, and wherein certain words have greater or lesser weight than other words.\n8. A method as recited in claim 1, wherein the measures of document similarity include user click-through similarity.\n9. A method as recited in claim 8, wherein two documents are considered similar based on user click-through similarity when the documents are associated with similar patterns of user click behavior, selected from among frequency of clicks, click context, duration of viewing, proximity in time to other clicks, or proximity in context to other clicks.\n10. A method as recited in claim 1, wherein the measures of document similarity are derived from patterns detected in user viewing of the documents.\n11. A method as recited in claim 10, wherein the user viewing information is monitored by a web caching system and stored in a log.\n12. A method as recited in claim 10, wherein two documents are considered similar based on patterns of user viewing behavior, including frequency of viewing, viewing context, duration of viewing, proximity in time to other documents viewed by the same user, or similarity of patterns of viewing by all users.\n13. A method as recited in claim 1, wherein the measures of document similarity include URL similarity.\n14. A method as recited in claim 13, wherein two documents are considered similar if a URL of each document contains similar URL sub-components.\n15. A method as recited in claim 1, wherein the measures of document similarity include multimedia similarity.\n16. A method as recited in claim 15, wherein two documents are considered similar based on features derived from multimedia components linked to or contained by the documents.\n17. A method as recited in claim 1, wherein the combination of two or more measures of document similarity is achieved by taking the union of each of a plurality of graphs, each graph describing one of the measures of document similarity, to compute a combined graph that describes the combined document similarity.\n18. A method as recited in claim 1, wherein the combination of two or more measures of document similarity is achieved by taking the intersection of each of a plurality of graphs, each graph describing one of the measures of document similarity, to compute a combined graph that describes the combined document similarity.\n19. A method as recited in claim 1, further comprising the step of extracting similarity information from the similarity matrix to obtain new documents supported by the set of training documents for each category.\n20. A method as recited in claim 19, wherein the similarity information is obtained by optimizing an objective function.\n21. A method as recited in claim 19, wherein the similarity information is obtained by only approximately optimizing an objective function.\n22. A method as recited in claim 21, wherein approximately optimizing the objective function comprises repeated application of a growth transformation.\n23. A method as recited in claim 19, further comprising the step of creating and storing a second matrix that represents an interim score for each document in each category.\n24. A method as recited in claim 19, further comprising the steps of, periodically as the matrix is being computed, normalizing rows of the matrix by normalizing within each document, across all categories, whereby the score for one document in a particular category will depend on the scores for that document in all other categories.\n25. A method as recited in claim 19, further comprising the steps of, periodically as the matrix is being computed, normalizing columns of the matrix by normalizing within each category, across all documents, whereby the score for one document in a particular category depends on the scores for all other documents in that category.\n26. A method as recited in claim 1, in which the categories come from a manually defined taxonomy.\n27. A method as recited in claim 1, wherein the categories are derived from logs of user queries.\n28. A method as recited in claim 1, further comprising the steps of creating and storing a second matrix using columns representing documents and rows representing user sessions, and wherein values of elements of the second matrix represent interest in a document shown by a particular user in a particular session.\n29. A method as recited in claim 1, further comprising the steps of creating and storing a matrix using columns representing user sessions and rows representing documents, and wherein values of elements of the second matrix represent interest in a document shown by a particular user in a particular session.\n30. A method as recited in claim 28, wherein the element values are computed as a function of a time that a user has spent viewing a document associated with each element.\n31. A method as recited in claim 28, further comprising the steps of creating and storing a second matrix representing a Similarity between pairs of documents i and j, wherein the second matrix is derived by comparing pairs of column vectors or row vectors, respectively i and j of the first matrix.\n32. A method as recited in claim 28, further comprising the steps of creating and storing a second matrix representing a Similarity between pairs of documents i and j, by finding pairs of documents i and j which have high interest values for a particular user in a particular session or period of time.\n33. The method recited in claim 1, further comprising the steps of:\nidentifying a category of a classification taxonomy of the hypertext system in which a first electronic document is presently classified; and\nif a second electronic document is found to be highly Similar, storing information that classifies the second electronic document into the category.\n34. A computer-readable recording medium carrying one or more sequences of instructions, wherein execution of the one or more sequences of instructions by one or more processors causes the one or more processors to perform the steps of:\nestablishing a plurality of training sets, wherein each training set is associated with a category and includes training documents that have been classified as belonging to said associated category;\ndetermining how strongly each document of said plurality of documents corresponds to each of said plurality of categories by determining similarity between said each document and the documents that belong to the training set of said category; and\nwherein the step of determining similarity is performed using a matrix representing document similarity that is derived by combining two or more measures of document similarity.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5745893A",
        "US5799292A",
        "US5835905A",
        "US5895470A",
        "US5920859A",
        "US5931907A",
        "US5960422A",
        "US6112203A",
        "US6115718A",
        "US6128606A",
        "US6182091B1",
        "US6182066B1",
        "US6282549B1",
        "US6321220B1",
        "US6338060B1",
        "US6360215B1",
        "US6389436B1",
        "US6397212B1",
        "US6405188B1",
        "US6418432B1",
        "US6418431B1",
        "US6446099B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20020016800A1",
        "US20030172349A1",
        "US20030187923A1",
        "US20030227484A1",
        "US20040193612A1",
        "US20040193684A1",
        "US20040193698A1",
        "US20040205063A1",
        "US20040255237A1",
        "US20040254904A1",
        "US20050004943A1",
        "US20050021508A1",
        "US20050114313A1",
        "US20050154694A1",
        "US20050210006A1",
        "US20050240576A1",
        "US20050251514A1",
        "US20050251532A1",
        "US20050289140A1",
        "US20060009963A1",
        "US20060026236A1",
        "US20060069982A1",
        "US20060069667A1",
        "US20060074871A1",
        "US20060080314A1",
        "US20060095430A1",
        "US20060100852A1",
        "US20060112068A1",
        "US20060136411A1",
        "US20060184500A1",
        "US20060200460A1",
        "US20060206796A1",
        "US20060212441A1",
        "US20060212288A1",
        "US20060212142A1",
        "US20060235860A1",
        "US20060294100A1",
        "US20070005588A1",
        "US20070038622A1",
        "US20070112758A1",
        "US20070112738A1",
        "US20070185871A1",
        "US20070192324A1",
        "US7260773B2",
        "US20070226229A1",
        "US20070223050A1",
        "US20070239792A1",
        "US20070239712A1",
        "US20070250502A1",
        "US7299222B1",
        "US20080005651A1",
        "US20080027706A1",
        "WO2008012619A2",
        "US20080077570A1",
        "US20080082481A1",
        "US20080082519A1",
        "US20080168056A1",
        "WO2008083447A1",
        "US20080195631A1",
        "US20080256065A1",
        "US20090007267A1",
        "US20090006378A1",
        "US20090012789A1",
        "US20090063470A1",
        "US20090070321A1",
        "US20090094020A1",
        "US20090106235A1",
        "US20090106221A1",
        "US20090106223A1",
        "US20090125505A1",
        "US20090157720A1",
        "US20090190839A1",
        "US20090240498A1",
        "US20090249178A1",
        "US20090254550A1",
        "US7603616B2",
        "US20090259651A1",
        "US20090271370A1",
        "US20100017403A1",
        "US20100077001A1",
        "US20100082421A1",
        "US20100100549A1",
        "US20100125601A1",
        "US7734627B1",
        "US7739209B1",
        "US20100169331A1",
        "US7761448B2",
        "US7769751B1",
        "US20100241940A1",
        "WO2010117581A1",
        "US20110055332A1",
        "US20110087669A1",
        "US20110087668A1",
        "US20110087773A1",
        "US7958136B1",
        "US20110258229A1",
        "US8060390B1",
        "US8086548B2",
        "US8122016B1",
        "US8136025B1",
        "US20120131005A1",
        "US20120198355A1",
        "WO2012104474A1",
        "US20130007708A1",
        "US20130013603A1",
        "EP2556445A1",
        "CN103003811A",
        "US8429111B1",
        "US8452849B2",
        "US8516357B1",
        "US8527516B1",
        "US8577972B1",
        "US8607140B1",
        "US8612411B1",
        "US8701014B1",
        "US8738635B2",
        "US8799339B1",
        "US20140258322A1",
        "US8874570B1",
        "CN104239228A",
        "US8965964B1",
        "US9116963B2",
        "US20150293697A1",
        "US9185067B1",
        "US9203879B2",
        "US9203647B2",
        "US9203794B2",
        "US9208231B1",
        "US9246975B2",
        "US9265458B2",
        "RU2579014C2",
        "US20160104197A1",
        "US9319356B2",
        "US20160110186A1",
        "US9380976B2",
        "US9462046B2",
        "US9460390B1",
        "US20160321250A1",
        "US9495462B2",
        "US20160335243A1",
        "US9558185B2",
        "US9563608B1",
        "US9647872B2",
        "US9667585B2",
        "US9672293B2",
        "US9727631B2",
        "US9852215B1",
        "US10187334B2",
        "US10341289B2",
        "US20190228056A1",
        "US20190251207A1",
        "US10643031B2",
        "USRE48102E1",
        "CN111488452A",
        "CN112287105A",
        "US11281861B2",
        "WO2022147049A1"
    ],
    "citedby_ftf": []
}