{
    "patent_link": "https://patents.google.com/patent/US5570133A/en",
    "patent_id": "US5570133A",
    "title": "Motion picture encoding system wherein image quality is maximized using inter-frame and intra-frame encoding",
    "abstract": "In a motion picture encoding system, which permits encoding of motion picture with high encoding efficiency and also permits improvement of the picture quality, priority orders are set preliminarily to obtain encoding matched to man's sight characteristics. Preferential high picture quality encoding of a picture portion attracting attention can be obtained by setting a high priority order for that portion. An optimum combination intra- and forward, rearward and bi-directional predictive inter-frame encoding pattern can be selected for every N frames by preliminarily collecting information of a motion picture sequence to be encoded.",
    "inventors": [
        "Yoichi Yagasaki"
    ],
    "assignee": "Sony Corp",
    "classifications": [
        "H04N19/577",
        "H04N19/107",
        "H04N19/503",
        "H04N19/61"
    ],
    "claims": "\n1. A motion picture encoding system for either intra-frame encoding or forward, rearward and bi-directional predictive inter-frame encoding a motion picture which includes a sequence of frames, comprising:\na means for encoding a given frame X by one of either intra-frame encoding or forward predictive inter-frame encoding;\nmeans for forward predictive encoding for a first case an (N-1)th frame and then for a second case an Nth frame, where N is a positive integer greater than X;\nmeans for bi-directional inter-frame encoding for the first case each frame of a sequence of frames between said given frame X and the (N-1)th frame and then for the second case each frame of a sequence of frames between said given frame X and the Nth frame;\nmeans for determining an estimate of the generated data quantity for frames encoded according to the first case and producing a corresponding signal D(N-1) corresponding thereto and for determining an estimate of the generated data quantity for frames encoded according to the second case and producing a corresponding signal D(N) corresponding thereto; and\nmeans for comparing the quantities D(N-1)/(N-1) and D(N)/N and forward predictive inter-frame encoding the (N-1)th frame and bidirectional inter-frame encoding frames in the motion picture between said given frame X and the (N-1)th frame if:\n{D(N-1)/(N-1)}<{D(N)/N-1}\nand otherwise forward predictive inter-frame encoding the (N)th frame and bidirectional inter-frame encoding the frames in the motion picture between said given frame X and the Nth frame.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4651206A",
        "US4837618A",
        "US4982285A",
        "US4985768A",
        "US4987490A",
        "US5038209A",
        "US5057918A",
        "US5068724A",
        "US5079630A",
        "US5089888A",
        "US5091782A",
        "US5103307A",
        "US5136378A",
        "US5136371A",
        "US5144426A",
        "US5144427A",
        "US5150432A",
        "US5198901A",
        "US5212549A",
        "US5237410A",
        "US5241383A",
        "US5249048A",
        "US5260783A",
        "US5357281A",
        "US5365271A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5828787A",
        "EP0878967A2",
        "US5856848A",
        "US5859668A",
        "US5870500A",
        "US5881174A",
        "US5991443A",
        "US6167157A",
        "US6307971B1",
        "WO2002096114A1",
        "US6549652B1",
        "AU771301B2",
        "US20040151390A1",
        "US20040156549A1",
        "US6937659B1",
        "US20060062478A1"
    ],
    "citedby_ftf": [
        "US5786858A",
        "JP3711571B2",
        "JPH08242452A",
        "KR0171143B1",
        "US5774600A",
        "US5872866A",
        "US6002801A",
        "US5903313A",
        "US5864637A",
        "US5953457A",
        "US5812197A",
        "US5680482A",
        "EP1357758A3",
        "US5758092A",
        "JP3681835B2",
        "US6957350B1",
        "JP3876392B2",
        "US5956083A",
        "US6115420A",
        "JP3630565B2",
        "GB2350512A",
        "US6625215B1",
        "JP4107544B2",
        "US8374237B2",
        "JP3925611B2",
        "US8111754B1",
        "US7266150B2",
        "US20030112863A1",
        "US20040202249A1",
        "US7889792B2",
        "US7492820B2",
        "US7869503B2",
        "US7986731B2",
        "US20050286629A1",
        "CA2721675A1",
        "CN102113326A",
        "JPWO2011099254A1"
    ]
}