{
    "patent_link": "https://patents.google.com/patent/US6119235A/en",
    "patent_id": "US6119235A",
    "title": "Method and apparatus for quality of service management",
    "abstract": "A method for managing quality of service in a firewall server (110), the firewall server (11) coupling a data source to a data receiver, includes the steps of estimating a bit rate over a round-trip-time between the data source and the data receiver, receiving a receive acknowlegment signal from the data receiver, thereafter delaying transmission of a receive acknowlegment signal when the bit rate is greater than a bit rate limit, and transmitting the receive acknowlegment signal to the data source when the bit rate is not greater than the bit",
    "inventors": [
        "Aseem Vaid",
        "Sanjay Sawhney"
    ],
    "assignee": "EMC Corp",
    "classifications": [
        "H04L41/5045",
        "H04L1/1854",
        "H04L41/0894",
        "H04L41/0896",
        "H04L41/22",
        "H04L41/5022",
        "H04L43/00",
        "H04L47/10",
        "H04L47/11",
        "H04L47/193",
        "H04L47/20",
        "H04L47/2441",
        "H04L47/283",
        "H04L47/323",
        "H04L63/1458",
        "H04L1/16",
        "H04L41/0893",
        "H04L43/0852",
        "H04L43/0864",
        "H04L43/087",
        "H04L43/0888",
        "H04L67/01"
    ],
    "claims": "\n1. A method for managing quality of service in a firewall server, the firewall server coupling a data source to a data receiver, comprising:\nclassifying a connection between the data source and the data receiver into at least one traffic class from a plurality of traffic classes;\nestimating a bit rate over a round-trip-time between the data source and the data receiver at the firewall server;\nreceiving a receive acknowledgment signal from the data receiver;\ndelaying transmission of a receive acknowledgment signal when the bit rate is greater than a bit rate limit; and\ntransmitting the receive acknowledgment signal to the data source when the bit rate is not greater than the bit rate limit.\n2. The method of claim 1 wherein the data source and the data receiver communicate using TCP, and the acknowledge signal is the ACK signal.\n3. The method of claim 1 further comprising determining the bit rate limit.\n4. The method of claim 3 wherein the bit rate limit is for the data source.\n5. The method of claim 3 wherein the bit rate limit is for the data receiver.\n6. The method of claim 1 further comprising determining the bit rate over a round-trip-time between the data source and the data receiver before transmitting the receive acknowledgment.\n7. The method of claim 1 wherein traffic classes in the plurality of traffic classes are user-definable.\n8. The method of claim 1 wherein classifying the connection between the data source and the data receiver comprises:\ndetermining a characteristic of data transmitted from the data source to the data receiver via the connection; and\nclassifying the connection based on the data characteristic.\n9. The method of claim 8 wherein the data characteristic is selectable from a group of data characteristics including data protocol, data application, data-type, source of the data, destination of the data, direction of the data, and user-defined data characteristics.\n10. A firewall server for managing quality of service comprising:\na computer memory;\nclassifying means coupled to the computer memory for classifying a connection between a data source and a data receiver into at least one traffic class from a plurality of traffic classes;\nestimating means coupled to the computer memory for estimating a bit rate over a round-trip-time between the data source and the data receiver;\nreceiving means for receiving a receive acknowledgment signal from the data receiver;\ndelay means for delaying transmission of the receive acknowledgment signal when the bit rate is greater than a bit rate limit; and\ntransmitting means for transmitting the receive acknowledgment signal to the data source when the bit rate is not greater than the bit rate limit.\n11. A computer program product for a firewall server including a processor for managing quality of service comprising:\na computer-readable memory comprising:\ncode that directs the processor to classify a connection between a data source and a data receiver into at least one traffic class from a plurality of traffic classes;\ncode that directs the processor to estimate a bit rate over a round-trip-time between the data source and the data receiver;\ncode that directs the processor to receive a receive acknowledgment signal from the data receiver;\ncode that directs the processor to delay transmission of the receive acknowledgment signal when the bit rate is greater than a bit rate limit; and\ncode that directs the processor to transmit the receive acknowledgment signal to the data source when the bit rate is not greater than the bit rate limit.\n12. A method for managing network traffic in a network, the network conforming to TCP protocol, comprising:\ndetermining a plurality of traffic classes for the network traffic, each traffic class having a priority;\nforming a scheduling of transmissions of the network traffic according to the priority of each traffic class; and\nusing TCP flow control to limit the flow of the network traffic according to the schedule.\n13. The method of claim 12 wherein the network traffic is outbound network traffic.\n14. The method of claim 12 wherein the network traffic is inbound network traffic.\n15. The method of claim 12 wherein the plurality of traffic classes is determined in response to a network traffic type.\n16. The method of claim 12 where network traffic types includes file types.\n17. The method of claim 12 wherein the plurality of traffic classes is determined in response to a network traffic source.\n18. The method of claim 12 wherein network traffic sources includes business units.\n19. The method of claim 12 wherein the plurality of traffic classes is determined in response to a network traffic requirement.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5109384A",
        "US5193151A",
        "US5561851A",
        "US5600645A",
        "US5815667A",
        "US6038216A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6202081B1",
        "US6298041B1",
        "US6341309B1",
        "US20020049899A1",
        "GB2370200A",
        "US20020129161A1",
        "US20020172153A1",
        "US20020174220A1",
        "US20020188734A1",
        "EP1278340A1",
        "US20030018801A1",
        "US20030021291A1",
        "US20030031210A1",
        "EP1284573A1",
        "US6526448B1",
        "US20030055949A1",
        "US20030081599A1",
        "US6560243B1",
        "US20030120764A1",
        "US6608818B1",
        "US20030177179A1",
        "US6625118B1",
        "US6639900B1",
        "US20030221112A1",
        "US20030225874A1",
        "US20040015602A1",
        "US20040058652A1",
        "US20040151113A1",
        "US6789203B1",
        "US20040236846A1",
        "US6831912B1",
        "US6839767B1",
        "US6842783B1",
        "US20050033845A1",
        "US6857025B1",
        "US20050044218A1",
        "US6871233B1",
        "US6928054B1",
        "US6977905B1",
        "US6990070B1",
        "US20060020702A1",
        "US6992982B1",
        "US6993591B1",
        "US7016301B1",
        "US20060130523A1",
        "US7068606B1",
        "US7080161B2",
        "US7236459B1",
        "US7336613B2",
        "US7349994B2",
        "US7369495B1",
        "US7389537B1",
        "US7406539B2",
        "US20080212480A1",
        "US20080304437A1",
        "US7487237B2",
        "US20090097483A1",
        "US20090178108A1",
        "US20090300739A1",
        "US7720959B2",
        "US7756032B2",
        "US7773536B2",
        "US7869366B1",
        "CN1685323B",
        "US20120106344A1",
        "EP2509359A2",
        "US20130124751A1",
        "US8595478B2",
        "US20140297723A1",
        "US20150312126A1",
        "US20160218983A1",
        "US9749174B1",
        "US9917916B2",
        "US10372347B2"
    ],
    "citedby_ftf": []
}