{
    "patent_link": "https://patents.google.com/patent/US20020143755A1/en",
    "patent_id": "US20020143755A1",
    "title": "System and methods for highly distributed wide-area data management of a network of data sources through a database interface",
    "abstract": "Methods and a system that provide a network of data sources in terms of a traditional database schema, convert traditional database queries into network messages, and route those messages to those data sources which have relevant data, in some instances through designated query nodes. In the present invention, those data sources accept the message, and then send reply messages to the originator of the query, or via designated join nodes in some embodiments. In some embodiments, the data sources may be able to perform local join operations. The system then collects these reply messages as appropriate at the designated join nodes, designated query nodes, and/or at the data sources, and the reply messages that meet the requirements of the query are sent back to the query originator. The query results provided to the query originator are presented as a traditional database result.",
    "inventors": [
        "Michael Wynblatt",
        "Julio Cesar Navas"
    ],
    "assignee": "SYNCORDANT LLC",
    "classifications": [
        "H04L67/10",
        "G06F16/2471",
        "Y10S707/99936",
        "Y10S707/99944",
        "Y10S707/99945"
    ],
    "claims": "\n1. A method for information management of a distributed data sources network database that comprises a plurality of nodes, said plurality of nodes including a querying node and a plurality of data sources, said method comprising the steps of:\nproviding a schema for said distributed data sources network database;\nentering a query in a database language at said querying node in said network, said query including at least one table name, at least one a table attribute, and at least one value of a table attribute;\ndecomposing said query into at least one network message including a particular set of a table name, a table attribute and a value;\ntransmitting said network message to data sources relevant to said particular set of said table name, said table attribute and said value in said query;\nreceiving at least one reply message from said data sources relevant to said particular set of said table name, said table attribute and said value of said query when said query is met; and\nproviding a query result in said database language at said querying node from said at least one reply message.\n2. The method according to claim 1, wherein said schema providing step includes providing a rank for each table attribute, and wherein a relative value of said rank of said table attribute in said query is used to select which table, table attribute, and value will be used as the routing key in said transmitting step.\n3. The method according to claim 1, further comprising a step of resolving any joins contained in said query once said at least one reply message has been received.\n4. The method according to claim 1, wherein said network message is an Ethernet packet, IP packet, TCP packet, UDP packet, Profibus packet, DeviceNet packet, IEEE 802.11 packet, Ricochet packet, GSM formatted packet, or CDMA formatted packet, or multiple of said packets.\n5. The method according to claim 1, wherein said query language comprises SQL.\n6. The method according to claim 1, wherein said transmitting step comprises routing said network message to data sources relevant to said query by using characteristic routing.\n7. The method according to claim 1, wherein said transmitting step comprises routing said network message only to data sources relevant to said query by using multicast routing.\n8. The method of claim 2 wherein said rank for each attribute is selected based on attributes partitioning the records along network topology getting highest rank and attributes having a large number of different values are ranked higher than attributes which have a small number of different values.\n9. A method for information management of a distributed data sources network database that comprises a plurality of nodes, said plurality of nodes including a querying node and a plurality of data sources, said method comprising the steps of:\nproviding a schema for said distributed data sources network database;\nentering a query in a database language at said querying node in said network, said query including at least one class name, at least one class attribute, and at least one value of a class attribute;\ndecomposing said query into at least one network message including a particular set of a class name, a class attribute and a value;\ntransmitting said network message to data sources relevant to said particular set of said class name, said class attribute and said value in said query;\nreceiving at least one reply message from said data sources relevant to said particular set of said class name, said class attribute and said value of said query when said query is met; and\nproviding a query result in said database language at said querying node from said at least one reply message.\n10. The method according to claim 9, wherein said schema providing step includes providing a rank for each class attribute, and wherein a relative value of said rank of said class attribute in said query is used to select which class, class attribute, and value will be used as the routing key in said transmitting step.\n11. The method according to claim 9, further comprising a step of resolving any joins contained in said query once said at least one reply message has been received.\n12. The method according to claim 9, wherein said network message is an Ethernet packet, IP packet, TCP packet, UDP packet, Profibus packet, DeviceNet packet, IEEE 802.11 packet, Ricochet packet, GSM formatted packet, or CDMA formatted packet, or multiple of said packets.\n13. The method according to claim 9, wherein said query language comprises SQL.\n14. The method according to claim 9, wherein said transmitting step comprises routing said network message to data sources relevant to said query by using characteristic routing.\n15. The method according to claim 9, wherein said transmitting step comprises routing said network message only to data sources relevant to said query by using multicast routing.\n16. The method of claim 10 wherein said rank for each attribute is selected based on attributes partitioning the records along network topology getting highest rank and attributes having a large number of different values are ranked higher than attributes which have a small number of different values.\n17. A method for information management of a distributed data sources network database that comprises a plurality of nodes, said plurality of nodes including a querying node and a plurality of data sources, said method comprising the steps of:\nproviding a schema for said distributed data sources network database;\nentering a query in a database language at said querying node in said network, said query including at least one tag name, at least one tag attribute, and at least one value of a tag attribute;\ndecomposing said query into at least one network message including a particular set of a tag name, a tag attribute and a value;\ntransmitting said network message to data sources relevant to said particular set of said tag name, said tag attribute and said value in said query;\nreceiving at least one reply message from said data sources relevant to said particular set of said tag name, said tag attribute and said value of said query when said query is met; and\nproviding a query result in said database language at said querying node from said at least one reply message.\n18. The method according to claim 17, wherein said schema providing step includes providing a rank for each tag attribute, and wherein a relative value of said rank of said tag attribute in said query is used to select which tag table, tag attribute, and value will be used as the routing key in said transmitting step.\n19. The method according to claim 17, further comprising a step of resolving any joins contained in said query once said at least one reply message has been received.\n20. The method according to claim 17, wherein said network message is an Ethernet packet, IP packet, TCP packet, UDP packet, Profibus packet, DeviceNet packet, IEEE 802.11 packet, Ricochet packet, GSM formatted packet, or CDMA formatted packet, or multiple of said packets.\n21. The method according to claim 17, wherein said query language comprises SQL.\n22. The method according to claim 17, wherein said transmitting step comprises routing said network message to data sources relevant to said query by using characteristic routing.\n23. The method according to claim 17, wherein said transmitting step comprises routing said network message only to data sources relevant to said query by using multicast routing.\n24. The method of claim 18 wherein said rank for each attribute is selected based on attributes partitioning the records along network topology getting highest rank and attributes having a large number of different values are ranked higher than attributes which have a small number of different values.\n25. A method for information management of a distributed data sources network database that comprises a plurality of nodes, said plurality of nodes including a querying node and a plurality of data sources and a plurality of archive nodes representing particular data sources, said method comprising the steps of:\nproviding a schema for said distributed data sources network database;\nentering a query in a database language at said querying node in said network;\ndecomposing said query into at least one network message;\ntransmitting said network message to data sources relevant to said query;\nreceiving from said network a list of successfully accessed data sources;\nretransmitting said network message to said archive nodes and to said data sources on said list;\nreceiving a reply message from said data sources from said list and from said archive nodes representing those data sources that match said query but are not on said list; and\nproviding a query result in said database language based on said reply message.\n26. The method according to claim 25, wherein said network message is an Ethernet packet, IP packet, TCP packet, UDP packet, Profibus packet, DeviceNet packet, IEEE 802.11 packet, Ricochet packet, GSM formatted packet, or CDMA formatted packet, or multiple of said packets.\n27. The method according to claim 25, wherein said schema comprises a relational schema, an object-oriented schema, or an object-relational schema.\n28. The method according to claim 25, wherein said query language comprises SQL.\n29. The method according to claim 25, wherein said transmitting step comprises routing said network message to data sources relevant to said query by using characteristic routing.\n30. The method according to claim 25, wherein said transmitting step comprises routing said network message only to data sources relevant to said query by using multicast routing.\n31. A method for information management of a distributed data sources network database that comprises a plurality of nodes, said plurality of nodes including a querying node and a plurality of data sources, said method comprising the steps of:\nproviding a schema for said distributed data sources network database, said schema providing a list of descriptors which are locally joinable;\nentering a query in a database language at said querying node in said network, said query including a plurality of predicates;\ndecomposing said query into at least one network message;\ntransmitting said network message to data sources relevant to said plurality of predicates of said query;\nreceiving from said data sources relevant to said query a reply message to said network message when those predicates of said query which are included in said list of locally joinable descriptors are locally joined at said data sources; and\nproviding a query result in said database language at said querying node from said reply message.\n32. The method according to claim 31, wherein said network message is an Ethernet packet, IP packet, TCP packet, UDP packet, Profibus packet, DeviceNet packet, IEEE 802.11 packet, Ricochet packet, GSM formatted packet, or CDMA formatted packet, or multiple of said packets.\n33. The method according to claim 31, wherein said schema comprises a relational schema and said descriptors comprise attributes or tables, an object-oriented schema and said descriptors comprise class attributes or classes, or an object-relational schema.\n34. The method according to claim 31, wherein said query language comprises SQL.\n35. The method according to claim 31, wherein said transmitting step comprises routing said network message to data sources relevant to said query by using characteristic routing.\n36. The method according to claim 31, wherein said transmitting step comprises routing said network message only to data sources relevant to said query by using multicast routing.\n37. A method for information management of a distributed data sources network database that comprises a plurality of nodes, said plurality of nodes including a querying node and at least one designated query node and a plurality of data sources, said method comprising the steps of:\nproviding a schema for said distributed data sources network database;\nentering a query in a database language at said querying node in said network, said query including a plurality of subqueries;\ndecomposing said query into a plurality of network messages, one of said plurality of said network messages corresponding to one of said plurality of subqueries;\ntransmitting one of said plurality of said network messages to a designated query node relevant to said one of said plurality of subqueries of said query, said at least one designated query node processing said one of said plurality of subqueries and transmitting query fragments of said query to data sources relevant to said query fragments and for which said at least one designated query node is responsible;\nreceiving from said at least one designated query node a reply message to said network message when responses to said query fragments are joined and said query is met; and\nproviding a query result in said database language at said querying node from said reply message.\n38. The method of claim 37 wherein said schema provides a list of descriptors which are locally joinable, wherein said schema is a relational schema and said descriptors include attributes or tables or wherein said schema is an object-oriented schema and said descriptors include class attributes or classes.\n39. The method of claim 37 wherein said at least one designated query node is located at main branch points of said distributed data sources network database.\n40. The method according to claim 38, wherein said schema providing step includes providing a rank for each attribute, and wherein said query incudes an attribute, and wherein a relative value of said rank of said attribute in said query is used to select a routing key in said transmitting step.\n41. The method according to claim 37, wherein said network message is an Ethernet packet, IP packet, TCP packet, UDP packet, Profibus packet, DeviceNet packet, IEEE 802.11 packet, Ricochet packet, GSM formatted packet, or CDMA formatted packet, or multiple of said packets.\n42. The method according to claim 37 wherein said rank for each attribute is selected based on attributes partitioning the records along network topology getting highest rank and attributes having a large number of different values are ranked higher than attributes which have a small number of different values.\n43. The method according to claim 42, wherein said query language comprises SQL.\n44. The method according to claim 37, wherein said transmitting step comprises routing said network message to data sources relevant to said query by using characteristic routing.\n45. The method according to claim 37, wherein said transmitting step comprises routing said network message only to data sources relevant to said query by using multicast routing.\n46. A method for information management of a distributed data sources network database that comprises a plurality of nodes, said plurality of nodes including a querying node and a plurality of data sources, said method comprising the steps of:\nproviding a schema for said distributed data sources network database;\ndistributing one or more functions to at least one node;\nentering a query in a database language at said querying node in said network;\ndecomposing said query into at least one network message;\ntransmitting said network message to data sources relevant to said query;\nreceiving from said data sources relevant to said query a reply message to said network message when said query is met and said one or more functions are applied; and\nproviding a query result in said database language at said querying node from said reply message.\n47. The method of claim 46 wherein said one or more functions comprise instructions, said instructions comprising object class methods distributed to said at least one node, which comprises an object-oriented data source.\n48. The method of claim 46 wherein said one or more functions comprise instructions, said instructions comprising distribution of data reduction instructions.\n49. The method of claim 46 wherein said one or more functions comprise instructions, said instructions comprising averaging, delta extraction, peak extraction or hashing.\n50. The method of claim 46 wherein said one or more functions comprise instructions, said instructions comprising distribution of data compression instructions.\n51. The method of claim 46 wherein said one or more functions comprise instructions, said instructions comprising distribution of trend analysis instructions that extract relevant summaries.\n52. The method of claim 46 wherein said at least one node comprises a data source.\n53. The method of claim 46 wherein said at least one node comprises a designated join node.\n54. The method of claim 53 further comprising the steps of receiving said network message at said designated join node, performing said one or more functions at said designated join node, and receiving from data sources relevant to said query responses to portions of said query from said network message in accordance with said one or more functions.\n55. The method of claim 47 wherein said one or more functions relates to new aspects of said schema.\n56. A system for information management of a distributed database comprising a network of data sources, said system comprising:\na plurality of data sources coupled to said network, said data sources capable of providing information according to a schema for said distributed database;\nat least one querying node coupled to said network, said querying node capable of receiving a query in a database language and decomposing said query into at least one network message that is transmitted over said network to data sources relevant to said query;\nwherein data sources relevant to said query send a reply message over said network in response to said network message when said query is met, and said querying node provides a query result in said database language from said reply message; and\nwherein said plurality of data sources includes at least one data source capable of performing local joins on said query.\n57. The system according to claim 56, wherein said network message and said reply message are Ethernet packets, IP packets, TCP packets, UDP packets, Profibus packets, DeviceNet packets, IEEE 802.11 packets, Ricochet packets, GSM formatted packets, or CDMA formatted packets, or multiple of said packets.\n58. The system according to claim 56, wherein said schema comprises a relational schema, an object-oriented schema, or an object-relational schema.\n59. The system according to claim 56, wherein said query language comprises SQL.\n60. The system according to claim 56, wherein said network message is transmitted using characteristic routing over said network only to data sources relevant to said query.\n61. The system according to claim 56, wherein said network message is transmitted using multicast routing over said network only to data sources relevant to said query.\n62. The method according to claim 31 wherein said transmitting step comprises transmitting a bloom filter bit vector with a bit vector representation less than a specified threshold.\n63. The method according to claim 37 wherein said at least one designated query node is located close to a centroid location of said distributed data sources network database, wherein said centroid location comprises an optimal location between said querying node and said data sources relevant to said query.\n64. The method according to claim 63 wherein said optimal location comprises the point equidistant between said querying node and said data sources relevant to said query.\n65. The method according to claim 63 wherein said optimal location comprises the point where there would be as much query-relevant data on one side as on the other side of said point.\n66. The method according to claim 46 wherein said distributing step also includes distributing the bodies of one or more functions with one or more functions closures to said at least one node.\n67. The method according to claim 66 wherein said at least one node comprises a querying node.\n68. The method according to claim 66 wherein said at least one node comprises a designated query node.\n69. The method according to claim 46 wherein said distributing step can be done through said query.\n70. The method according to claim 46 further comprising the step of sending a terminate query message to said data sources relevant to said query.\n71. The method of claim 46 wherein said instructions comprise distribution of trend analysis instructions that extract relevant summaries.\n72. The method of claim 46 wherein said at least one node comprises a data source.\n73. The method of claim 46 wherein said at least one node comprises a designated query node.\n74. The method of claim 54 furher comprising the steps of receiving said network message at said designated query node, performing said instructions at said designated query node, and receiving from data sources relevant to said query responses to portions of said query from said network message in accordance with said instructions.\n75. The method of claim 47 wherein said instructions relate to new aspects of said schema.\n76. The method of claim 46 wherein said query includes events or exceptions descriptions in the form of query constraints and/or a specified refresh rate and/or as part of the declarative steps in the said one or more functions, and wherein said one or more functions comprise an action to be taken when said events or said exceptions occur, and further comprising the step of performing said one or more functions at said at least one node to provide an event-based system reaction.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4635189A",
        "US5093782A",
        "US5179660A",
        "US5301339A",
        "US5953716A",
        "US6009428A",
        "US6353836B1",
        "US6606660B1"
    ],
    "citations_ftf": [
        "US5560005A",
        "EP0829811A1",
        "US6226649B1"
    ],
    "citedby_own": [
        "US20030229635A1",
        "US6675159B1",
        "US20040064327A1",
        "US20040138942A1",
        "US6766316B2",
        "US20040162744A1",
        "US20040181541A1",
        "US20040236738A1",
        "DE10325277A1",
        "US20050050221A1",
        "US20050055343A1",
        "US20050114551A1",
        "US20050120004A1",
        "US20050198076A1",
        "US20050228794A1",
        "US6968393B1",
        "US20060004878A1",
        "US20060004719A1",
        "US20060015805A1",
        "US7019674B2",
        "US7027974B1",
        "US7072822B2",
        "US20060155596A1",
        "US20060209725A1",
        "US7130822B1",
        "US20060248045A1",
        "US20070016604A1",
        "US20070033168A1",
        "US20070067726A1",
        "US20070067738A1",
        "US20070067272A1",
        "US20070076617A1",
        "US20070082707A1",
        "US20070112737A1",
        "US20070118561A1",
        "US20070156842A1",
        "US20070280220A1",
        "US20080033967A1",
        "US20080066067A1",
        "US20080133459A1",
        "US7406461B1",
        "US20080319922A1",
        "US20090043745A1",
        "US20090043910A1",
        "US20090043750A1",
        "US20090049031A1",
        "US7496557B2",
        "US7506162B1",
        "US7512625B2",
        "US20090113188A1",
        "US20090164416A1",
        "US7565356B1",
        "US20090234799A1",
        "US7647329B1",
        "US7668083B1",
        "US20100077107A1",
        "US7693826B1",
        "US7702640B1",
        "US20100114899A1",
        "US20100122026A1",
        "US7739287B1",
        "US7756901B2",
        "US7778997B1",
        "US7797333B1",
        "US7801911B1",
        "US20100281150A1",
        "US7836510B1",
        "US7873650B1",
        "US7881229B2",
        "US20110035729A1",
        "US20110066791A1",
        "US7917495B1",
        "US20110119407A1",
        "US7983239B1",
        "US7995595B1",
        "US20110231372A1",
        "US8085792B1",
        "US8139504B2",
        "US20120084287A1",
        "US8266234B1",
        "US20120317130A1",
        "US8352467B1",
        "US20130031605A1",
        "US8392401B1",
        "US8423562B2",
        "US8458511B2",
        "US8538920B2",
        "US8606792B1",
        "US20140056173A1",
        "US8694510B2",
        "US8762191B2",
        "US8843411B2",
        "US8930345B2",
        "US8983990B2",
        "US8996481B2",
        "US20150112985A1",
        "US20160062982A1",
        "US9436389B2",
        "US9438540B2",
        "US9571355B2",
        "US9767178B2",
        "US9798655B2",
        "WO2017222927A1",
        "US9886460B2",
        "US20180046636A1",
        "US10102258B2",
        "US10152500B2",
        "US10229161B2",
        "US10324925B2",
        "US10331573B2",
        "CN109977175A",
        "US10346429B2",
        "US10353911B2",
        "US10438013B2",
        "US10452975B2",
        "US10452677B2",
        "US10515085B2",
        "US10528590B2",
        "US10645548B2",
        "US10678788B2",
        "US10691710B2",
        "US10691722B2",
        "US10699027B2",
        "US10698771B2",
        "US10747752B2",
        "US10747774B2",
        "US10824637B2",
        "US10853376B2",
        "US10860653B2",
        "US10877967B1",
        "US10891291B2",
        "US20210036944A1",
        "US10922308B2",
        "US10956670B2",
        "US10984008B2",
        "US11010378B1",
        "USD920353S1",
        "US11016931B2",
        "US11023104B2",
        "US11036697B2",
        "US11036716B2",
        "US11042556B2",
        "US11042537B2",
        "US11042560B2",
        "US11042548B2",
        "US11068847B2",
        "US11068453B2",
        "US11068475B2",
        "US11086896B2",
        "US11086876B2",
        "USD940169S1",
        "USD940732S1",
        "US11238109B2",
        "US11243960B2",
        "US11327991B2",
        "US11334625B2",
        "US11442988B2",
        "US11468049B2",
        "US11475006B2",
        "US11537990B2",
        "US11657037B2",
        "US11675808B2",
        "US11755602B2"
    ],
    "citedby_ftf": [
        "US7620712B1",
        "US20040064456A1",
        "US7200675B2",
        "US7383255B2",
        "GB2415329A",
        "US7904488B2",
        "US20060031224A1",
        "US8756521B1",
        "US7676281B2",
        "US8799800B2",
        "US7650405B2",
        "US7809683B2",
        "US7672737B2",
        "US7548789B2",
        "US7881812B2",
        "US8275680B2",
        "US7734590B2",
        "US7801628B2",
        "US8484250B2",
        "US7660638B2",
        "US7945960B2",
        "US8635660B2",
        "US7542982B2",
        "US8375141B2",
        "US9262763B2",
        "US7657777B2",
        "US8645431B2",
        "US20080147821A1",
        "US20080255928A1",
        "US8000468B2",
        "US8054764B2",
        "US8984533B2",
        "US9392072B2",
        "US8484401B2",
        "JP5659757B2",
        "US20130297361A1",
        "US9569413B2",
        "US9363230B2",
        "JP6503945B2",
        "EP3489774A1"
    ]
}