{
    "patent_link": "https://patents.google.com/patent/US6028602A/en",
    "patent_id": "US6028602A",
    "title": "Method for managing contents of a hierarchical data model",
    "abstract": "A graphical user interface includes at least one primary window that displays the contents of a hierarchical data model as a hierarchical tree. A secondary window is displayed which contains a subset of the contents, e.g., groupings based on search criteria, of the hierarchical data model as a flat-list. The primary window and the secondary window are displayed on a screen at the same time so that a user can see both the hierarchical relationship and specific groupings of the contents of the hierarchical data model. Several synchronization mechanisms between the primary window and the secondary window are provided. For example, a user can select an element of the flat-list in the secondary window and cause the display of the primary window to correspond to the user's selection of the element. In addition, multiple selected elements from the secondary window can be copied back to the primary window such that a common operation can be performed on the multiple selected elements.",
    "inventors": [
        "Thomas Weidenfeller",
        "Torsten Schumacher"
    ],
    "assignee": "Telefonaktiebolaget LM Ericsson AB",
    "classifications": [
        "H04L41/22",
        "G06F3/0481",
        "Y10S715/968"
    ],
    "claims": "\n1. A graphical user interface comprising:\nat least one primary window displaying contents of a hierarchical data model as a hierarchical tree;\nat least one secondary window data model including at least one subset of said contents of said hierarchical data model;\nat least one secondary window displaying contents of said at least one secondary window data model as a flat list; and\nmeans for adding contents to said secondary window data model;\nwherein said at least one primary window and said at least one secondary window are concurrently displayed; and\nwherein said at least one subset comprises at least two elements each having different immediate parent nodes in said hierarchical data model.\n2. The system of claim 1 wherein said primary window includes a tree browser and said secondary window includes a bucket.\n3. The system of claim 1 further comprising:\ncontrol means for expanding and collapsing hierarchical levels of said hierarchical tree.\n4. The system of claim 1 wherein said graphical user interface displays information pertaining to the structure of a managed telecommunication network.\n5. The system of claim 1 wherein said contents of said hierarchical data model include managed objects.\n6. The system of claim 1 wherein contents of at least one secondary window are static.\n7. The system of claim 1 wherein contents of at least one secondary window are dynamic.\n8. The system of claim 1 further comprising:\nmeans for copying selections made in said at least one secondary window to said hierarchical tree.\n9. A method of operating a graphical user interface comprising the steps of:\ndisplaying contents of a hierarchical data model as a hierarchical tree in at least one primary window;\nsimultaneously displaying contents of at least one secondary window data model in at least one secondary window as a flat list; and\nadding contents to said at least one secondary window data model;\nwherein said at least one subset comprises at least two elements each having different immediate parent nodes in said hierarchical data model; and\nwherein said at least one secondary window data model includes at least one subset of said contents of said hierarchical data model.\n10. The method of claim 9 wherein the steps of displaying and simultaneously displaying further comprise the step of:\ndisplaying information pertaining to the structure of a managed telecommunication network.\n11. The method of claim 9 wherein said step of displaying said contents of said hierarchical data model as a hierarchical tree further comprises the step of:\ndisplaying a hierarchical list of managed objects.\n12. The method of claim 9 wherein said method of operating a graphical user interface further comprises the step of:\nchanging said contents of said hierarchical data model via said at least one of said primary window or said at least one of said secondary window.\n13. The method of claim 12 wherein said step of simultaneously displaying contents of said at least one secondary window data model further comprises the step of:\nkeeping said at least one secondary window data model static following said change in said hierarchical data model.\n14. The method of claim 12 wherein said step of simultaneously displaying said contents of said at least one secondary window data model further comprises the steps of:\nchanging said display of said contents of said hierarchical data model in at least one primary window to match said changes made in said hierarchical data model.\n15. The method of claim 9 wherein said method further comprises the steps of:\nselecting at least one element in said at least one secondary window; and\nchanging a display of at least one element in said at least one primary window to correspond to said selecting of said at least one element in said at least one secondary window, wherein said changing of said display indicates the hierarchical location of said at least one element in said hierarchical data model.\n16. The method of claim 9 wherein said method further comprises the steps of:\nselecting a plurality of elements in said at least one secondary window;\ndisplaying separate primary windows for each of said plurality of elements; and\nchanging said displays for each of said separate primary windows such that each of said separate primary windows indicate the hierarchical location of each of its respective elements in said hierarchical data model.\n17. A method of manipulating a display associated with a hierarchical data model in a graphical user interface comprising the steps of:\ndisplaying at least one element of said hierarchical data model as a hierarchical tree in said at least one primary window;\ndirectly selecting from said display at least one element of said hierarchical data model in said at least one primary window;\ncreating at least one secondary window data model including said at least one element;\ndisplaying said at least one element of said at least one secondary window data model in at least one secondary window as a flat list; and\nadding an additional at least one element to said at least one secondary window data model subsequent to the displaying step;\nwherein subsequent to the adding step, said secondary window data model comprises at least two elements each having different immediate parent nodes in said hierarchical data model.\n18. The method of claim 17 wherein said at least one element displayed in said at least one primary window is a managed object.\n19. The method of claim 17 wherein said method further comprises the step of:\ndestroying said at least one secondary window and said at least one secondary window data model.\n20. The method of claim 17 wherein said method further comprises the step of:\nstoring said at least one secondary window data model in a storage medium.\n21. The method of claim 20 wherein said method further comprises the step of:\nretrieving at least one secondary window data model from said storage medium.\n22. A method of manipulating a display associated with a hierarchical data model in a graphical user interface having at least one primary window and at least one secondary window, said secondary window associated with a secondary window data model, said method comprising the steps of:\ndisplaying at least one element of said hierarchical data model in at least one primary window;\nperforming a search of said hierarchical data model according to criteria;\nidentifying a set of elements as a result of said search;\nadding said set of elements to said secondary window data model; and\ndisplaying at least one element of said secondary window data model in an existing at least one secondary window without deleting any prior existing elements of said secondary window data model.\n23. The method of claim 22 wherein said step of displaying said at least one element of said secondary window data model further comprises the step of displaying said at least one element as at least one flat-list in said at least one secondary window.\n24. The method of claim 22 wherein said set of elements is the empty set.\n25. The method of claim 22 wherein said set of elements includes at least one managed object.\n26. The method of claim 22 wherein said method further comprises the step of:\ndestroying said at least one secondary window and said at least one secondary window data model.\n27. The method of claim 22 wherein said method further comprises the step of:\nstoring said at least one secondary window data model in a storage medium.\n28. The method of claim 27 wherein said method further comprises the step of:\nretrieving at least one secondary window data model from said storage medium.\n29. The method of claim 9 wherein said primary window includes a tree browser and said secondary window includes a bucket.\n30. The method of claim 9 further comprising the steps of:\nselecting at least one element from a display of said contents of said hierarchical data model or a display of said contents of said at least one secondary data model;\ncreating another at least one secondary window data model including said at least one element; and\ndisplaying contents of said another at least one secondary window data model in another at least one secondary window.\n31. The method of claim 30 wherein said step of displaying said contents of said another at least one secondary window data model further comprises the step of displaying said contents as at least one flat-list in said another at least one secondary window.\n32. The method of claim 9 wherein said method further comprises the step of:\nchanging said contents of said at least one secondary window data model.\n33. The method of claim 32 wherein said step of changing further comprises the step of:\nadding or removing elements to said at least one secondary window data model via a drag-and-drop operation performed on said at least one secondary window.\n34. The method of claim 32 wherein said step of changing further comprises the step of:\nadding or removing elements to said at least one secondary window model.\n35. The method of claim 32 wherein said step of changing further comprises the step of:\nediting an attribute of at least one of said contents of said at least one secondary window data model.\n36. The method of claim 9 wherein said method further comprises the steps of:\nselecting at least one element in said at least one secondary window;\ncausing said at least one element to be selected based upon said selection of said at least one element in said at least one primary window.\n37. The method of claim 36 wherein said method further comprises the step of:\nselecting another at least one element in said at least one primary window.\n38. The method of claim 36 wherein said method further comprises the step of:\nexecuting an operation which is performed on said at least one element.\n39. The method of claim 37 wherein said method further comprises the step of:\nexecuting an operation which is performed on both said at least one element and said another at least one element.\n40. The method of claim 9 wherein said method further comprises the steps of:\nselecting at least one element in said at least one secondary window; and\ncausing said at least one element to be an exclusive selection in said at least one primary window.\n41. The method of claim 9 wherein said at least one primary window includes at least one existing selection of at least one element, said method further comprising the steps of:\nselecting at least one element in said at least one secondary window; and\ncausing said at least one element from said selecting step to be added to said at least one existing selection in said at least one primary window.\n42. The method of claim 9 wherein said at least one primary window includes at least one existing selection of at least one element, said method further comprising the steps of:\nselecting at least one element in said at least one secondary window; and\ncausing said at least one element to be removed from said at least one existing selection in said at least one primary window.\n43. The method of claim 9 wherein said contents of said hierarchical data model are displayed as icons.\n44. A method of operating a graphical user interface comprising the steps of:\ndisplaying contents of a hierarchical data model as a hierarchical tree in at least one primary window;\ncreating at least one secondary window data model;\nselecting at least one of said contents of said hierarchical data model from said at least one primary window subsequent to the creating step;\nadding said at least one of said contents from said selecting step to said at least one secondary window data model subsequent to the selecting step; and\ndisplaying contents of said secondary window data model in at least one secondary window as a flat list;\nwherein following the completion of the adding step, said contents of said secondary window data model comprises at least two elements each having different immediate parent nodes in said hierarchical data model.\n45. The method of claim 44 wherein said step of creating at least one secondary window data model creates at least one secondary window data model without any objects.\n46. A method of operating a graphical user interface comprising the steps of:\ndisplaying contents of a hierarchical data model as a hierarchical tree in at least one primary window; and\nsimultaneously displaying at least one subset of said contents of said hierarchical data model in at least one secondary window;\nchanging said contents of said hierarchical data model via said at least one of said primary window or said at least one of said secondary window;\nwherein said at least one subset comprises at least two elements each having different immediate parent nodes in said hierarchical data model; and\nwherein said step of simultaneously displaying said at least one subset of said contents of said hierarchical data model further comprises the step of keeping said at least one subset static following said change in said hierarchical data model.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "JPH04205141A",
        "EP0690367A1",
        "US5504853A",
        "US5644736A",
        "US5701137A",
        "US5714971A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6154220A",
        "US6161136A",
        "WO2001026011A1",
        "WO2001065348A1",
        "US6298349B1",
        "US6313834B1",
        "US6335745B1",
        "US20020003548A1",
        "US6363301B1",
        "US6366919B2",
        "US20020078216A1",
        "US6418429B1",
        "US20020099595A1",
        "US6448985B1",
        "US20020147713A1",
        "US20020161828A1",
        "US6484190B1",
        "US20020178433A1",
        "US6493007B1",
        "US20020196293A1",
        "US20030020671A1",
        "US20030020730A1",
        "US20030033589A1",
        "US6532401B2",
        "US6549940B1",
        "GB2382185A",
        "EP1315097A1",
        "US6597773B2",
        "US6630942B2",
        "US20030227482A1",
        "US20030229646A1",
        "US20040017397A1",
        "US20040034662A1",
        "US20040051728A1",
        "US6724403B1",
        "WO2004051455A1",
        "US6760735B1",
        "US20040139200A1",
        "US6775659B2",
        "US20040194017A1",
        "US20040205711A1",
        "US20040236618A1",
        "US20050043984A1",
        "US20050166149A1",
        "US20050165766A1",
        "US20050193268A1",
        "US6961909B2",
        "US20050273728A1",
        "US20060004848A1",
        "US20060020586A1",
        "US20060036994A1",
        "US7028043B2",
        "US20060080304A1",
        "US20060173873A1",
        "US20060206837A1",
        "US20060217989A1",
        "US20060242603A1",
        "US20060294107A1",
        "US20070011179A1",
        "US20070050232A1",
        "US20070156677A1",
        "US20070168875A1",
        "US7296222B1",
        "US7305625B1",
        "US7313761B1",
        "US20080005135A1",
        "US20080046811A1",
        "US20080059896A1",
        "US20080165161A1",
        "US20080165210A1",
        "US20080168402A1",
        "US20080168478A1",
        "WO2008137559A1",
        "US20080320025A1",
        "US20090033412A1",
        "US20090112870A1",
        "US20090158197A1",
        "US20090158142A1",
        "US20090225039A1",
        "US20090225038A1",
        "US20090225037A1",
        "US20090228901A1",
        "US7610564B1",
        "US20090292718A1",
        "US20090306963A1",
        "US7703018B2",
        "US20100185929A1",
        "US20100199223A1",
        "US20100235118A1",
        "US20100255455A1",
        "US20100257483A1",
        "US20100257136A1",
        "CN101883184A",
        "US7844915B2",
        "US20100325728A1",
        "US20110179380A1",
        "US20110179386A1",
        "US20110179387A1",
        "US8078545B1",
        "US20120005611A1",
        "US20120072863A1",
        "US20120306739A1",
        "WO2013036373A3",
        "US8552999B2",
        "US20130339889A1",
        "US8656311B1",
        "US8661361B2",
        "US8813100B1",
        "US9043712B2",
        "USRE45559E1",
        "US9087138B2",
        "US9298363B2",
        "US20160103857A1",
        "US9336555B1",
        "US9360993B2",
        "US20160234341A1",
        "US9423954B2",
        "US9552404B2",
        "US9619132B2",
        "US9684521B2",
        "US9733716B2",
        "US9841878B1",
        "US10289267B2",
        "US10397639B1",
        "US10726126B2",
        "US10977331B2",
        "US11074231B1",
        "US11567918B2"
    ],
    "citedby_ftf": []
}