{
    "patent_id": "US-11210300-B2",
    "title": "System and methods of generating structured data from unstructured data ",
    "assignee": "NetSuite Inc.",
    "publication_date": "2021-12-28",
    "patent_link": "https://patents.google.com/patent/US11210300B2/en",
    "inventors": [
        "Oleksiy IGNATYEV",
        "Mihail Lambrinov Mihaylov"
    ],
    "classifications": [
        "G06F16/24578",
        "G06N20/00",
        "G06F16/22",
        "G06F16/24522",
        "G06F16/258",
        "G06F40/174",
        "G06F40/284",
        "G06N5/047",
        "G06Q10/00"
    ],
    "abstract": "Systems and methods to infer or predict the proper placement of unstructured data (such as text, phrases, segments of phrases, alphanumeric characters) into a more structured format (such as a specific data field). In some embodiments, this is based on a user's prior assignment of similar unstructured data into a specific structure. In some embodiments, this may be based on other users' prior assignment of similar unstructured data into the specific structure. In yet other embodiments, this may be based on information obtained from business data used by a data processing platform to assist in operating the business (i.e., either business data or the output of a business application that processes the business data, such as an ERP, CRM, or eCommerce application).",
    "claims": "\n1. A method of determining an assignment of one or more elements of data to a specific data field or to a set of data fields, comprising:\ntraining a machine learning algorithm to optimize identification of one or more structured data fields as destinations for elements of unstructured data based on historical entry of unstructured data into the structured data fields;\naccessing one or more sources of data to be processed for assignment to the specific data field or to the set of data fields;\ndetermining a relationship, association or correlation between samples of unstructured text and data fields that represent general text elements arranged in free-form strings using a natural language processing (NLP) technique that includes\ndetermining n-grams to represent each sample of unstructured text characters as a vector,\ndetermining, for each n-gram of the n-grams, an associated weight greater than zero and less than one based at least in part on an amount of time since a document containing the n-gram was cited by another document, with the weight reduced as the amount of time increases, and\nadding the highest weighted n-gram to a list of most likely candidates for placement into the specified data field or the set of data fields;\nidentifying a most likely candidate text or string for placement into the specified data field or the set of data fields by applying the trained machine learning algorithm to the vector;\nadding the most likely candidate text or string to the list of most likely candidates for placement into the specified data field or the set of data fields;\nreceiving a selection of one candidate from the list for placement into the specified data field or the set of data fields;\nin response to receiving the selection of the one candidate, using the one candidate as data values for the specified data field or the set of data fields; and\nstoring the data values in a format or record associated with the specific data field or the set of data fields.\n2. The method of claim 1, wherein at least one of the one or more sources of data is data associated with a specific task.\n3. The method of claim 1, wherein at least one of the one or more sources of data is data associated with a specific data processing application or business area.\n4. The method of claim 1, wherein at least one of the one or more sources of data is data associated with a specific time interval covering a lifetime of a product architecture or a time since a product architecting event.\n5. The method of claim 4, wherein the data associated with the specific time interval is data that was generated within that time interval.\n6. The method of claim 1, wherein at least one of the one or more sources of data is data associated with a specific set of users.\n7. The method of claim 1, wherein the weights are at least in part a function of how recently a document containing the accessed data was entered into a system.\n8. The method of claim 1, wherein the weights are at least in part a function of the amount of citation or incorporation by other documents of elements of the accessed data.\n9. The method of claim 1, wherein the sources of data include data resident on a multi-tenant business data processing platform, the platform including tenant-specific data generated or utilized by one or more of a tenant-specific enterprise resource planning (ERP), customer relationship management (CRM), eCommerce, human resources (HR), or financial application.\n10. The method of claim 1, wherein the machine learning technique includes application of a k-nearest neighbor approach to identifying the most likely candidate text or string, wherein the k-nearest neighbor approach is uncombined with a support vector machine approach.\n11. The method of claim 1, wherein the amount of time since the document containing the n-gram was cited by another document is the minimum amount of time among several amounts of time since the document containing the n-gram was cited.\n12. The method of claim 1, wherein the weights are calculated at least in part by dividing the minimum time among all times since the document containing the n-gram was cited by the total time since the document was entered into the system and subtracting a resulting quotient from one.\n13. The method of claim 1, wherein:\nat least one of the one or more sources of data is data associated with a specific task, a specific data processing application or business area, and a specific set of users, and the data is generated within specific time interval covering a lifetime of a product architecture;\nthe one or more sources of data include data resident on a multi-tenant business data processing platform, the platform including tenant-specific data generated or utilized by one or more of a tenant-specific eCommerce application;\nthe weights are at least in part a function of how recently a document containing the accessed data was entered into a system;\nthe machine learning technique includes application of a k-nearest neighbor approach to identifying the most likely candidate text or string that is uncombined with a support vector machine approach;\nthe amount of time since the document containing the n-gram was cited by another document is the minimum amount of time among several amounts of time since the document containing the n-gram was cited.\n14. A system for determining an assignment of one or more elements of data to a specific data field, comprising\na database or data store containing a plurality of data records;\none or more business related data processing applications installed in the system;\na hardware processor programmed with a set of instructions, wherein, when executed by the hardware processor, the instructions cause the system to\ntrain a machine learning algorithm to optimize identification of one or more structured data fields as destinations for elements of unstructured data based on historical entry of unstructured data into the structured data fields;\naccess one or more sources of data from the database or data store to be processed for assignment to the specific data field;\ndetermine a relationship, association or correlation between samples of unstructured text and data fields that represent general text elements arranged in free-form strings-using a natural language processing (NLP) technique that includes\ndetermining n-grams to represent each sample of unstructured text characters as a vector,\ndetermine, for each n-gram of the n-grams, an associated weight greater than zero and less than one based at least in part on an amount of time since a document containing the n-gram was cited by another document, with the weight reduced as the amount of time increases, and\nadding the highest weighted n-gram to a list of most likely candidates for placement into the specified data field or the set of data fields;\nidentify a most likely candidate text or string for placement into the specified data field by applying a machine learning technique to the vector;\nadd the most likely candidate text or string to the list of most likely candidates for placement into the specified data field or the set of data fields;\nreceive a selection of one candidate from the list for placement into the specified data field or set of data fields;\nin response to receiving the selection of the one candidate, use the one candidate as data values for the specified data field; and\nstore the data values in a format or record associated with the specific data field.\n15. The system of claim 14, wherein the one or more business related data processing applications include one or more of an enterprise resource planning (ERP), customer relationship management (CRM), human resources management (HR), or eCommerce application.\n16. The system of claim 14, wherein at least one of the one or more sources of data is data that was generated within a specific time interval.\n17. The system of claim 14, wherein at least one of the one or more sources of data is data associated with a specific set of users.\n18. The system of claim 14, wherein the weights are at least in part a function of how recently the accessed data was entered into a system.\n19. The system of claim 14, wherein the weights are at least in part a function of the amount of citation or incorporation by other documents of elements of the accessed data.\n20. The system of claim 14, wherein the machine learning technique includes application of the k-nearest neighbor approach to identifying the most likely candidate text or string."
}