{
    "patent_link": "https://patents.google.com/patent/US4893330A/en",
    "patent_id": "US4893330A",
    "title": "Method and apparatus for restricting credit card communication calls",
    "abstract": "A method and an apparatus are disclosed to enable a public switching network to limit the geographical calling area of calls charged to a credit card. When a credit card call is originated, the called party number is included as part of the credit card validation request. The called party number is compared against numbers stored in a call restriction table previously entered by the owner of the credit card. The network accepts or denies credit card calls as a result of this comparison.",
    "inventors": [
        "Victor A. Franco"
    ],
    "assignee": "AT&T Corp",
    "classifications": [
        "H04M15/38",
        "H04M3/38",
        "H04Q3/0016",
        "H04Q2213/1313",
        "H04Q2213/13515",
        "Y10S379/903",
        "Y10S379/912"
    ],
    "claims": "\n1. In a data base system, a method of providing a calling charge validation service for determining whether a communication call connection should be complete by an associated communication switching system, the method characterized by the steps of\nreceiving from said switching system a call message including a call billing code and a dialing sequence identifying the destination of a call,\naccessing a data base associated with said billing code to obtain stored dialing data which identifies potential destinations for said call, and\ncomparing the dialing sequence against said stored dialing data and, in response to said comparison, signaling said switching system to control a call connection to the destination determined by said dialing sequence.\n2. The method of claim 1 wherein said comparing step signals said switching system to deny the completion of the call connection to said destination.\n3. The method of claim 1 wherein said comparing step signals said switching system to complete the call connection to said destination.\n4. The method of claim 1 wherein said data base system includes a polarity bit associated with said billing code, said polarity bit having a first value indicating that said stored dialing data includes permissible call destinations and a second value indicating that said stored data includes impermissible call destinations; and wherein\nsaid comparing step is jointly responsive to said stored dialing data and the value of said polarity bit for signaling said switching system to control the call connection to said destination.\n5. The method of claim 1 wherein said data base includes stored dialing data identifying a plurality of permissible destinations for said call.\n6. The method of claim 1 wherein said data base includes stored dialing data identifying a plurality of impermissible destinations for said call.\n7. The method of claim 1 wherein said data base includes previously stored billing code data, said method including the step of\nchecking said received call billing code against said stored billing code data and, in response thereto, signaling said switching system to control the call connection to the destination determined by said dialing sequence.\n8. The method of claim 1 wherein said data base includes a fraud indicator associated with said billing code, said method including the step of\ndetecting the status of said fraud indicator and in response thereto, signaling said switching system to control the call connection to said destination determined by said dialing sequence.\n9. The method of claim 1 wherein said received call message includes a calling station identification, and said method includes the step of\ndetermining if a calling station is a restricted station by checking said calling station identification against previously stored calling station identifications and, in response to said determination, signaling said switching system to control the call connection to said destination determined by said dialing sequence.\n10. The method of claim 1 wherein said data base comprises two lists of dialing sequences including\na first list where each dialing sequence thereon has no NPA or NXX codes in common with any other dialing sequence in said first list, and\na second list where each second dialing sequence thereon has an NPA code in common with a dialing sequence of said first list.\n11. The method of claim 10 wherein said data base comprises a third list of dialing sequences where each third list dialing sequence has both NPA and NXX codes in common with a dialing sequence of said second list.\n12. The method of claim 1 wherein said data base includes a domestic list and an international list of dialing sequences for at least one billing code.\n13. The method of claim 1 wherein said billing code is a nontelephone number based charge card number.\n14. Apparatus for use in conjunction with a communication system for providing a calling charge validation service for determining whether a communication call should be processed by said communication switching system, said apparatus including\ndata base means for storing previously entered dialing data which identifies potential destinations for calls chargeable to a billing code,\nmeans for receiving from said switching system a call message icluding a call billing code and a dialing sequence identifying the destination of a call, and\nprocessor means for accessing said data base means using said received billing code, comparing the received dialing sequence with stored dialing data associated with said received billing code, and in response to said comparison, signaling said switching system to control a call connection to the destination determined by said dialing sequence.\n15. The apparatus of claim 14 wherein said data base system includes a polarity bit associated with said billing code, said polarity bit having a first value indicating that said stored dialing data includes permissible call destinations and a second value indicating that said stored dialing data includes impermissible call destinations; and wherein\nsaid processor means is jointly responsive to said stored dialing data and the value of said polarity bit for signaling said switching system to control the call connection to said destination.\n16. The apparatus of claim 14 wherein said data base includes previously stored billing code data and said processor means includes\nmeans for checking said received call billing code against said stored billing code data and, in response thereto, signaling said switching system to control the call connection to the destination determined by said dialing sequence.\n17. The apparatus of claim 14 wherein said data base includes a fraud indicator associated with said billing code, and said processor means includes\nmeans for detecting the status of said fraud indicator and in response thereto, signaling said switching system to control the call connection to said destination determined by said dialing sequence.\n18. The apparatus of claim 14 wherein said received call message includes a calling station identification, and said processor means includes\nmeans for determining if a calling station is a restricted station by checking said calling station identification against previously stored calling station identifications and, in response to said determination, signaling said switching system to control the call connection to the destination determined by said dialing sequence.\n19. The apparatus of claim 14 wherein said data base comprises two lists of dialing sequences including\na first list where each dialing sequence thereon has no NPA or NXX codes in common with any other dialing sequence in said first list, and\na second list where each second dialing sequence thereon has an NPA code in common with a dialing sequence of said first list.\n20. The apparatus of claim 14 wherein said data base comprises a third list of dialing sequences where each third list dialing sequence has both NPA and NXX codes in common with a dialing sequence of said second list.\n21. A method of providing a calling charge validation service for a communication system for determining whether a communication call should be processed by said communication switching system, characterized by the steps of:\nreceiving from a caller a call message including a call billing code and a dialing sequence identifying the destination of a call,\naccessing a data base associated with said billing code to obtain stored dialing data which identifies restricted and unrestricted call destinations, and\ncomparing the received dialing sequence with said stored dialing data and, in response thereto, controlling a call connection to the destination determined by said dialing sequence.\n22. The method of claim 21 wherein said data base system includes a polarity bit associated with said billing code, said polarity bit having a first value indicating that said stored dialing data includes permissible call destinations and a second value indicating that said stored dialing data includes impermissible call destinations; and wherein\nsaid comparing step is jointly responsive to said stored dialing data and the value of said polarity bit for controlling the call connection to said destination.\n23. The method of claim 22 wherein said data base includes stored billing code data, said method including the step of\nchecking said received call billing code against previously stored billing code data and, in response thereto, controlling the call connection to said destination.\n24. The method of claim 22 wherein said data base includes a fraud bit associated with said billing code, said method including the step\ndetecting the status of said fraud bit and, in response thereto, controlling the call connection to said destination.\n25. The method of claim 22 wherein said received call message includes a calling station identification and said method includes the step of\ndetermining if a calling station is a restricted station by checking said calling station identification against previously stored calling station identifications and, in response to said determination, controlling the call connection to said destination.\n26. The method of claim 22 wherein said data base comprises two lists of dialing sequences including\na first list where each dialing sequence thereon has no NPA or NXX codes in common with any other dialing sequence in said first list, and\na second list where each second dialing sequence thereon has an NPA code in common with a dialing sequence of said first list.\n27. The method of claim 22 wherein said data base comprises a third list of dialing sequences where each third list dialing sequence has both NPA and NXX codes in common with a dialing sequence of said second list.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4756020A"
    ],
    "citations_ftf": [
        "US4162377A",
        "JPS5946459B2",
        "GB2086187A",
        "JPH0378820B2",
        "GB2171877B",
        "FR2596598B1",
        "JPH0311158B2"
    ],
    "citedby_own": [
        "US5163086A",
        "US5181238A",
        "US5226073A",
        "US5276444A",
        "US5291399A",
        "US5313463A",
        "US5345595A",
        "US5448617A",
        "US5463681A",
        "US5481600A",
        "US5485510A",
        "WO1996007265A1",
        "US5510777A",
        "US5555551A",
        "US5563933A",
        "US5566234A",
        "US5586175A",
        "US5602906A",
        "US5666405A",
        "US5719926A",
        "US5737701A",
        "US5754632A",
        "US5787156A",
        "US5822544A",
        "US5825863A",
        "US5875236A",
        "US5898762A",
        "US5907602A",
        "US5917893A",
        "US5950121A",
        "US5956637A",
        "US5970129A",
        "US5987118A",
        "US6014439A",
        "US6016344A",
        "US6044135A",
        "US6058301A",
        "US6075982A",
        "US6145084A",
        "US6160874A",
        "US6188761B1",
        "US6192113B1",
        "US6229819B1",
        "US6246755B1",
        "US6292656B1",
        "US20020034283A1",
        "US20020044043A1",
        "DE10047177A1",
        "US20020067823A1",
        "US6434223B2",
        "US20020120587A1",
        "US6449346B1",
        "US20020173292A1",
        "US20020194119A1",
        "US6505039B1",
        "US20030018567A1",
        "US6512415B1",
        "US20030055786A1",
        "US6570967B2",
        "US6587890B1",
        "US6678360B1",
        "US6704563B1",
        "US20040120475A1",
        "US20040208299A1",
        "US7096192B1",
        "US20060251226A1",
        "US7136835B1",
        "US7187928B1",
        "US20080140576A1",
        "US20090012897A1",
        "US7929516B2",
        "US20120197796A1",
        "GB2524575A",
        "US11170613B2"
    ],
    "citedby_ftf": [
        "US5818920A",
        "CA2336786A1",
        "US7145989B1",
        "DE19926472C2",
        "AU2001271968B2",
        "US6961412B2",
        "US6950506B2",
        "US7810134B2",
        "US20150134302A1",
        "US10366439B2",
        "US20160092956A1"
    ]
}