{
    "patent_id": "US-11298191-B2",
    "title": "Robotically-assisted surgical guide ",
    "assignee": "Mako Surgical Corp.",
    "publication_date": "2022-04-12",
    "patent_link": "https://patents.google.com/patent/US11298191B2/en",
    "inventors": [
        "Arthur E. Quaid, III"
    ],
    "classifications": [
        "A61B34/10",
        "A61B17/3403",
        "A61B17/1703",
        "A61B34/20",
        "A61B34/25",
        "A61B34/30",
        "A61B34/32",
        "A61B34/35",
        "A61B34/37",
        "A61B34/70",
        "A61B34/74",
        "A61B34/76",
        "A61B34/77",
        "A61B90/03",
        "A61B90/06",
        "A61B90/36",
        "A61B90/39",
        "B25J13/025",
        "B25J9/0081",
        "A61B17/1757",
        "A61B17/1767",
        "A61B2017/00022",
        "A61B2017/00119",
        "A61B2017/00128",
        "A61B2017/00199",
        "A61B2017/00212",
        "A61B2017/00398",
        "A61B2017/3405",
        "A61B2034/104",
        "A61B2034/105",
        "A61B2034/107",
        "A61B2034/2055",
        "A61B2034/2068",
        "A61B2034/2072",
        "A61B2034/252",
        "A61B2034/254",
        "A61B2090/031",
        "A61B2090/064",
        "A61B2090/365",
        "A61B2090/3945"
    ],
    "abstract": "A computer-assisted surgery system for performing a surgical procedure at a target area on a patient's anatomy. Said computer-assisted surgery system includes a robotic device having a plurality of joints and a plurality of actuators and a guide mechanically coupled to said robotic device. Said robotic device is configured to constrain said guide according to a pre-defined virtual geometry with said guide being movable along said pre-defined virtual geometry toward the target area on the patient's anatomy. The computer-assisted surgery system also includes a computer in communication with said robotic device and configured to command said robotic device to operate in one of a first mode in which said guide is manually manipulated by a user or a second mode in which said robotic device operates autonomously.",
    "claims": "\n1. A computer-assisted surgery system for performing a surgical procedure at a target area on a patient's anatomy, said computer-assisted surgery system comprising:\na robotic device having a plurality of joints and a plurality of actuators;\na guide mechanically coupled to said robotic device, wherein said robotic device is configured to constrain said guide according to a pre-defined virtual geometry with said guide being movable along said pre-defined virtual geometry toward the target area on the patient's anatomy; and\na computer in communication with said robotic device and configured to command said robotic device to operate in one of a first mode in which said guide is manually manipulated by a user or a second mode in which said robotic device operates autonomously;\nwherein said robotic device is configured to be controlled by said computer to generate force feedback in said first mode in response to said guide being manually manipulated by the user in said first mode in order to constrain said guide with said pre-defined virtual geometry;\nwherein said robotic device is further controlled to lock the guide in a desired pose in response to the guide moving to the desired pose via manual manipulation in the first mode and occurrence of a combination of inputs to a foot pedal and a touchscreen.\n2. The computer-assisted surgery system of claim 1, wherein said computer is further configured to:\nreceive a preoperative image dataset of the patient's anatomy taken with an imaging modality; and\nregister the preoperative image dataset to the patient's anatomy.\n3. The computer-assisted surgery system of claim 2, wherein said computer is further configured to receive a second preoperative image dataset of the patient's anatomy taken with a second imaging modality different than the imaging modality and register the preoperative image dataset and the second preoperative image dataset to the patient's anatomy, wherein the preoperative image dataset is different than the second preoperative image dataset.\n4. The computer-assisted surgery system of claim 1, wherein said computer is further configured to define the target area relative to a virtual representation of the patient's anatomy and register the virtual representation of the patient's anatomy to the patient's anatomy.\n5. The computer-assisted surgery system of claim 1, wherein the guide is a drill guide.\n6. The computer-assisted surgery system of claim 1, further comprising a display for displaying images of the patient's anatomy.\n7. The computer-assisted surgery system of claim 1, further comprising an imaging modality for generating an image dataset of the target area of the patient's anatomy.\n8. The computer-assisted surgery system of claim 1, further comprising a camera and an array of trackable markers attachable to the patient's anatomy.\n9. The computer-assisted surgery system of claim 8, wherein said trackable markers comprise passive reflective markers.\n10. The computer-assisted surgery system of claim 1, wherein said robotic device comprises a robotic arm configured to move said guide in at least four degrees of freedom.\n11. The computer-assisted surgery system of claim 10, wherein the predefined virtual geometry is a line, a plane, or a surface.\n12. A method for performing a surgical procedure at a target area using a computer-assisted surgery system comprising a computer and a robotic device in communication with the computer, the robotic device having a plurality of joints and a plurality of actuators, said method comprising:\ndetermining, with the computer-assisted surgery system, a position of a guide relative to a pre-defined virtual geometry with the guide being mechanically coupled to the robotic device;\ncommanding, by the computer-assisted surgery system, the robotic device to operate in one of a first mode or a second mode, wherein the guide is manually manipulated by a user in the first mode and the robotic device operates autonomously in the second mode; and\ngenerating, with the robotic device, force feedback in response to the guide being manually manipulated by the user in the first mode to constrain the guide to the pre-defined virtual geometry with the guide moveable along the pre-defined virtual geometry to provide access to the target area; and\nlocking, by the robotic device, the guide in a desired pose in response to the guide moving to the desired pose via manual manipulation along the pre-defined virtual geometry in the first mode and occurrence of a combination of inputs to a foot pedal and a touchscreen.\n13. The method of claim 12, further comprising:\nreceiving, at the computer-assisted surgery system, a preoperative image dataset taken of a patient's anatomy using an imaging modality; and\nregistering the preoperative image dataset to the patient's anatomy.\n14. The method of claim 13, further comprising receiving, at the computer-assisted surgery system, a second preoperative image dataset taken of the patient's anatomy using a second imaging modality different than the imaging modality, and registering, with the computer-assisted surgery system, the preoperative image dataset and the second preoperative image dataset to the patient's anatomy, wherein the second preoperative image data set is different than the preoperative image dataset.\n15. The method of claim 12, wherein the target area is defined relative to a virtual representation of a patient's anatomy and the method further comprises registering the virtual representation with the patient's anatomy.\n16. The method of claim 12, wherein the guide is a drill guide.\n17. The method of claim 12, further comprising displaying a virtual representation of a patient's anatomy on a display.\n18. The method of claim 12, further comprising displaying a virtual representation of the pre-defined virtual geometry on a display.\n19. The method of claim 12, wherein the predefined virtual geometry is a line, a plane, or a surface.\n20. The method of claim 12, wherein determining, with the computer-assisted surgery system, the position of the guide relative to the pre-defined virtual geometry comprises tracking a patient's anatomy with a camera and an array of trackable markers attached to the patient's anatomy."
}