{
    "patent_id": "US-11552969-B2",
    "title": "Threat detection platforms for detecting, characterizing, and remediating email-based threats in real time ",
    "assignee": "Abnormal Security Corporation",
    "publication_date": "2023-01-10",
    "patent_link": "https://patents.google.com/patent/US11552969B2/en",
    "inventors": [
        "Sanjay Jeyakumar",
        "Jeshua Alexis Bratman",
        "Dmitry Chechik",
        "Abhijit Bagri",
        "Evan Reiser",
        "Sanny Xiao Lang Liao",
        "Yu Zhou Lee",
        "Carlos Daniel Gasperi",
        "Kevin Lau",
        "Kai Jing Jiang",
        "Su Li Debbie Tan",
        "Jeremy Kao",
        "Cheng-Lin Yeh"
    ],
    "classifications": [
        "H04L63/1483",
        "H04L63/1416",
        "G06F21/561",
        "G06F21/566",
        "H04L51/212",
        "H04L63/123",
        "H04L63/126",
        "H04L63/1433",
        "H04L63/145",
        "H04L63/1475",
        "G06N20/20",
        "G06N5/01",
        "G06N5/04"
    ],
    "abstract": "Conventional email filtering services are not suitable for recognizing sophisticated malicious emails, and therefore may allow sophisticated malicious emails to reach inboxes by mistake. Introduced here are threat detection platforms designed to take an integrative approach to detecting security threats. For example, after receiving input indicative of an approval from an individual to access past email received by employees of an enterprise, a threat detection platform can download past emails to build a machine learning (ML) model that understands the norms of communication with internal contacts (e.g., other employees) and/or external contacts (e.g., vendors). By applying the ML model to incoming email, the threat detection platform can identify security threats in real time in a targeted manner.",
    "claims": "\n1. A system, comprising:\na processor configured to:\nreceive an email addressed to an employee of an enterprise;\napply a first model to the email to produce a first output indicative of whether the email is representative of a non-malicious email, wherein the first model is trained using past emails addressed to the employee that have been verified as non-malicious emails;\ndetermine, based on the first output, that the email is potentially a malicious email;\nresponsive to determining that the email is potentially a malicious email based on the first output, apply a second model to the email to produce a second output indicative of whether the email is representative of a given type of malicious email, wherein the second model is one of a plurality of models, each of which is respectively associated with a different type of malicious email, wherein at least one model included in the plurality of models determines a goal of the malicious email, and wherein the processor is further configured to upload information associated with the goal to a profile of the employee; and\nperform an action with respect to the email based on the second output; and\na memory coupled to the processor and configured to provide the processor with instructions.\n2. The system of claim 1, wherein the second output indicates that the email is not of the given type of malicious email, and wherein performing the action comprises forwarding the email to an inbox of the employee.\n3. The system of claim 1, wherein at least one model included in the plurality of models determines whether content in a given email includes a query for data.\n4. The system of claim 1, wherein at least one model included in the plurality of models includes determining whether content in a given email includes a query for funds.\n5. The system of claim 1, wherein at least one model included in the plurality of models determines whether content in a given email includes a link to a Hypertext Markup Language (HTML) resource.\n6. The system of claim 1, wherein at least one model included in the plurality of models determines whether a given email includes an attachment.\n7. The system of claim 1, wherein at least one model included in the plurality of models discovers one or more facets of a security threat associated with the malicious email.\n8. The system of claim 1, wherein the plurality of models collectively produce a plurality of outputs when applied to the email, and wherein the processor is further configured to apply a third model designed to aggregate at least two of the plurality of outputs produced into a comprehensible visualization component.\n9. The system of claim 1, wherein the second output indicates that the email includes a link to a Hypertext Markup Language (HTML) resource, and wherein performing the action comprises:\nfollowing the link so that the HTML resource is accessed using a virtual web browser;\nextracting a Document Object Model (DOM) for the HTML resource through the virtual web browser; and\nanalyzing the DOM to determine whether the link represents a security threat.\n10. The system of claim 1, wherein the second output indicates that the email includes a primary link to a resource hosted by a network-accessible hosting service, and wherein performing the action comprises:\nfollowing the primary link so that the resource is accessed using a virtual web browser;\ndiscovering whether any secondary links to secondary resources are present by examining content of the resource through the virtual web browser;\nfor each secondary link, following the secondary link so that the corresponding secondary resource is accessed using the virtual web browser and analyzing content of the corresponding secondary resource to determine whether the secondary link represents a security threat; and\ndetermining whether the primary link represents a security threat based on whether any secondary links were determined to represent security threats.\n11. The system of claim 1,\nwherein the second output indicates that the email includes a link to a Hypertext Markup Language (HTML) resource, and wherein performing the action comprises:\nfollowing the link so that the HTML resource is accessed using a virtual web browser;\ncapturing a screenshot of the HTML resource through the virtual web browser;\napplying a computer vision algorithm designed to identify similarities between the screenshot and a library of verified sign-in websites; and\ndetermining whether the link represents a security threat based on an output produced by the computer vision algorithm.\n12. The system of claim 1, wherein the second output indicates that the email includes an attachment, and wherein performing the action comprises:\nopening the attachment within a secure processing environment; and\ndetermining whether the attachment represents a security threat based on an analysis of content of the attachment.\n13. A method, comprising:\nreceiving an email addressed to an employee of an enterprise;\napplying a first model to the email to produce a first output indicative of whether the email is representative of a non-malicious email, wherein the first model is trained using past emails addressed to the employee that have been verified as non-malicious emails;\ndetermining, based on the first output, that the email is potentially a malicious email;\nresponsive to determining that the email is potentially a malicious email based on the first output, applying a second model to the email to produce a second output indicative of whether the email is representative of a given type of malicious email, wherein the second model is one of a plurality of models, each of which is respectively associated with a different type of malicious email, wherein at least one model included in the plurality of models determines a goal of the malicious email, and further comprising uploading information associated with the goal to a profile of the employee; and\nperforming an action with respect to the email based on the second output.\n14. The method of claim 13, wherein the second output indicates that the email is not of the given type of malicious email, and wherein performing the action comprises forwarding the email to an inbox of the employee.\n15. The method of claim 13, wherein at least one model included in the plurality of models determines whether content in a given email includes a query for data.\n16. The method of claim 13, wherein at least one model included in the plurality of models includes determining whether content in a given email includes a query for funds.\n17. The method of claim 13, wherein at least one model included in the plurality of models determines whether content in a given email includes a link to a Hypertext Markup Language (HTML) resource.\n18. The method of claim 13, wherein at least one model included in the plurality of models determines whether a given email includes an attachment.\n19. The method of claim 13, wherein at least one model included in the plurality of models discovers one or more facets of a security threat associated with the malicious email.\n20. The method of claim 13, wherein the plurality of models collectively produce a plurality of outputs when applied to the email, further comprising applying a third model designed to aggregate at least two of the plurality of outputs produced into a comprehensible visualization component.\n21. The method of claim 13, wherein the second output indicates that the email includes a link to a Hypertext Markup Language (HTML) resource, and wherein performing the action comprises:\nfollowing the link so that the HTML resource is accessed using a virtual web browser;\nextracting a Document Object Model (DOM) for the HTML resource through the virtual web browser; and\nanalyzing the DOM to determine whether the link represents a security threat.\n22. The method of claim 13, wherein the second output indicates that the email includes a primary link to a resource hosted by a network-accessible hosting service, and wherein performing the action comprises:\nfollowing the primary link so that the resource is accessed using a virtual web browser;\ndiscovering whether any secondary links to secondary resources are present by examining content of the resource through the virtual web browser;\nfor each secondary link, following the secondary link so that the corresponding secondary resource is accessed using the virtual web browser and analyzing content of the corresponding secondary resource to determine whether the secondary link represents a security threat; and\ndetermining whether the primary link represents a security threat based on whether any secondary links were determined to represent security threats.\n23. The method of claim 13, wherein the second output indicates that the email includes a link to a Hypertext Markup Language (HTML) resource, and wherein performing the action comprises:\nfollowing the link so that the HTML resource is accessed using a virtual web browser;\ncapturing a screenshot of the HTML resource through the virtual web browser;\napplying a computer vision algorithm designed to identify similarities between the screenshot and a library of verified sign-in websites; and\ndetermining whether the link represents a security threat based on an output produced by the computer vision algorithm.\n24. The method of claim 13, wherein the second output indicates that the email includes an attachment, and wherein performing the action comprises:\nopening the attachment within a secure processing environment; and\ndetermining whether the attachment represents a security threat based on an analysis of content of the attachment.",
    "status": "Active",
    "citations_own": [
        "US5999932A",
        "US6023723A",
        "US6088717A",
        "US20020002520A1",
        "US20020116463A1",
        "US20030204569A1",
        "US20040030913A1",
        "US20040117450A1",
        "US20040128355A1",
        "US20040215977A1",
        "US20040260922A1",
        "US20050039019A1",
        "US20050187934A1",
        "US20050198518A1",
        "US20060036698A1",
        "US20060053203A1",
        "US20060191012A1",
        "US20060253581A1",
        "US20070074169A1",
        "US7263506B2",
        "US20070276851A1",
        "US20080005249A1",
        "US20080086532A1",
        "US20080114684A1",
        "US20080201401A1",
        "US7451487B2",
        "US20090037350A1",
        "US20090132490A1",
        "US7610344B2",
        "US20100115040A1",
        "US20100211641A1",
        "US20100318614A1",
        "US7953814B1",
        "US20110173142A1",
        "US20110179126A1",
        "US20110213869A1",
        "US20110214157A1",
        "US20110231510A1",
        "US20110231564A1",
        "US20110238855A1",
        "US20120028606A1",
        "US20120110672A1",
        "US20120137367A1",
        "US20120233662A1",
        "US20120278887A1",
        "US20120290712A1",
        "US20120297484A1",
        "US20130041955A1",
        "US20130086261A1",
        "US20130086180A1",
        "US20130097709A1",
        "US20130167207A1",
        "US20130191759A1",
        "US8566938B1",
        "US20140013441A1",
        "US20140032589A1",
        "US20140181223A1",
        "US8819819B1",
        "US20140325662A1",
        "US20140365303A1",
        "US20140380478A1",
        "US20140379825A1",
        "US8935788B1",
        "US20150026027A1",
        "US9009824B1",
        "US20150128274A1",
        "US20150143456A1",
        "US20150161611A1",
        "US20150161609A1",
        "US20150228004A1",
        "US20150234831A1",
        "US20150237068A1",
        "US9154514B1",
        "US20150295945A1",
        "US20150295942A1",
        "US20150319157A1",
        "US20150339477A1",
        "US9213827B2",
        "US20160014151A1",
        "US9245225B2",
        "US9245115B1",
        "US20160036829A1",
        "US9264418B1",
        "US20160057167A1",
        "US9348981B1",
        "US20160227367A1",
        "US20160253598A1",
        "US20160262128A1",
        "US20160301705A1",
        "US20160306812A1",
        "US20160321243A1",
        "US20160328526A1",
        "US20160344770A1",
        "US9516053B1",
        "US20160380936A1",
        "US9537880B1",
        "US20170041296A1",
        "US9571512B2",
        "US20170098219A1",
        "US20170111506A1",
        "US9686308B1",
        "US20170186112A1",
        "US20170214701A1",
        "US20170223046A1",
        "US20170222960A1",
        "US20170230323A1",
        "US20170230403A1",
        "US20170237754A1",
        "US20170251006A1",
        "US9756007B1",
        "US9774626B1",
        "US9781152B1",
        "US20170289191A1",
        "CN107315954A",
        "US20170346853A1",
        "US9847973B1",
        "US20180027006A1",
        "US20180026926A1",
        "US20180084003A1",
        "US20180084013A1",
        "US20180091453A1",
        "US9946789B1",
        "US9961096B1",
        "US9967268B1",
        "US20180159808A1",
        "US10015182B1",
        "US20180189347A1",
        "US20180196942A1",
        "US20180219888A1",
        "US10044745B1",
        "US20180227324A1",
        "US10091312B1",
        "US20180295146A1",
        "US10104029B1",
        "US20180324297A1",
        "US10129288B1",
        "US20180375814A1",
        "US20190014143A1",
        "US20190028509A1",
        "US20190052655A1",
        "US20190068616A1",
        "US20190065748A1",
        "US20190081983A1",
        "US20190087428A1",
        "US20190089711A1",
        "US10243989B1",
        "US10250624B2",
        "US20190104154A1",
        "US20190109863A1",
        "US10277628B1",
        "US20190141183A1",
        "US20190166161A1",
        "US20190190929A1",
        "US20190190936A1",
        "US20190199745A1",
        "US20190205511A1",
        "US20190222606A1",
        "US10362057B1",
        "US20190238571A1",
        "US10397272B1",
        "US10419468B2",
        "US20190311121A1",
        "US20190319905A1",
        "US20190319987A1",
        "US20190384911A1",
        "US10523609B1",
        "US20200007502A1",
        "US20200021609A1",
        "US20200044851A1",
        "US20200053111A1",
        "US20200053120A1",
        "US20200068031A1",
        "US20200076825A1",
        "US20200074078A1",
        "US10601865B1",
        "US20200127962A1",
        "US20200125725A1",
        "US20200162483A1",
        "US10673880B1",
        "US20200204572A1",
        "US20200287936A1",
        "US20200344251A1",
        "US10834127B1",
        "US20200358804A1",
        "US20200374251A1",
        "US20200389486A1",
        "US20200396258A1",
        "US20200412767A1",
        "US20210021612A1",
        "US10911489B1",
        "US20210058395A1",
        "US20210091962A1",
        "US20210092154A1",
        "US11019076B1",
        "US20210168161A1",
        "US11063897B2",
        "US20210240836A1",
        "US20210272066A1",
        "US20210295179A1",
        "US11153351B2",
        "US20210336983A1",
        "US20210360027A1"
    ],
    "citations_ftf": [
        "US8244532B1",
        "US20200067861A1"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US11050793B2",
        "US11431738B2",
        "US20200204572A1",
        "US11032312B2",
        "BR112021010468A2",
        "US11552990B2",
        "US11196754B1",
        "US11470042B2",
        "US10911489B1",
        "US20210266345A1",
        "US11477234B2",
        "US11790060B2",
        "WO2021183939A1",
        "US11651222B2",
        "US11470108B2",
        "US20210409445A1",
        "US20220036208A1",
        "US20220051127A1",
        "CN112039874B",
        "US11528242B2",
        "US20220156655A1",
        "US11687648B2",
        "CN112788010B",
        "US11652828B1",
        "US11082445B1",
        "CN112784990A",
        "EP4044503A1",
        "US20220269774A1",
        "US11711348B2",
        "US11595446B2",
        "CN113411199A",
        "US20220360601A1",
        "CN113452709A",
        "US20230047190A1",
        "US11444978B1",
        "US11438377B1",
        "US11336689B1",
        "CN113965378B",
        "CN113919239B",
        "US20230291755A1",
        "CN116308237B"
    ]
}