{
    "patent_id": "US-11544099-B2",
    "title": "Analytic model execution engine with instrumentation for granular performance analysis for metrics and diagnostics for troubleshooting ",
    "assignee": "Modelop, Inc.",
    "publication_date": "2023-01-03",
    "patent_link": "https://patents.google.com/patent/US11544099B2/en",
    "inventors": [
        "Stuart Bailey",
        "Matthew Mahowald",
        "Maksym Kharchenko"
    ],
    "classifications": [
        "G06F9/45558",
        "G06F8/31",
        "G06F8/51",
        "G06F8/60",
        "G06F9/455",
        "G06F9/45504",
        "G06F9/5077",
        "G06N20/20",
        "G06N5/01",
        "G06F8/30",
        "G06N20/00",
        "G06N5/003",
        "G06Q10/067"
    ],
    "abstract": "At an interface an analytic model for processing data is received. The analytic model is inspected to determine a language, an action, an input type, and an output type. A virtualized execution environment is generated for an analytic engine that includes executable code to implement the analytic model for processing an input data stream.",
    "claims": "\n1. A system, comprising:\nan interface;\na processor configured to:\nreceive, at the interface, an analytic model for processing; an input data stream;\ninspect the analytic model to determine a programming language of the analytic model, an action to be performed on the input data stream, a type of the input data stream, and a type of an output data stream;\ngenerate a virtualized execution environment (VEE), the VEE including executable code to implement the analytic model, the implemented analytic model for processing the input data stream;\nadd, at runtime of the VEE, a sensor to instrument the implemented analytic model, wherein the sensor is configured to instrument the VEE for an analytic engine, wherein the sensor provides metrics for debugging a performance of the analytic model;\ndebug the performance of the analytic model until the analytic engine is optimized and at least one bug is eradicated from the analytic model; and\nremove the sensor via the interface after a determination that the sensor is no longer required for the debugging; and\na memory coupled to the processor and configured to provide the processor with instructions.\n2. The system recited in claim 1, wherein the analytic model is implemented using a container to provide the VEE for the analytic engine.\n3. The system recited in claim 2, wherein the container is a portable and independently executable microservice.\n4. The system recited in claim 1, wherein the analytic model includes an input configuration schema that specifies the type of the input data stream, an output configuration schema that specifies the type of the output data stream, and an I/O descriptor abstraction that specifies abstracts the input data stream type.\n5. The system recited in claim 1, wherein the VEE includes a plurality of runtime engines that each supports a distinct analytic model programming language.\n6. The system recited in claim 4, wherein the processor is further configured to:\nbind the analytic model and the I/O descriptor abstraction;\nreceive the input data stream at a stream processor;\nprocess the input data stream using the executable code that implements the analytic model, wherein the stream processor enforces the type of the input data stream; and\ngenerate the output data stream using the stream processor based on the type of the output data stream, wherein the output data stream includes a score and/or a metric.\n7. The system recited in claim 1, wherein the interface for receiving the analytic model includes an Application Programming Interface (API), a Command Line Interface (CLI), and/or a dashboard interface.\n8. The system recited in claim 5, wherein the analytic model is coded in a first programming language, and wherein the processor is further configured to:\ntranslate the first programming language to a first analytic model programming language; and\nroute the executable code to one of the plurality of runtime engines based on the first analytic model programming language.\n9. A method, comprising:\nreceiving at an interface an analytic model for processing an input data stream;\ninspecting the analytic model to determine a programming language of the analytic model, an action to be performed on the input data stream, a type of the input data stream, and a type of an output data stream;\ngenerating a virtualized execution environment (VEE), the VEE including executable code to implement the analytic model, the implemented analytic model for processing the input data stream;\nadding, at runtime of the VEE, a sensor to the implemented analytic model, the sensor to instrument the VEE for an analytic engine, wherein the sensor provides metrics for debugging a performance of the analytic model;\ndebugging the performance of the analytic model until the analytic engine is optimized and at least one bug is eradicated from the analytic model; and\nremoving the sensor via the interface after determining that the sensor is no longer required for the debugging.\n10. The method of claim 9, wherein the analytic model is implemented using a container to provide the VEE for the analytic engine.\n11. The method of claim 10, wherein the container is a portable and independently executable microservice.\n12. The method of claim 9, wherein the analytic model includes an input configuration schema that specifies the type of the input data stream, an output configuration schema that specifies the type of the output data stream, and an I/O descriptor abstraction that abstracts the input data stream type.\n13. The method of claim 9, wherein the VEE for the analytic engine includes a plurality of runtime engines that each supports a distinct analytic model language.\n14. A computer program product, the computer program product being embodied in a tangible non-transitory computer readable storage medium and comprising computer instructions for:\nreceiving at an interface an analytic model for processing an input data stream;\ninspecting the analytic model to determine a programming language of the analytic model, an action to be performed on the input data stream, a type of the input data stream, and a type of an output data stream;\ngenerating a virtualized execution environment (VEE), the VEE including executable code to implement the analytic model, the implemented analytic model for processing the input data stream;\nadding, at runtime of the VEE, a sensor to the implemented analytic model, the sensor to instrument the VEE for an analytic engine, wherein the sensor provides metrics for debugging a performance of the analytic model;\ndebugging the performance of the analytic model until the analytic engine is optimized and at least one bug is eradicated from the analytic model; and\nremoving the sensor via the interface after determining that the sensor is no longer required for the debugging.\n15. The computer program product recited in claim 14, wherein the analytic model is implemented using a container to provide the VEE for the analytic engine.\n16. The computer program product recited in claim 15, wherein the container is a portable and independently executable microservice.\n17. The computer program product recited in claim 14, wherein the analytic model includes an input configuration schema that specifies the type of the input data stream, an output configuration schema that specifies the type of the output data stream, and an I/O descriptor abstraction that abstracts the input data stream type.\n18. The computer program product recited in claim 14, wherein the VEE for the analytic engine includes a plurality of runtime engines that each supports a distinct analytic model language.",
    "status": "Active",
    "citations_own": [
        "US20020062475A1",
        "US20030163603A1",
        "US20090025009A1",
        "US20100332968A1",
        "US20110307871A1",
        "US20120257255A1",
        "US20120304172A1",
        "US20130007720A1",
        "US20130152080A1",
        "US20130317803A1",
        "US20140236564A1",
        "US20140278337A1",
        "US8910124B1",
        "US20140372167A1",
        "US20150082284A1",
        "US20160048388A1",
        "US20160182315A1",
        "US20160196204A1",
        "US9400889B2",
        "US20160292598A1",
        "US20170006135A1",
        "US20170034016A1",
        "WO2017025203A1",
        "US20170104780A1",
        "US20170111236A1",
        "US9667725B1",
        "US20180027080A1",
        "US20180121221A1",
        "US20180157517A1"
    ],
    "citations_ftf": [
        "JP2002007201A",
        "US9798788B1",
        "US9098821B2",
        "SG11201703164RA",
        "US20160292591A1",
        "CN204946606U",
        "US10438132B2",
        "US20180189743A1",
        "US10360193B2",
        "US11276011B2"
    ],
    "citedby_own": [
        "US20230229400A1"
    ],
    "citedby_ftf": [
        "US10002163B2",
        "US10891114B2",
        "US11151465B2",
        "US11334806B2",
        "US10684868B2",
        "US11169898B2",
        "US10838833B1",
        "US11334589B2",
        "US11699116B2",
        "US11010150B2",
        "US11487941B2",
        "US20190361697A1",
        "US11321139B2",
        "US11269820B1",
        "US11474978B2",
        "US10460235B1",
        "US10809987B2",
        "US11321397B2",
        "US10853180B2",
        "US10936444B2",
        "US11436248B2",
        "US11797550B2",
        "CN109947429B",
        "US10942723B2",
        "US11113249B2",
        "US11232078B2",
        "US10809994B1",
        "US10956140B2",
        "US11113095B2",
        "US20200364606A1",
        "US11269596B2",
        "US11245600B2",
        "US11720826B2",
        "US20210036935A1",
        "CN110620727B",
        "EP3816879A1",
        "CN111045901A",
        "US11042361B1",
        "CN111092947B",
        "CN111209084B",
        "US20210256000A1",
        "US10901817B1",
        "CN111400000B",
        "CN111209091B",
        "US11487555B2",
        "CN111740926B",
        "US11321351B2",
        "CN112181644B",
        "CN112230911A",
        "CN111880821A",
        "CN112379867B",
        "US11392487B2",
        "CN112532450B",
        "CN112346737B",
        "WO2022178458A1",
        "US20220334857A1",
        "US20230056965A1",
        "US20230086750A1",
        "US11558254B1",
        "CN115065171B"
    ]
}