{
    "patent_link": "https://patents.google.com/patent/US5297032A/en",
    "patent_id": "US5297032A",
    "title": "Securities trading workstation",
    "abstract": "A work station for use by a trader of securities on an established market. The work station is integrated into a network of competing market makers for a plurality of securities for trading. A centralized database provides a feed of data on current market events for the securities, including price and transaction data. The work station is specifically programmed to receive the feed of data from the database and convert this datastream into a form conducive to enhanced trading. Seven separate applications permit the trader to track the market, select securities, bid and ask pricing, market direction and market depth. Traders equipped with the workstation are capable of entering transactions with more complete and copious knowledge about the extant market.",
    "inventors": [
        "Donald R. Trojan",
        "Edward F. Keenan, III",
        "Henry Hyatt"
    ],
    "assignee": "Bank of America Corp",
    "classifications": [],
    "claims": "\n1. In combination in a system for controlling the operation of a trader work station as integrated in a network for the trading of financial instruments wherein a database is configured to deliver an on-line datastream to a plurality of traders said system comprising:\ndata communication means for managing the transfer of on-line data from said database to the work station and the transfer of trader selected transactions to said database;\ndata compilation means for providing select records to a plurality of separate window interface applications;\nmarket maker application means for displaying a select security and associated market makers with current price quote information, and further permitting the entry of a transaction order by the trader for transmission to the database; and\ntrader book application means for displaying a select group of securities associated with an individual trader wherein said group of securities include current data on an inside market, depth of said inside market, and direction of said inside market for each security in said group.\n2. The system of claim 1 wherein said market maker application means includes high and low price trades, trading volume, inside market quotes and transaction limits.\n3. The system of claim 2 wherein said trader book application means includes means to display a bid side of the market in expanded format.\n4. The system of claim 3 wherein said trader book application means includes highlighting of a security in said group of securities upon a receipt of a change of an inside market for the respective security from said database.\n5. A data processing system for controlling a trader workstation with display means wherein said workstation is in communication with a remote database having stored securities related transactional data, said workstation comprising:\nticker means for receiving an incoming datastream from said remote database and displaying in real time on said display means current bid and ask price quote data for individual securities and market makers;\nlevel 2/3 means for tracking and displaying a bid and ask side of a market for a select security and a listing of current market makers for said select security; and\ncomposite means for tracking and displaying a depth of market and direction of market for a plurality of individual securities.\n6. The system of claim 5 wherein said workstation display means includes plural windows for trader interface with stored application programs.\n7. The system of claim 6 further comprising a configuration file means for controlling data display on said display means.\n8. The system of claim 7 further comprising a communications linkage means for managing the transfer of message queues between said remote database and said workstation.",
    "status": "Expired - Lifetime",
    "citations_own": [],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": []
}