{
    "patent_id": "US-2013018828-A1",
    "title": "System and method for automated labeling of text documents using ontologies ",
    "assignee": "International Business Machines Corporation",
    "publication_date": "2013-01-17",
    "patent_link": "https://patents.google.com/patent/US20130018828A1/en",
    "inventors": [
        "Jingrui He",
        "Richard D. Lawrence",
        "Prem Melville",
        "Vikas Sindhwani",
        "Vijil E. Chenthamarakshan"
    ],
    "classifications": [
        "G06N5/022",
        "G06F16/353",
        "G06F16/367"
    ],
    "abstract": "A first mapping function automatically maps a plurality of documents each with a concept of ontology to create a documents-to-ontology distribution. An ontology-to-class distribution that maps concepts in the ontology to class labels, respectively, is received, and a classifier is generated that labels a selected document with an associated class identified based on the documents-to-ontology distribution and the ontology-to-class distribution.",
    "claims": "\n1. A system for automated labeling of documents using ontology, comprising:\na first mapping function for automatically mapping a plurality of documents each with a concept of an ontology to create a documents-to-ontology distribution;\na second mapping function that maps concepts in the ontology to class labels and creates an ontology-to-class distribution;\na classifier that labels a selected document with an associated class label automatically, based on the documents-to-ontology distribution and the ontology-to-class distribution; and\na processor operable to execute the first mapping function.\n2. The system of claim 1, wherein the second mapping function is provided by a user.\n3. The system of claim 1, further including training the classifier based on the automatically labeled document.\n4. A computer readable storage medium storing a program of instructions executable by a machine to perform a method of automated labeling of documents using ontology, comprising:\nmapping automatically, by a processor, a document with a concept in an ontology;\nreceiving an ontology concepts-to-class label mapping; and\nlabeling the document with a class label automatically, by identifying a class associated with the concept in the ontology, based on the ontology concepts-to-class label mapping.\n5. The computer readable storage medium of claim 4, wherein the ontology concepts-to-class label mapping is performed under manual supervision.\n6. The computer readable storage medium of claim 4, wherein the mapping is performed autonomously without manual supervision.\n7. The computer readable storage medium of claim 4, wherein the mapping step includes a mapping function extracting one or more keywords in the document and associating said one or more keywords to one or more concepts in the ontology.\n8. The computer readable storage medium of claim 7, further including the mapping function mapping the document to an ontology concept based on said association of said one or more keywords to said one or more concepts in the ontology, wherein the ontology concept associated with most of the keywords in the document is selected as the concept to map to the document."
}