{
    "patent_link": "https://patents.google.com/patent/US20040205461A1/en",
    "patent_id": "US20040205461A1",
    "title": "System and method for hierarchical segmentation with latent semantic indexing in scale space",
    "abstract": "A system and method for automatically generating a hierarchical table of contents or outline for indexing a document and identifying clusters of related information in the document. The document may comprise text, audio, video, or a multimedia presentation. The invention employs a unique and novel combination of latent semantic indexing techniques to identify related blocks and major topic changes within the document with scale space segmentation techniques to respectively identify self-similar blocks within the document and to thus find topic changes of various sizes at block edges. The invention then produces a visual presentation of the semantic structure of the document.",
    "inventors": [
        "James Kaufman",
        "Dulce Ponceleon",
        "Malcolm Slaney"
    ],
    "assignee": "International Business Machines Corp",
    "classifications": [],
    "claims": "\n1. A method for generating a table of contents for a document using only information in said document, comprising the steps of:\nbuilding a model of said document including an initial semantic structure;\ndetecting changes in said semantic structure spanning different scales; and\nordering said changes into entries in said table of contents based on scale span.\n2. The method of claim 1 wherein said table of contents is a hierarchical sequential description of topic changes in said document.\n3. The method of claim 1 wherein said document includes at least one of the following: a text file, an audio file, a video file, a multimedia presentation.\n4. The method of claim 3 wherein said audio file includes music.\n5. The method of claim 3 wherein said audio file includes speech.\n6. The method of claim 3 wherein said text file is an audio transcript.\n7. The method of claim 3 wherein frames in said video file are modeled by a number representing color intensity data.\n8. The method of claim 3 wherein said model combines audio data and video data into a single unified document representation.\n9. The method of claim 8 wherein said video data is scaled to have similar influence in said model as said audio data.\n10. The method of claim 1 wherein said building step comprises the further steps of:\ndefining a vector of terms occurring in said document; and\nmapping said document into a vector space by projecting scaled term occurrence histogram data onto said vector of terms.\n11. The method of claim 10 wherein said terms include at least one of: words, phrases, sentences, paragraphs, shots in video data.\n12. The method of claim 11 wherein said terms are locally and globally weighted.\n13. The method of claim 12 wherein said local weighting includes the log of term frequency plus one, and said global weighting includes term frequency entropy weighting.\n14. The method of claim 10 wherein said mapping step includes the further step of summarizing said terms using singular-value decomposition.\n15. The method of claim 1 wherein said detecting step comprises the further steps of:\napplying successively smaller scale filter windows to said model according to said initial semantic structure to construct a map of said changes versus scale;\nidentifying local peaks in said contour map, said peaks being points of maximum vector derivative magnitude;\ntracing said local peaks back to a semantic structure change origin point; and\nmeasuring a span of scales over which each said change exists.\n16. The method of claim 15 wherein said filter windows are Gaussian.\n17. A system for generating a table of contents for a document using only information in said document, comprising:\nmeans for building a model of said document including an initial semantic structure;\nmeans for detecting changes in said semantic structure spanning different scales; and\nmeans for ordering said changes into entries in said table of contents based on scale span.\n18. A computer program product comprising a machine-readable medium having computer-executable program instructions thereon for generating a table of contents for a document using only information in said document, including:\na first code means for building a model of said document including an initial semantic structure;\na second code means for detecting changes in said semantic structure spanning different scales; and\na third code means for ordering said changes into entries in said table of contents based on scale span.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4850022A",
        "US4995011A",
        "US5113367A",
        "US5355161A",
        "US5428774A",
        "US5455806A",
        "US5550965A",
        "US5557297A",
        "US5956026A",
        "US5996415A",
        "US6137544A",
        "US6161084A",
        "US6175829B1"
    ],
    "citations_ftf": [
        "US4658372A",
        "US4839853A",
        "US5301109A",
        "US5544352A",
        "US5963205A",
        "US5799276A",
        "US6070133A"
    ],
    "citedby_own": [
        "US20030112268A1",
        "US20040133574A1",
        "US20060149742A1",
        "WO2006074053A1",
        "US20060155703A1",
        "US20070198912A1",
        "US20070196015A1",
        "US20080066136A1",
        "US20080065671A1",
        "WO2008069791A1",
        "US20090110268A1",
        "US20090157714A1",
        "US20090164217A1",
        "US7702618B1",
        "US20100205142A1",
        "WO2011035389A1",
        "US20110087701A1",
        "US7987195B1",
        "US20120197908A1",
        "US8302002B2",
        "WO2012174639A1",
        "US20130174030A1",
        "US20140122984A1",
        "CN104765723A",
        "US20150370453A1",
        "US20160179755A1",
        "US20160371312A1",
        "US20180097659A1",
        "CN109902289A",
        "US20200111023A1",
        "US11188509B2",
        "US11434743B2",
        "US11725494B2"
    ],
    "citedby_ftf": [
        "US6154757A",
        "US20070156665A1",
        "KR100612840B1",
        "US7711679B2",
        "US7580921B2",
        "US7567959B2",
        "US7676495B2",
        "US7844566B2",
        "US20060242098A1",
        "US20080215614A1",
        "US8359190B2",
        "US7559017B2",
        "US7925655B1",
        "US8166021B1",
        "US8086594B1",
        "US8166045B1",
        "US7702614B1",
        "US7693813B1",
        "US8117223B2",
        "US8250469B2",
        "US8392816B2",
        "US20090144277A1",
        "US8181197B2",
        "US8112702B2",
        "JP5341388B2",
        "US8566353B2",
        "US20100131569A1",
        "US8826117B1",
        "US8132200B1",
        "US8577887B2",
        "US8731261B2",
        "US9501506B1",
        "US9483568B1",
        "US10140379B2"
    ]
}