{
    "patent_link": "https://patents.google.com/patent/US20030069908A1/en",
    "patent_id": "US20030069908A1",
    "title": "Software composition using graph types,graph, and agents",
    "abstract": "An environment for composing software permits the separation of control functions from information about the context in which the control functions operate. The software composition environment is used to make a system which will translate XML documents into models and vice-versa. The translation system is used to translate an XML document having one DTD into an XML document having another DTD by translating the first XML document into a model representing the semantics of the XML document and translating the model into the second XML document (2005). The system for translating XML documents into models employs a general technique for translating any XML documents into a mirror model (2107) that reflects the structure of the XML document and a general technique of using tag pattern models (2109) to obtain information from one model and using it to make or modify another model. In the system for translating XML document, the tag pattern models are used to translate mirror models into semantic models and vice-versa.",
    "inventors": [
        "Jon Anthony",
        "Dean Allemang"
    ],
    "assignee": "Synquiry Technologies Ltd",
    "classifications": [
        "G06F16/258",
        "G06F40/143",
        "G06F40/154",
        "Y10S707/99936",
        "Y10S707/99943",
        "Y10S707/99945"
    ],
    "claims": "\n1. Apparatus for controlling a processor that has access to a storage device,\nthe apparatus comprising:\na model type in the storage device that defines a class of models, a model being a graph that has one or more entities as vertices;\nan agent in the storage device that is associated with the model type and specifies an operation to be performed in a context provided by a model of the class defined by the model type; and\na particular model of the model type in the storage device to which the agent has been made available,\nthe processor responding to the agent by performing the operation specified thereby in the context provided by the particular model.\n2. The apparatus for controlling a processor set forth in claim 1 further comprising:\na set of one or more definitions of events in the storage device, the agent being further associated with a definition of an event and the processor responding to the event defined in the definition by performing the operation specified by the agent in the context of the particular model.\n3. The apparatus for controlling a processor set forth in claim 2 wherein:\nthe set of definitions of events is a model.\n4. The apparatus for controlling a processor set forth in claim 1 wherein:\nthere is a plurality of the particular models; and\nthe agent is available to more than one of the particular models.\n5. The apparatus for controlling a processor set forth in claim 1 wherein:\nthere is a plurality of the particular models; and\na given vertex belongs to more than one of the particular models.\n6. The apparatus for controlling a processor set forth in claim 1 wherein:\nthere is a plurality of the model types; and\nthe agent is associated with more than one of the model types.\n7. The apparatus for controlling a processor set forth in claim 1 wherein:\nthe agent is made available to the particular model when the agent is an entity in the particular model.\n8. The apparatus for controlling a processor set forth in any one of claims 1 through 7 wherein:\nthe model type defines a facet type that specifies a type of relationship to a vertex of a model of the type; and\nthe particular model has a facet of the facet type; and\nthe processor manipulates the particular model as specified by the facet type definition for the facet.\n9. The apparatus for controlling a processor set forth in claim 8 wherein:\nthere is a plurality of the facet types defined in the model type.\n10. The apparatus for controlling a processor set forth in claim 9 wherein:\nthere is a plurality of vertices in the particular model, ones of the plurality of vertices being related to others thereof by facets having types belonging to the plurality of types\n11. The apparatus for controlling a processor set forth in claim 10 wherein:\na given vertex has a plurality of facets of different facet types.\n12. The apparatus for controlling a processor set forth in claim 8 wherein:\nthe facet type definition specifies a set-theoretic character of the relationship.\n13. The apparatus for controlling a processor set forth in claim 8 wherein:\nthe facet type definition specifies a constraint on the facet.\n14. The apparatus for controlling a processor set forth in claim 8 wherein:\nthe facet type definition specifies a propagator on the facet.\n15. The apparatus for controlling a processor set forth in any one of claims 1 through 7 wherein:\nthere is a plurality of the vertices;\nthe vertices of a first subset of the vertices are instance vertices representing things; and\nthe vertices of a second subset of the vertices are vertices representing abstractions concerning the things represented by the first subset of the vertices.\n16. The apparatus for controlling a processor set forth in claim 15 wherein:\nan instance vertex may represent an instance of an abstraction represented by a vertex of the second subset.\n17. The apparatus for controlling a processor set forth in claim 15 wherein:\nan instance vertex may exhibit a property represented by a vertex of the second subset.\n18. The apparatus for controlling a processor set forth in claim 15 wherein:\nthere is a plurality of the particular models; and\na vertex in the first subset represents another particular model.\n19. The apparatus for controlling a processor set forth in claim 15 wherein the apparatus further comprises:\nthings represented by the instance vertices in the storage device; and\na thing represented by an instance vertex is locatable from the instance vertex.\n20. Apparatus employed in a system having a processor and storage accessible thereto for using information contained in a first graph stored in the storage to make or modify a second graph stored in the storage, both graphs having vertices containing information that are joined by edges specifying relationships between the vertices, the apparatus comprising:\na third graph stored in the storage, the third graph including\na pattern part that specifies a pattern of vertices and/or edges in the first graph and\na synthesis part that specifies a modification of the second graph; and\ncode stored in the storage and executable by the processor that matches the pattern part to vertices and/or edges having the pattern in the first graph and uses information from the matched vertices and/or edges in the first graph as specified in the synthesis part to make or modify the second graph.\n21. The apparatus set forth in claim 20 wherein:\nthe first graph and the second graph have types; and\nthe third graph is associated with the types of the first and second graphs.\n22. The apparatus set forth in claim 20 or claim 21 wherein:\nthere is a plurality of the third graphs; and\nthe code matches the third graphs to the first graph in a predetermined order.\n23. The apparatus set forth in claim 22 wherein:\nthe predetermined order is associated with the types of the first and second graphs.\n24. The apparatus set forth in claim 20 or claim 21 wherein:\nthere is a plurality of predefined ones of the third graphs; and\na user of the apparatus selects a set of the third graphs from the predefined ones and determines an order in which the third graphs in the set are matched to the first graph.\n25. The apparatus set forth in claim 24 wherein:\nthe user further associates the selected and ordered set of the third graphs with the types of the first and second graphs\n26. The apparatus set forth in claim 24 further comprising:\na graphical user interface for selecting the set of third graphs and determining the order.\n27. The apparatus set forth in claim 20 further comprising:\na graphical user interface for specifying a pattern part in the third graph by selecting one or more vertices in the first graph.\n28. The apparatus set forth in claim 27 wherein:\nthe graphical user interface further specifies the pattern part by specifying a class of edge in the first graph..\n29. The apparatus set forth in claim 28 wherein:\nthe first graph is hierarchical; and\nwhen the graphical user interface selects a plurality of the vertices, the pattern part in the third graph includes vertices corresponding to the vertices in the smallest subtree with regard to the selected class of edge in the first graph that contains the selected vertices.\n30. The apparatus set forth in claim 20 wherein:\na vertex of a pattern part matches a class of vertex in the first graph and an edge of a pattern part matches a class of edge in the first graph.\n31. The apparatus set forth in claim 30 wherein:\nan annotation in the vertex of the pattern part specifies the class of vertex or the class of edge.\n32. The apparatus set forth in claim 20 wherein:\nthe synthesis part includes a vertex that that specifies a class of vertex or a class of edge that is to be made or modified in the second graph.\n33. The apparatus set forth in claim 32 wherein:\nan annotation in the vertex specifies the class of vertex or class of edge.\n34. The apparatus set forth in claim 32 wherein:\nthe synthesis part further includes a vertex that combines information from a plurality of vertices in the third graph for use in a further vertex of the synthesis part.\n35. The apparatus set forth in claim 32 wherein:\nan edge in the synthesis part together with an annotation in a vertex of the synthesis part specifies a portion of a flow of the information via the third graph from the matched vertices of the first graph to the edges and/or vertices being made or modified in the second graph.\n36. Apparatus employed in a system having a processor and storage accessible thereto for producing a graph having a plurality of vertices and edges in the storage, the apparatus comprising:\na linear representation of a plurality of nested entities in the storage; and\ncode stored in the storage and executable by the processor that makes the graph in response to the linear representation, the graph having vertices representing the entities and edges representing the nesting.\n37. The apparatus set forth in claim 36 wherein:\nthe entities in the linear representation have content; and\nthe code associates content from the entity with the vertex corresponding to the entity.\n38. The apparatus set forth in either of claims 36 or 37 wherein:\nthe linear representation is an XML document and the entities are XML constructs.\n39. Apparatus employed in a system having a processor and storage accessible thereto for producing a linear representation in the storage, the linear representation having a plurality of nested entities and the apparatus comprising:\na graph in the storage, the graph having vertices connected by edges indicating an enclosure relationship; and\ncode stored in the storage and executable by the processor that makes the linear representation in response to the graph, entities in the linear representation corresponding to vertices in the graph and the entities being nested in the linear representation as indicated by the edges of the graph.\n40. The apparatus set forth in claim 39 wherein:\nthe vertices in the graph are associated with content; and\nan entity in the linear representation corresponding to a vertex contains the content associated with the vertex.\n41. The apparatus set forth in either of claims 39 or 40 wherein:\nthe linear representation is an XML document and the entities are XML constructs.\n42. Apparatus employed in a system having a processor and storage accessible thereto for translating a XML document having a first DTD into another XML document having a second DTD, the apparatus comprising:\na first translator that executes on the processor and translates any XML document having the first DTD into a semantic representation in the storage of information from the translated XML document; and\na second translator that executes on the processor and translates the semantic representation into the other XML document.\n43. The apparatus set forth in claim 42 wherein:\nthe semantic representation is a first graph of a type having vertices and edges that are capable of representing information from any XML document having the first or second DTD.\n44. The apparatus set forth in claim 43 further comprising:\na transform component that makes or modifies a target graph using information in a source graph as specified in a tag pattern graph that matches patterns of vertices and edges in the source graph and uses information contained in the matched vertices and edges to make and/or modify vertices and/or edges in the target graph,\nthe first translator using the transform component in translating from XML to the first graph and the second translator using the transform component in translating from the first graph to XML.\n45. The apparatus set forth in claim 44 wherein:\nthe first translator comprises an import component that translates any XML document into a graph in the storage of a mirror type whose edges describe nesting in the XML document and whose vertices contain the information from the XML document;\nthe second translator comprises an export component that translates any graph in the storage of the mirror type into an XML document;\nthe first translator makes and/or modifies the first graph using the transform component with a first tag pattern graph and a first mirror graph made by the import component from the XML document as a source graph and the first graph as a destination graph; and\nthe second translator makes and/or modifies a second graph of the mirror type using the transform component with a second tag pattern graph and the first graph as a source graph and the second graph of the mirror type as a destination graph and makes the other XML document using the export component.\n46. Apparatus employed in a system having a processor and storage accessible thereto that translates an XML document in the storage that has a particular DTD into a first graph in the storage whose vertices and/or edges represent information from the XML document, the apparatus comprising:\nan import component that translates any XML document into a graph in the storage of a mirror type whose edges describe nesting in the XML document and whose vertices contain information from the XML document; and\na transform component that makes or modifies a target graph using information in a source graph as specified in a tag pattern graph that matches patterns of vertices and edges in the source graph and uses information contained in the matched vertices and edges to make and/or modify vertices and/or edges in the target graph,\nthe import component translating the XML document into a second graph and the transform graph using a tag pattern graph for the particular DTD with the second graph as a source graph to make and/or modify the first graph.\n47. The apparatus set forth in claim 46 wherein:\nthe tag pattern graph includes\na pattern part that specifies a pattern to be matched and\na synthesis part that specifies how the information contained in the matched vertices and/or edges is to be used to make and or modify vertices and/or edges in the target graph,\nthe transform component making and/or modifying the target graph as specified by the synthesis part.\n48. Apparatus employed in a system having a processor and storage accessible thereto that translates a first graph in the storage whose vertices and edges represent information into an XML document that contains the information and has a particular DTD, the apparatus comprising:\na transform component that makes or modifies a target graph using information in a source graph as specified in a tag pattern graph that matches patterns of vertices and edges in the source graph and uses information contained in the matched vertices and edges to make and/or modify vertices and/or edges in the target graph; and\nan export component that translates a graph in the storage of a mirror type whose edges describe nesting in an XML document and whose vertices contain information to be contained in the XML document into the XML document,\nthe transform component using a tag pattern graph for the particular DTD with the first graph as a source graph and a second graph of the mirror type as a destination graph and the export component translating the second graph into the XML document.\n49. The apparatus set forth in claim 48 wherein:\nthe tag pattern graph includes\na pattern part that specifies a pattern to be matched and\na synthesis part that specifies how the information contained in the matched\nvertices and/or edges is to be used to make and or modify vertices and/or edges in the target graph,\nthe transform component making and/or modifying the target graph as specified by the synthesis part.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US5444837A",
        "US5506985A",
        "US5727158A",
        "US5732192A",
        "US5802529A",
        "US5887171A",
        "US6009436A",
        "US6038573A",
        "US6041331A",
        "US6125351A",
        "US6154738A",
        "US6191787B1",
        "US6476814B1",
        "US6556983B1",
        "US6574655B1",
        "US6662355B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20020007405A1",
        "US20020059265A1",
        "US20030014439A1",
        "US20030093756A1",
        "US20030149934A1",
        "US20030177341A1",
        "US20030204503A1",
        "US20030225474A1",
        "US20040189695A1",
        "US20040193594A1",
        "US20040189707A1",
        "US20040194110A1",
        "US20040189694A1",
        "US20040193673A1",
        "US20040205507A1",
        "US20040207666A1",
        "US20040230599A1",
        "US20040236758A1",
        "US20050004910A1",
        "US20050043940A1",
        "US20050091235A1",
        "US20050138057A1",
        "US20050188174A1",
        "US20050240878A1",
        "US20050240880A1",
        "US20050246643A1",
        "US20050283742A1",
        "US20050289138A1",
        "US20060004790A1",
        "US20060004739A1",
        "US20060020899A1",
        "US20060023617A1",
        "US20060117067A1",
        "US20060224371A1",
        "US20060236244A1",
        "US20060242121A1",
        "US20060242591A1",
        "US20060242604A1",
        "US20060242164A1",
        "US20060242585A1",
        "US20070016872A1",
        "US20070050358A1",
        "US7188316B2",
        "US20070064603A1",
        "US20070192350A1",
        "US20070277094A1",
        "US20080098349A1",
        "US20080133213A1",
        "US20080155517A1",
        "US20080168061A1",
        "US20080263104A1",
        "US20080275582A1",
        "US7543270B1",
        "US7650575B2",
        "US20100036789A1",
        "US20100125783A1",
        "US20100138448A1",
        "US20100169299A1",
        "US20100192057A1",
        "US7769794B2",
        "US7925682B2",
        "US20110113385A1",
        "US20110314382A1",
        "US8108430B2",
        "US8126826B2",
        "US20120072257A1",
        "US20120078974A1",
        "US8156147B1",
        "US20120159304A1",
        "US8490015B2",
        "US20130297631A1",
        "US20140047319A1",
        "US8707209B2",
        "US8972342B2",
        "US9009179B2",
        "US20160048499A1",
        "US9785678B1",
        "US20180011887A1",
        "US9898449B1",
        "US20180225259A1",
        "US10169325B2",
        "US10175955B2",
        "US20200169270A1",
        "US11301506B2",
        "US11507629B2",
        "US11657044B2"
    ],
    "citedby_ftf": [
        "US20030212954A1",
        "US20030131144A1",
        "WO2005111850A2",
        "EP1625513B1",
        "US7912863B1",
        "US7774376B1",
        "US20060195411A1",
        "US9378203B2",
        "US10002325B2",
        "US9104779B2",
        "US7849090B2",
        "US7606781B2",
        "US9177248B2",
        "US8849860B2",
        "US7636702B2",
        "US9214001B2",
        "US9558184B1",
        "US20090058847A1",
        "US8676732B2",
        "US9361365B2",
        "WO2009132442A1",
        "US8959200B2",
        "US8463053B1",
        "JP5538393B2",
        "US9292855B2",
        "US8473905B1",
        "US9262520B2",
        "US9235806B2",
        "US10474647B2",
        "US11294977B2",
        "US8572101B2",
        "US20120324367A1",
        "US8677300B2",
        "TWI745623B"
    ]
}