{
    "patent_id": "US-11054913-B2",
    "title": "Hidden markov model-based gesture recognition with FMCW radar ",
    "assignee": "Texas Instruments Incorporated",
    "publication_date": "2021-07-06",
    "patent_link": "https://patents.google.com/patent/US11054913B2/en",
    "inventors": [
        "Gregory Jan Malysa",
        "Murtaza Ali",
        "Dan Wang",
        "Lorin Paul Netsch"
    ],
    "classifications": [
        "G06F3/017",
        "G01S13/34",
        "G01S13/584",
        "G01S7/415",
        "G06F18/295",
        "G06F3/01",
        "G06F3/03",
        "G06F3/0487",
        "G06K9/00335",
        "G06K9/6297",
        "G06V40/20",
        "G01S2007/356",
        "G01S7/356",
        "G06F2218/12",
        "G06N7/005",
        "G06N7/01"
    ],
    "abstract": "A system includes a frequency modulated continuous wave (FMCW) transceiver, a processor, and a memory. The memory stores program instructions that, when executed by the processor, cause the system to receive a signal representative of an FMCW signal reflected from an object of interest, apply a first Fourier transform to the signal to obtain range data, identify a subset of the range data corresponding to a region of interest, apply a second Fourier transform on the identified subset of the range data to obtain velocity data corresponding to the identified subset of the range data, and identify a gesture performed by the object of interest based on at least a portion of velocity data.",
    "claims": "\n1. A system comprising:\na frequency modulated continuous wave (FMCW) transceiver;\na processor; and\nmemory to store program instructions that, when executed by the processor, cause the system to:\nreceive a signal representative of an FMCW signal reflected from an object of interest;\napply a first Fourier transform to the signal to obtain range data;\nidentify a subset of the range data corresponding to a region of interest;\napply a second Fourier transform on the identified subset of the range data to obtain velocity data corresponding to the identified subset of the range data;\ndetermine a velocity-energy vector by integrating a squared magnitude of each of a plurality of velocity data points from the velocity data with respect to range; and\nidentify a gesture performed by the object of interest based at least partially on the velocity-energy vector.\n2. The system of claim 1, wherein the program instructions, when executed by the processor, cause the system to cause the FMCW transceiver to transmit the FMCW signal toward the object of interest.\n3. The system of claim 1, wherein the program instructions, when executed by the processor, cause the system to identify a subset of the velocity data that corresponds to velocities of interest, and wherein the plurality of velocity data points from the velocity data are part the identified subset of the velocity data.\n4. The system of claim 1, wherein identifying the gesture performed by the object of interest based at least partially on the velocity-energy vector includes using one or more hidden Markov models.\n5. The system of claim 1, wherein identifying the gesture performed by the object of interest includes using a Gaussian parameterization of the velocity-energy vector.\n6. The system of claim 5, wherein the velocity-energy vector includes a first number of feature points and the Gaussian parameterization of the velocity energy vector includes a second number of feature points, the second number being less than the first number.\n7. The system of claim 3, wherein the velocities of interest include a velocity range between −1 meters/second and +1 meters/second.\n8. The system of claim 1, wherein the identified subset of the range data is identified by gating the range data based on the region of interest.\n9. The system of claim 8, wherein the region of interest is a distance range between 0.7 and 1.4 meters.\n10. The system of claim 1, wherein the FMCW transceiver operates at a frequency of between 76 and 80 gigahertz (GHz).\n11. The system of claim 1, wherein the received signal includes a plurality of frames, each frame having a predetermined number of chirps.\n12. The system of claim 1, wherein the first and second Fourier transforms are fast Fourier transforms (FFTs).\n13. The system of claim 1, wherein the program instructions cause the processor to determine an velocity-energy vector by integrating with respect to range a squared magnitude of each of a plurality of velocity data points from the subset of the velocity data that corresponds to the velocities of interest, and wherein the identification of the gesture is based on the velocity-energy vector.\n14. A system comprising:\na frequency modulated continuous wave (FMCW) transceiver;\na processor; and\nmemory to store program instructions that, when executed by the processor, cause the system to:\nreceive a signal representative of an FMCW signal reflected from an object of interest;\napply a first Fourier transform to the signal to obtain range data;\nidentify a subset of the range data corresponding to a region of interest;\napply a second Fourier transform on the identified subset of the range data to obtain velocity data corresponding to the identified subset of the range data;\nidentify a subset of the velocity data that corresponds to velocities of interest, wherein the velocities of interest is from −1 meters/second and +1 meters/second; and\nidentify a gesture performed by the object of interest based on at least a portion of the subset of the velocity data.",
    "status": "Active",
    "citations_own": [
        "US6011507A",
        "US20080106460A1",
        "US7492303B1",
        "US20100245154A1",
        "US20100305857A1",
        "US20120323251A1",
        "US20140092011A1",
        "US20170060254A1",
        "US10203763B1"
    ],
    "citations_ftf": [
        "FR2950713A1"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "DE102016213007A1",
        "US10181653B2",
        "US10218407B2",
        "US10934764B2",
        "US11067667B2",
        "US10466772B2",
        "US10505255B2",
        "US10602548B2",
        "US20190049558A1",
        "US10746625B2",
        "US11278241B2",
        "US11346936B2",
        "DE102018200814B3",
        "US10795012B2",
        "CN108344995A",
        "US20190244062A1",
        "US10576328B2",
        "US10705198B2",
        "CN108509910B",
        "US10775482B2",
        "US10761187B2",
        "US10794841B2",
        "CN108761461B",
        "US10399393B1",
        "US10903567B2",
        "US11416077B2",
        "US10928501B2",
        "CN109188414A",
        "US11183772B2",
        "US11125869B2",
        "US11360185B2",
        "US11397239B2",
        "EP3654053A1",
        "US11087115B2",
        "CN109829509B",
        "US11355838B2",
        "US11126885B2",
        "US11454696B2",
        "US11327167B2",
        "US11774592B2",
        "KR102107685B1",
        "US11435443B2",
        "CN110988861B",
        "US11614516B2",
        "CN111461037B",
        "US11585891B2",
        "US11567185B2",
        "US11774553B2",
        "US11704917B2",
        "US11614511B2",
        "CN112164092B",
        "US11719787B2",
        "US11719805B2",
        "US11662430B2",
        "CN112926526A",
        "CN113837131A"
    ]
}