{
    "patent_link": "https://patents.google.com/patent/US20050080710A1/en",
    "patent_id": "US20050080710A1",
    "title": "Method and apparatus for providing trading information",
    "abstract": "A method of providing trading market information, including (a) receiving substantially real time trade data for a trade; (b) adding the quantity of the received trade data to generate bid trade volumes and ask trade volumes for the price of the trade; (c) determining whether the price signifies a change in price direction in a series; (d) selectively displaying the generated bid trade volumes and ask trade volumes in a row of a column, the row corresponding to the price of the trade and the column corresponding to a series of trades. If a change in price direction in a series is determined in step (c), the bid trade volumes and ask trade volumes are displayed as a new series in a new column. The steps are repeated with new trade data. Price deltas consisting of ask trade volumes minus bid trade volumes for each price are continuously generated and selectively displayed. A total delta comprising the sum of the price deltas is also displayed. An apparatus having a display monitor and processor function according to the method.",
    "inventors": [
        "Richard Malato",
        "Trevor Harnett",
        "Michael Burkhart"
    ],
    "assignee": "MALATO HARNETT LLC",
    "classifications": [],
    "claims": "\n1. A method of providing trading market information, comprising:\n(a) receiving substantially real time trade data for a trade, said trade data including quantity, price, and bid/ask indication;\n(b) adding said quantity of said received trade data to generate bid trade volumes and ask trade volumes for the price of said trade;\n(c) determining whether said price signifies a change in price direction in a series;\n(d) selectively displaying said generated bid trade volumes and ask trade volumes in a row of a column, said row corresponding to said price of said trade and said column corresponding to a series of trades, wherein if a change in price direction in a series is determined in step (c), said bid trade volumes and ask trade volumes are displayed as a new series in a new column; and\n(e) repeating steps (a) through (d) for the next received trade data.\n2. The method of claim 1, wherein selectively displaying said bid trade volumes and said ask trade volumes comprises selectively displaying a price delta comprising ask trade volumes minus bid trade volumes.\n3. The method of claim 1, wherein selectively displaying said bid trade volumes and said ask trade volumes comprises selectively displaying said ask trade volumes on one side of said column and said bid trade volumes on the other side of said column, with a separator displayed therebetween.\n4. The method of claim 1, wherein when a change in price direction is determined in step (d), said new column is displayed where the column for the immediately previously generated ask trade volumes and bid trade volumes were displayed, and the previously displayed columns are shifted horizontally one column.\n5. The method of claim 1, wherein said selectively displaying said generated bid trade volumes and ask trade volumes comprises selectively displaying the total trade volumes.\n6. The method of claim 5, wherein each row in each column comprises a cell, and said selectively displaying step (c) further comprises shading each of said cells based on total volume displayed in said cells.\n7. The method of claim 6, wherein darker shades correspond to higher total volumes.\n8. The method of claim 1, wherein each row in each column comprises a cell, and further comprising the steps of:\ngenerating price deltas comprising ask trade volumes minus bid trade volumes for each price of each series; and\ndisplaying each cell having a positive price delta in a first color and displaying each cell having a negative price delta in a second color, said second color being different from said first color.\n9. The method of claim 8, wherein said second color is red.\n10. The method of claim 8, wherein said selectively displaying step (c) further comprises shading each of said cells based on the absolute value of said price delta for each cell.\n11. The method of claim 1, wherein consecutive price series are alternately designated as up and down price series, and a change in price direction in a series is determined in step (d) when it is determined that the price of the last received trade data is either (I) at least two price levels below the price level of the highest trade price in an up price series, or (ii) at least two price levels above the lowest trade price in a down price series.\n12. The method of claim 1, further comprising the steps of:\ncontinuously generating price deltas comprising ask trade volumes minus bid trade volumes for each price; and\nselectively displaying the current price deltas.\n13. The method of claim 12, further comprising the steps of:\nperiodically generating a total delta comprising the sum of the price deltas; and\nselectively displaying the current total delta.\n14. A method of providing trading market information, comprising:\n(a) receiving substantially real time trade data for a trade, said trade data including price and bid/ask indication;\n(b) adding said received trade data to generate bid trade counts and ask trade counts for the price of said trade;\n(c) determining whether said price signifies a change in price direction in a series;\n(d) selectively displaying said generated bid trade counts and ask trade counts in a row of a column, said row corresponding to said price of said trade and said column corresponding to a series of trades, wherein if a change in price direction in a series is determined in step (c), said bid trade counts and ask trade counts are displayed as a new series in a new column; and\n(e) repeating steps (a) through (d) for the next received trade data.\n15. A method of providing trading market information, comprising:\ncontinuously receiving trade data, said trade data for each trade including quantity, price, and bid/ask indication;\nbeginning at a selected time, continuously adding said quantity of said received trade data to generate bid trade volumes and ask trade volumes for each price for all trades since said selected time;\ncontinuously updating price deltas comprising ask trade volumes minus bid trade volumes for each price;\nperiodically generating a total delta comprising the sum of the price deltas; and\nselectively continuously displaying current ones of said price deltas and total delta.\n16. The method of claim 15, wherein said displaying step includes displaying price deltas in a series of cells in a column, wherein each cell corresponds to a different price.\n17. A method of providing trading market information, comprising:\ncontinuously receiving a substantially real time stream of trade data, said trade data for each trade including quantity, price, and bid/ask indication;\nbeginning at a selected time, continuously adding said quantity of said received trade data substantially as received to generate bid trade volumes and ask trade volumes for each price for all trades since said selected time;\ncontinuously updating price deltas comprising ask trade volumes minus bid trade volumes for each price;\nperiodically generating a total delta comprising the sum of the price deltas; and\nselectively continuously displaying current selected ones of said bid trade volumes, ask trade volumes, price deltas and total delta.\n18. An apparatus for providing trading market information, comprising:\na display monitor;\na processing unit having\nan input port adapted to receive substantially real time trade data for a trade, said trade data including quantity, price, and bid/ask indication, and\nan output port connected to said monitor for displaying information, wherein said processing unit:\n(a) adds said quantity of said received trade data to generate bid trade volumes and ask trade volumes for the price of said trade,\n(b) determines whether said price signifies a change in price direction in a series,\n(c) selectively generates for output through said output port a display signal for said monitor, said display signal displaying said generated bid trade volumes and ask trade volumes in a rows of a column, said row corresponding to said price of said trade and said column corresponding to a series of trades, wherein if a change in price direction in a series is determined, said display signal displays said bid trade volumes and ask trade volumes as a new series in a new column, and\n(d) continuously updates processes (a) through (c) as new trade data is received via said input port.\n19. The apparatus of claim 18, further comprising a user input to said processor adapted to allow user selection of parameters for said display signal.\n20. The apparatus of claim 19, wherein said parameters include volume thresholds.\n21. The apparatus of claim 19, wherein said parameters include change in price direction indicators.\n22. The apparatus of claim 19, wherein said parameters include the mode of displaying said bid trade volumes and ask trade volumes.\n23. The apparatus of claim 22,.wherein said displaying mode includes at least two of bid trade volumes and ask trade volumes on opposite sides of a separator, ask trade volumes minus bid trade volumes, ask trade volumes plus bid trade volumes, and bid trade counts and ask trade counts on opposite sides of a separator.",
    "status": "Abandoned",
    "citations_own": [
        "US5446890A",
        "US5806047A",
        "US5933816A",
        "US6064984A",
        "US20030009411A1",
        "US20050044031A1",
        "US6907404B1",
        "US20050182670A1",
        "US20060282356A1",
        "US20070288400A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20060293999A1",
        "US20070063875A1",
        "US20070087756A1",
        "US20070118463A1",
        "US20080243710A1",
        "US20100131427A1",
        "US20100211529A1",
        "US20100293084A1",
        "US20100317420A1",
        "US20120271748A1",
        "US8463679B2",
        "CN103620632A",
        "US8713478B2",
        "US9311670B2",
        "US20170301017A1",
        "US20200226638A1"
    ],
    "citedby_ftf": [
        "WO2005119533A1"
    ]
}