{
    "patent_link": "https://patents.google.com/patent/US3882672A/en",
    "patent_id": "US3882672A",
    "title": "System arrangement for governing gas turbine engines, especially gas turbine aero-engines",
    "abstract": "A system arrangement for the control of acceleration processes in gas turbine engines, especially gas turbine aero-engines. The system arrangement includes means for measuring the actual ratio of pressures at the outlet and inlet of the compressor operating in front of the combustion chamber and providing signal values indicative of the measured pressure ratio, means for comparing the measured pressure ratio signal values with a set of predetermined pressure ratio signal values for an operating range of the engine which predetermined signal values are set below the value corresponding to compressor surge, and means for controlling the metered fuel value for the engine in response to the actual measured signal value exceeding the predetermined pressure ratio signal value.",
    "inventors": [
        "Klaus Bauerfeind"
    ],
    "assignee": "MTU Aero Engines GmbH",
    "classifications": [],
    "claims": "\n1. System arrangement for the control of acceleration processes in gas turbine engines, especially gas turbine aero engines of the type having a compressor operating in front of a combustion chamber and a turbine operating behind the combustion chamber, the system arrangement comprising means for measuring the actual ratio of pressures at the outlet and inlet of the compressor and providing output signal values indicative thereof, means for comparing the actual measured compressor pressure ratio signal values with a set of predetermined pressure ratio signal values for an operating range of the engine which predetermined pressure ratio signal values are set below the ratio level signal value corresponding to compressor surge over the operating range of the engine, and means responsive to the actual measured signal value of the compressor ratio exceeding the predetermined pressure ratio signal value for controlling the metered fuel value Beta from a speed governor of the engine to provide a maximum value of Beta max during acceleration and to provide a minimum value of Beta min during deceleration of the engine.\n2. A system arrangement according to claim 1, wherein the set of predetermined pressure ratio signal values are a function of the relative compressor speed related to compressor inlet temperature N/ Square Root Tt1.\n3. A system arrangement according to claim 1, wherein the set of predetermined pressure ratio signal values are a function of compressor inlet mass flow related to compressor inlet conditions M1 Square Root Tt1/Pt1.\n4. A system arrangement according to claim 3, further comprising means for providing a signal Delta Pt s1/Pt1 which is representative of relative mass flow M1 Square Root Tt1/Pt1 in a plane upstream of the compressor wherein Delta Pt s1 is the difference between total and static pressure.\n5. A system arrangement according to claim 1, wherein said means for measuring the actual compressor ratio includes first means for measuring the pressure difference Delta Pt2 1 between the outlet and the inlet of the compressor, second means for measuring the compressor inlet pressure Pt1, and means responsive to said first and second means for providing the actual pressure ratio signal value Pt2/Pt1 in accordance with the equation Pt2/Pt1 ( Delta Pt2 1/Pt1+ 1).\n6. A system arrangement according to claim 1, further comprising means for adding a lead term signal value to the actual measured pressure ratio signal value, wherein the lead term signal value varies with flight conditions and is a function of compressor inlet pressure Pt1.\n7. A system arrangement according to claim 1, further comprisiNg means for limiting the maximum output value of the metered fuel flow of the speed governor Beta max as a function of turbine outlet gas temperature when the temperature drops below the normal operating value as occurs in an engine flame-out for ensuring that during reignition the metered fuel flow will prevent compressor surge.\n8. A system arrangement according to claim 1, further comprising means for stopping the integration of the speed governor signal at the magnitude value prevailing at the time when the speed governor output signal is limited to one of Beta max and Beta min during acceleration and deceleration until the output signal is no longer limited by one of Beta max and Beta min.\n9. A system arrangement according to claim 1, further characterized by means for setting a fuel control signal Beta 5 at a value of Beta min for a predetermined time interval in response to temperatures normally occuring during at least one of stabilized and transient operation of the engine being exceeded.\n10. A system arrangement according to claim 1, further comprising secondary acceleration governor means for controlling acceleration in response to engine pressures falling below a predetermined value, said secondary acceleration governor means limiting the acceleration parameter of the engine rather than the compressor pressure ratio.\n11. A system arrangement according to claim 1, further comprising pressure transducer means for providing electrical output signals in accordance with the sensed pressures, said pressure transducers being disposed in a heat insulated housing and protected against vibration, said housing being provided with thermostatically controlled heating system.\n12. A system arrangement according to claim 1, further comprising a plurality of pressure transducer means calibrated for different pressure ranges extending over the operating pressure range of the engine for supplying electrical output signals corresponding to the pressure range thereof and means for receiving the appropriate signal from the transducer means corresponding to the existing pressure.\n13. A system arrangement according to claim 2, wherein said means for measuring the actual compressor ratio includes first means for measuring the pressure difference Delta Pt2 1 between the outlet and the inlet of the compressor, second means for measuring the compressor inlet pressure Pt1, and means responsive to said first and second means for providing the actual pressure ratio signal value Pt2/Pt1 in accordance with the equation Pt2/Pt1 ( Delta Pt2 1/Pt1+ 1).\n14. A system arrangement according to claim 5, further comprising means for adding a lead term signal value to the actual measured pressure ratio signal value, wherein the lead term signal value varies with flight conditions and is a function of compressor inlet pressure Pt1.\n15. A system arrangement according to claim 6, further comprising means for limiting the maximum output value of the metered fuel flow of the speed governor Beta max as a function of turbine outlet gas temperature when the temperature drops below the normal operating value as occurs in an engine flame-out for ensuring that during reignition the metered fuel flow will prevent compressor surge.\n16. A system arrangement according to claim 7, further comprising means for stopping the integration of the speed governor signal at the magnitude value prevailing at the time when the speed governor output signal is limited to one of Beta max and Beta min during acceleration and deceleration until the output signal is no longer limited by one of Beta max and Beta min.\n17. A system arrangement according to claim 8, further characterized by means for setting a fuel control signal Beta 5 at a value of Beta min for a predetermined time interval in response to temperatures normally occuring During at least one of stabilized and transient operation of the engine being exceeded.\n18. A system arrangement according to claim 9, further comprising secondary acceleration governor means for controlling acceleration in response to engine pressures falling below a predetermined value, said secondary acceleration governor means limiting the acceleration parameter of the engine rather than the compressor pressure ratio.\n19. A system arrangement according to claim 10, further comprising pressure transducer means for providing electrical output signals in accordance with the sensed pressures, said pressure transducers being disposed in a heat insulated housing and protected against vibration, said housing being provided with thermostatically controlled heating system.\n20. A system arrangement according to claim 11, further comprising a plurality of pressure transducer means calibrated for different pressure ranges extending over the operating pressure range of the engine for supplying electrical output signals corresponding to the pressure range thereof and means for receiving the appropriate signal from the transducer means corresponding to the existing pressure.\n21. A system arrangement according to claim 4, wherein said means for measuring the actual compressor ratio includes first means for measuring the pressure difference Delta Pt2 1 between the outlet and the inlet of the compressor, second means for measuring the compressor inlet pressure Pt1, and means responsive to said first and second means for providing the actual pressure ratio signal value Pt2/Pt1 in accordance with the equation Pt2/Pt1 ( Delta Pt2 1/Pt1+ 1).\n22. A system arrangement according to claim 21, further comprising means for adding a lead term signal value to the actual measured pressure ratio signal value, wherein the lead term signal value varies with flight conditions and is a function of compressor inlet pressure Pt1.\n23. A system arrangement according to claim 22, further comprising means for limiting the maximum output value of the metered fuel flow of the speed governor Beta max as a function of turbine outlet gas temperature when the temperature drops below the normal operating value as occurs in an engine flame-out for ensuring that during reignition the metered fuel flow will prevent compressor surge.\n24. A system arrangement according to claim 23, further comprising means for stopping the integration of the speed governor signal at the magnitude value prevailing at the time when the speed governor output signal is limited to one of Beta max and Beta min during acceleration and deceleration until the output signal is no longer limited by one of Beta max and Beta min.\n25. A system arrangement according to claim 24, further characterized by means for setting a fuel control signal Beta 5 at a value of Beta min for a predetermined time interval in response to temperatures normally occuring during at least one of stabilized and transient operation of the engine being exceeded.\n26. A system arrangement according to claim 25, further comprising secondary acceleration governor means for controlling acceleration in response to engine pressures falling below a predetermined value, said secondary acceleration governor means limiting the acceleration parameter of the engine rather than the compressor pressure ratio.\n27. A system arrangement according to claim 26, further comprising pressure transducer means for providing electrical output signals in accordance with the sensed pressures, said pressure transducers being disposed in a heat insulated housing and protected against vibration, said housing being provided with thermostatically controlled heating system.\n28. A system arrangement according to claim 27, further comprising a plurality of pressure transducer means calibrated for different pressure ranges extending over the operating Pressure range of the engine for supplying electrical output signals corresponding to the pressure range thereof and means for receiving the appropriate signal from the transducer means corresponding to the existing pressure.\n29. A system arrangement for the control of acceleration processes in gas turbine engines, especially gas turbine aero-engines of the type having a compressor operating in front of a combustion chamber and a turbine operating behind the combustion chamber, the system arrangement comprising means for measuring the actual ratio of pressures at the outlet and inlet of the compressor and providing output signal values indicative thereof, means for comparing the actual measured compressor pressure ratio signal values with a set of predetermined compressor pressure outlet to inlet ratio signal values for an operating range of the engine which predetermined pressure ratio signal values are set below the ratio level signal value corresponding to compressor surge over the operating range of the engine, and means responsive to the actual measured signal value of the compressor ratio exceeding the predetermined pressure ratio signal value for controlling the metered quantity of fuel supplied to the engine, the set of predetermined compressor pressure ratio signal values being a function of one of the relative compressor speed related to compressor inlet temperature N/ Square Root Tt1 and of relative compressor inlet mass flow related to compressor inlet conditions M1 Square Root Tt1/Pt1 in accordance with the slope of the lines N/ Square Root Tt1 constant in the compressor characteristic, where N is the shaft rotational speed, Tt1 is the total temperature at the compressor inlet, M1 is the compressor inlet mass flow, and Pt1 is the total pressure at the compressor inlet.\n30. A system arrangement according to claim 29, wherein said means responsive to the actual measured signal value of the compressor pressure ratio exceeding the predetermined pressure ratio signal serves for reducing the metered fuel quantity.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US2948114A",
        "US3068648A",
        "US3076312A",
        "US3187504A",
        "US3240014A",
        "US3242673A",
        "US3295315A",
        "US3357177A",
        "US3421317A",
        "US3606754A",
        "US3764785A"
    ],
    "citations_ftf": [
        "US3032986A",
        "US3046739A",
        "US3316713A"
    ],
    "citedby_own": [
        "US4217754A",
        "US4928484A",
        "US4984425A",
        "US5022224A",
        "US5481865A",
        "US5732546A",
        "US20140093350A1",
        "US10961921B2"
    ],
    "citedby_ftf": [
        "JPS528215A"
    ]
}