{
    "patent_id": "US-11684439-B2",
    "title": "Surgical system sterile drape ",
    "assignee": "Intuitive Surgical Operations, Inc.",
    "publication_date": "2023-06-27",
    "patent_link": "https://patents.google.com/patent/US11684439B2/en",
    "inventors": [
        "Anthony K. McGrogan",
        "Jeffrey D. Brown",
        "Thomas G. Cooper",
        "Eugene F. Duval",
        "Daniel H. Gomez",
        "Robert E. Holop",
        "Craig R. Ramstad"
    ],
    "classifications": [
        "A61B34/70",
        "A61B1/00135",
        "A61B1/00142",
        "A61B17/0218",
        "A61B17/3421",
        "A61B17/3423",
        "A61B17/3474",
        "A61B34/00",
        "A61B34/30",
        "A61B34/35",
        "A61B34/37",
        "A61B46/10",
        "A61B46/23",
        "A61B50/00",
        "A61B50/20",
        "A61B50/30",
        "A61B90/08",
        "A61B90/98",
        "A61M13/003",
        "B25J15/0066",
        "B25J15/04",
        "B32B3/12",
        "F16F1/121",
        "G03B3/00",
        "G03B35/00",
        "H01F27/2823",
        "H01F5/02",
        "H01F5/04",
        "H04N23/51",
        "H04N23/54",
        "H04N23/55",
        "H04N23/555",
        "H04N23/57",
        "H04N23/60",
        "H04N23/687",
        "H05K1/18",
        "A61B17/29",
        "A61B2017/00477",
        "A61B2017/3445",
        "A61B2017/3447",
        "A61B2034/302",
        "A61B2034/306",
        "A61B2050/3008",
        "A61B2090/5025",
        "B25J15/02",
        "G03B2205/0015",
        "G03B2205/0069",
        "G03B5/02",
        "H01F2005/027",
        "Y10T74/20305"
    ],
    "abstract": "A drape includes a first drape portion configured to receive a manipulator arm of a surgical system and a pocket coupled to a distal portion of the first drape portion. The pocket is configured to receive a manipulator of the surgical system. The pocket includes a flexible membrane positionable between an output of the manipulator and an input of a surgical instrument mountable to the manipulator. In some embodiments, the flexible membrane is located at a distal end of the pocket. In some embodiments, the flexible membrane is configured to allow an actuating force to be transmitted from the output of the manipulator to the input of the surgical instrument. In some embodiments, the pocket provides a sterile barrier between the manipulator and the surgical instrument. In some embodiments, the drape further includes a rotatable seal configured to couple a proximal opening of the pocket to the first drape portion.",
    "claims": "\n1. A drape assembly for providing a sterile interface for a surgical manipulator system, the drape assembly comprising:\na first drape portion configured to receive a first portion of the surgical manipulator system in an installed state of the drape assembly on the surgical manipulator system;\na second drape portion configured to receive a second portion of the surgical manipulator system in the installed state of the drape assembly on the surgical manipulator system; and\na coupling mechanism configured to rotatably couple the first drape portion to the second drape portion,\nwherein the coupling mechanism comprises a first coupling member and a second coupling member and, in an uninstalled state of the drape assembly off the surgical manipulator system, the first coupling member is fixedly attached to the first drape portion and the second coupling member is fixedly attached to the second drape portion.\n2. The drape assembly of claim 1, wherein the first and second coupling members are configured to couple to each other and form a rotatable seal.\n3. The drape assembly of claim 2, wherein the first coupling member and the second coupling member comprise complementary engagement features configured to engage one another to form the rotatable seal.\n4. The drape assembly of claim 2, wherein the seal comprises a labyrinth seal.\n5. The drape assembly of claim 1, wherein the second drape portion is configured to receive a manipulator coupled to the first portion of the surgical manipulator system in the installed state of the drape assembly on the surgical manipulator system.\n6. The drape assembly of claim 5, wherein the second drape portion comprises a pocket configured to receive the manipulator.\n7. The drape assembly of claim 6, wherein the pocket is configured to provide a sterile barrier between the manipulator and a surgical instrument mounted to the manipulator.\n8. The drape assembly of claim 6, wherein the pocket includes a flexible membrane positionable to cover an output of the manipulator.\n9. The drape assembly of claim 8, wherein the flexible membrane is located at a distal end of the pocket.\n10. The drape assembly of claim 8, wherein the flexible membrane is configured to allow an actuating force to be transmitted from the output of the manipulator to an input of a surgical instrument mounted to the manipulator.\n11. The drape assembly of claim 6, wherein the pocket is configured to allow the manipulator to move away from the first portion of the surgical manipulator system in the installed state of the drape assembly on the surgical manipulator system.\n12. The drape assembly of claim 5, wherein the second drape portion is configured to allow the manipulator to move away from the first portion of the surgical manipulator system in the installed state of the drape assembly on the surgical manipulator system.\n13. The drape assembly of claim 1, wherein the second drape portion is configured to receive a second portion of the surgical manipulator system extending from and rotatably connected to the first portion of the surgical manipulator system.\n14. The drape assembly of claim 13, wherein the second drape portion is configured to receive a manipulator arm of the surgical manipulator system.\n15. The drape assembly of claim 1, wherein the second drape portion comprises one or more pockets configured to receive differing respective components of the second portion of the surgical manipulator system.\n16. The drape assembly of claim 1, wherein the coupling mechanism is configured to be coupled to the surgical manipulator system.\n17. The drape assembly of claim 1,\nwherein the second coupling member comprises a comb portion that defines a plurality of openings;\nwherein the second drape portion comprises a plurality of pockets each configured to receive a corresponding manipulator of a plurality of manipulators of the second portion of the surgical manipulator system with the plurality of manipulators extending through the plurality of openings, respectively.\n18. A method of draping a surgical manipulator system, the method comprising:\ndraping a first portion of the surgical manipulator system with a first drape portion of a drape assembly fixedly attached to a first coupling member; and\ndraping a second portion of the surgical manipulator system with a second drape portion of the drape assembly fixedly attached to a second coupling member;\nwherein, the first drape portion and the second drape portion are rotatably coupled to one another via coupling of the first coupling member and the second coupling member.\n19. The method of claim 18,\nwherein in a coupled state of the first and second coupling members, the first and second coupling members form a seal.\n20. The method of claim 18, further comprising coupling one or both of the first coupling member and the second coupling member to at least one of the first and second portions of the surgical manipulator system.\n21. A drape assembly for providing a sterile interface for a surgical manipulator system, the drape assembly comprising:\na first drape portion configured to receive a first portion of the surgical manipulator system in an installed state of the drape assembly on the surgical manipulator system;\na second drape portion configured to receive a second portion of the surgical manipulator system in the installed state of the drape assembly on the surgical manipulator system; and\na coupling mechanism configured to rotatably couple the first drape portion to the second drape portion,\nwherein the coupling mechanism rotatably couples the first drape portion to the second drape portion in an uninstalled state of the drape assembly off the surgical manipulator system.\n22. The drape assembly of claim 21, wherein the coupling mechanism comprises a first coupling member coupled to the first drape portion and a second coupling member coupled to the second drape portion, the first and second coupling members coupled together and forming a rotatable seal.\n23. The drape assembly of claim 22, wherein the first coupling member and the second coupling member comprise complementary engagement features that engage one another to form the rotatable seal.\n24. The drape assembly of claim 22, wherein the rotatable seal comprises a labyrinth seal.\n25. The drape assembly of claim 22,\nwherein the second coupling member comprises a comb portion defining a plurality of openings;\nwherein the second drape portion comprises a plurality of pockets each configured to, in the installed state of the drape assembly on the surgical manipulator system, receive a corresponding manipulator of a plurality of manipulators of the second portion of the surgical manipulator system with the plurality of manipulators extending through the plurality of openings, respectively.\n26. The drape assembly of claim 21, wherein the second drape portion is configured to receive a manipulator coupled to the first portion of the surgical manipulator system, the second portion of the surgical manipulator system comprising the manipulator.\n27. The drape assembly of claim 26,\nwherein the coupling mechanism is configured to be coupled to the first portion of the manipulator system in the installed state of the drape assembly on the surgical manipulator system; and\nwherein the second drape portion is configured to, in the installed state of the drape assembly on the surgical manipulator system, allow the manipulator to move away from the first portion of the surgical manipulator system."
}