{
    "patent_id": "US-11172704-B2",
    "title": "Electronic cigarette ",
    "assignee": "Fontem Holdings 1 B.V.",
    "publication_date": "2021-11-16",
    "patent_link": "https://patents.google.com/patent/US11172704B2/en",
    "inventors": [
        "Lik Hon"
    ],
    "classifications": [
        "A24F40/40",
        "A24B15/167",
        "A24F40/46",
        "A24F40/90",
        "A61M15/06",
        "F22B1/284",
        "H01M10/0525",
        "H01M10/425",
        "H01M10/46",
        "H01M10/488",
        "H01M50/20",
        "H01M50/202",
        "H01M50/213",
        "H01M50/224",
        "H01M50/247",
        "H01M50/284",
        "H02J7/00",
        "H02J7/0042",
        "H05B1/0244",
        "H05B1/0291",
        "H05B1/0297",
        "H05B3/03",
        "H05B3/06",
        "H05B3/42",
        "A24F40/10",
        "A61M15/0015",
        "A61M2016/0024",
        "A61M2205/8206",
        "H01M2220/30",
        "Y02E60/10"
    ],
    "abstract": "An electronic cigarette includes a battery assembly, an atomizer assembly and a cigarette bottle assembly. An external thread electrode is located in one end of battery assembly. An internal thread electrode is located in one end of atomizer assembly. The battery assembly and the atomizer assembly are connected by the screwthread electrode. The cigarette bottle assembly is inserted into the other end of the atomizer assembly and both form a cigarette type or cigar type body.",
    "claims": "\n1. A vaporizing device comprising:\na battery assembly comprising a battery electrically connected to a circuit board and contained in a battery assembly housing;\na first screw thread electrode located at a first end of the battery assembly housing;\nan atomizer assembly comprising:\nan atomizer assembly housing having a first and second end;\nan atomizer comprising a porous body having a first end and a second end, a cylindrical chamber within the porous body, and a heating wire in the cylindrical chamber;\nthe atomizer assembly housing having an air inlet;\nan outlet at the second end of the atomizer assembly housing;\nan airflow path in the atomizer assembly from the air inlet to the outlet;\nthe atomizer located between the air inlet and the outlet to allow air to pass through the porous body from the first end to the second of the porous body and past the heating wire;\na second screw thread electrode located at the first end of the atomizer assembly housing, the second screw thread electrode concentric with the first screw thread electrode; and\nthe battery assembly and atomizer assembly mechanically and electrically connected by the engagement of the first screw thread electrode with the second screw thread electrode with electricity conducted from the battery to the heating wire through the first and second screw thread electrodes.\n2. The vaporizing device of claim 1 wherein the chamber is cylindrical.\n3. The vaporizing device of claim 1 wherein the porous body comprises a fiber material.\n4. The vaporizing device of claim 1 wherein the porous body comprises a ceramic material.\n5. The vaporizing device of claim 1 further comprising at least one LED indicator in the battery assembly housing electrically connected to the circuit board.\n6. The vaporizing device of claim 1 wherein the battery comprises a rechargeable lithium ion battery.\n7. The vaporizing device of claim 1 wherein the atomizer assembly further includes a single liquid supply.\n8. The vaporizing device of claim 7 further comprising a liquid in the liquid supply.\n9. The vaporizing device of claim 8 with the liquid comprising a nicotine solution and the liquid provided to the porous body.\n10. The vaporizing device of claim 9 with the liquid supply comprising a bottle assembly detachable from the atomizer assembly.\n11. The vaporizing device of claim 1 with the heating wire comprising a wire coil wound on a surface of the porous body.\n12. The vaporizing device of claim 1 wherein the airflow path is through a cylindrical opening at the first end of the porous body.\n13. The vaporizing device of claim 1 wherein the atomizer assembly housing is cylindrical.\n14. A vaporizing device comprising:\na battery assembly comprising a battery electrically connected to a circuit board and contained in a battery assembly housing;\na first screw thread electrode located at a first end of the battery assembly housing;\nan atomizer assembly comprising:\na liquid supply and a cylindrical atomizer assembly housing having a first and second end;\nan atomizer comprising a porous body having a first end and a second end, a cylindrical chamber within the porous body, and a heating wire in the cylindrical chamber;\nthe atomizer assembly housing having an air inlet;\nan outlet at the second end of the atomizer assembly housing;\nan airflow path through the chamber in the atomizer assembly from the air inlet to the outlet;\nthe atomizer located between the air inlet and the outlet to allow air to pass through the porous body from the first end to the second end of the porous body and past the heating wire;\na second screw thread electrode located at the first end of the atomizer assembly housing, the second screw thread electrode concentric with the first screw thread electrode; and\nthe battery assembly and atomizer assembly mechanically and electrically connected by the engagement of the first screw thread electrode with the second screw thread electrode with electricity conducted from the battery to the heating wire through the first and second screw thread electrodes.\n15. The vaporizing device of claim 14 further comprising a liquid in the liquid supply.\n16. The vaporizing device of claim 15 with the liquid comprising a nicotine solution and the liquid provided to the porous body.\n17. The vaporizing device of claim 14 with the heating wire comprising a wire coil wound on a surface of the porous body.\n18. A vaporizing device comprising:\na battery assembly comprising a battery electrically connected to a circuit board and contained in a battery assembly housing;\na first screw thread electrode located at a first end of the battery assembly housing;\nan atomizer assembly comprising:\na liquid supply and a cylindrical atomizer assembly housing having a first and second end;\nan atomizer comprising a porous body having a first end and a second end, a cylindrical chamber within the porous body between the first end and the second end, and a heating wire coil in the cylindrical chamber;\nthe atomizer assembly housing having an air inlet;\nan outlet at the second end of the atomizer assembly housing;\nan airflow path through the chamber in the atomizer assembly from the air inlet to the outlet;\nthe atomizer located between the air inlet and the outlet to allow air to pass through the porous body from the first end to the second of the porous body and past the heating wire coil;\na second screw thread electrode located at the first end of the atomizer assembly housing, the second screw thread electrode concentric with the first screw thread electrode; and\nthe battery assembly and atomizer assembly mechanically and electrically connected by the engagement of the first screw thread electrode with the second screw thread electrode with electricity conducted from the battery to the heating wire coil through the first and second screw thread electrodes.\n19. The vaporizing device of claim 18 with the liquid supply comprising a bottle assembly detachable from the atomizer assembly.\n20. The vaporizing device of claim 18 with the heating wire coil wound on a surface of the porous body."
}