{
    "patent_id": "US-11165741-B2",
    "title": "Introducing a new message source into an electronic message delivery environment ",
    "assignee": "Hubspot, Inc.",
    "publication_date": "2021-11-02",
    "patent_link": "https://patents.google.com/patent/US11165741B2/en",
    "inventors": [
        "Michael O'Brien",
        "Michael Axiak"
    ],
    "classifications": [
        "H04L51/34",
        "H04L51/18",
        "G06N20/00",
        "G06N3/08",
        "G06N7/005",
        "G06N7/01",
        "G06Q10/107",
        "G06Q30/0248",
        "G06Q30/0277",
        "H04L51/08",
        "H04L51/12",
        "H04L51/212",
        "H04L51/22",
        "H04L51/234",
        "H04L51/28",
        "H04L51/42",
        "H04L51/48",
        "H04L61/2007",
        "H04L61/5007"
    ],
    "abstract": "Provided herein is an electronic message management platform that enables management and execution of electronic message campaigns while appropriately managing challenges presented by spam filters, black lists, and domain blocking technologies, and that includes elements for managing an electronic message campaign based on dynamic conditions, quality measures, engagement factors, and other measures, factors and conditions.",
    "claims": "\n1. A method of generating a sender policy framework (SPF) record comprising:\npreparing a list of Internet Protocol (IP) addresses to be included in one or more SPF records for a domain;\nsearching the list for IP addresses that can be represented as a continuous string of IP addresses;\nconverting the IP addresses that can be represented as a continuous string from individual IP addresses to inclusive IP address group designators;\nusing a knapsack algorithm, generating a first SPF record that includes a maximum number of IP addresses for a given SPF record size;\nstoring the IP addresses identified by the knapsack algorithm into the first SPF record; and\nupdating the first SPF record with a reference to a second SPF record in response to a number of IP addresses in the list exceeding the maximum number of IP addresses determined from the knapsack algorithm for the first SPF record.\n2. The method of claim 1, wherein the reference to the second SPF record includes the domain plus an identifier that is a whole number greater than a SPF record reference for the first SPF record.\n3. The method of claim 1, further comprising, repeating the converting, knapsack algorithm, storing and updating steps for the second SPF record.\n4. The method of claim 1, wherein the updating is in response to at least one new IP address needing to be included in the one or more SPF records for the domain.\n5. The method of claim 1, wherein searching the list for IP addresses that can be represented as a continuous string of IP addresses comprises searching for a power of two in the IP addresses.\n6. The method of claim 1, wherein inclusive IP address group designators include a subnet definition.\n7. The method of claim 6, wherein the subnet definition is a subnet mask.\n8. The method of claim 1, wherein generating an SPF record further comprises representing the inclusive IP address group designators as a string representation of ranges.\n9. The method of claim 8, wherein using the knapsack algorithm comprises fitting the string representation of ranges in the SPF record within the given SPF record size.\n10. A system for generating a sender policy framework (SPF) record comprising:\na processor; and a memory storing code that when executed causes the processor to perform operations, the operations comprising:\npreparing a list of Internet Protocol (IP) addresses to be included in one or more SPF records for a domain;\nsearching the list for IP addresses that can be represented as a continuous string of IP addresses;\nconverting the IP addresses that can be represented as a continuous string from individual IP addresses to inclusive IP address group designators;\nusing a knapsack algorithm, generating a first SPF record that includes a maximum number of IP addresses for a given SPF record size;\nstoring the IP addresses identified by the knapsack algorithm into the first SPF record; and\nupdating the first SPF record with a reference to a second SPF record in response to a number of IP addresses in the list exceeding the maximum number of IP addresses determined from the knapsack algorithm for the first SPF record.\n11. The system of claim 10, wherein the reference to the second SPF record includes the domain plus an identifier that is a whole number greater than a SPF record reference for the first SPF record.\n12. The system of claim 10, wherein the operation further comprises repeating the converting, knapsack algorithm, storing and updating steps for the second SPF record.\n13. The system of claim 10, wherein the updating is in response to at least one new IP address needing to be included in the one or more SPF records for the domain.\n14. The system of claim 10, wherein searching the list for IP addresses that can be represented as a continuous string of IP addresses comprises searching for a power of two in the IP addresses.\n15. The system of claim 10, wherein inclusive IP address group designators include a subnet definition.\n16. The system of claim 15, wherein the subnet definition is a subnet mask.\n17. The system of claim 10, wherein generating an SPF record further comprises representing the inclusive IP address group designators as a string representation of ranges.\n18. The system of claim 17, wherein using the knapsack algorithm comprises fitting the string representation of ranges in the SPF record within the given SPF record size."
}