{
    "patent_id": "US-11665072-B2",
    "title": "Parallel computational framework and application server for determining path connectivity ",
    "assignee": "Www.Trustscience.Com Inc.",
    "publication_date": "2023-05-30",
    "patent_link": "https://patents.google.com/patent/US11665072B2/en",
    "inventors": [
        "Leo M. Chan"
    ],
    "classifications": [
        "H04L43/065",
        "G06F16/3322",
        "G06N7/01",
        "H04L41/14",
        "H04L43/045",
        "H04L43/0805",
        "H04L43/16",
        "H04L67/535"
    ],
    "abstract": "Systems and methods for social graph data analytics to determine the connectivity between nodes within a community are provided. A user may assign user connectivity values to other members of the community, or connectivity values may be automatically harvested or assigned from third parties or based on the frequency of interactions between members of the community. Connectivity values may represent such factors as alignment, reputation, status, and/or influence within a social graph of a network community, or the degree of trust. The paths connecting a first node to a second node may be retrieved, and social graph data analytics may be performed on the retrieved paths. For example, a network connectivity value may be determined from all or a subset of all of the retrieved paths. Network connectivity values and/or other social graph data may be outputted to third-party processes, services, and ratings agencies for use in initiating automatic transactions, making automated network-based or real-world decisions, determining or verifying the identity of a node within the community, scoring or ranking nodes, or making credit-granting decisions.",
    "claims": "\n1. A method for determining the network connectivity between a first\n2. The method of claim 1 further comprising accessing a link threshold value, wherein counting paths to the second node from the first node comprises counting only those paths containing fewer links than the accessed link threshold value.\n3. The method of claim 1 further comprising accessing a path weight threshold value, wherein counting paths to the second node from the first node comprises counting only those paths with a normalized path weight above the accessed path weight threshold value.\n4. The method of claim 1 wherein the processing circuitry determines a user connectivity value for each counted path by multiplying the path weight for an counted path and a minimum connectivity value assigned to a link in the counted path.\n5. The method of claim 1 wherein determining a relative user weight for a link comprises computing the average of user connectivity values assigned by a node connected to the link.\n6. The method of claim 1 wherein determining the overall weight of a counted path comprises multiplying the weights of all links along the path.\n7. An application server for determining the network connectivity between a first node and a second node connected to the first node by at least one path, the application server comprising\na storage device configured to:\nstore a first list that identifies outgoing paths from the first node;\nstore a second list that identifies incoming paths to the second node;\n8. The system of claim 7 wherein the processing circuitry is further configured to access a link threshold value, wherein counting paths to the second node from the first node comprises counting only those paths containing fewer links than the accessed link threshold value.\n9. The system of claim 7 wherein the processing circuitry is further configured to access a path weight threshold value, wherein counting paths to the second node from the first node comprises counting only those paths with a normalized path weight above the accessed path weight threshold value.\n10. The system of claim 7 wherein the processing circuitry is further configured to access third-party ratings data, wherein the network connectivity indication is based, at least in part, on the third-party ratings information.\n11. The system of claim 7 wherein counting paths to the second node from the first node comprises accessing data from a social networking service.\n12. The system of claim 7 wherein determining a relative user weight for a link comprises computing the average of user connectivity values assigned by a node connected to the link.\n13. The system of claim 7 wherein determining the overall weight of a counted path comprises multiplying the weights of all links along the path.\n14. A system for determining the network connectivity between a first node and a second node connected to the first node by at least one path, the system compromising:\nmeans for storing a first list that identifies outgoing paths from the first node;\nmeans for storing a second list that identifies incoming paths to the second node;\nmeans for counting paths to the second node from the first node, wherein counting paths comprises accessing the first list and the second list, wherein each path comprises one or more links between nodes;\nmeans for determining a relative user weight for each of the one or more links between nodes;\nmeans for determining an overall weight of a plurality of the counted paths; and\nmeans for determining a network connectivity indication based, at least in part, on the counted paths.\n15. The system of claim 14 wherein the system further comprises means for determining a user connectivity value for each identified path by multiplying the path weight for a counted path and a minimum connectivity value assigned to a link in the counted path.\n16. The system of claim 15 wherein the user connectivity value represents a subjective user trust value or competency assessment.\n17. The system of claim 14 wherein the system further comprises means for accessing third-party ratings data, wherein the network connectivity indication is based, at least in part, on the third-party ratings information.\n18. The system of claim 14 wherein counting paths to the second node from the first node comprises accessing data from a social networking service.\n19. The system of claim 14 wherein determining a relative user weight for a link comprises computing the average of user connectivity values assigned by a node connected to the link.\n20. The system of claim 14 wherein determining the overall weight of a counted path comprises multiplying the weights of all links along the path."
}