{
    "patent_id": "US-11082115-B2",
    "title": "Beam management using adaptive learning ",
    "assignee": "Qualcomm Incorporated",
    "publication_date": "2021-08-03",
    "patent_link": "https://patents.google.com/patent/US11082115B2/en",
    "inventors": [
        "Shay Landis",
        "Assaf Touboul",
        "Arthur GUBESKYS",
        "Alexei Yurievitch Gorokhov",
        "Aamod Dinkar Khandekar"
    ],
    "classifications": [
        "H04B17/318",
        "G06N20/00",
        "G06N3/006",
        "G06N3/044",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/08",
        "G06N3/084",
        "G06N3/088",
        "G06N7/01",
        "H04B17/336",
        "H04B17/373",
        "H04B17/382",
        "H04B17/3913",
        "H04B7/0632",
        "H04B7/0695",
        "H04B7/088",
        "G06N3/047"
    ],
    "abstract": "Certain aspects of the present disclosure provide techniques for beam management using adaptive learning. Certain aspects provide a method that can be performed by a node, such as user equipment (UE) or a base station (BS). The node determines one or more beams to utilize for a beam management procedure using adaptive learning. The node performs the beam management procedure using the determined one or more beams. In some aspects, the node uses an adaptive reinforcement learning algorithm to select beams for measurement in beam discovery procedure. The node may adaptive the beam management algorithm based on feedback associated with the beam selection, such as based on a throughput achieved using a beam pairing determined during the beam management procedure.",
    "claims": "\n1. A method for wireless communication by a user equipment (UE), comprising:\ndetermining one or more beams to utilize for a beam management procedure using an adaptive learning algorithm, wherein using the adaptive learning algorithm includes outputting an action based on one or more inputs;\nperforming the beam management procedure using the determined one or more beams;\nreceiving feedback associated with the beam management procedure using the determined one or more beams, wherein the feedback is associated with the action; and\nupdating the adaptive learning algorithm based on the feedback, wherein updating the adaptive learning algorithm based on the feedback includes adjusting one or more weights applied to the one or more inputs.\n2. The method of claim 1, wherein performing the beam management procedure using the determined one or more beams comprises:\nmeasuring a channel based on one or more synchronization signal block (SSB) transmissions from a base station (BS) using the determined one or more beams, the SSB transmissions associated with one or more transmit beams of the BS; and\nselecting one or more beam pair links (BPLs) associated with one or more channel measurements that are above a channel measurement threshold; or one or more strongest channel measurements among all channel measurements associated with the one or more SSB transmissions; or a combination thereof.\n3. The method of claim 2, further comprising:\nreceiving a physical downlink shared channel (PDSCH) using one of the selected one or more BPLs;\ndetermining a throughput, spectral efficiency, or both associated with the PDSCH, wherein the feedback is the determined throughput, spectral efficiency, or both; and\nusing the updated adaptive learning algorithm to determine another one or more beams to utilize for performing another beam management procedure to select another one or more BPLs.\n4. The method of claim 2, wherein measuring the channel comprises measuring a reference signal receive power (RSRP); a spectral efficiency, a channel flatness, or a signal-to-noise ratio (SNR); or a combination thereof.\n5. The method of claim 1, further comprising:\ndetermining the adaptive learning algorithm, updating the adaptive learning algorithm, or both, based on training information.\n6. The method of claim 5, wherein the training information comprises:\ntraining information obtained from deploying one or more UEs in one or more simulated communication environments prior to network deployment of the one or more UEs;\ntraining information obtained by feedback previously received while the one or more UEs was deployed in one or more communication environments;\ntraining information from at least one of the network, one or more UEs, or a cloud;\ntraining information received while the UE was at least one of online or idle; or\na combination thereof.\n7. The method of claim 5, wherein the training information comprises training information received from one or more UEs, different than the UE, after deployment of the UE, wherein the training information comprises information associated with beam measurements by the one or more UEs, or feedback associated with one or more beam management procedures performed by the one or more UEs, or a combination thereof.\n8. The method of claim 1, wherein the adaptive learning algorithm comprises an adaptive machine learning algorithm; an adaptive reinforcement learning algorithm; an adaptive deep learning algorithm; an adaptive continuous infinite learning algorithm; or an adaptive policy optimization reinforcement learning algorithm, or a combination thereof.\n9. The method of claim 1, wherein the adaptive learning algorithm is modeled as a partially observable markov decision process (POMDP).\n10. The method of claim 1, wherein the adaptive learning algorithm is implemented by an artificial neural network.\n11. The method of claim 10, wherein:\nthe artificial neural network comprises a deep Q network (DQN) comprising one or more deep neural networks (DNNs); and\nthe determining the one or more beams using the adaptive learning algorithm includes:\npassing one or more state parameters and one or more action parameters through the one or more DNNs;\nfor each state parameter, outputting a value for each action parameter; and\nselecting an action associated with a maximum output value.\n12. The method of claim 10, wherein updating the adaptive learning algorithm comprises adjusting one or more weights associated with one or more neuron connections in the artificial neural network.\n13. The method of claim 1, wherein determining the one or more beams to utilize for the beam management procedure using the adaptive learning algorithm includes:\ndetermining one or more beams to include in a codebook based on the adaptive learning; and\nselecting one or more beams from the codebook to utilize for the beam management procedure.\n14. The method of claim 1, wherein determining the one or more beams to utilize for the beam management procedure includes using the adaptive learning algorithm to select one or more beams from a codebook to utilize for the beam management procedure.\n15. The method of claim 1, wherein the adaptive learning algorithm uses a state parameter associated with a channel measurement, a reward parameter associated with a received signal throughput or spectral efficiency, and an action parameter associated with selection of a beam pair corresponding to the channel measurement.\n16. The method of claim 15, wherein the reward parameter is offset by a penalty amount.\n17. The method of claim 16, wherein the penalty amount is dependent on a number of the one or more beams measured for the beam management procedure.\n18. The method of claim 16, wherein the penalty amount is dependent on an amount of power consumption associated with the beam management procedure.\n19. The method of claim 1, wherein the determined one or more beams comprises a subset of available receive beams.\n20. An apparatus for wireless communication by a user equipment (UE), comprising:\na memory; and\na processor coupled to the memory, the processor and memory configured to:\ndetermine one or more beams to utilize for a beam management procedure using an adaptive learning algorithm that outputs an action based on one or more inputs;\nperform the beam management procedure using the determined one or more beams;\nreceive feedback associated with the beam management procedure using the determined one or more beams, wherein the feedback is associated with the action; and\nadjust one or more weights applied to the one or more inputs to update the adaptive learning algorithm based on the feedback.\n21. The apparatus of claim 20, wherein in configuring to perform the beam management procedure using the determined one or more beams the memory and the processor are configured to:\nmeasure a channel based on one or more synchronization signal block (SSB) transmissions from a base station (BS) using the determined one or more beams, the SSB transmissions associated with one or more transmit beams of the BS; and\nselect one or more beam pair links (BPLs) associated with one or more channel measurements that are above a channel measurement threshold; or one or more strongest channel measurements among all channel measurements associated with the one or more SSB transmissions; or a combination thereof.\n22. The apparatus of claim 21, wherein the processor and memory are further configured to:\nreceive a physical downlink shared channel (PDSCH) using one of the selected one or more BPLs;\ndetermine a throughput, spectral efficiency, or both associated with the PDSCH, wherein the feedback is the determined throughput, spectral efficiency, or both; and\nuse the updated adaptive learning algorithm to determine another one or more beams to utilize for performing another beam management procedure to select another one or more BPLs.\n23. The apparatus of claim 21, wherein the processor and memory are configured to measure the channel wherein in configuring to measure the channel the memory and the processor are configured to measure a reference signal receive power (RSRP); a spectral efficiency, a channel flatness, or a signal-to-noise ratio (SNR); or a combination thereof.\n24. The apparatus of claim 20, wherein the processor and memory are further configured to:\ndetermine the adaptive learning algorithm, update the adaptive learning algorithm, or both, based on training information.\n25. The apparatus of claim 24, wherein the training information comprises:\ntraining information obtained from deploying one or more UEs in one or more simulated communication environments prior to network deployment of the one or more UEs;\ntraining information obtained by feedback previously received while the one or more UEs was deployed in one or more communication environments;\ntraining information from at least one of the network, one or more UEs, or a cloud;\ntraining information received while the apparatus was at least one of online or idle; or\na combination thereof.\n26. The apparatus of claim 24, wherein the training information comprises training information received from one or more UEs, different than the apparatus, after deployment of the apparatus, wherein the training information comprises information associated with beam measurements by the one or more UEs, or feedback associated with one or more beam management procedures performed by the one or more UEs, or a combination thereof.\n27. An apparatus for wireless communication by a user equipment (UE), comprising:\nmeans for determining one or more beams to utilize for a beam management procedure using an adaptive learning algorithm, wherein using the adaptive learning algorithm includes outputting an action based on one or more inputs;\nmeans for performing the beam management procedure using the determined one or more beams;\nmeans for receiving feedback associated with the beam management procedure using the determined one or more beams, wherein the feedback is associated with the action; and\nmeans for updating the adaptive learning algorithm based on the feedback, wherein updating the adaptive learning algorithm based on the feedback includes adjusting one or more weights applied to the one or more inputs.\n28. A non-transitory computer readable medium storing computer executable code thereon for wireless communication by a user equipment (UE), comprising:\ncode for determining one or more beams to utilize for a beam management procedure using an adaptive learning algorithm, wherein using the adaptive learning algorithm includes outputting an action based on one or more inputs;\ncode for performing the beam management procedure using the determined one or more beams;\ncode for receiving feedback associated with the beam management procedure using the determined one or more beams, wherein the feedback is associated with the action; and\ncode for updating the adaptive learning algorithm based on the feedback, wherein updating the adaptive learning algorithm based on the feedback includes adjusting one or more weights applied to the one or more inputs."
}