{
    "patent_id": "US-10709362-B2",
    "title": "Analyte sensor ",
    "assignee": "Dexcom, Inc.",
    "publication_date": "2020-07-14",
    "patent_link": "https://patents.google.com/patent/US10709362B2/en",
    "inventors": [
        "Peter C. Simpson",
        "James H. Brauker",
        "Mark C. Brister",
        "Paul V. Goode, Jr.",
        "Apurv Ullas Kamath",
        "Aarthi Mahalingam",
        "Jack Pryor",
        "Matthew D. Wightlin"
    ],
    "classifications": [
        "A61B5/14532",
        "A61B17/3468",
        "A61B5/0002",
        "A61B5/0004",
        "A61B5/0031",
        "A61B5/05",
        "A61B5/1411",
        "A61B5/14503",
        "A61B5/14507",
        "A61B5/1451",
        "A61B5/14514",
        "A61B5/14546",
        "A61B5/1473",
        "A61B5/14735",
        "A61B5/1486",
        "A61B5/14865",
        "A61B5/1495",
        "A61B5/6801",
        "A61B5/6833",
        "A61B5/68335",
        "A61B5/6848",
        "A61B5/6849",
        "A61B5/72",
        "A61B2017/3492",
        "A61B2560/0223",
        "A61B2560/045",
        "A61B2560/063",
        "A61B2562/18",
        "A61B5/14",
        "A61B5/145",
        "A61B5/1468",
        "A61B5/150022",
        "A61M2005/1585",
        "A61M5/14244",
        "A61M5/1723",
        "Y02A90/10",
        "Y02A90/26"
    ],
    "abstract": "The present invention relates generally to systems and methods for measuring an analyte in a host. More particularly, the present invention relates to systems and methods for transcutaneous measurement of glucose in a host.",
    "claims": "\n1. A system for measuring a glucose concentration in a host, the system comprising:\na transcutaneous glucose sensor configured to provide sensor data indicative of a glucose concentration in a host;\nsensor electronics configured to operatively connect to the transcutaneous analyte sensor; and\na processor configured to calibrate the sensor data based on predetermined calibration information, wherein the predetermined calibration information is obtained prior to implantation, wherein the predetermined calibration information is derived at least in part from a batch of sensors meeting a predetermined limit of sensor sensitivity variation, wherein the predetermined calibration information comprises one or both of predetermined baseline information and predetermined sensitivity information associated with the glucose sensor, and wherein the processor is configured to calibrate the sensor data without requiring reference data from a reference glucose monitor.\n2. The system of claim 1, wherein the calibration is based on a conversion function comprising a baseline value and a sensitivity value, and wherein the processor is configured to adjust the baseline value based on the predetermined baseline information.\n3. The system of claim 1, wherein the predetermined sensitivity information is derived from in vitro testing and is provided as a calibration code.\n4. The system of claim 1, further comprising:\na transmitter unit operably coupled to the glucose sensor, the transmitter unit having a radio frequency transmitter configured to wirelessly transmit sensor data; and\na receiver unit comprising a radio frequency receiver and a display, the radio frequency receiver configured to receive the transmitted sensor data and the display configured to display information based on the transmitted sensor data.\n5. A method for processing data from a transcutaneous glucose sensor, the method comprising:\nreceiving sensor data from the transcutaneous glucose sensor after the transcutaneous glucose sensor is implanted in a host, wherein the sensor data is indicative of a glucose concentration in the host;\nreceiving predetermined calibration information, wherein the predetermined calibration information is derived at least in part from a batch of sensors meeting a predetermined limit of sensor sensitivity variation, wherein the predetermined calibration information comprises one or both of predetermined baseline information and predetermined sensitivity information associated with the transcutaneous glucose sensor; and\ncalibrating, using a processor, the sensor data received from the transcutaneous glucose sensor based at least in part on the predetermined calibration information, wherein the calibrating is performed without reliance on reference data from a reference glucose monitor.\n6. The method of claim 5, wherein the calibrating is based on a conversion function comprising a sensitivity value and a baseline value, and wherein the method further comprises validating the conversion function based on at least one of the predetermined baseline information or the predetermined sensitivity information.\n7. The method of claim 6, further comprising determining an error if the validation fails.\n8. The method of claim 7, further comprising adjusting the conversion function if the validation fails.\n9. The method of claim 8, wherein adjusting the conversion function comprises adjusting the baseline value of the conversion function.\n10. The method of claim 9, wherein adjusting the baseline value is based on the predetermined baseline information.\n11. The method of claim 5, wherein the predetermined sensitivity information is derived from in vitro testing and is provided as a calibration code.\n12. The system of claim 1, wherein the calibration is based on a conversion function comprising a baseline value and a sensitivity value, and wherein the processor is configured to validate the conversion function based on at least one of the predetermined sensitivity information or the predetermined baseline information.\n13. The system of claim 12, wherein the processor is configured to detect an error if the validation fails.\n14. The system of claim 13, wherein the processor is configured to adjust the conversion function if the validation fails.\n15. The system of claim 14, wherein the processor is configured to adjust the conversion function by adjusting the baseline value of the conversion function."
}