{
    "patent_id": "US-11360509-B2",
    "title": "Electronic device having display and surrounding touch sensitive surfaces for user interface and control ",
    "assignee": "Apple Inc.",
    "publication_date": "2022-06-14",
    "patent_link": "https://patents.google.com/patent/US11360509B2/en",
    "inventors": [
        "Nicholas King",
        "Duncan Robert Kerr",
        "Paul Herbst",
        "Steven P. Hotelling"
    ],
    "classifications": [
        "G06F1/1626",
        "G06F1/1637",
        "G06F1/1643",
        "G06F1/169",
        "G06F3/03547",
        "G06F3/0412",
        "G06F3/044",
        "G06F3/04847",
        "G06F3/04883",
        "G06F3/04886",
        "G06F2200/1612",
        "G06F2203/0339",
        "G06F2203/04101",
        "G06F2203/04105",
        "G06F2203/04808",
        "G06F3/0445",
        "G06F3/0446"
    ],
    "abstract": "An electronic device has a display and has a touch sensitive bezel surrounding the display. Areas on the bezel are designated for controls used to operate the electronic device. Visual guides corresponding to the controls are displayed on the display adjacent the areas of the bezel designated for the controls. Touch data is generated by the bezel when a user touches an area of the bezel. The device determines which of the controls has been selected based on which designated area is associated with the touch data from the bezel. The device then initiates the determined control. The device can have a sensor for determining the orientation of the device. Based on the orientation, the device can alter the areas designated on the bezel for the controls and can alter the location of the visual guides for the display so that they match the altered areas on the bezel.",
    "claims": "\n1. An apparatus, comprising:\na touch screen located on a front surface of the apparatus;\na first touch sensitive region located on a side surface of the apparatus, the side surface adjacent to but non-planar with respect to the front surface, the first touch sensitive region providing one or more configurable control areas; and\na processor communicatively coupled to the touch screen and the first touch sensitive region, the processor configured for\ndisplaying one or more first images in a first region of the touch screen,\ndetecting a first touch at a first control area of the first touch sensitive region,\nupon detecting the first touch, configuring one or more areas in a second region of the touch screen as input areas, the one or more input areas correlated to a location of the first touch,\ndetecting one or more second touches at the one or more input areas in the second region, and\nperforming a first operation in response to the detected one or more second touches.\n2. The apparatus of claim 1, the processor further configured for displaying the first region and the second region adjacent to each other on the touch screen.\n3. The apparatus of claim 1, the processor further configured for locating the second region at an edge of the touch screen.\n4. The apparatus of claim 1, the processor further configured for detecting a gesture at the first control area of the first touch sensitive region, and upon detecting the gesture, designating the one or more areas in the second region of the touch screen as the input areas.\n5. The apparatus of claim 1, the processor further configured for detecting movement of an object over the first control area of the first touch sensitive region, and upon detecting the movement of the object, designating the one or more areas in the second region of the touch screen as the input areas.\n6. The apparatus of claim 1, the processor further configured for detecting a gesture at the one or more input areas of the second region, and performing the first operation in response to the detected gesture.\n7. The apparatus of claim 1, the processor further configured for detecting movement of an object at the one or more input areas of the second region, and performing the first operation in response to the detected movement.\n8. The apparatus of claim 1, the processor further configured for detecting a tap at the one or more input areas of the second region, and performing the first operation in response to the detected tap.\n9. The apparatus of claim 1, the processor further configured for re-designating a function of the one or more configurable control areas in the first touch sensitive region during operation of the apparatus.\n10. A method for performing operations on a hand-held device, comprising:\ndisplaying one or more first images in a first region of a touch screen located on a front surface of the device;\nproviding one or more configurable control areas at a first touch sensitive region located on a side surface of the device, the side surface adjacent to but non-planar with respect to the front surface;\ndetecting a first touch at a first control area of the first touch sensitive region;\nupon detecting the first touch, configuring one or more areas in a second region of the touch screen as input areas, the one or more input areas correlated to a location of the first touch;\ndetecting one or more second touches at the one or more input areas in the second region; and\nperforming a first operation in response to the detected one or more second touches.\n11. The method of claim 10, further comprising displaying the first region and the second region adjacent to each other on the touch screen.\n12. The method of claim 10, further comprising locating the second region at an edge of the touch screen.\n13. The method of claim 10, further comprising detecting a gesture at the first control area of the first touch sensitive region, and upon detecting the gesture, designating the one or more areas in the second region of the touch screen as the input areas.\n14. The method of claim 10, further comprising detecting movement of an object over the first control area of the first touch sensitive region, and upon detecting the movement of the object, designating the one or more areas in the second region of the touch screen as the input areas.\n15. The method of claim 10, further comprising detecting a gesture at the one or more input areas of the second region, and performing the first operation in response to the detected gesture.\n16. The method of claim 10, further comprising detecting movement of an object at the one or more input areas of the second region, and performing the first operation in response to the detected movement.\n17. The method of claim 10, further comprising detecting a tap at the one or more input areas of the second region, and performing the first operation in response to the detected tap.\n18. The method of claim 10, further comprising re-designating a function of the one or more configurable control areas in the first touch sensitive region during the performance of the operations.\n19. A non-transitory computer-readable storage medium having stored thereon instructions which, if executed by a specialized electronic device, causes the electronic device to perform a method comprising:\ndisplaying one or more first images in a first region of a touch screen located on a front surface of the device;\nproviding one or more configurable control areas at a first touch sensitive region located on a side surface of the device, the side surface adjacent to but non-planar with respect to the front surface;\ndetecting a first touch at a first control area of the first touch sensitive region;\nupon detecting the first touch, configuring one or more areas in a second region of the touch screen as input areas, the one or more input areas correlated to a location of the first touch;\ndetecting one or more second touches at the one or more input areas in the second region; and\nperforming a first operation in response to the detected one or more second touches.\n20. The non-transitory computer-readable storage medium of claim 19, the method further comprising detecting a gesture at the first control area of the first touch sensitive region, and upon detecting the gesture, designating the one or more areas in the second region of the touch screen as the input areas."
}