{
    "patent_id": "US-10609061-B2",
    "title": "Anomaly detection using cognitive computing ",
    "assignee": "International Business Machines Corporation",
    "publication_date": "2020-03-31",
    "patent_link": "https://patents.google.com/patent/US10609061B2/en",
    "inventors": [
        "Sharon Hagi",
        "Gary I. Givental"
    ],
    "classifications": [
        "H04L63/1425",
        "G06F21/566",
        "G06N20/00",
        "G06N3/042",
        "G06N3/049",
        "G06N5/022",
        "G06N5/041",
        "H04L63/1416",
        "G06N20/10",
        "G06N20/20",
        "G06N3/044",
        "G06N3/045",
        "G06N3/088",
        "G06N3/126",
        "G06N5/01",
        "G06N5/025",
        "G06N5/048",
        "G06N7/01"
    ],
    "abstract": "An anomaly detection system configured to generate a plurality of tensors based on spatial attributes of a set of cybersecurity data and temporal attributes of the set of cybersecurity data. The set of cybersecurity data comprising numeric data and textual data collected from a plurality of computational sources. The anomaly detection system can provide the plurality of tensors to a Hierarchical Temporal Memory (HTM) network. The HTM network can be configured to generate respective HTM outputs for respective regions of the HTM network. The anomaly detection system can determine that at least one HTM output indicates an anomaly, convert the at least one HTM output to a notification, and provide the notification to a user interface.",
    "claims": "\n1. A computer-implemented method comprising:\ngenerating a plurality of tensors based on spatial attributes of a set of cybersecurity data and temporal attributes of the set of cybersecurity data, wherein the set of cybersecurity data comprises numeric data and textual data, and wherein the set of cybersecurity data is collected from a plurality of computational sources;\nproviding the plurality of tensors to a Hierarchical Temporal Memory (HTM) network, the HTM network configured to generate respective HTM outputs for respective regions of the HTM network, wherein respective outputs are based on active nodes for respective regions of the HTM network;\ndetermining that at least one HTM output indicates an anomaly;\nconverting the at least one HTM output to a notification; and\nproviding the notification to a user interface.\n2. The method according to claim 1, wherein the set of cybersecurity data comprises syslog data, firewall event log data, operating system log data, application log data, and device log data.\n3. The method according to claim 1, wherein the plurality of computational sources comprise a Security Information and Event Management (SIEM) system, a Simple Network Management Protocol (SNMP) trap, and an Intrusion Detection and Prevention System (IDPS).\n4. The method according to claim 1, wherein generating a plurality of tensors further comprises:\nclassifying the set of cybersecurity data into a numeric data subset and a textual data subset;\ngenerating at least a first Vector Space Model (VSM) based on the numeric data subset;\ngenerating at least a second VSM based on the textual data subset;\nstoring textual associations between the first VSM and the textual data subset, wherein textual associations indicate a textual value for a respective value of a respective component of the first VSM; and\nstoring numeric associations between the second VSM and the numeric data subset, wherein numeric associations indicate a property attribute for a respective component of the second VSM.\n5. The method according to claim 4, wherein generating a plurality of tensors further comprises:\ngenerating respective tensors based on respective VSMs; and\ngenerating at least one sparse distributed representation (SDR) based on at least one tensor.\n6. The method according to claim 5, wherein providing the plurality of tensors to a Hierarchical Temporal Memory (HTM) network further comprises:\ninputting at least one SDR to a first region of a first layer of the HTM network;\ninputting an output of the first region of the first layer of the HTM network to a second region of a second layer of the HTM network, wherein the second layer comprises fewer nodes than the first layer; and\ngenerating a HTM output based on a set of active nodes of at least the second region of the second layer of the HTM network.\n7. The method according to claim 6, wherein the notification comprises textual output and numeric output, wherein converting the HTM output to a notification further comprises:\ngenerating textual output based, at least in part, on the HTM output and the textual associations; and\ngenerating numeric output based, at least in part, on the HTM output and the numeric associations.\n8. The method according to claim 1, the method further comprising:\nperforming natural language processing on a query received from a user interface;\nidentifying a relevant portion of the HTM network based on the query;\nperforming natural language processing on a second output from the relevant portion of the HTM network to generate an answer to the query; and\npresenting the answer to the user interface.\n9. The method according to claim 8, wherein the answer comprises textual data, numeric data, and a confidence value.\n10. A computer-implemented method comprising:\nconverting, using machine learning algorithms in a feature extraction system, security data to a plurality of spatial-temporal multi-dimensional arrays, wherein the security data is collected from, at least in part, a security information and event management (SIEM) system functioning in a cybersecurity environment communicatively coupling a plurality of computational devices;\nwherein the plurality of spatial-temporal multi-dimensional arrays are based, at least in part, on at least one sequence of computational events associated with at least a portion of the plurality of computational devices;\nproviding the plurality of spatial-temporal multi-dimensional arrays to a three-dimensional integrated circuit (3DIC) executing a Hierarchical Temporal Memory (HTM) network;\nreceiving, at the feature extraction system and from the HTM network, at least one output multi-dimensional array based, at least in part, on active nodes in a respective region of the HTM network;\nidentifying, using machine learning algorithms in the feature extraction system, at least one anomaly based on the at least one output multi-dimensional array;\nreconfiguring, by the feature extraction system, at least one aspect of the cybersecurity environment in response to identifying the at least one anomaly; and\npresenting, by the feature extraction system and to a user interface communicatively coupled to the feature extraction system, a notification of the at least one anomaly.\n11. The method according to claim 10, wherein the security data comprises syslog data, firewall event log data, operating system log data, application log data, and device log data.\n12. The method according to claim 10, wherein the security data is further collected from, at least in part, a Simple Network Management Protocol (SNMP) trap and an Intrusion Detection and Prevention System (IDPS).\n13. The method according to claim 10, wherein converting the security data to a plurality of spatial-temporal multi-dimensional arrays further comprises:\nclassifying the security data into a numeric data subset and a textual data subset;\ngenerating a first Vector Space Model (VSM) based on the numeric data subset; and\ngenerating a second VSM based on the textual data subset.\n14. The method according to claim 13, wherein converting the security data to a plurality of spatial-temporal multi-dimensional arrays further comprises:\ngenerating respective spatial-temporal multi-dimensional arrays based on respective VSMs; and\ngenerating a sparse distributed representation (SDR) based on a spatial-temporal multi-dimensional array.\n15. The method according to claim 14, wherein providing the plurality of spatial-temporal multi-dimensional arrays to a Hierarchical Temporal Memory (HTM) network further comprises:\ninputting the SDR to a first region of a first layer of the HTM network;\ninputting an output of the first region of the first layer of the HTM network to a second region of a second layer of the HTM network, wherein the second layer comprises fewer nodes than the first layer; and\ngenerating a HTM output based on a set of active nodes of the second region of the second layer of the HTM network.\n16. The method according to claim 15, wherein converting the security data to a plurality of spatial-temporal multi-dimensional arrays further comprises:\nstoring textual associations between the first VSM and the textual data subset, wherein textual associations indicate a textual value for a respective value of a respective component of the first VSM; and\nstoring numeric associations between the second VSM and the numeric data subset, wherein numeric associations indicate a property attribute for a respective component of the second VSM;\nwherein the notification comprises textual output and numeric output, and wherein presenting the notification further comprises:\ngenerating textual output based, at least in part, on the HTM output and the textual associations; and\ngenerating numeric output based, at least in part, on the HTM output and the numeric associations.\n17. The method according to claim 10, the method further comprising:\nperforming natural language processing on a query received from the user interface;\nidentifying a relevant portion of the HTM network based on the query;\nperforming natural language processing on a second output from the relevant portion of the HTM network to generate an answer to the query; and\npresenting the answer to the user interface.\n18. The method according to claim 17, wherein the answer comprises textual data, numeric data, and a confidence value.\n19. The method according to claim 10, wherein the computer-implemented is performed according to instructions downloaded over a network from a remote data processing system.\n20. A computer-implemented method comprising:\ngenerating a plurality of tensors based on spatial attributes and temporal attributes of a set of cybersecurity data, wherein the set of cybersecurity data comprises syslog data, firewall event log data, operating system log data, application log data, and device log data, and wherein the set of cybersecurity data is collected from a Security Information and Event Management (STEM) system, a Simple Network Management Protocol (SNMP) trap, and an Intrusion Detection and Prevention System (IDPS);\nproviding the plurality of tensors to a Hierarchical Temporal Memory (HTM) network implemented on a three-dimensional integrated circuit (3DIC);\ndetermining that an HTM output of the HTM network indicates an anomaly in the set of cybersecurity data;\nconverting the HTM output to a notification; and\nproviding the notification to a user interface."
}