{
    "patent_id": "US-11195520-B2",
    "title": "Always-on keyword detector ",
    "assignee": "Syntiant",
    "publication_date": "2021-12-07",
    "patent_link": "https://patents.google.com/patent/US11195520B2/en",
    "inventors": [
        "Kurt F. Busch",
        "Jeremiah H. Holleman, III",
        "Pieter Vorenkamp",
        "Stephen W. Bailey"
    ],
    "classifications": [
        "G06N3/08",
        "G06N20/20",
        "G06N3/0635",
        "G06N3/065",
        "G06N3/105",
        "G10L15/16",
        "G10L15/22",
        "G10L15/28",
        "G10L2015/088",
        "G10L2015/223"
    ],
    "abstract": "Provided herein is an integrated circuit including, in some embodiments, a special-purpose host processor, a neuromorphic co-processor, and a communications interface between the host processor and the co-processor configured to transmit information therebetween. The special-purpose host processor is operable as a stand-alone host processor. The neuromorphic co-processor includes an artificial neural network. The co-processor is configured to enhance special-purpose processing of the host processor through the artificial neural network. In such embodiments, the host processor is a keyword identifier processor configured to transmit one or more detected words to the co-processor over the communications interface. The co-processor is configured to transmit recognized words, or other sounds, to the host processor.",
    "claims": "\n1. An integrated circuit for detecting keywords, comprising:\na keyword identifier host processor configured to identify one or more words within a received data stream;\na co-processor comprising an artificial neural network configured to identify one or more desired keywords among the one or more words received from the host processor; and\nan interface between the host processor and the co-processor configured to transmit information therebetween.\n2. The integrated circuit of claim 1, wherein the co-processor includes a database comprised of known keywords whereby the one or more desired keywords may be utilized by the co-processor.\n3. The integrated circuit of claim 2, wherein new keywords may be added to the database and distinguished from existing keywords.\n4. The integrated circuit of claim 1, wherein the integrated circuit is configured to operate on current leakage from a power source.\n5. A method for detecting keywords within a data stream, comprising:\nreceiving the data stream in the form of electrical signals to a host processor;\ntransmitting the electrical signals from the host processor to a co-processor;\nidentifying one or more desired keywords within the electrical signals via a neural network within the co-processor;\ntransmitting the one or more desired keywords from the co-processor to the host processor; and\ngenerating one or more output signals from the host processor upon receiving the one or more identified desired keywords from the co-processor.\n6. The method of claim 5, wherein the co-processor further includes a database of known keywords utilized to identify electrical signals corresponding to one or more keywords.\n7. The method of claim 5, wherein the one or more keywords are comprised of a plurality of predefined acoustic signals other than speech.\n8. An integrated circuit, comprising:\na host processor;\na co-processor including an artificial neural network configured to enhance the processing of the host processor; and\nan interface between the host processor and the co-processor configured to transmit information therebetween.\n9. The integrated circuit of claim 8, wherein the host processor is a pattern signal identifier processor configured to transmit a data stream in the form of electrical signals to the co-processor over the interface, and wherein the co-processor is configured to enhance the processing of the host processor by providing one or more detected patterns within the pattern signal to the host processor over the interface.\n10. The integrated circuit of claim 9, wherein the interface between the host processor and the co-processor is a serial peripheral interface (“SPI”) bus or inter-integrated circuit (“I2C”) bus.\n11. The integrated circuit of claim 10, wherein the artificial neural network is disposed in an analog multiplier array of a number of two-quadrant multipliers in a memory sector of the integrated circuit.\n12. The integrated circuit of claim 11, wherein synaptic weights of the artificial neural network are stored in firmware of the integrated circuit, and wherein the firmware is configured to receive updates to the synaptic weights of the artificial neural network.\n13. The integrated circuit of claim 12, wherein the integrated circuit is configured to operate on battery power.\n14. An integrated circuit for pattern recognition, comprising:\na host processor configured to identify one or more pattern signals within a received data stream and transmit the one or more pattern signals to a co-processor;\nan artificial neural network within the co-processor configured to recognize one or more pre-selected patterns among the one or more pattern signals received from the host processor; and\nan interface between the host processor and the co-processor configured to transmit information therebetween.\n15. The integrated circuit of claim 14, wherein the integrated circuit is configured to operate on battery power.\n16. The integrated circuit of claim 15, wherein the integrated circuit is configured to remain in a low-power, always-on state whereby the integrated circuit remains continuously ready to receive the data stream.\n17. The integrated circuit of claim 14, wherein the host processor is configured to generate an output signal upon detection of the one or more desired sounds.\n18. The integrated circuit of claim 14, wherein the data stream comprises data associated with a received audio signal.\n19. The integrated circuit of claim 14, wherein the integrated circuit is configured to be powered by current leakage from a power source.\n20. The integrated circuit of claim 14, wherein the integrated circuit is configured to remain in a fully aware state to receive the data stream.\n21. The integrated circuit of claim 14, wherein the co-processor includes a database comprised of known patterns whereby the one or more pre-selected patterns may be identified among the one or more pattern signals."
}