{
    "patent_id": "US-11086507-B2",
    "title": "Unlocking a device by performing gestures on an unlock image ",
    "assignee": "Apple Inc.",
    "publication_date": "2021-08-10",
    "patent_link": "https://patents.google.com/patent/US11086507B2/en",
    "inventors": [
        "Imran Chaudhri",
        "Bas Ording",
        "Freddy Allen Anzures",
        "Marcel van Os",
        "Scott Forstall",
        "Greg Christie"
    ],
    "classifications": [
        "G06F3/0488",
        "H04M1/67",
        "G06F21/36",
        "G06F3/017",
        "G06F3/0484",
        "G06F3/04842",
        "G06F3/04883",
        "H04M1/663",
        "H04M1/575",
        "H04M2250/22"
    ],
    "abstract": "A device with a touch-sensitive display may be unlocked via gestures performed on the touch-sensitive display. The device is unlocked if contact with the display corresponds to a predefined gesture for unlocking the device. The device displays one or more unlock images with respect to which the predefined gesture is to be performed in order to unlock the device. The performance of the predefined gesture with respect to the unlock image may include moving the unlock image to a predefined location and/or moving the unlock image along a predefined path. The device may also display visual cues of the predefined gesture on the touch screen to remind a user of the gesture.",
    "claims": "\n1. An electronic device, comprising:\na touch-sensitive display;\none or more processors; and\nmemory storing one or more programs configured to be executed by the one or more processors, the one or more programs including instructions for:\nwhile the electronic device is in a first user-interface state that includes displaying a graphical object on the touch-sensitive display, detecting progress towards satisfaction of a user input condition for transitioning the electronic device to a second user-interface state;\nwhile the electronic device is in the first user-interface state that includes displaying the graphical object on the touch-sensitive display, indicating progress towards satisfaction of the user input condition by transitioning an optical intensity of the graphical object displayed on the touch-sensitive display; and\ntransitioning the electronic device to the second user-interface state if the user input condition is satisfied.\n2. The electronic device of claim 1, wherein the graphical object is a user interface associated with the first user-interface state or the second user-interface state.\n3. The electronic device of claim 1, wherein satisfying the user input condition includes detecting contact with the touch-sensitive display that corresponds to a predefined gesture.\n4. The electronic device of claim 1, wherein satisfying the user input condition includes:\ndisplaying an image on the touch-sensitive display; and\ndetecting contact with the touch-sensitive display that corresponds to a predefined gesture with respect to the image.\n5. The electronic device of claim 1, wherein satisfying the user input condition includes:\ndisplaying an image on the touch-sensitive display; and\ndetecting contact with the touch-sensitive display corresponding to moving the image to a predefined location on the touch-sensitive display.\n6. The electronic device of claim 1, wherein satisfying the user input condition includes:\ndisplaying an image on the touch-sensitive display; and\ndetecting contact with the touch-sensitive display corresponding to moving the image along a predefined path on the touch-sensitive display.\n7. The electronic device of claim 1, wherein satisfying the user input condition includes:\ndisplaying a plurality of images on the touch-sensitive display; and\ndetecting contact with the touch-sensitive display that corresponds to a predefined gesture with respect to one of the plurality of images.\n8. The electronic device of claim 1, wherein transitioning the optical intensity includes the graphical object increasing in optical intensity.\n9. The electronic device of claim 1, wherein the first user-interface state is for a first application and the second user-interface state is for a second application that is different from the first application.\n10. The electronic device of claim 1, wherein the first user-interface state is a lock state of the electronic device and the second user-interface state is an unlock state of the electronic device.\n11. The electronic device of claim 1, wherein the graphical object is associated with the first user-interface state.\n12. The electronic device of claim 1, wherein the graphical object is associated with the second user-interface state.\n13. The electronic device of claim 1, wherein transitioning the optical intensity of the graphical object displayed on the touch-sensitive display includes fading out a user interface associated with the first user-interface state.\n14. The electronic device of claim 1, wherein transitioning the optical intensity of the graphical object displayed on the touch-sensitive display includes fading in a user interface associated with the second user-interface state.\n15. The electronic device of claim 1, wherein transitioning the optical intensity of the graphical object includes decreasing the optical intensity of the graphical object.\n16. The electronic device of claim 1, wherein transitioning the optical intensity of the graphical object includes increasing the optical intensity of the graphical object.\n17. The electronic device of claim 1, wherein the graphical object is not displayed prior to detecting progress towards satisfaction of the user input condition.\n18. The electronic device of claim 1, wherein the optical intensity of the graphical object is a function of completion of the user input condition.\n19. The electronic device of claim 1, wherein:\nthe graphical object has a first optical intensity that corresponds to a first percentage of completion of the user input condition;\nthe graphical object has a second optical intensity that corresponds a second percentage of completion of the user input condition, the second optical intensity different than the first optical intensity, and wherein the second percentage of completion is different than the first percentage of completion; and\nthe graphical object has a third optical intensity that corresponds a third percentage of completion of the user input condition, the third optical intensity different than the first optical intensity and the second optical intensity, and wherein the third percentage of completion is different than the first percentage of completion and the second percentage of completion.\n20. The electronic device of claim 1, wherein the optical intensity of the graphical object is at an initial level prior to detecting progress toward satisfaction of the user input condition;\nthe one or more programs including instructions for:\nafter indicating progress towards satisfaction of the user input condition by transitioning the optical intensity of the graphical object displayed on the touch-sensitive display, returning the optical intensity of the graphical object to the initial level based on detecting a failure to satisfy the user input condition.\n21. A method, comprising:\nat an electronic device with a touch-sensitive display:\nwhile the electronic device is in a first user-interface state that includes displaying a graphical object on the touch-sensitive display, detecting progress towards satisfaction of a user input condition for transitioning the electronic device to a second user-interface state;\nwhile the electronic device is in the first user-interface state that includes displaying the graphical object on the touch-sensitive display, indicating progress towards satisfaction of the user input condition by transitioning an optical intensity of the graphical object displayed on the touch-sensitive display; and\ntransitioning the electronic device to the second user-interface state if the user input condition is satisfied.\n22. The method of claim 21, wherein the graphical object is a user interface associated with the first user-interface state or the second user-interface state.\n23. The method of claim 21, wherein satisfying the user input condition includes detecting contact with the touch-sensitive display that corresponds to a predefined gesture.\n24. The method of claim 21, wherein satisfying the user input condition includes:\ndisplaying an image on the touch-sensitive display; and\ndetecting contact with the touch-sensitive display that corresponds to a predefined gesture with respect to the image.\n25. The method of claim 21, wherein satisfying the user input condition includes:\ndisplaying an image on the touch-sensitive display; and\ndetecting contact with the touch-sensitive display corresponding to moving the image to a predefined location on the touch-sensitive display.\n26. The method of claim 21, wherein satisfying the user input condition includes:\ndisplaying an image on the touch-sensitive display; and\ndetecting contact with the touch-sensitive display corresponding to moving the image along a predefined path on the touch-sensitive display.\n27. The method of claim 21, wherein satisfying the user input condition includes:\ndisplaying a plurality of images on the touch-sensitive display; and\ndetecting contact with the touch-sensitive display that corresponds to a predefined gesture with respect to one of the plurality of images.\n28. The method of claim 21, wherein transitioning the optical intensity includes the graphical object increasing in optical intensity.\n29. The method of claim 21, wherein the first user-interface state is for a first application and the second user-interface state is for a second application that is different from the first application.\n30. The method of claim 21, wherein the first user-interface state is a lock state of the electronic device and the second user-interface state is an unlock state of the electronic device.\n31. The method of claim 21, wherein the graphical object is associated with the first user-interface state.\n32. The method of claim 21, wherein the graphical object is associated with the second user-interface state.\n33. The method of claim 21, wherein transitioning the optical intensity of the graphical object displayed on the touch-sensitive display includes fading out a user interface associated with the first user-interface state.\n34. The method of claim 21, wherein transitioning the optical intensity of the graphical object displayed on the touch-sensitive display includes fading in a user interface associated with the second user-interface state.\n35. The method of claim 21, wherein transitioning the optical intensity of the graphical object includes decreasing the optical intensity of the graphical object.\n36. The method of claim 21, wherein transitioning the optical intensity of the graphical object includes increasing the optical intensity of the graphical object.\n37. The method of claim 21, wherein the graphical object is not displayed prior to detecting progress towards satisfaction of the user input condition.\n38. The method of claim 21, wherein the optical intensity of the graphical object is a function of completion of the user input condition.\n39. The method of claim 21, wherein:\nthe graphical object has a first optical intensity that corresponds to a first percentage of completion of the user input condition;\nthe graphical object has a second optical intensity that corresponds to a second percentage of completion of the user input condition, the second optical intensity different than the first optical intensity, and wherein the second percentage of completion is different than the first percentage of completion; and\nthe graphical object has a third optical intensity that corresponds a third percentage of completion of the user input condition for transitioning the electronic device, the third optical intensity different than the first optical intensity and the second optical intensity, and wherein the third percentage of completion is different than the first percentage of completion and the second percentage of completion.\n40. The method of claim 21, wherein the optical intensity of the graphical object is at an initial level prior to detecting progress toward satisfaction of the user input condition;\nthe one or more programs including instructions for:\nafter indicating progress towards satisfaction of the user input condition by transitioning the optical intensity of the graphical object displayed on the touch-sensitive display, returning the optical intensity of the graphical object to the initial level based on detecting a failure to satisfy the user input condition.\n41. A non-transitory computer-readable storage medium storing one or more programs configured to be executed by one or more processors of an electronic device with a touch-sensitive display, the one or more programs including instructions for:\nwhile the electronic device is in a first user-interface state that includes displaying a graphical object on the touch-sensitive display, detecting progress towards satisfaction of a user input condition for transitioning the electronic device to a second user-interface state;\nwhile the electronic device is in the first user-interface state that includes displaying the graphical object on the touch-sensitive display, indicating progress towards satisfaction of the user input condition by transitioning an optical intensity of the graphical object displayed on the touch-sensitive display; and\ntransitioning the electronic device to the second user-interface state if the user input condition is satisfied.\n42. The non-transitory computer-readable storage medium of claim 41, wherein the graphical object is a user interface associated with the first user-interface state or the second user-interface state.\n43. The non-transitory computer-readable storage medium of claim 41, wherein satisfying the user input condition includes detecting contact with the touch-sensitive display that corresponds to a predefined gesture.\n44. The non-transitory computer-readable storage medium of claim 41, wherein satisfying the user input condition includes:\ndisplaying an image on the touch-sensitive display; and\ndetecting contact with the touch-sensitive display that corresponds to a predefined gesture with respect to the image.\n45. The non-transitory computer-readable storage medium of claim 41, wherein satisfying the user input condition includes:\ndisplaying an image on the touch-sensitive display; and\ndetecting contact with the touch-sensitive display corresponding to moving the image to a predefined location on the touch-sensitive display.\n46. The non-transitory computer-readable storage medium of claim 41, wherein satisfying the user input condition includes:\ndisplaying an image on the touch-sensitive display; and\ndetecting contact with the touch-sensitive display corresponding to moving the image along a predefined path on the touch-sensitive display.\n47. The non-transitory computer-readable storage medium of claim 41, wherein satisfying the user input condition includes:\ndisplaying a plurality of images on the touch-sensitive display; and\ndetecting contact with the touch-sensitive display that corresponds to a predefined gesture with respect to one of the plurality of images.\n48. The non-transitory computer-readable storage medium of claim 41, wherein transitioning the optical intensity includes the graphical object increasing in optical intensity.\n49. The non-transitory computer-readable storage medium of claim 41, wherein the first user-interface state is for a first application and the second user-interface state is for a second application that is different from the first application.\n50. The non-transitory computer-readable storage medium of claim 41, wherein the first user-interface state is a lock state of the electronic device and the second user-interface state is an unlock state of the electronic device.\n51. The non-transitory computer-readable storage medium of claim 41, wherein the graphical object is associated with the first user-interface state.\n52. The non-transitory computer-readable storage medium of claim 41, wherein the graphical object is associated with the second user-interface state.\n53. The non-transitory computer-readable storage medium of claim 41, wherein transitioning the optical intensity of the graphical object displayed on the touch-sensitive display includes fading out a user interface associated with the first user-interface state.\n54. The non-transitory computer-readable storage medium of claim 41, wherein transitioning the optical intensity of the graphical object displayed on the touch-sensitive display includes fading in a user interface associated with the second user-interface state.\n55. The non-transitory computer-readable storage medium of claim 41, wherein transitioning the optical intensity of the graphical object includes decreasing the optical intensity of the graphical object.\n56. The non-transitory computer-readable storage medium of claim 41, wherein transitioning the optical intensity of the graphical object includes increasing the optical intensity of the graphical object.\n57. The non-transitory computer-readable storage medium of claim 41, wherein the graphical object is not displayed prior to detecting progress towards satisfaction of the user input condition.\n58. The non-transitory computer-readable storage medium of claim 41, wherein the optical intensity of the graphical object is a function of completion of the user input condition.\n59. The non-transitory computer-readable storage medium of claim 41, wherein:\nthe graphical object has a first optical intensity that corresponds to a first percentage of completion of the user input condition;\nthe graphical object has a second optical intensity that corresponds to a second percentage of completion of the user input condition, the second optical intensity different than the first optical intensity, and wherein the second percentage of completion is different than the first percentage of completion; and\nthe graphical object has a third optical intensity that corresponds a third percentage of completion of the user input condition for transitioning the electronic device, the third optical intensity different than the first optical intensity and the second optical intensity, and wherein the third percentage of completion is different than the first percentage of completion and the second percentage of completion.\n60. The non-transitory computer-readable storage medium of claim 41, wherein the optical intensity of the graphical object is at an initial level prior to detecting progress toward satisfaction of the user input condition;\nthe one or more programs including instructions for:\nafter indicating progress towards satisfaction of the user input condition by transitioning the optical intensity of the graphical object displayed on the touch-sensitive display, returning the optical intensity of the graphical object to the initial level based on detecting a failure to satisfy the user input condition."
}