{
    "patent_id": "US-11625139-B2",
    "title": "Ancestry painting ",
    "assignee": "23Andme, Inc.",
    "publication_date": "2023-04-11",
    "patent_link": "https://patents.google.com/patent/US11625139B2/en",
    "inventors": [
        "John Michael Macpherson",
        "Brian Thomas Naughton",
        "Joanna Louise Mountain"
    ],
    "classifications": [
        "G06N20/00",
        "G06F11/0793",
        "G06F16/29",
        "G06F3/04812",
        "G06F3/0484",
        "G06N5/022",
        "G06N5/04",
        "G06N7/01",
        "G16B20/00",
        "G16B20/20",
        "G16B20/40",
        "G16B30/00",
        "G16B40/00",
        "G16B40/20",
        "G16B40/30",
        "G16B45/00",
        "G16H10/60"
    ],
    "abstract": "Displaying an indication of ancestral data is disclosed. An indication that a genetic interval corresponds to a reference interval that has a likelihood of having one or more ancestral origins is received. One or more graphic display parameters are determined based at least in part on the indication. An indication of the one or more ancestral origins is visually displayed using the one or more graphic display parameters.",
    "claims": "\n1. A computer-implemented method comprising:\nobtaining genetic data of an individual;\ndetermining that a genetic interval of the genetic data for a particular chromosome matches a reference genetic interval for the particular chromosome, wherein the reference genetic interval has a likelihood of having one or more ancestral origins;\ndetermining graphic display parameters corresponding to each of the one or more ancestral origins;\ngenerating, for display on a graphical user interface, a representation of the particular chromosome with the genetic interval indicating the one or more ancestral origins in accordance with the graphic display parameters; and\nproviding, to the graphical user interface, the representation of the particular chromosome.\n2. The computer-implemented method of claim 1, wherein the particular chromosome is an autosomal chromosome, and wherein the graphical user interface also includes representations of one or more additional autosomal chromosomes with additional genetic intervals thereof indicating the one or more ancestral origins in accordance with the graphic display parameters.\n3. The computer-implemented method of claim 2, wherein the graphical user interface also includes representations of X or Y chromosomes with further genetic intervals thereof indicating the one or more ancestral origins in accordance with the graphic display parameters.\n4. The computer-implemented method of claim 2, wherein the particular chromosome and the one or more additional autosomal chromosomes are presented in numeric order on the graphical user interface.\n5. The computer-implemented method of claim 1, wherein the particular chromosome is an X or Y chromosome.\n6. The computer-implemented method of claim 1, wherein the representation of the particular chromosome includes an additional genetic interval that has not been genotyped, and wherein the representation of the particular chromosome indicates the additional genetic interval that has not been genotyped in accordance with the graphic display parameters.\n7. The computer-implemented method of claim 1, wherein the representation of the particular chromosome is linear.\n8. The computer-implemented method of claim 1, wherein the representation of the particular chromosome includes: a first portion of the genetic interval indicating ancestral origins of the individual's mother in accordance with the graphic display parameters, and a second portion of the genetic interval indicating ancestral origins of the individual's father in accordance with the graphic display parameters.\n9. The computer-implemented method of claim 1, wherein the graphic display parameters comprise colors representing the one or more ancestral origins.\n10. The computer-implemented method of claim 1, wherein the one or more ancestral origins each correspond to a different geographic area.\n11. The computer-implemented method of claim 1, wherein the reference genetic interval is assigned the likelihood of having the one or more ancestral origins based on the reference genetic interval being in a database of genetic interval frequencies for a population of individuals of known ancestral origins.\n12. The computer-implemented method of claim 11, wherein the likelihood of having the one or more ancestral origins is based on a ratio of a largest of the genetic interval frequencies for the reference genetic interval to a second largest of the genetic interval frequencies for the reference genetic interval.\n13. The computer-implemented method of claim 11, wherein the likelihood of having the one or more ancestral origins is above a threshold value.\n14. The computer-implemented method of claim 1, wherein the graphical user interface also represents the one or more ancestral origins in a hierarchical form.\n15. A non-transitory computer-readable medium storing program instructions that, when executed by one or more processors of a computing system, cause the computing system to perform operations comprising:\nobtaining genetic data of an individual;\ndetermining that a genetic interval of the genetic data for a particular chromosome matches a reference genetic interval for the particular chromosome, wherein the reference genetic interval has a likelihood of having one or more ancestral origins;\ndetermining graphic display parameters corresponding to each of the one or more ancestral origins;\ngenerating, for display on a graphical user interface, a representation of the particular chromosome with the genetic interval indicating the one or more ancestral origins in accordance with the graphic display parameters; and\nproviding, to the graphical user interface, the representation of the particular chromosome.\n16. The non-transitory computer-readable medium of claim 15, wherein the particular chromosome is an autosomal chromosome, and wherein the graphical user interface also includes representations of one or more additional autosomal chromosomes with additional genetic intervals thereof indicating the one or more ancestral origins in accordance with the graphic display parameters.\n17. The non-transitory computer-readable medium of claim 16, wherein the graphical user interface also includes representations of X or Y chromosomes with further genetic intervals thereof indicating the one or more ancestral origins in accordance with the graphic display parameters.\n18. The non-transitory computer-readable medium of claim 15, wherein the representation of the particular chromosome includes: a first portion of the genetic interval indicating ancestral origins of the individual's mother in accordance with the graphic display parameters, and a second portion of the genetic interval indicating ancestral origins of the individual's father in accordance with the graphic display parameters.\n19. The non-transitory computer-readable medium of claim 15, wherein the reference genetic interval is assigned the likelihood of having the one or more ancestral origins based on the reference genetic interval being in a database of genetic interval frequencies for a population of individuals of known ancestral origins.\n20. A computing system comprising:\na processor;\nmemory; and\nprogram instructions, stored in the memory, that upon execution by the processor cause the computing system to perform operations comprising:\nobtaining genetic data of an individual;\ndetermining that a genetic interval of the genetic data for a particular chromosome matches a reference genetic interval for the particular chromosome, wherein the reference genetic interval has a likelihood of having one or more ancestral origins;\ndetermining graphic display parameters corresponding to each of the one or more ancestral origins;\ngenerating, for display on a graphical user interface, a representation of the particular chromosome with the genetic interval indicating the one or more ancestral origins in accordance with the graphic display parameters; and\nproviding, to the graphical user interface, the representation of the particular chromosome."
}