{
    "patent_id": "US-11559301-B2",
    "title": "Surgical stapling device ",
    "assignee": "Covidien Lp",
    "publication_date": "2023-01-24",
    "patent_link": "https://patents.google.com/patent/US11559301B2/en",
    "inventors": [
        "David Racenet",
        "Lee Ann Olson",
        "Ralph Stearns",
        "Philip Roy",
        "John Beardsley"
    ],
    "classifications": [
        "A61B17/068",
        "A61B17/0644",
        "A61B17/07207",
        "A61B17/105",
        "A61B34/71",
        "A61B2017/0688",
        "A61B2017/07214",
        "A61B2017/07278",
        "A61B2017/07285",
        "A61B2017/291",
        "A61B2017/2923",
        "A61B2017/2927",
        "A61B2017/2931",
        "A61B2017/320052",
        "A61B2090/0811"
    ],
    "abstract": "A surgical device is disclosed which includes a handle portion, a central body portion and a SULU. The SULU includes a proximal body portion, an intermediate pivot member and a tool assembly. The intermediate pivot member is pivotally secured to the proximal body portion about a first pivot axis and the tool assembly is pivotally secured to the intermediate pivot member about a second pivot axis which is orthogonal to the first pivot axis. The SULU includes a plurality of articulation links which are operably connected to the tool assembly by non-rigid links. The articulation links are adapted to releasably engage articulation links positioned in the central body portion. The body portion articulation links are connected to an articulation actuator which is supported for omni-directional movement to effect articulation of the tool assembly about the first and second axes. The handle portion includes a spindle and barrel assembly drive mechanism for advancing and retracting a drive member positioned in the tool assembly. In one embodiment, the tool assembly includes a cartridge assembly having a plurality of staples and an anvil assembly.",
    "claims": "\n1. A loading unit for a surgical stapling device, the loading unit comprising:\nan elongate body; and\na tool assembly pivotally connected to the elongate body, the tool assembly including an anvil assembly;\na cartridge assembly pivotally secured relative to the anvil assembly, the cartridge assembly including a support channel having a distal end and a staple cartridge received within the support channel, the staple cartridge supporting a plurality of staples and defining a longitudinal axis;\na clamping member slidably disposed along the anvil assembly and the cartridge assembly and moveable along the longitudinal axis from a first position to a second position;\na first cable configured to advance the clamping member along the anvil and cartridge assemblies from the first position to the second position; and\na second cable configured to retract the clamping member along the anvil and cartridge assemblies, wherein retraction of the first cable advances the clamping member from the first position to the second position and retraction of the second cable retracts the clamping member from the second position to the first position.\n2. The loading unit of claim 1, wherein advancement of the clamping member from the first position to the second position causes an ejection of the plurality of staples from the cartridge assembly.\n3. The loading unit of claim 1, wherein the clamping member includes a knife.\n4. The loading unit of claim 1, wherein the clamping member defines a first opening for receiving the first cable and a second opening for receiving the second opening.\n5. The loading unit of claim 1, wherein the first cable extends through the elongate body.\n6. The loading unit of claim 5, wherein the second cable extends through the elongate body.\n7. The loading unit of claim 1, further including a guide cap defining at least one track and a central opening, wherein the first cable is received through the central opening and within the at least one track.\n8. The loading unit of claim 7, wherein the guide cap is disposed on the distal end of the support channel.\n9. The loading unit of claim 1, further including a sled disposed distal of the clamping member.\n10. The loading unit of claim 1, wherein advancement of the clamp member from the first position to the second position causes the anvil and cartridge assemblies to move from an open configuration to a closed configuration.\n11. The loading unit of claim 10, wherein retraction of the clamp member from the first position to the second position causes the anvil and cartridge assemblies to move from the closed configuration to the open configuration.\n12. A tool assembly comprising:\nan anvil assembly;\na cartridge assembly pivotally secured relative to the anvil assembly, the cartridge assembly including a support channel having a distal end and a staple cartridge received within the support channel, the staple cartridge supporting a plurality of staples and defining a longitudinal axis;\na clamping member slidably disposed along the anvil assembly and the cartridge assembly and moveable along the longitudinal axis from a first position to a second position;\na first cable configured to advance the clamping member along the anvil and cartridge assemblies from the first position to the second position; and\na second cable configured to retract the clamping member along the anvil and cartridge assemblies, wherein retraction of the first cable advances the clamping member from the first position to the second position and retraction of the second cable retracts the clamping member from the second position to the first position.\n13. The tool assembly of claim 12, wherein advancement of the clamping member from the first position to the second position causes an ejection of the plurality of staples from the cartridge assembly.\n14. The tool assembly of claim 12, wherein the clamping member includes a knife.\n15. The tool assembly of claim 12, wherein the clamping member defines a first opening for receiving the first cable and a second opening for receiving the second cable.\n16. The tool assembly of claim 12, further including a guide cap defining at least one track and a central opening, wherein the first cable is received through the central opening and within the at least one track.\n17. The tool assembly of claim 16, wherein the guide cap is disposed on the distal end of the support channel.\n18. The tool assembly of claim 12, further including a sled disposed distal of the clamping member.\n19. The tool assembly of claim 12, wherein advancement of the clamp member from the first position to the second position causes the anvil and cartridge assemblies to move from an open configuration to a closed configuration.\n20. The tool assembly of claim 19, wherein retraction of the clamp member from the first position to the second position causes the anvil and cartridge assemblies to move from the closed configuration to the open configuration."
}