{
    "patent_id": "US-11530454-B2",
    "title": "Detecting mutations and ploidy in chromosomal segments ",
    "assignee": "Natera, Inc.",
    "publication_date": "2022-12-20",
    "patent_link": "https://patents.google.com/patent/US11530454B2/en",
    "inventors": [
        "Joshua Babiarz",
        "Tudor Pompiliu Constantin",
        "Lane A. Eubank",
        "George Gemelos",
        "Matthew Micah Hill",
        "Huseyin Eser Kirkizlar",
        "Matthew Rabinowitz",
        "Onur Sakarya",
        "Styrmir Sigurjonsson",
        "Bernhard Zimmermann"
    ],
    "classifications": [
        "C12Q1/6869",
        "C12Q1/6886",
        "C12Q1/6806",
        "G06N20/00",
        "G06N7/005",
        "G06N7/01",
        "G16B15/00",
        "G16B20/00",
        "G16B20/10",
        "G16B20/20",
        "G16B25/00",
        "G16B40/00",
        "G16B40/20",
        "G16H10/40",
        "G16H50/20",
        "G16Z99/00",
        "C12Q2539/10",
        "C12Q2600/156",
        "C12Q2600/158",
        "C12Q2600/16",
        "C12Q2600/172",
        "G16B25/20"
    ],
    "abstract": "The invention provides methods, systems, and computer readable medium for detecting ploidy of chromosome segments or entire chromosomes, for detecting single nucleotide variants and for detecting both ploidy of chromosome segments and single nucleotide variants. In some aspects, the invention provides methods, systems, and computer readable medium for detecting cancer or a chromosomal abnormality in a gestating fetus.",
    "claims": "\n1. A method for preparing a plasma sample of a subject having cancer or suspected of having cancer useful for detecting one or more single nucleotide variant (SNV) mutations in the plasma sample, the method comprising:\nperforming whole exome sequencing or whole genome sequencing on a tumor sample of the subject to identify a plurality of tumor-specific SNV mutations;\nperforming targeted multiplex amplification to amplify 10 to 500 target loci each encompassing a different tumor-specific SNV mutation from cell-free DNA isolated from a plasma sample of the subject or DNA derived therefrom to obtain amplicons having a length of 50-150 bases, wherein the target loci are amplified together in the same reaction volume; and\nsequencing the amplicons to obtain sequence reads, and detecting one or more of the tumor-specific SNV mutations present in the cell-free DNA from the sequence reads, wherein the sequencing has a depth of read of at least 50,000 per target locus.\n2. The method of claim 1, wherein the cell-free DNA comprises circulating tumor DNA.\n3. The method of claim 1, wherein the SNV mutations comprise one or more clonal SNV mutations.\n4. The method of claim 1, wherein the SNV mutations comprise one or more subclonal SNV mutations.\n5. The method of claim 1, wherein the SNV mutations comprise one or more clonal SNV mutations and one or more subclonal SNV mutations.\n6. The method of claim 1, wherein the tumor sample of the subject is a tumor tissue sample.\n7. The method of claim 1, wherein the method further comprises determining clonal heterogeneity of the tumor sample.\n8. The method of claim 1, wherein the targeted multiplex amplification amplifies 20 to 50 target loci each encompassing a different tumor-specific SNV mutation.\n9. The method of claim 1, wherein the targeted multiplex amplification amplifies 50 to 100 target loci each encompassing a different tumor-specific SNV mutation.\n10. The method of claim 1, wherein the method further comprises designing PCR primers or hybrid capture probes targeting the plurality of SNV mutations identified in the tumor sample.\n11. The method of claim 1, wherein the method further comprises performing barcoding PCR prior to the sequencing.\n12. The method of claim 1, wherein the method further comprises detecting recurrence and/or metastases of the cancer from the SNV mutations detected in the cell-free DNA.\n13. The method of claim 1, wherein the cancer is colorectal cancer, lung cancer, bladder cancer, or breast cancer.\n14. A method for preparing a plasma sample of a subject having cancer or suspected of having cancer useful for detecting one or more single nucleotide variant (SNV) mutations in the plasma sample, the method comprising:\nperforming whole exome sequencing or whole genome sequencing on a tumor sample of the subject to identify a plurality of tumor-specific SNV mutations;\nperforming targeted multiplex amplification to amplify 10 to 500 target loci each encompassing a different tumor-specific SNV mutation from cell-free DNA isolated from a plasma sample of the subject or DNA derived therefrom to obtain amplicons, wherein the target loci are amplified together in the same reaction volume; and\nsequencing the amplicons to obtain sequence reads, and detecting one or more of the tumor-specific SNV mutations present in the cell-free DNA from the sequence reads, wherein the method is capable of detecting an SNV mutation that is present in less than or equal to 0.015% of the cell-free DNA comprising the SNV locus.\n15. The method of claim 14, wherein the sequencing has a depth of read of at least 50,000 per target locus.\n16. The method of claim 14, wherein the cell-free DNA comprises circulating tumor DNA.\n17. The method of claim 14, wherein the SNV mutations comprise one or more clonal SNV mutations.\n18. The method of claim 14, wherein the SNV mutations comprise one or more subclonal SNV mutations.\n19. The method of claim 14, wherein the SNV mutations comprise one or more clonal SNV mutations and one or more subclonal SNV mutations.\n20. The method of claim 14, wherein the tumor sample of the subject is a tumor tissue sample.\n21. The method of claim 14, wherein the method further comprises determining clonal heterogeneity of the tumor sample.\n22. The method of claim 14, wherein the targeted multiplex amplification amplifies 20 to 50 target loci each encompassing a different tumor-specific SNV mutation.\n23. The method of claim 14, wherein the targeted multiplex amplification amplifies 50 to 100 target loci each encompassing a different tumor-specific SNV mutation.\n24. The method of claim 14, wherein the method further comprises designing PCR primers or hybrid capture probes targeting the plurality of SNV mutations identified in the tumor sample.\n25. The method of claim 14, wherein the method further comprises performing barcoding PCR prior to the sequencing.\n26. The method of claim 14, wherein the method further comprises detecting recurrence and/or metastases of the cancer from the SNV mutations detected in the cell-free DNA.\n27. The method of claim 14, wherein the cancer is colorectal cancer, lung cancer, bladder cancer, or breast cancer.\n28. The method of claim 14, wherein the method is capable of detecting an SNV mutation that is present in 0.005% to 0.015% of the cell-free DNA comprising the SNV locus."
}