{
    "patent_id": "US-11287974-B2",
    "title": "Systems and methods for storage modeling and costing ",
    "assignee": "Commvault Systems, Inc.",
    "publication_date": "2022-03-29",
    "patent_link": "https://patents.google.com/patent/US11287974B2/en",
    "inventors": [
        "Anand Prahlad",
        "Srinivas Kavuri",
        "Andre Duque Madeira",
        "Norman R. LUNDE",
        "Alan G. Bunte",
        "Andreas May",
        "Jeremy Alan Schwartz"
    ],
    "classifications": [
        "G06F3/0619",
        "G06F3/0604",
        "G06F11/1446",
        "G06F16/10",
        "G06F16/185",
        "G06F3/0481",
        "G06F3/0482",
        "G06F3/04847",
        "G06F3/0605",
        "G06F3/061",
        "G06F3/0631",
        "G06F3/0644",
        "G06F3/0649",
        "G06F3/065",
        "G06F3/0653",
        "G06F3/067",
        "G06F3/0683",
        "G06F3/0685",
        "G06F3/0686",
        "G06N5/04",
        "G06Q30/0283",
        "G06Q30/0284",
        "G06F11/1458",
        "G06F11/1461",
        "G06F11/1469",
        "G06F2201/81",
        "G06F2201/84",
        "Y10S707/99953",
        "Y10S707/99955"
    ],
    "abstract": "The present invention provides systems and methods for data storage. A hierarchical storage management architecture is presented to facilitate data management. The disclosed system provides methods for evaluating the state of stored data relative to enterprise needs by using weighted parameters that may be user defined. Also disclosed are systems and methods evaluating costing and risk management associated with stored data.",
    "claims": "\n1. A method of monitoring performance of data protection operations in a data storage system, the method comprising:\nperforming, with one or more computing devices comprising computer hardware, data protection operations that copy primary data to create one or more secondary copies on one or more secondary storage devices, the one or more secondary copies stored in a secondary format, wherein the primary data is created during primary data operations generated by one or more applications executing on one or more client computing devices in a primary storage system, the primary data operations storing primary data in one or more primary storage devices in at least a native format associated with the one or more applications that generated the primary data, the native format different than the secondary format;\nreceiving first user input via a graphical user interface, the first user input specifying a first target data protection operation performance corresponding to a first time period;\nreceiving second user input via the graphical user interface, the second user input specifying a second target data protection operation performance corresponding to a second time period different than the first time period;\nmonitoring actual performance of the data protection operations performed by the one or more computing devices;\ndetermining a data protection operation performance metric based on the first target data protection operation performance, the second target data protection operation performance, and the monitoring of the actual performance; and\noutputting a data protection operation performance indication based at least on the data protection operation performance metric.\n2. The method of claim 1 wherein the first user input specifies a minimum number of successful data protection operations to be performed over the first time period and the second user input specifies a minimum number of successful data protection operations to be performed over the second time period.\n3. The method of claim 2 wherein the first user input specifies a minimum number of successful full data protection operations to be performed over the first time period.\n4. The method of claim 1 wherein the first user input relates to data protection operation failures.\n5. The method of claim 1 wherein the first target data protection operation performance relates to short-term data protection and the second target data protection operation performance relates to long-term data protection.\n6. The method of claim 5 wherein the first user input includes a number of days and the second user input includes a number of weeks, months, or years.\n7. The method of claim 1 wherein the determining comprises applying a different weighting to monitored actual performance of data protection operations associated with the first target data protection operation performance than to monitored actual performance of data protection operations associated with the second target protection operation performance.\n8. The method of claim 7 further wherein the different weighting is based on user input received via the graphical user interface.\n9. The method of claim 1 wherein the outputting comprises providing the data protection operation performance indication for display on the graphical user interface.\n10. The method of claim 9 wherein the graphical user interface comprises a bar graph.\n11. A system for monitoring performance of data protection operations, the system comprising:\none or more computing devices that perform data protection operations to copy primary data to create one or more secondary copies on one or more secondary storage devices, the one or more secondary copies stored in a secondary format, wherein the primary data is created during primary data operations generated by one or more applications executing on one or more client computing devices in a primary storage system, the primary data operations storing primary data in one or more primary storage devices in at least a native format associated with the one or more applications that generated the primary data, the native format different than the secondary format;\nwherein the one or more computing devices:\nreceive first user input entered via a graphical user interface, the first user input specifying a first target data protection operation performance corresponding to a first time period;\nreceive second user input entered via the graphical user interface, the second user input specifying a second target data protection operation performance corresponding to a second time period different than the first time period;\nmonitor actual performance of the data protection operations performed by the one or more computing devices;\ndetermine a data protection operation performance metric based on the first target data protection operation performance, the second target data protection operation performance, and the monitoring of the actual performance; and\noutput a data protection operation performance indication based at least on the data protection operation performance metric.\n12. The system of claim 11 wherein the first user input specifies a minimum number of successful data protection operations to be performed over the first time period and the second user input specifies a minimum number of successful data protection operations to be performed over the second time period.\n13. The system of claim 12 wherein the first user input specifies a minimum number of successful full data protection operations over the first time period.\n14. The system of claim 13 wherein the first user input relates to data protection operation failures.\n15. The system of claim 11 wherein the first target data protection operation performance relates to short-term data protection and the second target data protection operation performance relates to long-term data protection.\n16. The system of claim 11 wherein, in determining the data protection operation performance metric, the one or more computing devices apply a different weighting to monitored actual performance of data protection operations associated with the first target data protection operation performance than to monitored actual performance of data protection operations associated with the second target data protection operation performance.\n17. The system of claim 16 wherein the different weighting is based on user input received via the graphical user interface.\n18. The system of claim 11 wherein the one or more computing devices provide the data protection operation performance indication for display on the graphical user interface.\n19. The system of claim 18 wherein the graphical user interface comprises a bar graph."
}