{
    "patent_id": "US-11604547-B2",
    "title": "Multipoint touchscreen ",
    "assignee": "Apple Inc.",
    "publication_date": "2023-03-14",
    "patent_link": "https://patents.google.com/patent/US11604547B2/en",
    "inventors": [
        "Steve Hotelling",
        "Joshua A. Strickon",
        "Brian Q. Huppi"
    ],
    "classifications": [
        "G06F3/0443",
        "G06F3/0412",
        "G02F1/13338",
        "G06F3/0414",
        "G06F3/04166",
        "G06F3/044",
        "G06F3/0445",
        "G06F3/0446",
        "G06F2203/04101",
        "G06F2203/04104",
        "G06F2203/04105",
        "G06F3/0416"
    ],
    "abstract": "A touch panel having a transparent capacitive sensing medium configured to detect multiple touches or near touches that occur at the same time and at distinct locations in the plane of the touch panel and to produce distinct signals representative of the location of the touches on the plane of the touch panel for each of the multiple touches is disclosed.",
    "claims": "\n1. A computer-implemented method for detecting pressure at each of one or more touch regions that occur at a same time and at one or more distinct locations in a plane of a device, comprising:\ndetecting a change in charge coupling at each of a plurality of sensing nodes in the device;\ngenerating touch data from the detected change in charge coupling at each of the plurality of sensing nodes;\ngenerating gradient data from the touch data, the gradient data indicative of differences in the touch data between the plurality of sensing nodes; and\nestimating an amount of pressure at each of the one or more touch regions from the gradient data.\n2. The method of claim 1, further comprising:\nwhen the gradient data is indicative of a steep gradient, estimating a greater amount of pressure at a particular touch region; and\nwhen the gradient data is indicative of a shallow gradient, estimating a lower amount of pressure at the particular touch region.\n3. The method of claim 1, further comprising calculating boundaries for each of the one or more touch regions from the gradient data.\n4. The method of claim 3, wherein the boundaries are calculated using a watershed algorithm.\n5. The method of claim 1, further comprising:\nreceiving raw data, the raw data indicative of the detected change in charge coupling at each of the plurality of sensing nodes; and\nfiltering the raw data to generate the touch data.\n6. The method of claim 5, further comprising calculating coordinates for each of the one or more touch regions from the raw data associated with each of the one or more touch regions.\n7. The method of claim 6, wherein calculating the coordinates for each of the one or more touch regions comprises calculating a centroid of each of the one or more touch regions using the raw data associated with each of the one or more touch regions.\n8. The method of claim 5, wherein filtering the raw data comprises reducing noise in the raw data.\n9. The method of claim 5, wherein filtering the raw data comprises eliminating the raw data indicative of a touch at a particular sensing node, when no other sensing node adjacent to that particular sensing node contains raw data indicative of a touch at that adjacent sensing node.\n10. The method of claim 5, wherein prior to receiving the raw data, the method comprises converting analog signals from each of the plurality of sensing nodes into digitized signals, the digitized signals constituting the raw data.\n11. A touch sensitive device, comprising:\na touch sensor panel including a plurality of sensing nodes;\na processor coupled to the touch sensor panel, the processor configured for detecting pressure at each of one or more touch regions that occur at a same time and at one or more distinct locations on the touch sensor panel by\ndetecting a change in charge coupling at each of the plurality of sensing nodes,\ngenerating touch data from the detected change in charge coupling at each of the plurality of sensing nodes,\ngenerating gradient data from the touch data, the gradient data indicative of differences in the touch data between the plurality of sensing nodes, and\nestimating an amount of pressure at each of the one or more touch regions from the gradient data.\n12. The touch sensitive device of claim 11, the processor further configured for:\nwhen the gradient data is indicative of a steep gradient, estimating a greater amount of pressure at a particular touch region; and\nwhen the gradient data is indicative of a shallow gradient, estimating a lower amount of pressure at the particular touch region.\n13. The touch sensitive device of claim 11, the processor further configured for calculating boundaries for each of the one or more touch regions from the gradient data.\n14. The touch sensitive device of claim 13, the processor further configured for calculating the boundaries using a watershed algorithm.\n15. The touch sensitive device of claim 11, the processor further configured for:\nreceiving raw data, the raw data indicative of the detected change in charge coupling at each of the plurality of sensing nodes; and\nfiltering the raw data to generate the touch data.\n16. The touch sensitive device of claim 15, the processor further configured for calculating coordinates for each of the one or more touch regions from the raw data associated with each of the one or more touch regions.\n17. The touch sensitive device of claim 16, the processor further configured for calculating the coordinates for each of the one or more touch regions by calculating a centroid of each of the one or more touch regions using the raw data associated with each of the one or more touch regions.\n18. The touch sensitive device of claim 15, wherein filtering the raw data comprises reducing noise in the raw data.\n19. The touch sensitive device of claim 15, wherein filtering the raw data comprises eliminating the raw data indicative of a touch at a particular sensing node, when no other sensing node adjacent to that particular sensing node contains raw data indicative of a touch at that adjacent sensing node.\n20. The touch sensitive device of claim 15, further comprising sense circuitry coupled to the touch sensor panel and configured for converting analog signals from each of the plurality of sensing nodes into digitized signals, the digitized signals constituting the raw data."
}