{
    "patent_id": "US-11614721-B2",
    "title": "Systems and methods for smart spaces ",
    "assignee": "Webee Corporation",
    "publication_date": "2023-03-28",
    "patent_link": "https://patents.google.com/patent/US11614721B2/en",
    "inventors": [
        "Lucas Marcelo Funes"
    ],
    "classifications": [
        "G05B15/02",
        "G06N20/00",
        "G06N5/047",
        "H04L12/2816",
        "H04L12/2823",
        "H04L12/2834",
        "H04L41/16",
        "G05B2219/25011",
        "G05B2219/25168",
        "G05B2219/2642"
    ],
    "abstract": "A smart space may be provided by a hub and an artificial intelligence server in communication with the hub. The hub may receive data from at least one smart object in the smart space. The artificial intelligence server may generate clusters of the data received from each of the at least one smart objects. The server may perform processing comprising using a cluster to detect an anomaly in the smart object, identify the smart object, classify the smart object, determine a user behavior, determine a user mood, determine an energy consumption pattern, or create an automated action, or a combination thereof.",
    "claims": "\n1. A system for providing a smart space, comprising:\nan artificial intelligence server configured to:\nreceive data from at least one smart object in the smart space;\ngenerate, by applying at least one artificial intelligence algorithm, machine learning algorithm, deep learning algorithm, or a combination thereof, clusters of the data received from each of the at least one smart objects, each cluster comprising data received from one of the at least one smart objects during one of a plurality of time periods, wherein a plurality of clusters are generated for each of the at least one smart objects, each of the plurality of clusters for each of the at least one smart objects comprising data received during a different time period;\nperform processing comprising using the clusters to classify the at least one smart object, the processing comprising:\nevaluating a plurality of the clusters to identify a consistency between the clusters,\nanalyzing the plurality of clusters having the consistency and, based on the analyzing, identifying a pattern indicative of an object type, and\nclassifying the at least one smart object as the object type indicated by the identified pattern;\nprovide a drag and drop user interface including at least one virtual representation of the at least one smart object based on the object type as classified by the processing, the user interface being configured to receive a user input indicating a function specific to the object type; and\ngenerate and send a command configured to control the function indicated by the command, thereby causing a change in an operation of the at least one smart object wherein the at least one visual representation is configured to be dragged and dropped within the user interface to define the command.\n2. The system of claim 1, wherein providing the user interface comprises identifying, based on the processing, at least one feature of the at least one smart object and providing at least one user interface element corresponding to the at least one feature.\n3. The system of claim 1, wherein:\nthe user interface includes at least one intelligent agent comprising an artificial intelligence and/or machine learning component, and\ngenerating the command is further based on code automatically generated by the at least one intelligent agent.\n4. The system of claim 3, wherein the at least one intelligent agent automatically generates the code in response to a user preference identified through user interaction with the user interface.\n5. The system of claim 1, wherein the server is further configured to:\ngenerate analytics information from the data received from the at least one smart object; and\nprovide the analytics information in the user interface.\n6. The system of claim 1, wherein providing the user interface comprises sending data enabling display of the user interface to a mobile device, a personal computer, a television, or a combination thereof.\n7. The system of claim 1, wherein generating the command comprises identifying a plurality of command classes assigned to the at least one smart object according to the object type and selecting at least one of the command classes as the command.\n8. The system of claim 7, wherein the selecting is based at least in part on intelligent mapping according to the object type.\n9. The system of claim 1, wherein the machine learning algorithm comprises a K-means algorithm.\n10. The system of claim 1, wherein classifying the smart object comprises:\nanalyzing the clusters to identify at least one additional pattern indicative of a plurality of object types, thereby identifying a plurality of smart objects; and\nassociating the plurality of smart objects with one another into a composite object.\n11. The system of claim 1, wherein classifying the at least one smart object includes determining an energy consumption pattern of the at least one smart object.\n12. The system of claim 11, wherein determining the energy consumption pattern comprises identifying events in the data corresponding to energy use and compiling energy use data for a period of time.\n13. The system of claim 12, wherein determining the energy consumption pattern\nfurther comprises:\nobtaining weather information; and\ncorrelating the weather information with the energy use.\n14. The system of claim 1, wherein the classifying the at least one smart object includes determining a user interaction with the at least one smart object.\n15. The system of claim 14, wherein determining the user interaction comprises analyzing the clusters to identify a pattern indicative of a repeated user action.\n16. The system of claim 1, wherein the at least one smart object comprises a door/window sensor, a smart plug, a sensor unit, a smart socket, a skipper, a presence tag, a smart wall unit, a thermostat, a plug, a dimmer, a television, a home theater component, an appliance, a lock, a machine, or a device, or a combination thereof.\n17. The system of claim 1, wherein the command comprises an automated action.\n18. The system of claim 17, wherein the automated action comprises generating an alert.\n19. The system of claim 1, wherein generating clusters\ncomprises: obtaining the data over a period of time;\nidentifying temporal relationships between events in the data; and\nforming the clusters at times indicative of the temporal relationships.\n20. The system of claim 1, wherein the artificial intelligence server is further configured to perform processing comprising associating the at least one smart object into a smart space network.\n21. The system of claim 1, further comprising a hub configured to receive the data from the at least one smart object and send the data to the artificial intelligence server.\n22. The system of claim 21, wherein at least a portion of the artificial intelligence server and the hub are elements of a combined system.\n23. The system of claim 21, wherein the hub is further configured to control output displayed on a mobile device, a personal computer, a television, or a combination thereof.\n24. The system of claim 21, wherein the artificial intelligence server is further configured to install software on the hub.\n25. The system of claim 21, wherein:\nthe hub is in communication with a display and a controller, and\nthe hub is further configured to provide a user interface for control of the smart space via the display and receive a user command via the controller.\n26. The system of claim 25, wherein the display is a mobile device, a personal computer, a television, or a combination thereof.\n27. The system of claim 1, wherein classifying the at least one smart object includes identifying an anomaly exhibited by the at least one smart object based on the evaluating.\n28. A method for providing a smart space, comprising:\nreceiving, by an artificial intelligence server, data from at least one smart object in the smart space;\ngenerating, by the artificial intelligence server applying at least one artificial intelligence algorithm, machine learning algorithm, deep learning algorithm, or a combination thereof, clusters of the data received from each of the at least one smart objects, each cluster comprising data received from one of the at least one smart objects during one of a plurality of time periods, wherein a plurality of clusters are generated for each of the at least one smart objects, each of the plurality of clusters for each of the at least one smart objects comprising data received during a different time period;\nperforming, by the artificial intelligence server, processing comprising using the clusters to classify the at least one smart object, the processing comprising:\nevaluating a plurality of the clusters to identify a consistency between the clusters,\nanalyzing the plurality of clusters having the consistency and, based on the analyzing, identifying a pattern indicative of an object type, and\nclassifying the at least one smart object as the object type indicated by the identified pattern;\nproviding a drag and drop user interface including at least one virtual representation of the at least one smart object based on the object type as classified by the processing, the user interface being configured to receive a user input indicating a function specific to the object type; and\ngenerating and sending, by the artificial intelligence server, a command configured to control the function indicated by the command, thereby causing a change in an operation of the at least one smart object, wherein the at least one visual representation is configured to be dragged and dropped within the user interface to define the command.\n29. The method of claim 28, wherein providing the user interface comprises identifying, based on the processing, at least one feature of the at least one smart object and providing at least one user interface element corresponding to the at least one feature.\n30. The method of claim 28, wherein:\nthe user interface includes at least one intelligent agent comprising an artificial intelligence and/or machine learning component, and\ngenerating the command is further based on code automatically generated by the at least one intelligent agent.\n31. The method of claim 30, wherein the at least one intelligent agent automatically generates the code in response to a user preference identified through user interaction with the user interface.\n32. The method of claim 28, further comprising:\ngenerating, by the artificial intelligence server, analytics information from the data received from the at least one smart object; and\nproviding the analytics information in the user interface.\n33. The method of claim 28, wherein providing the user interface comprises sending, by the artificial intelligence server, data enabling display of the user interface to a mobile device, a personal computer, a television, or a combination thereof.\n34. The method of claim 28, wherein generating the command comprises identifying a plurality of command classes assigned to the at least one smart object according to the object type and selecting at least one of the command classes as the command.\n35. The method of claim 34, wherein the selecting is based at least in part on intelligent mapping according to the object type.\n36. The method of claim 28, wherein the machine learning algorithm comprises a K-means algorithm.\n37. The method of claim 28, wherein classifying the smart object comprises: analyzing the clusters to identify at least one additional pattern indicative of a plurality of object types, thereby identifying a plurality of smart objects; and\nassociating the plurality of smart objects with one another into a composite object.\n38. The method of claim 28, wherein classifying the at least one smart object includes determining an energy consumption pattern of the at least one smart object.\n39. The method of claim 38, wherein determining the energy consumption pattern comprises identifying events in the data corresponding to energy use and compiling energy use data for a period of time.\n40. The method of claim 39, wherein determining the energy consumption pattern\nfurther comprises:\nobtaining weather information; and\ncorrelating the weather information with the energy use.\n41. The method of claim 28, wherein the classifying the at least one smart object includes determining a user interaction with the at least one smart object.\n42. The method of claim 28, wherein determining the user interaction comprises analyzing the clusters to identify a pattern indicative of a repeated user action.\n43. The method of claim 28, wherein the at least one smart object comprises a door/window sensor, a smart plug, a sensor unit, a smart socket, a skipper, a presence tag, a smart wall unit, a thermostat, a plug, a dimmer, a television, a home theater component, an appliance, a lock, a machine, or a device, or a combination thereof.\n44. The method of claim 28, wherein the command comprises an automated action.\n45. The method of claim 44, wherein the automated action comprises generating an alert.\n46. The method of claim 28, wherein generating clusters\ncomprises: obtaining the data over a period of time;\nidentifying temporal relationships between events in the data; and forming\nthe clusters at times indicative of the temporal relationships.\n47. The method of claim 28, further comprising performing, by the artificial intelligence server, processing comprising associating the at least one smart object into a smart space network.\n48. The method of claim 28, further comprising:\nreceiving, by a hub, the data from the at least one smart object; and\nsending, by the hub, the data to the artificial intelligence server.\n49. The method of claim 48, wherein at least a portion of the artificial intelligence server and the hub are elements of a combined system.\n50. The method of claim 48, further comprising controlling, by the hub, output displayed on a mobile device, a personal computer, a television, or a combination thereof.\n51. The method of claim 48, further comprising installing, by the artificial intelligence server, software on the hub.\n52. The method of claim 48, wherein the hub is in communication with a display and a controller, the method further comprising providing, by the hub, a user interface for control of the smart space via the display and receive a user command via the controller.\n53. The method of claim 52, wherein the display is a mobile device, a personal computer, a television, or a combination thereof.\n54. The method of claim 28, wherein classifying the at least one smart object includes identifying an anomaly exhibited by the at least one smart object based on the evaluating."
}