{
    "patent_id": "US-11637331-B2",
    "title": "Neural-network state-of-charge and state of health estimation ",
    "assignee": "The Trustees Of Columbia University In The City Of New York, Mcmaster University",
    "publication_date": "2023-04-25",
    "patent_link": "https://patents.google.com/patent/US11637331B2/en",
    "inventors": [
        "Ephram Chemali",
        "Matthias Preindl"
    ],
    "classifications": [
        "G01R31/392",
        "G01R31/367",
        "G01R31/382",
        "G06N3/044",
        "G06N3/045",
        "G06N3/0454",
        "H01M10/052",
        "H01M10/425",
        "H01M10/486",
        "H02J7/0048",
        "G06N20/20",
        "G06N3/08",
        "G06N3/084",
        "G06N7/01",
        "H01M10/0525",
        "H01M2010/4271",
        "H01M2010/4278",
        "Y02E60/10"
    ],
    "abstract": "An approach to control or monitoring of battery operation makes use of an artificial neural network (ANN), which receives one or more battery attributes for a Lithium ion (Li-ion) battery, and determines, based on the received one or more battery attributes, a state-of-charge (SOC) and/or a state-of-health (SOH) estimate for the Li-ion battery. The ANN includes at least one of a recurrent neural network (RNN) and a convolutional neural network (CNN), and the series of values of the battery attributes includes at one of battery voltage values, battery current values, and battery temperature values.",
    "claims": "\n1. A method for monitoring a battery state, the method comprising:\nreceiving by a processor-based artificial neural network (ANN), encoding characteristic behavior of a battery at multiple different ambient temperatures, a time series of values, determined based on measurements performed by one or more sensors monitoring the battery, for one or more battery attributes for the battery, the one or more battery attributes comprising at least a current ambient temperature; and\ndetermining by the processor-based ANN encoding the characteristic behavior of the battery at the multiple different ambient temperatures, based on the time series of values comprising the current ambient temperature, the battery state;\nwherein the processor-based ANN includes at least one of a recurrent neural network (RNN) or a convolutional neural network (CNN), the battery state includes at least one of a state of charge (SOC) or a state of health (SOH), and the time series of values of the battery attributes includes at least one of battery voltage values, battery current values, or battery temperature values.\n2. The method of claim 1, wherein the processor-based ANN comprises a CNN.\n3. The method of claim 2, wherein the CNN comprises a plurality of layers, including at least one pooling layer and at least one fully connected layer.\n4. The method of claim 1, wherein the battery state comprises the state-of-health (SOH) of the battery.\n5. The method of claim 4, wherein the SOH represents a capacity of the battery.\n6. The method of claim 4, wherein the battery attributes include the state-of-charge (SOC) of the battery.\n7. The method of claim 6, further comprising determine the time series of values of SOC using an RNN based on battery attributes including battery voltage and battery current.\n8. The method of claim 1, further comprising providing the determined battery state for controlling operation of the battery or an electrical apparatus coupled to the battery.\n9. The method of claim 1, wherein the battery comprises a rechargeable battery, and wherein receiving the time series of values for the one or more battery attributes includes receiving a time series of values spanning multiple charging and discharging cycles.\n10. The method of claim 1, wherein determining the battery state includes determining a battery state at a first time dependent on the received time series of battery attributes spanning greater than 30 minutes of operation of the battery.\n11. The method of claim 10, wherein the time series of values is sampled at a rate of at least one sample per 10 seconds, and the battery state at the first time is dependent on at least 256 time samples of the time series.\n12. The method of claim 1, wherein receiving the time series of the values for the one or more battery attributes comprises receiving values of two or more of the battery voltage, the battery current, and the battery temperature.\n13. The method of claim 1 wherein the battery comprises a Lithium-ion (Li-ion) battery.\n14. The method of claim 1, further comprising determining values of parameters of the processor-based ANN, and configuring the processor-based ANN with said determined values.\n15. The method of claim 14, wherein determining the values of the parameters includes processing a plurality of time series of battery attributes and corresponding battery state, the plurality of time series spanning a plurality of different state-of-charge profiles.\n16. The method of claim 1, wherein the processor-based ANN is trained based on backward-pass through the processor-based ANN of gradients of a loss function, representing the disparity between an actual state-of-charge value for the battery and a predicted value, computed for training set values corresponding to at least some of the multiple different ambient temperatures provided to the processor-based ANN during a respective forward-pass corresponding to the backward pass.\n17. A battery monitoring system comprising:\none or more sensors monitoring battery attributes of a battery; and\na processor-based artificial neural network (ANN), encoding characteristic behavior of the battery at multiple different ambient temperatures, the processor-based ANN configured to:\nreceive a time series of values, determined based on measurements performed by the one or more sensors, for one or more battery attributes for the battery, the one or more battery attributes comprising at least a current ambient temperature, and\ndetermine, by the processor-based ANN encoding the characteristic behavior of the battery at the multiple different ambient temperatures, based on the time series of values, the battery state;\nwherein the processor-based ANN includes at least one of a recurrent neural network (RNN) or a convolutional neural network (CNN), the battery state includes at least one of a state of charge (SOC) or a state of health (SOH), and the time series of values of the battery attributes includes at least one of battery voltage values, battery current values, or battery temperature values.\n18. The battery monitoring system of claim 17, wherein the processor-based ANN is trained based on backward-pass through the processor-based ANN of gradients of a loss function, representing the disparity between an actual state-of-charge value for the battery and a predicted value, computed for training set values corresponding to at least some of the multiple different ambient temperatures provided to the processor-based ANN during a respective forward-pass corresponding to the backward pass.\n19. A non-transitory computer readable media programmed h instructions, executable on one or more processors, to:\nreceive by a processor-based artificial neural network (ANN), encoding characteristic behavior of a battery at multiple different ambient temperatures, a time series of values, determined based on measurements performed by one or more sensors monitoring the battery, for one or more battery attributes for a battery, the one or more battery attributes comprising at least a current ambient temperature; and\ndetermine by the processor-based ANN encoding the characteristic behavior of the battery at the multiple different ambient temperatures, based on the time series of values comprising the current ambient temperature, the battery state;\nwherein the processor-based ANN includes at least one of a recurrent neural network (RNN) or a convolutional neural network (CNN), the battery state includes at least one of a state of charge (SOC) or a state of health (SOH), and the time series of values of the battery attributes includes at least one of battery voltage values, battery current values, or battery temperature values.\n20. The non-transitory computer readable media of claim 19, wherein the processor-based ANN is trained based on backward-pass through the processor-based ANN of gradients of a loss function, representing the disparity between an actual state-of-charge value for the battery and a predicted value, computed for training set values corresponding to at least some of the multiple different ambient temperatures provided to the processor-based ANN during a respective forward-pass corresponding to the backward pass."
}