{
    "patent_id": "US-11337696-B2",
    "title": "Surgical stapling device ",
    "assignee": "Covidien Lp",
    "publication_date": "2022-05-24",
    "patent_link": "https://patents.google.com/patent/US11337696B2/en",
    "inventors": [
        "Thomas Wenchell",
        "Stanislaw Marczyk",
        "Kenneth H. Whitfield",
        "Roman Czernik",
        "Henry E. Holsten",
        "Frank C. Maffei"
    ],
    "classifications": [
        "A61B17/07207",
        "A61B17/068",
        "A61B90/03",
        "A61B2017/00115",
        "A61B2017/0046",
        "A61B2017/2927",
        "A61B2090/034",
        "A61B2090/0808"
    ],
    "abstract": "A surgical stapling device for sequentially applying a plurality of fasteners to body tissue and simultaneously incising tissue is provided. The surgical stapling device is adapted to receive disposable loading units having staples in linear rows whose length can be between about 30 mm and 60 mm. The disposable loading unit includes a proximal body portion, a mounting assembly and a tool assembly. The mounting assembly is secured to the proximal end of the tool assembly and pivotally mounted about a pivot axis to the distal end of the proximal body portion. A support member or blow-out plate assembly is positioned on opposite sides of the pivot axis and extends between the proximal body portion and the mounting assembly.",
    "claims": "\n1. A surgical stapling device comprising:\na proximal body portion defining a longitudinal axis, the proximal body portion having a proximal end portion and a distal end portion;\na tool assembly supported on a distal end portion of the proximal body portion, the tool assembly including a cartridge assembly and an anvil assembly, the cartridge assembly supporting a plurality of staples;\na drive member movable within the proximal body portion between a retracted position and an advanced position; and\na locking member secured to the drive member, the locking member engaged with the proximal body portion to retain the drive member in the retracted position, the locking member being movable to a position disengaged from the proximal body portion upon application of a predetermined force to the drive member.\n2. The stapling device of claim 1, wherein the locking member includes first and second legs connected by a cross member.\n3. The stapling device of claim 2, wherein the drive member defines a slot and the cross member is positioned within the slot of the drive member.\n4. The stapling device of claim 2, wherein each of the first and second legs includes a lateral protrusion.\n5. The surgical stapling device of claim 4, wherein the proximal body portion defines recesses, the lateral protrusions received within the recesses when the locking member is engaged with the proximal body portion until the predetermined force is applied to the drive member.\n6. The stapling device of claim 5, wherein the lateral protrusions of the locking member and the recesses formed in the proximal body portion are configured such that movement of the lateral protrusions from the recesses provides an audible and tactile indication that the stapling device has been actuated.\n7. The stapling device of claim 1, further including a handle assembly and an elongated body portion coupled to the handle assembly, the proximal body portion releasably coupled to the elongated body portion.\n8. A surgical stapling device comprising:\na proximal body portion defining a longitudinal axis, the proximal body portion having a proximal end portion and a distal end portion;\na tool assembly supported on the distal end portion of the elongated body portion;\na drive member movable within the proximal body portion from a retracted position to an advanced position; and\na locking member supported on the drive member, the locking member being releasably secured within the proximal body portion and configured to prevent axial movement of the drive member from the retracted position towards the advanced position, the locking member being movable to a position disengaged from the proximal body portion upon application of a predetermined force to the drive member to facilitate movement of the drive member from the retracted position to the advanced position;\nwherein the locking member includes first and second legs connected by a cross member and a body having a generally H-shaped configuration.\n9. The stapling device of claim 8, wherein the locking member includes a pair of arms, each of the arms of the pair of arms extending transversely from the body of the locking member in relation to the first and second legs.\n10. The stapling device of claim 8, wherein the tool assembly is pivotally supported at the distal end portion of the proximal body portion about a pivot axis extending transversely in relation to the longitudinal axis of the proximal body portion.\n11. The stapling device of claim 10, further including a support member positioned adjacent the pivot axis on a side of the drive member, the support member having a first end fixedly attached to the tool assembly, and a second end fixedly attached to the proximal body portion, the support member lengthening as the tool assembly pivots.\n12. The stapling device of claim 8, wherein the tool assembly includes a cartridge assembly and an anvil assembly, the cartridge assembly including a plurality of staples.\n13. The stapling device of claim 8, further including a handle assembly and an elongated body portion coupled to the handle assembly, the proximal body portion releasably coupled to the elongated body portion.\n14. The surgical stapling device of claim 8, wherein the proximal body portion defines recesses, wherein the lateral protrusions are received within the recesses when the locking member is engaged with the proximal body portion until the predetermined force is applied to the drive member.\n15. The stapling device of claim 14, wherein the lateral protrusions of the locking member and the recesses formed in the proximal body portion are configured such that movement of the lateral protrusions from the recesses provides an audible and tactile indication that the stapling device has been actuated."
}