{
    "patent_id": "US-11559377-B2",
    "title": "Augmented reality enhancements for dental practitioners ",
    "assignee": "Align Technology, Inc.",
    "publication_date": "2023-01-24",
    "patent_link": "https://patents.google.com/patent/US11559377B2/en",
    "inventors": [
        "Avi Kopelman",
        "Adi Levin",
        "Eric Paul Meyer",
        "Elad Zeiri",
        "Amir Ashkenazi",
        "Ron Ganot",
        "Sergei Ozerov",
        "Inna KARAPETYAN"
    ],
    "classifications": [
        "A61C9/0053",
        "A61B1/000094",
        "A61B1/000096",
        "A61B34/10",
        "A61B34/20",
        "A61B34/25",
        "A61B5/0088",
        "A61B90/36",
        "A61C1/0015",
        "A61C1/082",
        "A61C19/04",
        "A61C19/05",
        "A61C5/44",
        "A61C7/002",
        "A61C9/004",
        "A61C9/0046",
        "G06F3/011",
        "G06T17/00",
        "G06T19/006",
        "G06V10/758",
        "G06V40/171",
        "G09B23/283",
        "G16H20/40",
        "G16H30/20",
        "G16H30/40",
        "G16H40/60",
        "G16H50/20",
        "G16H50/50",
        "A61B1/00009",
        "A61B1/00045",
        "A61B1/00172",
        "A61B1/24",
        "A61B2017/00216",
        "A61B2034/102",
        "A61B2034/105",
        "A61B2034/107",
        "A61B2034/2048",
        "A61B2034/2065",
        "A61B2034/252",
        "A61B2034/254",
        "A61B2034/256",
        "A61B2034/258",
        "A61B2090/062",
        "A61B2090/309",
        "A61B2090/3612",
        "A61B2090/365",
        "A61B2090/371",
        "A61B2090/372",
        "A61B2090/373",
        "A61B2090/502",
        "A61B34/76",
        "A61B5/1032",
        "A61B5/4542",
        "A61B5/4547",
        "A61B5/4552",
        "A61B5/7455",
        "A61B6/14",
        "A61B6/466",
        "A61B6/5217",
        "A61B6/5247",
        "G02B2027/0178",
        "G02B27/0093",
        "G02B27/017",
        "G06F3/013",
        "G06N20/10",
        "G06N3/08",
        "G06T2207/30036",
        "G06T2210/41",
        "Y02A90/10"
    ],
    "abstract": "An image of a dental arch comprising a preparation tooth is generated by an image capture device associated with an augmented reality (AR) display. The image of the dental arch is registered to previous image data associated with the dental arch. A visual overlay associated with a dental prosthetic to be placed on the preparation tooth is generated based on the registering of the image of the dental arch to the previous image data associated with the dental arch. The visual overlay is output to the AR display, wherein the visual overlay is superimposed over a view of the preparation tooth on the AR display.",
    "claims": "\n1. A method comprising:\nreceiving an image of a dental arch comprising a preparation tooth, the image having been generated by an image capture device associated with an augmented reality (AR) display;\nregistering, by a processing device, the image of the dental arch to previous image data associated with the dental arch;\ngenerating, by the processing device, a visual overlay associated with a dental prosthetic to be placed on the preparation tooth based on the registering of the image of the dental arch to the previous image data associated with the dental arch; and\noutputting the visual overlay to the AR display, wherein the visual overlay is superimposed over a view of the preparation tooth on the AR display.\n2. The method of claim 1, wherein the previous image data associated with the dental arch comprises a three-dimensional model of the dental arch, and wherein registering the image of the dental arch to the three-dimensional model of the dental arch comprises:\ngenerating a plurality of perspective view images of the three-dimensional model of the dental arch; and\ncomparing the image of the dental arch to the plurality of perspective view images to identify a perspective view image for which the three-dimensional model in the perspective view image most closely matches the dental arch in the image.\n3. The method of claim 1, wherein the dental prosthetic is a crown or bridge.\n4. The method of claim 1, wherein the visual overlay comprises an insertion path for inserting the dental prosthetic onto the preparation tooth.\n5. The method of claim 1, wherein the image of the dental arch comprises the dental arch in a patient's oral cavity.\n6. The method of claim 1, wherein the visual overlay comprises a depiction of an original geometry of a tooth corresponding to the preparation tooth that is superimposed over the preparation tooth.\n7. The method of claim 1, further comprising:\ndetermining, by the processing device, a position of the preparation tooth on the dental arch.\n8. The method of claim 1, further comprising:\nreceiving a new image;\nidentifying a change to the preparation tooth based on a comparison of the new image to the image; and\ndetermining an update to the visual overlay based on the change to the preparation tooth.\n9. A non-transitory computer readable medium comprising instructions that, when executed by a processing device, cause the processing device to perform operations comprising:\nreceiving an image of a dental arch comprising a preparation tooth, the image having been generated by an image capture device associated with an augmented reality (AR) display;\nregistering, by the processing device, the image of the dental arch to previous image data associated with the dental arch;\ndetermining, by the processing device, a position on the dental arch of an area of interest associated with the preparation tooth;\ngenerating, by the processing device, a visual overlay associated with a dental prosthetic to be placed on the preparation tooth; and\noutputting the visual overlay to the AR display, wherein the visual overlay is output in accordance with the position on the dental arch of the area of interest such that the visual overlay is superimposed over a view of the preparation tooth on the AR display.\n10. The non-transitory computer readable medium of claim 9, wherein the previous image data associated with the dental arch comprises a three-dimensional model of the dental arch.\n11. The non-transitory computer readable medium of claim 10, wherein registering the image of the dental arch to the three-dimensional model of the dental arch comprises:\ngenerating a plurality of perspective view images of the three-dimensional model of the dental arch; and\ncomparing the image of the dental arch to the plurality of perspective view images to identify a perspective view image for which the three-dimensional model in the perspective view image most closely matches the dental arch in the image.\n12. The non-transitory computer readable medium of claim 9, wherein the dental prosthetic is a crown or bridge.\n13. The non-transitory computer readable medium of claim 9, wherein the visual overlay comprises an insertion path for inserting the dental prosthetic onto the preparation tooth.\n14. The non-transitory computer readable medium of claim 9, wherein the image of the dental arch comprises the dental arch in a patient's oral cavity.\n15. The non-transitory computer readable medium of claim 9, wherein the visual overlay comprises a depiction of an original geometry of a tooth corresponding to the preparation tooth that is superimposed over the preparation tooth.\n16. The non-transitory computer readable medium of claim 9, the operations further comprising:\ndetermining where to place the visual overlay on the AR display based on the position on the dental arch of the area of interest such that the visual overlay is superimposed over the view of the preparation tooth on the AR display.\n17. A system comprising:\nan image capture device to generate an image of at least a portion of a dental arch;\nan augmented reality (AR) display to display the image of at least the portion of the dental arch; and\na processing device to:\nreceive the image of at least the portion of the dental arch;\nregister the image of at least the portion of the dental arch to previous image data associated with the dental arch;\ndetermine a position on at least the portion of the dental arch of an area of interest;\ngenerate a visual overlay associated with a dental prosthetic to be placed at the area of interest; and\noutput the visual overlay to the AR display, wherein the visual overlay is superimposed over the image at the area of interest.\n18. The system of claim 17, wherein the previous image data associated with the dental arch comprises a three-dimensional model of the dental arch, and wherein registering the image of at least the portion of the dental arch to the three-dimensional model of the dental arch comprises:\ngenerating a plurality of perspective view images of the three-dimensional model of the dental arch; and\ncomparing the image of at least the portion of the dental arch to the plurality of perspective view images to identify a perspective view image for which the three-dimensional model in the perspective view image most closely matches at least the portion of the dental arch in the image.\n19. The system of claim 17, wherein the dental prosthetic is a crown or bridge.\n20. The system of claim 17, wherein the visual overlay comprises an insertion path for inserting the dental prosthetic onto a preparation tooth at the area of interest.\n21. The system of claim 17, wherein the image of the at least the portion of the dental arch comprises the dental arch in a patient's oral cavity."
}