{
    "patent_id": "US-11712312-B2",
    "title": "Robotic surgery system including position sensors using Fiber Bragg Gratings ",
    "assignee": "Intuitive Surgical Operations, Inc.",
    "publication_date": "2023-08-01",
    "patent_link": "https://patents.google.com/patent/US11712312B2/en",
    "inventors": [
        "David Q. Larkin",
        "David C. Shafer"
    ],
    "classifications": [
        "A61B34/30",
        "A61B1/009",
        "A61B34/20",
        "A61B34/37",
        "A61B34/71",
        "A61B90/30",
        "B25J18/06",
        "B25J19/025",
        "B25J9/1635",
        "A61B2017/00057",
        "A61B2017/00477",
        "A61B2017/0477",
        "A61B2017/2906",
        "A61B2034/2048",
        "A61B2034/2059",
        "A61B2034/2061",
        "A61B2034/2065",
        "A61B2034/305",
        "A61B2090/3614",
        "A61B90/361",
        "Y10S901/09",
        "Y10S901/28",
        "Y10S901/46",
        "Y10S901/47",
        "Y10T29/49826",
        "Y10T74/20305"
    ],
    "abstract": "A method for determining a shape of a lumen in an anatomical structure comprises reading information from a plurality of strain sensors disposed substantially along a length of a flexible medical device when the flexible medical device is positioned in the lumen. When the flexible medical device is positioned in the lumen, the flexible medical device conforms to the shape of the lumen. The method further comprises computationally determining, by a processing system, the shape of the lumen based on the information from the plurality of strain sensors.",
    "claims": "\n1. A method for determining a shape of a lumen in an anatomical structure, the method comprising:\nreading information from a plurality of strain sensors disposed substantially along a length of a flexible medical device when the flexible medical device is positioned in the lumen, wherein when the flexible medical device is positioned in the lumen, the flexible medical device conforms to the shape of the lumen; and\ncomputationally determining, by a processing system, the shape of the lumen based on the information from the plurality of strain sensors.\n2. The method of claim 1, wherein the flexible medical device includes a fiber optic cable extending along the length of the flexible medical device, and wherein the plurality of strain sensors is configured on the fiber optic cable.\n3. The method of claim 2, wherein the fiber optic cable includes a plurality of optical cores, and wherein each optical core of the plurality of optical cores includes at least one strain sensor of the plurality of strain sensors.\n4. The method of claim 3, wherein each optical core of the plurality of optical cores includes a plurality of sensor regions, wherein at each sensor region, a strain sensor on a first optical core of the plurality of optical cores is aligned with a strain sensor on each other optical core of the plurality of optical cores.\n5. The method of claim 4, wherein computationally determining the shape of the lumen includes compensating for movement of one or more of the plurality of sensor regions.\n6. The method of claim 1, wherein the plurality of strain sensors employ Rayleigh scattering.\n7. The method of claim 1, wherein the plurality of strain sensors comprise a plurality of Fiber Bragg Gratings.\n8. The method of claim 1, wherein the flexible medical device includes a steerable tip which is electromechanically movable for positioning the flexible medical device in the lumen.\n9. The method of claim 1, wherein the anatomical structure is part of one of a heart, a brain, a digestive system, a circulatory system, a respiratory system, or a urinary system.\n10. The method of claim 9, wherein the anatomical structure is a lung and the lumen is an air passageway in the lung.\n11. A medical system comprising:\na flexible medical device, wherein the flexible medical device conforms to a shape of a lumen of an anatomical structure when the flexible medical device is positioned in the lumen, wherein the flexible medical device includes a length extending between proximal and distal ends of the flexible medical device, and wherein the flexible medical device includes a plurality of strain sensors disposed substantially along the length of the flexible medical device for detecting bending of the flexible medical device; and\na processing system including one or more processors, the processing system configured to:\nreceive information concurrently read from the plurality of strain sensors of the flexible medical device after the flexible medical device has been positioned in the lumen; and\ncomputationally determine the shape of the lumen based on the received information.\n12. The medical system of claim 11, wherein the flexible medical device includes a fiber optic cable extending along the length of the flexible medical device, and wherein the plurality of strain sensors is configured on the fiber optic cable.\n13. The medical system of claim 12, wherein the fiber optic cable includes a plurality of optical cores, and wherein each optical core of the plurality of optical cores includes at least one strain sensor of the plurality of strain sensors.\n14. The medical system of claim 13, wherein each optical core of the plurality of optical cores includes a plurality of sensor regions, wherein at each sensor region, a strain sensor on a first optical core of the plurality of optical cores is aligned with a strain sensor on each other optical core of the plurality of optical cores.\n15. The medical system of claim 14, wherein computationally determining the shape of the lumen includes compensating for movement of one or more of the plurality of sensor regions.\n16. The medical system of claim 11, wherein the plurality of strain sensors employ Rayleigh scattering.\n17. The medical system of claim 11, wherein the plurality of strain sensors comprise a plurality of Fiber Bragg Gratings.\n18. The medical system of claim 11, further comprising:\nan input device;\na controller; and\nan electromechanical interface including an actuator, the actuator configured to be controlled by the controller in response to an input received from the input device so that the flexible medical device is electromechanically positionable in the lumen.\n19. The medical system of claim 11, wherein the anatomical structure is part of one of a heart, a brain, a digestive system, a circulatory system, a respiratory system, or a urinary system.\n20. The medical system of claim 19, wherein the anatomical structure is a lung and the lumen is an air passageway in the lung."
}