{
    "patent_id": "US-11203340-B2",
    "title": "Vehicular vision system using side-viewing camera ",
    "assignee": "Magna Electronics Inc.",
    "publication_date": "2021-12-21",
    "patent_link": "https://patents.google.com/patent/US11203340B2/en",
    "inventors": [
        "John A. Pawlicki",
        "Martha A. McMahon",
        "Steven G. Chinn",
        "Joel S. Gibson"
    ],
    "classifications": [
        "B60K31/0008",
        "B60Q1/525",
        "B60Q9/008",
        "B60R11/04",
        "B60T7/22",
        "B60W10/04",
        "B60W10/20",
        "B60W30/09",
        "B60W30/12",
        "B60W30/143",
        "B60W30/16",
        "B60W30/18",
        "B60W50/14",
        "B62D15/025",
        "G01S11/12",
        "G01S13/867",
        "G01S13/931",
        "G06K9/00791",
        "G06K9/00798",
        "G06K9/00805",
        "G06K9/00818",
        "G06K9/00825",
        "G06K9/4604",
        "G06K9/52",
        "G06T7/13",
        "G06T7/174",
        "G06T7/60",
        "G06T7/73",
        "G06V20/56",
        "G06V20/58",
        "G06V20/582",
        "G06V20/584",
        "G06V20/588",
        "G08G1/16",
        "G08G1/167",
        "H04N23/90",
        "H04N5/247",
        "B60K31/00",
        "B60R2011/004",
        "B60T2201/08",
        "B60T2201/082",
        "B60T2201/089",
        "B60T2210/34",
        "B60W2050/143",
        "B60W2420/42",
        "B60W2420/52",
        "B60W2554/4041",
        "B60W2554/80",
        "B60W2554/801",
        "B60W2554/802",
        "B60W2555/20",
        "B60W2556/60",
        "B60W2710/20",
        "B60W2720/10",
        "G06K2209/27",
        "G06T2207/30244",
        "G06T2207/30256",
        "G06T2207/30261",
        "G06V2201/10"
    ],
    "abstract": "A vehicular vision system includes a side-viewing camera mounted within an exterior rearview mirror assembly attached at a side of a vehicle equipped with the vehicular vision system. The side-viewing camera has a field of view at least sideward of the side of the equipped vehicle at which the exterior rearview mirror assembly is attached. The side-viewing camera captures an image of a scene occurring exterior of the equipped vehicle. The captured image includes an image data set representative of the exterior scene. A control includes an image processor, and the image data set is provided to the control. The control processes a reduced image data set of the image data set provided to the control to detect edges present exterior of the equipped vehicle within an area of interest of the scene occurring exterior of the equipped vehicle that is within the field of view of the side-viewing camera.",
    "claims": "\n1. A vehicular vision system, said vehicular vision system comprising:\na side-viewing camera mounted within an exterior rearview mirror assembly that is attached at a side of a vehicle equipped with said vehicular vision system;\nsaid side-viewing camera having a field of view at least sideward of the side of the equipped vehicle at which the exterior rearview mirror assembly is attached;\nwherein said side-viewing camera captures an image of a scene occurring exterior of the equipped vehicle;\nthe captured image comprising an image data set representative of the exterior scene;\na control comprising an image processor;\nwherein the image data set is provided to said control; and\nwherein said control processes a reduced image data set of the image data set provided to said control to detect edges present exterior of the equipped vehicle within an area of interest of the scene occurring exterior of the equipped vehicle that is within the field of view of said side-viewing camera.\n2. The vehicular vision system of claim 1, wherein said side-viewing camera is mounted within a driver-side exterior rearview mirror assembly of the equipped vehicle.\n3. The vehicular vision system of claim 2, wherein said side-viewing camera mounted within the driver-side exterior rearview mirror assembly of the equipped vehicle is part of a panoramic vision system of the equipped vehicle.\n4. The vehicular vision system of claim 1, wherein said side-viewing camera is mounted within a passenger-side exterior rearview mirror assembly of the equipped vehicle.\n5. The vehicular vision system of claim 4, wherein said side-viewing camera mounted within the passenger-side exterior rearview mirror assembly of the equipped vehicle is part of a panoramic vision system of the equipped vehicle.\n6. The vehicular vision system of claim 1, wherein said side-viewing camera comprises an imaging sensor, and wherein said imaging sensor comprises a CMOS imaging array having a plurality of photo-sensing pixels.\n7. The vehicular vision system of claim 1, wherein the reduced image data set is less than 75% of the image data set representative of the exterior scene.\n8. The vehicular vision system of claim 1, wherein the reduced image data set is less than 66% of the image data set representative of the exterior scene.\n9. The vehicular vision system of claim 1, wherein the reduced image data set is less than 50% of the image data set representative of the exterior scene.\n10. The vehicular vision system of claim 1, wherein said control, when processing the reduced image data set, weighs image data within the reduced image data set which is indicative of physical characteristics of an object of interest more than other image data within the reduced image data set which is not likely to be indicative of such an object of interest.\n11. The vehicular vision system of claim 1, wherein the detected edges present exterior of the equipped vehicle within the area of interest comprise edges of another vehicle.\n12. The vehicular vision system of claim 1, wherein the detected edges present exterior of the equipped vehicle within the area of interest comprise edges of a feature of a road the equipped vehicle is travelling on.\n13. The vehicular vision system of claim 12, wherein the feature of the road the equipped vehicle is travelling on comprises a lane marker.\n14. The vehicular vision system of claim 1, wherein said control applies an edge detection algorithm to the reduced image data set of the image data set provided to said control to detect edges present exterior of the equipped vehicle within the area of interest.\n15. A vehicular vision system, said vehicular vision system comprising:\na side-viewing camera mounted within an exterior rearview mirror assembly that is attached at a side of a vehicle equipped with said vehicular vision system;\nwherein said side-viewing camera comprises an imaging sensor;\nwherein said imaging sensor comprises a CMOS imaging array having a plurality of photo-sensing pixels;\nsaid side-viewing camera having a field of view at least sideward of the side of the equipped vehicle at which the exterior rearview mirror assembly is attached;\nwherein said side-viewing camera captures an image of a scene occurring exterior of the equipped vehicle;\nthe captured image comprising an image data set representative of the exterior scene;\na control comprising an image processor;\nwherein the image data set is provided to said control;\nsaid control processing a reduced image data set of the image data set provided to said control to detect edges present exterior of the equipped vehicle within an area of interest of the scene occurring exterior of the equipped vehicle that is within the field of view of said side-viewing camera; and\nwherein the reduced image data set is less than 50% of the image data set representative of the exterior scene.\n16. The vehicular vision system of claim 15, wherein said side-viewing camera is mounted within a driver-side exterior rearview mirror assembly of the equipped vehicle.\n17. The vehicular vision system of claim 16, wherein said side-viewing camera mounted within the driver-side exterior rearview mirror assembly of the equipped vehicle is part of a panoramic vision system of the equipped vehicle.\n18. The vehicular vision system of claim 15, wherein said side-viewing camera is mounted within a passenger-side exterior rearview mirror assembly of the equipped vehicle.\n19. The vehicular vision system of claim 18, wherein said side-viewing camera mounted within the passenger-side exterior rearview mirror assembly of the equipped vehicle is part of a panoramic vision system of the equipped vehicle.\n20. The vehicular vision system of claim 15, wherein said control, when processing the reduced image data set, weighs image data within the reduced image data set which is indicative of physical characteristics of an object of interest more than other image data within the reduced image data set which is not likely to be indicative of such an object of interest.\n21. The vehicular vision system of claim 15, wherein the detected edges present exterior of the equipped vehicle within the area of interest comprise edges of another vehicle.\n22. The vehicular vision system of claim 15, wherein the detected edges present exterior of the equipped vehicle within the area of interest comprise edges of a feature of a road the equipped vehicle is travelling on.\n23. The vehicular vision system of claim 22, wherein the feature of the road the equipped vehicle is travelling on comprises a lane marker.\n24. The vehicular vision system of claim 15, wherein said control applies an edge detection algorithm to the reduced image data set of the image data set provided to said control to detect edges present exterior of the equipped vehicle within the area of interest.\n25. A vehicular vision system, said vehicular vision system comprising:\na driver side-viewing camera mounted within a driver-side exterior rearview mirror assembly that is attached at a driver side of a vehicle equipped with said vehicular vision system;\nsaid driver side-viewing camera having a field of view at least sideward of the side of the equipped vehicle at which the driver-side exterior rearview mirror assembly is attached;\nsaid driver side-viewing camera comprising an imaging sensor operable to capture an image of a scene occurring exterior of the equipped vehicle at the driver side of the equipped vehicle;\nthe image captured by said imaging sensor of said driver side-viewing camera comprising a driver-side image data set representative of the scene occurring exterior of the equipped vehicle at the driver side of the equipped vehicle;\nwherein said imaging sensor of said driver side-viewing camera comprises a CMOS imaging array having a plurality of photo-sensing pixels;\na control comprising an image processor;\nwherein the driver-side image data set is provided to said control;\nsaid control applying an edge detection algorithm to a reduced image data set of the driver-side image data set provided to said control, the reduced image data set of the driver-side image data set being representative of a driver-side area of interest of the scene occurring exterior of the equipped vehicle at the driver side of the equipped vehicle that is within the field of view of said driver side-viewing camera;\nsaid control processing the reduced image data set representative of the driver-side area of interest of the scene occurring exterior of the equipped vehicle at the driver side of the equipped vehicle to detect edges present exterior of the equipped vehicle within the driver-side area of interest;\nwherein the reduced image data set representative of the driver-side area of interest is less than 50% of the image data set representative of the scene occurring exterior of the equipped vehicle at the driver side of the equipped vehicle;\na passenger side-viewing camera mounted within a passenger-side exterior rearview mirror assembly that is attached at a passenger side of the equipped vehicle;\nsaid passenger side-viewing camera having a field of view at least sideward of the side of the equipped vehicle at which the passenger-side exterior rearview mirror assembly is attached;\nsaid passenger side-viewing camera comprising an imaging sensor operable to capture an image of a scene occurring exterior of the equipped vehicle at the passenger side of the equipped vehicle;\nthe image captured by said imaging sensor of said passenger side-viewing camera comprising a passenger-side image data set representative of the scene occurring exterior of the equipped vehicle at the passenger side of the equipped vehicle;\nwherein said imaging sensor of said passenger side-viewing camera comprises a CMOS imaging array having a plurality of photo-sensing pixels;\nwherein the passenger-side image data set is provided to said control;\nsaid control applying an edge detection algorithm to a reduced image data set of the passenger-side image data set provided to said control, the reduced image data set of the passenger-side image data set being representative of a passenger-side area of interest of the scene occurring exterior of the equipped vehicle at the passenger side of the equipped vehicle that is within the field of view of said passenger side-viewing camera;\nsaid control processing the reduced image data set representative of the passenger-side area of interest of the scene occurring exterior of the equipped vehicle at the passenger side of the equipped vehicle to detect edges present exterior of the equipped vehicle within the passenger-side area of interest; and\nwherein the reduced image data set representative of the passenger-side area of interest is less than 50% of the image data set representative of the scene occurring exterior of the equipped vehicle at the passenger side of the equipped vehicle.\n26. The vehicular vision system of claim 25, wherein said driver side-viewing camera mounted within the driver-side exterior rearview mirror assembly of the equipped vehicle and said passenger side-viewing camera mounted within the passenger-side exterior rearview mirror assembly of the equipped vehicle are part of a panoramic vision system of the equipped vehicle.\n27. The vehicular vision system of claim 26, wherein said control, when processing the reduced image data set representative of the driver-side area of interest of the scene occurring exterior of the equipped vehicle at the driver side of the equipped vehicle, weighs image data within the reduced image data set representative of the driver-side area of interest which is indicative of physical characteristics of an object of interest more than other image data within the reduced image data set representative of the driver-side area of interest which is not likely to be indicative of such an object of interest.\n28. The vehicular vision system of claim 26, wherein said control, when processing the reduced image data set representative of the passenger-side area of interest of the scene occurring exterior of the equipped vehicle at the passenger side of the equipped vehicle, weighs image data within the reduced image data set representative of the passenger-side area of interest which is indicative of physical characteristics of an object of interest more than other image data within the reduced image data set representative of the passenger-side area of interest which is not likely to be indicative of such an object of interest.\n29. The vehicular vision system of claim 26, wherein the detected edges present exterior of the equipped vehicle within the driver-side area of interest comprise edges of a feature of a road the equipped vehicle is travelling on.\n30. The vehicular vision system of claim 26, wherein the detected edges present exterior of the equipped vehicle within the passenger-side area of interest comprise edges of a feature of a road the equipped vehicle is travelling on."
}