{
    "patent_id": "US-11700190-B2",
    "title": "Technologies for annotating process and user information for network flows ",
    "assignee": "Cisco Technology, Inc.",
    "publication_date": "2023-07-11",
    "patent_link": "https://patents.google.com/patent/US11700190B2/en",
    "inventors": [
        "Navindra Yadav",
        "Abhishek Ranjan Singh",
        "Anubhav Gupta",
        "Shashidhar Gandham",
        "Jackson Ngoc Ki Pang",
        "Shih-Chun Chang",
        "Hai Trong Vu"
    ],
    "classifications": [
        "H04L43/045",
        "G06F16/122",
        "G06F16/137",
        "G06F16/162",
        "G06F16/17",
        "G06F16/173",
        "G06F16/174",
        "G06F16/1744",
        "G06F16/1748",
        "G06F16/2322",
        "G06F16/235",
        "G06F16/2365",
        "G06F16/24578",
        "G06F16/248",
        "G06F16/285",
        "G06F16/288",
        "G06F16/29",
        "G06F16/9535",
        "G06F21/53",
        "G06F21/552",
        "G06F21/556",
        "G06F21/566",
        "G06F3/0482",
        "G06F3/04842",
        "G06F3/04847",
        "G06F9/45558",
        "G06N20/00",
        "G06N99/00",
        "G06T11/206",
        "H04J3/0661",
        "H04J3/14",
        "H04L1/242",
        "H04L41/046",
        "H04L41/0668",
        "H04L41/0803",
        "H04L41/0806",
        "H04L41/0816",
        "H04L41/0893",
        "H04L41/0894",
        "H04L41/12",
        "H04L41/16",
        "H04L41/22",
        "H04L41/40",
        "H04L43/02",
        "H04L43/026",
        "H04L43/04",
        "H04L43/062",
        "H04L43/08",
        "H04L43/0805",
        "H04L43/0811",
        "H04L43/0829",
        "H04L43/0841",
        "H04L43/0858",
        "H04L43/0864",
        "H04L43/0876",
        "H04L43/0882",
        "H04L43/0888",
        "H04L43/10",
        "H04L43/106",
        "H04L43/12",
        "H04L43/16",
        "H04L43/20",
        "H04L45/306",
        "H04L45/38",
        "H04L45/46",
        "H04L45/507",
        "H04L45/66",
        "H04L45/74",
        "H04L47/11",
        "H04L47/20",
        "H04L47/2441",
        "H04L47/2483",
        "H04L47/28",
        "H04L47/31",
        "H04L47/32",
        "H04L61/5007",
        "H04L63/0227",
        "H04L63/0263",
        "H04L63/06",
        "H04L63/0876",
        "H04L63/1408",
        "H04L63/1416",
        "H04L63/1425",
        "H04L63/1433",
        "H04L63/1441",
        "H04L63/145",
        "H04L63/1458",
        "H04L63/1466",
        "H04L63/16",
        "H04L63/20",
        "H04L67/01",
        "H04L67/10",
        "H04L67/1001",
        "H04L67/12",
        "H04L67/51",
        "H04L67/75",
        "H04L69/16",
        "H04L69/22",
        "H04L9/0866",
        "H04L9/3239",
        "H04L9/3242",
        "H04W72/54",
        "H04W84/18",
        "G06F2009/4557",
        "G06F2009/45587",
        "G06F2009/45591",
        "G06F2009/45595",
        "G06F2221/033",
        "G06F2221/2101",
        "G06F2221/2105",
        "G06F2221/2111",
        "G06F2221/2115",
        "G06F2221/2145",
        "H04L67/535"
    ],
    "abstract": "Systems, methods, and computer-readable media for annotating process and user information for network flows. In some embodiments, a capturing agent, executing on a first device in a network, can monitor a network flow associated with the first device. The first device can be, for example, a virtual machine, a hypervisor, a server, or a network device. Next, the capturing agent can generate a control flow based on the network flow. The control flow may include metadata that describes the network flow. The capturing agent can then determine which process executing on the first device is associated with the network flow and label the control flow with this information. Finally, the capturing agent can transmit the labeled control flow to a second device, such as a collector, in the network.",
    "claims": "\n1. A network traffic monitoring system comprising:\na plurality of distributed sensors, each sensor associated with a particular device of a plurality of physical or virtual devices, wherein:\neach sensor generates network flow data based upon packets sent and/or received via a network interface local to the particular device associated with that sensor;\na first device of the plurality of physical or virtual devices is associated with at least one first sensor of the plurality of distributed sensors and comprises a virtual machine;\na second device of the plurality of physical or virtual devices is associated with at least one second sensor and comprises a container; and\na third device of the plurality of physical or virtual devices is associated with at least one third sensor comprises a network switch; and\na backend comprising a collector, an analytics module, and a presentation module, wherein the collector includes a storage, and wherein the presentation module includes one or more application programming interface (API) segments;\nwherein the collector is communicably attached to a communications network and receives a plurality of network flow data from the plurality of distributed sensors via the attached communications network,\nwherein the analytics module evaluates the plurality of network flow data to establish patterns of a particular behavior of the plurality of physical or virtual devices, and uses a machine learning model to evaluate received information from the plurality of network flow data, and\nwherein upon identifying received information that varies from the machine learning model of the particular behavior of the plurality of physical or virtual devices, the system provides, via the presentation module, a report of anomalous flow data.\n2. The network traffic monitoring system of claim 1, wherein the analytics module further evaluates the plurality of network flow data to generate a directed control flow graph corresponding to components of a distributed application.\n3. The network traffic monitoring system of claim 2, wherein the presentation module includes a user interface, and wherein the presentation module creates a visual representation of the directed control flow graph via the user interface.\n4. The network traffic monitoring system of claim 2, wherein the analytics module annotates a node and/or an edge with one of a process ID, a process name, a username, a location, or an environment variable.\n5. The network traffic monitoring system of claim 4, wherein the presentation module includes a user interface, and wherein information about nodes, network flows, the directed control flow graph, and tags are visually represented via the user interface.\n6. The network traffic monitoring system of claim 1, wherein identifying received information that varies from the machine learning model of the particular behavior includes analyzing whether a particular flow from the plurality of network flow information complies with a security policy.\n7. The network traffic monitoring system of claim 1, wherein at least one API segment allows access via a database protocol.\n8. The network traffic monitoring system of claim 1, wherein at least one API segment allows access via a web server.\n9. The network traffic monitoring system of claim 1, wherein at least one API segment allows access for ad-hoc queries.\n10. A method of monitoring network traffic comprising:\nat a plurality of distributed sensors, each sensor associated with a particular device of a plurality of physical or virtual devices:\ngenerating network flow data based upon packets being sent and/or received via a network interface local to the particular device; and\nsending the network flow data via a communications network, wherein:\na first device of the plurality of physical or virtual devices is associated with at least one first sensor of the plurality of distributed sensors and comprises a virtual machine;\na second device of the plurality of physical or virtual devices is associated with at least one second sensor and comprises a container; and\na third device of the plurality of physical or virtual devices is associated with at least one third sensor comprises a network switch;\nreceiving, at a collector communicably attached to the communications network, a plurality of network flow data, each network flow data coming from a sensor of the plurality of distributed sensors;\nstoring at least a portion of the plurality of network flow data received by the collector; and\nanalyzing the plurality of network flow data received by the collector via an associated analytics module, wherein analyzing the plurality of network flow data includes:\nestablishing patterns of a particular behavior of the plurality of physical or virtual devices;\nusing a machine learning model to evaluate received information from the plurality of network flow data; and\nproviding, via a presentation module, a result of the analyzing.\n11. The method of claim 10, wherein analyzing the plurality of network flow data further comprises identifying received anomalous information that varies from the machine learning model of particular behavior, and wherein providing the result further comprises including analysis of the received anomalous information.\n12. The method of claim 10, wherein providing the result of the analyzing includes making the result available via an application programming interface (API).\n13. The method of claim 12, wherein the API is a database access API.\n14. The method of claim 12, wherein making the result available via an API includes allowing ad-hoc queries.\n15. The method of claim 12, wherein the API is provided via a web server.\n16. The method of claim 10, wherein providing the result of the analyzing includes making the result available via a graphical user interface.\n17. Non-transitory computer-readable media encoding a set of computer-readable instructions which, when executed on one or more processors on devices connected to a network, cause one or more devices to:\nat a plurality of distributed sensors, each sensor associated with a particular device of a plurality of physical or virtual devices:\ngenerate network flow data based upon packets sent and/or received via a network interface local to the particular device; and\nsend the network flow data via a communications network, wherein:\na first device of the plurality of physical or virtual devices is associated with at least one first sensor of the plurality of distributed sensors and comprises a virtual machine;\na second device of the plurality of physical or virtual devices is associated with at least one second sensor and comprises a container; and\na third device of the plurality of physical or virtual devices is associated with at least one third sensor comprises a network switch;\nreceive, at a collector communicably attached to the communications network, a plurality of network flow data, each network flow data coming from a sensor of the plurality of distributed sensors;\nstore at least a portion of the plurality of network flow data received by the collector; and\nanalyze, via an analytics module, the plurality of network flow data received by the collector, wherein the computer-readable instructions, when executed on the one or more processors, cause the one or more devices to:\nestablish patterns of a particular behavior of the plurality of physical or virtual devices;\nuse a machine learning model to evaluate received information from the plurality of network flow data; and\nprovide, via a presentation module, a result of the analyzing.\n18. The non-transitory computer-readable media of claim 17, further including instructions that, when executed by the one or more processors, cause the one or more devices to make the result available via an application programming interface (API).\n19. The non-transitory computer-readable media of claim 17, further including instructions that, when executed on the one or more processors, cause the one or more devices to make the result available via a graphical user interface.\n20. The non-transitory computer-readable media of claim 17, further including instructions that, when executed on the one or more processors, cause the one or more devices to identify received anomalous information that varies from the machine learning model of the particular behavior, wherein the result of the analyzing includes analysis of the anomalous information."
}