{
    "patent_id": "US-10503791-B2",
    "title": "System for creating a reasoning graph and for ranking of its nodes ",
    "assignee": "Borislav Agapiev",
    "publication_date": "2019-12-10",
    "patent_link": "https://patents.google.com/patent/US10503791B2/en",
    "inventors": [
        "Borislav Agapiev"
    ],
    "classifications": [
        "G06F16/951",
        "G06F16/9024",
        "G06F17/16",
        "G06N20/00",
        "G06N3/042",
        "G06N3/08",
        "G06N5/022",
        "G06N5/046"
    ],
    "abstract": "A Reasoning Graph is defined as a directed graph characterized by nodes that can be, but are not limited to, concepts, situations, conditions, events, and persons with edges between nodes if one node is a cause of another node (its effect). The Reasoning Graph is automatically generated by analyzing a large corpus text from a repository such as the Wide World Web and other sources. The analysis leads to creation of edges within the graph based on, for example, lexical and semantic analysis of the text. Nodes of the Reasoning Graph can be ranked according to eigenvalue analysis of the connectivity matrix associated with the Reasoning Graph, including through application of both random as well as reasoning surfer models.",
    "claims": "\n1. A system comprising:\na first plurality of computer systems each configured as Web crawlers deployed and configured to crawl unstructured text documents accessible via the World Wide Web, the first plurality of computer systems configured as Web crawlers each communicably coupled to one or more storage repositories and configured to store copies of said documents in said storage repositories;\na second plurality of computer systems each configured as causality extractors communicatively coupled to said storage repositories and configured to receive and operate on contents of the storage repositories to identify and extract cause/effect pairs according to causal relationships therebetween as reported in said unstructured text documents, said causality extractors further being configured to store said cause/effect pairs as linked nodes in a directed graph instantiated as a single data structure across one or more physical storage media communicably coupled to each of said second plurality of computer systems, in which said nodes of the directed graph are linked by edges representing causal relationships identified by said causality extractors,\nwherein respective ones of said second plurality of computer systems include respective processors and memories coupled to said processors, said memories including processor-executable instructions, which instructions, when executed by said processors, cause said processors to configure the respective ones of said computer systems as the causality extractors to operate on contents of the storage repositories to identify and extract the cause/effect pairs by:\nparsing said unstructured text documents stored by said Web crawlers,\nrecognizing, within segments of the unstructured text documents, keywords expressing causality relationships,\ndetermining boundaries of the cause/effect pairs in the unstructured text documents recognized to have keywords expressing the causality relationships, and\nstoring identified and bounded cause/effect pairs in the unstructured text documents as the nodes of the directed graph in ranked order the single data structure, wherein said nodes are ranked according to observations of surfers browsing said directed graph.\n2. The system of claim 1, wherein at least some of second plurality of computer systems configured as the causality extractors are configured, according to said instructions, to make boundary determinations of causes and effects through identification of lexical groups by occurrences of punctuation, stop-words and pronouns, adverbs, adjectives, and idioms.\n3. The system of claim 1, wherein at least some of the second plurality of computer systems configured as causality extractors are configured, according to said instructions, to make boundary determinations of causes and effects through use of a deep neural network trained using previous cause and effect boundaries determined by the system.\n4. The system of claim 1, wherein at least some of the second plurality of computer systems configured as causality extractors are configured, according to said instructions, to make boundary determinations of causes and effects through identification of lexical groups using one or more natural language toolkits that include libraries for one or more of: classification, tokenization, stemming, tagging, and parsing of unstructured text.\n5. The system of claim 1, wherein at least some of said unstructured text documents comprise hypertext markup language (HTML) documents from the World Wide Web."
}