{
    "patent_id": "US-11604951-B2",
    "title": "Image analysis and prediction based visual search ",
    "assignee": "Ebay Inc.",
    "publication_date": "2023-03-14",
    "patent_link": "https://patents.google.com/patent/US11604951B2/en",
    "inventors": [
        "Fan Yang",
        "Ajinkya Gorakhnath Kale",
        "Qiaosong Wang",
        "Mohammadhadi Kiapour",
        "Robinson Piramuthu"
    ],
    "classifications": [
        "G06K9/6277",
        "G06F16/50",
        "G06F16/532",
        "G06F16/583",
        "G06F18/2113",
        "G06F18/2411",
        "G06F18/2415",
        "G06K9/623",
        "G06K9/6269",
        "G06N3/044",
        "G06N3/0445",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/084",
        "G06N5/022",
        "G06V10/462",
        "G06V10/771",
        "G06N7/005",
        "G06N7/01"
    ],
    "abstract": "Methods, systems, and computer programs are presented for adding new features to a network service. A method includes receiving an image depicting an object of interest. A category set is determined for the object of interest and an image signature is generated for the image. Using the category set and the image signature, the method identifies a set of publications within a publication database and assigns a rank to each publication. The method causes presentation of the ranked list of publications at a computing device from which the image was received.",
    "claims": "\n1. A method, comprising:\nreceiving, by at least one processor of a server, at least one image depicting at least a portion of an object of interest;\nidentifying a set of aspects representing one or more attributes within the at least one image;\nidentifying, for each publication of a set of publications within a publication database of images, a set of metadata descriptors;\ngenerating, for each publication of the set of publications, an aspect score, the aspect score generated by at least combining values for each metadata descriptor that matches at least one of the set of aspects representing the one or more attributes of the object of interest within the at least one image;\ngenerating a ranked list of publications organized according to at least the aspect score for each publication; and\ncausing presentation of at least a portion of the ranked list of publications at a computing device from which the at least one image was received.\n2. The method of claim 1, wherein at least one aspect of the set of aspects comprises a visual attribute of the object of interest.\n3. The method of claim 1, wherein the set of aspects are determined based on edge detection, object recognition, color recognition, and/or pattern recognition.\n4. The method of claim 1, wherein the aspect score is generated based on a weighted comparison of the set of aspects of the object of interest and the set of metadata descriptors.\n5. The method of claim 4, wherein each metadata descriptor for each publication is assigned a weight value.\n6. The method of claim 1 further comprising:\ndetermining a probability that the object of interest includes each of the identified set of aspects, wherein the probability represents a confidence score for each of the identified set of aspects.\n7. A system, comprising:\none or more hardware processors; and\na non-transitory machine-readable storage medium including instructions that, when executed by the one or more hardware processors, cause the one or more hardware processors to perform operations comprising:\nreceiving, by at least one processor of a server, at least one image depicting at least a portion of an object of interest;\nidentifying a set of aspects representing one or more attributes within the at least one image;\nidentifying, for each publication of a set of publications within a publication database of images, a set of metadata descriptors;\ngenerating, for each publication of the set of publications, an aspect score, the aspect score generated by at least combining values for each metadata descriptor that matches at least one of the set of aspects representing the one or more attributes of the object of interest within the at least one image;\ngenerating a ranked list of publications organized according to at least the aspect score for each publication; and\ncausing presentation of at least a portion of the ranked list of publications at a computing device from which the at least one image was received.\n8. The system of claim 7, wherein at least one aspect of the set of aspects comprises a visual attribute of the object of interest.\n9. The system of claim 7, wherein the set of aspects are determined based on edge detection, object recognition, color recognition, and/or pattern recognition.\n10. The system of claim 7, wherein the aspect score is generated based on a weighted comparison of the set of aspects of the object of interest and the set of metadata descriptors.\n11. The system of claim 10, wherein each metadata descriptor for each publication is assigned a weight value.\n12. The system of claim 7, the operations further comprising:\ndetermining a probability that the object of interest includes each of the identified set of aspects, wherein the probability represents a confidence score for each of the identified set of aspects.\n13. A non-transitory machine-readable storage medium including instructions that, when executed by one or more processors of a machine, cause the machine to perform operations comprising:\nreceiving, by at least one processor of a server, at least one image depicting at least a portion of an object of interest;\nidentifying a set of aspects representing one or more attributes within the at least one image;\nidentifying, for each publication of a set of publications within a publication database of images, a set of metadata descriptors;\ngenerating, for each publication of the set of publications, an aspect score, the aspect score generated by at least combining values for each metadata descriptor that matches at least one of the set of aspects representing the one or more attributes of the object of interest within the at least one image;\ngenerating a ranked list of publications organized according to at least the aspect score for each publication; and\ncausing presentation of at least a portion of the ranked list of publications at a computing device from which the at least one image was received.\n14. The non-transitory machine-readable storage medium of claim 13, wherein at least one aspect of the set of aspects comprises a visual attribute of the object of interest.\n15. The non-transitory machine-readable storage medium of claim 13, wherein the set of aspects are determined based on edge detection, object recognition, color recognition, and/or pattern recognition.\n16. The non-transitory machine-readable storage medium of claim 13, wherein the aspect score is generated based on a weighted comparison of the set of aspects of the object of interest and the set of metadata descriptors.\n17. The non-transitory machine-readable storage medium of claim 16, wherein each metadata descriptor for each publication is assigned a weight value.\n18. The non-transitory machine-readable storage medium of claim 13, the operations further comprising:\ndetermining a probability that the object of interest includes each of the identified set of aspects, wherein the probability represents a confidence score for each of the identified set of aspects."
}