{
    "patent_id": "US-11010667-B2",
    "title": "Dictionary DGA detector model ",
    "assignee": "Capital One Services, Llc",
    "publication_date": "2021-05-18",
    "patent_link": "https://patents.google.com/patent/US11010667B2/en",
    "inventors": [
        "Kate Highnam",
        "Domenic Vincent Puzio",
        "Song Luo"
    ],
    "classifications": [
        "G06N3/084",
        "G06N3/08",
        "G06N3/044",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/049",
        "G06N3/082",
        "H04L61/1511",
        "H04L61/4511",
        "H04L63/0236",
        "H04L63/1433",
        "H04L63/1475",
        "H04L63/1483",
        "G06N20/20"
    ],
    "abstract": "Systems and methods are provided for detecting dictionary domain generation algorithm domain names using deep learning models. The system and method may comprise training and applying a model comprising a long short-term memory network, a convolutional neural network, and a feed forward neural network that accepts as input an output from the long short-term memory network and convolutional neural network. The system and method may provide a score indicating the likelihood that a domain name was generated using a dictionary domain generation algorithm domain name. The system and method may be provided as a service.",
    "claims": "\n1. A user device, comprising:\nat least one memory unit storing computer program instructions; and\none or more processors configured to execute the computer program instructions to perform operations comprising:\nreceiving a suspect domain name comprising a sequence of characters;\ngenerating a sequence of numbers based on the sequence of characters;\ngenerating a sequence of one-hot encoding vectors based on the sequence of numbers;\nmultiplying the sequence of one-hot encoding vectors with a vector of weights to generate a sequence of dense embedding vectors;\ngenerating, using a feedforward neural network model, a dictionary domain generation algorithm (DGA) score based on the sequence of dense embedding vectors, the feedforward neural network model comprising an input layer, one or more hidden layers, and an output layer, and wherein:\nthe sequence of dense embedding vectors are provided, as input, to (i) a long short-term memory neural network model and (ii) a convolutional neural network model, and\nthe input layer of the feedforward neural network model takes, as input, (i) neural node outputs of the long short-term memory neural network model and (ii) filter outputs of the convolutional neural network model; and\nblocking access to a website corresponding to the suspect domain name based on the dictionary DGA score and a predetermined threshold related to dictionary DGA scores.\n2. The user device of claim 1, wherein the operations further comprise:\ngenerating the neural node outputs based on the sequence of dense embedding vectors.\n3. The user device of claim 1, wherein the operations further comprise:\ngenerating the filter outputs of the convolutional neural network model based on the sequence of dense embedding vectors.\n4. The user device of claim 1, wherein the operations further comprise:\ndisplaying a message indicating the suspect domain name is a candidate dictionary DGA name.\n5. The user device of claim 4, wherein the message comprises a probability that the suspect domain name is a dictionary DGA name.\n6. The user device of claim 1, wherein blocking access comprises:\nadding the suspect domain name to a list of domains of known malicious sites.\n7. The user device of claim 1, wherein blocking access comprises:\ndisplaying a prompt at a display of the user device;\nreceiving a user input; and\nbased on the user input, blocking network traffic to and from a website corresponding to the suspect domain name.\n8. The user device of claim 1, wherein the operations further comprise:\nfreezing a user account associated with the suspect domain name based on the dictionary DGA score and the predetermined threshold.\n9. The user device of claim 1, wherein the operations further comprise:\nwiping the user device based on the dictionary DGA score and the predetermined threshold.\n10. The user device of claim 1, wherein the operations further comprise:\ntraining the long short-term memory neural network model, the convolutional neural network model, and the feedforward neural network model.\n11. The user device of claim 10, wherein the operations further comprise:\nrandomly assigning a vector of encoding weights and adjusting the vector of encoding weights during training to obtain an adjusted vector of encoding weights, wherein the vector of weights is the adjusted vector of encoding weights.\n12. The user device of claim 10, wherein training comprises:\nreceiving training data comprising legitimate domain names and dictionary DGA names.\n13. The user device of claim 1, wherein receiving the suspect domain name comprises:\nreceiving the suspect domain name in an email.\n14. The user device of claim 1, wherein receiving the suspect domain name comprises:\nreceiving the suspect domain name in a network log.\n15. The user device of claim 1, wherein generating a sequence of numbers based on the sequence of characters comprises at least one of appending or pre-pending dummy characters to a beginning or an end of the suspect domain name.\n16. The user device of claim 1, wherein the filter outputs of the convolutional neural network model comprise an output of a sliding window of a fixed character length.\n17. The user device of claim 1, wherein the operations further comprise:\nupdating the feedforward neural network model in response to a determination that the website corresponding to the suspect domain name is to be blocked.\n18. The user device of claim 1, wherein the operations further comprise:\nidentifying a file comprising instructions to contact the website corresponding to the suspect domain name; and\ndeleting the file.\n19. A computer-implemented method comprising:\nreceiving a suspect domain name comprising a sequence of characters;\ngenerating a sequence of numbers based on the sequence of characters;\ngenerating a sequence of one-hot encoding vectors based on the sequence of numbers;\nmultiplying the sequence of one-hot encoding vectors with a vector of weights to generate a sequence of dense embedding vectors;\ngenerating, using a feedforward neural network model, a dictionary domain generation algorithm (DGA) score based on the sequence of dense embedding vectors, the feedforward neural network model comprising an input layer, one or more hidden layers, and an output layer, wherein:\nthe sequence of dense embedding vectors are provided, as input, to (i) a long short-term memory neural network model and (ii) a convolutional neural network model, and\nthe input layer of the feedforward neural network model takes, as an input, (i) neural node outputs of the long short-term memory neural network model and (ii) filter outputs of the convolutional neural network model; and\nblocking access to a website corresponding to the suspect domain name based on the dictionary DGA score and a predetermined threshold related to dictionary DGA scores.\n20. A non-transitory computer-readable medium storing computer program instructions that, when executed by one or more processors, effectuates operations comprising:\nreceiving a suspect domain name comprising a sequence of characters;\ngenerating a sequence of numbers based on the sequence of characters;\ngenerating a sequence of one-hot encoding vectors based on the sequence of numbers;\nmultiplying the sequence of one-hot encoding vectors with a vector of weights to generate a sequence of dense embedding vectors;\ngenerating, using a feedforward neural network model, a dictionary domain generation algorithm (DGA) score based on the sequence of dense embedding vectors, the feedforward neural network model comprising an input layer, one or more hidden layers, and an output layer, wherein:\nthe sequence of dense embedding vectors are provided, as input, to (i) a long short-term memory neural network model and (ii) a convolutional neural network model, and\nthe input layer of the feedforward neural network model takes, as an input, (i) neural node outputs of the long short-term memory neural network model and (ii) filter outputs of the convolutional neural network model; and\nblocking access to a website corresponding to the suspect domain name based on the dictionary DGA score and a predetermined threshold related to dictionary DGA scores."
}