{
    "patent_id": "US-11783196-B2",
    "title": "Radio signal identification, identification system learning, and identifier deployment ",
    "assignee": "Virginia Tech Intellectual Properties, Inc.",
    "publication_date": "2023-10-10",
    "patent_link": "https://patents.google.com/patent/US11783196B2/en",
    "inventors": [
        "Timothy James O'Shea"
    ],
    "classifications": [
        "G06N3/086",
        "G06N20/00",
        "G06N3/045",
        "G06N3/08",
        "G06N3/082",
        "H04B17/30",
        "H04W24/08",
        "G06F18/217",
        "G06F2218/00",
        "G06N3/006",
        "G06N3/044",
        "G06N3/048"
    ],
    "abstract": "Methods, systems, and apparatus, including computer programs encoded on computer storage media, for training and deploying machine-learned identification of radio frequency (RF) signals. One of the methods includes: determining an RF signal configured to be transmitted through an RF band of a communication medium; determining first classification information that is associated with the RF signal, and that includes a representation of a characteristic of the RF signal or a characteristic of an environment in which the RF signal is communicated; using at least one machine-learning network to process the RF signal and generate second classification information as a prediction of the first classification information; calculating a measure of distance between (i) the second classification information that was generated by the at least one machine-learning network, and (ii) the first classification information associated with the RF signal; and updating the at least one machine-learning network based on the measure of distance.",
    "claims": "\n1. A method, performed by at least one processor, to process radio frequency (RF) signals, the method comprising:\ndetermining a first RF signal;\ndetermining first classification information associated with the first RF signal, the first classification information comprising an indication of a modulation type of the first RF signal;\ndetermining a plurality of basis signals;\nprojecting the first RF signal onto the plurality of basis signals to generate a plurality of basis coefficients for the first RF signal;\ngenerating second classification information as a prediction of the first classification information by processing the plurality of basis coefficients using at least one machine-learning network, wherein the at least one machine-learning network comprises a convolutional neural network (CNN) or a recurrent neural network (RNN);\ncalculating a measure of distance between the second classification information and the first classification information; and\nupdating the at least one machine-learning network based on the measure of distance between the second classification information and the first classification information.\n2. The method of claim 1, comprising:\nproviding the first RF signal into an analog-to-digital converter (ADC) and obtaining, as an output of the ADC, a plurality of sampled time series values, and\nprojecting the first RF signal onto the plurality of basis signals using the plurality of sampled time series values.\n3. The method of claim 1, wherein determining the first RF signal comprises generating the first RF signal by software simulation.\n4. The method of claim 1, wherein determining the first RF signal comprises:\nobtaining an initial RF signal from a stored dataset; and\naugmenting the initial RF signal with one or more of a random phase offset, a random frequency offset, a time offset, time dilation, delay spread, a fading effect, a distortion effect, an interference effect, a spatial propagation effect, a dispersion effect, a non-linear effect, noise, or content alteration, to obtain the first RF signal.\n5. The method of claim 1, wherein the at least one machine-learning network is configured to perform at least one of higher-order moment determination or multi-carrier extraction.\n6. The method of claim 1, wherein at least one of the first classification information or the second classification information indicates at least one of (i) a type of traffic, protocol, or standard that is carried by or that is utilized to transmit the first RF signal, (ii) a type of hardware apparatus that transmits or receives the first RF signal, (iii) a type of RF emission or a type of RF emission pattern occurring in a communication medium carrying the first RF signal, or (iv) a presence of one or more types of communications signals.\n7. The method of claim 1, comprising at least one of normalizing the first RF signal, filtering the first RF signal, or synchronizing the first RF signal.\n8. The method of claim 1, wherein updating the at least one machine-learning network comprises updating one or more weights in one or more layers of the at least one machine-learning network to cause an objective function that is based on classification error to have a determined characteristic.\n9. The method of claim 1, further comprising:\ndiscriminating a modulation type of a second RF signal using the at least one machine-learning network, wherein discriminating the modulation type of the second RF signal comprises:\nobtaining the second RF signal from a communication medium;\nproviding the second RF signal as input to the at least one machine-learning network;\nin response to providing the second RF signal as input to the at least one machine-learning network, obtaining a second output of the at least one machine-learning network; and\ndetermining, from the second output of the at least one machine-learning network, third classification information associated with the second RF signal, the third classification information indicative of the modulation type of the second RF signal.\n10. The method of claim 9, comprising determining information about an emitting device of the second RF signal based on the third classification information.\n11. The method of claim 10, wherein the information about the emitting device of the second RF signal comprises an identity of the emitting device, a usage level of the emitting device, on-times of the emitting device, or a location of the emitting device.\n12. The method of claim 9, wherein the third classification information associated with the second RF signal comprises at least one of an estimate of an RF signal type of the second RF signal or a likelihood or a pseudo-probability of a presence of a predetermined type of RF signal in the second RF signal.\n13. The method of claim 9, wherein obtaining the second RF signal from the communication medium comprises obtaining the second RF signal from a cellular communication channel.\n14. The method of claim 1, wherein the measure of distance between the second classification information and the first classification information comprises at least one of (i) a cross-entropy between the second classification information and the first classification information, or (ii) a geometric distance metric between the second classification information and the first classification information.\n15. The method of claim 1, comprising:\nupdating the plurality of basis signals based at least on the measure of distance between the second classification information and the first classification information.\n16. The method of claim 1, wherein the plurality of basis signals comprise In-Phase and Quadrature-Phase (I/Q) signals.\n17. The method of claim 1, wherein the at least one machine learning network is initialized using Quadrature Phase-Shift Keying (QPSK) basis signals, Gaussian Binary Frequency Shift Keying (GFSK) basis signals, or orthogonal frequency division multiple access (OFDM) basis signals.\n18. The method of claim 1, herein the at least one machine learning network is initialized using a random set of basis signals.\n19. The method of claim 1, wherein the at least one machine learning network comprises a bank of multiple filters, and\nwherein projecting the first RF signal onto the plurality of basis signals comprises correlating the first RF signal with the multiple filters to generate the plurality of basis coefficients.\n20. The method of claim 19, wherein the multiple filters are each tuned to a corresponding frequency.\n21. The method of claim 1, wherein the plurality of basis signals are parametrized, and\nwherein updating the at least one machine-learning network comprises updating parameters of the plurality of basis signals.\n22. One or more non-transitory computer readable media storing instructions that that are operable, when executed on one or more processors, to cause the one or more processors to perform operations comprising:\ndetermining a first radio-frequency (RF) signal;\ndetermining first classification information associated with the first RF signal, the first classification information comprising an indication of a modulation type of the first RF signal;\ndetermining a plurality of basis signals;\nprojecting the first RF signal onto the plurality of basis signals to generate a plurality of basis coefficients for the first RF signal;\ngenerating second classification information as a prediction of the first classification information by processing the plurality of basis coefficients using at least one machine-learning network, wherein the at least one machine-learning network comprises a convolutional neural network (CNN) or a recurrent neural network (RNN);\ncalculating a measure of distance between the second classification information and the first classification information; and\nupdating the at least one machine-learning network based on the measure of distance between the second classification information and the first classification information.\n23. The one or more non-transitory computer readable media of claim 22, wherein determining the first RF signal comprises at least one of\n(i) generating the first RF signal by software simulation; or\n(ii) obtaining an initial RF signal from a stored dataset, and augmenting the initial RF signal with one or more of a random phase offset, a random frequency offset, a time offset, time dilation, delay spread, a fading effect, a distortion effect, an interference effect, a spatial propagation effect, a dispersion effect, a non-linear effect, noise, or content alteration, to obtain the first RF signal.\n24. The one or more non-transitory computer readable media of claim 22, wherein the at least one machine-learning network is configured to perform at least one of higher-order moment determination or multi-carrier extraction.\n25. The one or more non-transitory computer readable media of claim 22, wherein at least one of the first classification information or the second classification information indicates at least one of (i) a type of traffic, protocol, or standard that is carried by or that is utilized to transmit the first RF signal, (ii) a type of hardware apparatus that transmits or receives the first RF signal, (iii) a type of RF emission or a type of RF emission pattern occurring in a communication medium carrying the first RF signal, or (iv) a presence of one or more types of communications signals.\n26. The one or more non-transitory computer readable media of claim 22, wherein the operations comprise:\ndiscriminating a modulation type of a second RF signal using the at least one machine-learning network, wherein discriminating the modulation type of the second RF signal comprises:\nobtaining the second RF signal from a communication medium;\nproviding the second RF signal as input to the at least one machine-learning network;\nin response to providing the second RF signal as input to the at least one machine-learning network, obtaining a second output of the at least one machine-learning network; and\ndetermining, from the second output of the at least one machine-learning network, third classification information associated with the second RF signal, the third classification information indicative of the modulation type of the second RF signal.\n27. The one or more non-transitory computer readable media of claim 26, wherein the operations comprise determining, based on the third classification information, an identity of an emitting device of the second RF signal, a usage level of the emitting device, on-times of the emitting device, or a location of the emitting device.\n28. The one or more non-transitory computer readable media of claim 26, wherein the third classification information associated with the second RF signal comprises at least one of an estimate of an RF signal type of the second RF signal or a likelihood or a pseudo-probability of a presence of a predetermined type of RF signal in the second RF signal.\n29. The one or more non-transitory computer readable media of claim 22, comprising:\nupdating the plurality of basis signals based at least on the measure of distance between the second classification information and the first classification information.\n30. A system comprising:\none or more processors; and\none or more storage devices storing instructions that are operable, when executed on the one or more processors, to cause the one or more processors to perform operations comprising:\ndetermining a first radio-frequency (RF) signal;\ndetermining first classification information associated with the first RF signal, the first classification information comprising an indication of a modulation type of the first RF signal;\ndetermining a plurality of basis signals;\nprojecting the first RF signal onto the plurality of basis signals to generate a plurality of basis coefficients for the first RF signal;\ngenerating second classification information as a prediction of the first classification information by processing the plurality of basis coefficients using at least one machine-learning network, wherein the at least one machine-learning network comprises a convolutional neural network (CNN) or a recurrent neural network (RNN);\ncalculating a measure of distance between the second classification information and the first classification information; and\nupdating the at least one machine-learning network based on the measure of distance between the second classification information and the first classification information.\n31. The system of claim 30, wherein determining the first RF signal comprises at least one of\n(i) generating the first RF signal by software simulation; or\n(ii) obtaining an initial RF signal from a stored dataset, and augmenting the initial RF signal with one or more of a random phase offset, a random frequency offset, a time offset, time dilation, delay spread, a fading effect, a distortion effect, an interference effect, a spatial propagation effect, a dispersion effect, a non-linear effect, noise, or content alteration, to obtain the first RF signal.\n32. The system of claim 30, wherein the at least one machine-learning network is configured to perform at least one of higher-order moment determination or multi-carrier extraction.\n33. The system of claim 30, wherein at least one of the first classification information or the second classification information indicates at least one of (i) a type of traffic, protocol, or standard that is carried by or that is utilized to transmit the first RF signal, (ii) a type of hardware apparatus that transmits or receives the first RF signal, (iii) a type of RF emission or a type of RF emission pattern occurring in a communication medium carrying the first RF signal, or (iv) a presence of one or more types of communications signals.\n34. The system of claim 30, wherein the operations comprise:\ndiscriminating a modulation type of a second RF signal using the at least one machine-learning network, wherein discriminating the modulation type of the second RF signal comprises:\nobtaining the second RF signal from a communication medium;\nproviding the second RF signal as input to the at least one machine-learning network;\nin response to providing the second RF signal as input to the at least one machine-learning network, obtaining a second output of the at least one machine-learning network; and\ndetermining, from the second output of the at least one machine-learning network, third classification information associated with the second RF signal, the third classification information indicative of the modulation type of the second RF signal.\n35. The system of claim 34, wherein the operations comprise determining, based on the third classification information, an identity of an emitting device of the second RF signal, a usage level of the emitting device, on-times of the emitting device, or a location of the emitting device.\n36. The system of claim 34, wherein the third classification information associated with the second RF signal comprises at least one of an estimate of an RF signal type of the second RF signal or a likelihood or a pseudo-probability of a presence of a predetermined type of RF signal in the second RF signal."
}