{
    "patent_id": "US-11023107-B2",
    "title": "Virtual teller systems and methods ",
    "assignee": "Nant Holdings Ip, Llc",
    "publication_date": "2021-06-01",
    "patent_link": "https://patents.google.com/patent/US11023107B2/en",
    "inventors": [
        "Patrick Soon-Shiong"
    ],
    "classifications": [
        "G06F3/0484",
        "G06Q50/10",
        "G06F9/453",
        "G06N5/022",
        "G06Q30/016"
    ],
    "abstract": "A virtual assistant ecosystem is presented. One can instantiate or construct a customized virtual assistant when needed by capturing a digital representation of one or more objects. A virtual assistant engine analyzes the digital representation to determine the nature or type of the objects present. The engine further obtains attributes for a desirable assistant based on the type of objects. Once the attributes are compiled the engine can then create the specific type of assistant required by the circumstances.",
    "claims": "\n1. A virtual assistant system comprising:\none or more processors; and\nat least one non-transitory memory device storing software instructions that, when executed by the one or more processors, cause the one or more processors to:\nobtain a digital representation of one or more objects associated with a user device, wherein the one or more objects are observed as represented in a scene captured in the digital representation, and wherein the scene includes at least one of a two-dimensional object, a three-dimensional object, and a four-dimensional object;\nidentify at least two digital features of at least one of the one or more objects from the digital representation in accordance with at least two data modalities observed in the digital representation, the at least two data modalities selected from a modality group comprising image data and auditory data;\nbased on the at least two digital features, determine at least one object type identifier indicative of an object type using object recognition processes;\ncompile a plurality of assistant attributes using the at least one object type identifier;\ninstantiate a virtual assistant that has a refined list of assistant attributes from the plurality of assistant attributes and is associated with the object type; and\nestablish a communication link between the user device and the virtual assistant.\n2. The system of claim 1, wherein the modality group further comprises at least one of location data, time data, and biometric data.\n3. The system of claim 1, wherein the digital representation includes at least one of the following data modalities: image data, audio data, video data, location data, time data, biometric data, and news data.\n4. The system of claim 1, wherein the at least one object type identifier adheres to an object type ontology.\n5. The system of claim 1, wherein the at least one object type identifier adheres to a hierarchical object namespace.\n6. The system of claim 1, wherein the virtual assistant comprises a user interface to a human assistant.\n7. The system of claim 6, wherein the communication link comprises a remote connection to the human assistant.\n8. The system of claim 1, wherein the virtual assistant comprises an automated assistant.\n9. The system of claim 1, wherein the virtual assistant comprises an instantiated virtual assistant.\n10. The system of claim 9, wherein the virtual assistant comprises a virtual machine within which the virtual assistant operates.\n11. The system of claim 1, wherein the virtual assistant comprises an avatar.\n12. The system of claim 11, wherein the one or more processors are further caused to present the avatar overlaid on a displayed image rendered on a display of the user device.\n13. The system of claim 1, wherein the one or more processors are further caused to obtain the digital representation of the object are disposed within the user device.\n14. The system of claim 13, wherein the user device comprises at least one of the following: a cell phone, a mobile phone, a table, a phablet, a vehicle, a kiosk, an appliance, a consumer electronic device, a game console, and a sensor platform.\n15. The system of claim 1, wherein the communication link comprises at least one of the following: a video link, an email link, a messaging link, a voice link, a tactile link, a gaming link, a shared internal memory, an application program interface call, and a proprietary protocol.\n16. The system of claim 1, wherein the virtual assistant comprises at least one of the following: a virtual bank teller, a virtual shopper, a virtual teacher, a virtual consultant, a virtual security personnel, a virtual healthcare provider, a virtual support person, a virtual call center person, a virtual companion, and a virtual pet.\n17. The system of claim 1, further comprising a plurality of assistance knowledge databases associated with different assistant types.\n18. The system of claim 17, wherein the one or more processors are further caused to select at least one assistance knowledge database according to an assistant type based on the at least one object type identifier.\n19. The system of claim 18, wherein the virtual assistant comprises an interface to the at least one assistance knowledge database selected.\n20. The system of claim 1, wherein the communication link comprises a secured channel.\n21. The system of claim 20, wherein the one or more processors are further caused to secure the secured channel according to security attributes determined from the at least two digital features.\n22. The system of claim 21, wherein the security attributes include at least one of the following: a security protocol, a key, a hash, an algorithm, and a certificate.\n23. The system of claim 1, wherein the at least two digital features include at least one of the following: a scale invariant feature, a descriptor, a location, a position, an orientation, an amplitude, a frequency, an envelope, a juxtaposition, a touch pattern, a fingerprint derived from the digital representation, and a biometric.\n24. The system of claim 1, wherein the one or more objects comprise at least one of the following: a person, a face, an image, an image of an image, a time-varying object, a 2D object, a 3D object, a vehicle, a poster, a magazine, a newspaper, an active device, a toy, a check, a financial document, a book, a page of a book, an item of clothing, an animal, and a piece of sporting equipment.\n25. The system of claim 1, wherein the digital representation is captured by a user of the user device for association with a user request for assistance.\n26. The system of claim 1, wherein the identifying comprises executing an implementation of at least one processing algorithm for digital feature derivation.\n27. The system of claim 1, wherein an object type database storing the at least one object type identifier comprises one or more tree data structures.\n28. The system of claim 27, wherein a final result set of object types indicated by the at least one object type identifier includes an intersection, or other overlap, of object types returned from at least one tree data structure of the one or more tree data structures.\n29. The system of claim 1, wherein the compiling includes obtaining at least one of user-generated and device-generated information that is contextual to circumstances of a user request.\n30. The system of claim 29, wherein the compiling includes removing assistant attributes from the plurality of assistant attributes determined to not correspond to the at least one object type identifier based on the at least one of user-generated and device-generated information to generate the refined list of assistant attributes.\n31. The system of claim 29, wherein the compiling includes adding assistant attributes to the plurality of assistant attributes that are determined to correspond to the at least one object type identifier based on the at least one of user-generated and device-generated contextual information.\n32. A computerized method for implementing a virtual assistant, the method comprising:\nobtaining a digital representation of one or more objects associated with-a user device, wherein the one or more objects are observed as represented in a scene in the digital representation, and wherein the scene includes at least one of a two-dimensional object, a three-dimensional object, and a four-dimensional object;\nidentifying at least two digital features of at least one of the one or more objects from the digital representation in accordance with at least two data modalities observed in the digital representation, the at least two data modalities selected from a modality group comprising image data and auditory data;\nbased on the at least two digital features, determining at least one object type identifier indicative of an object type using object recognition processes;\ncompiling a plurality of assistant attributes using the at least one object type identifier;\ninstantiating a virtual assistant that has a refined list of assistant attributes from the plurality of assistant attributes and is associated with the object type; and\nestablishing a communication link between the user device and the virtual assistant.\n33. A computer program product embedded in a non-transitory computer readable medium comprising instructions executable by a computer processor for implementing a virtual assistant, the instructions being executable by a computer processor to execute processing comprising:\nobtaining a digital representation of one or more objects associated with-a user device, wherein the one or more objects are observed as represented in a scene in the digital representation, and wherein the scene includes at least one of a two-dimensional object, a three-dimensional object, and a four-dimensional object;\nidentifying at least two digital features of at least one of the one or more objects from the digital representation in accordance with at least two data modalities observed in the digital representation, the at least two data modalities selected from a modality group comprising image data and auditory data;\nbased on the at least two digital features, determining at least one object type identifier indicative of an object type using object recognition processes;\ncompiling a plurality of assistant attributes using the at least one object type identifier;\ninstantiating a virtual assistant that has a refined list of assistant attributes from the plurality of assistant attributes and is associated with the object type; and\nestablishing a communication link between the user device and the virtual assistant."
}