{
    "patent_id": "US-11419608-B2",
    "title": "Interlocking buttress material retention system ",
    "assignee": "Covidien Lp",
    "publication_date": "2022-08-23",
    "patent_link": "https://patents.google.com/patent/US11419608B2/en",
    "inventors": [
        "Megan L. (Prommersberger) Stopek"
    ],
    "classifications": [
        "A61B17/105",
        "A61B17/0682",
        "A61B17/0686",
        "A61B17/072",
        "A61B17/07207",
        "A61B17/07292",
        "A61B17/32",
        "A61B17/068",
        "A61B2017/00004",
        "A61B2017/00893",
        "A61B2017/07214",
        "A61B2017/320052"
    ],
    "abstract": "A surgical stapler is provided having a pair of jaws including a staple containing cartridge and an anvil. Buttress material is releasable affixed to the staple containing cartridge and the anvil. One of the jaws includes a pair of longitudinal projections at a first end of the jaw and configured to frictionally engage corresponding slots in a first end the buttress material. One of the jaws includes a post at a second end of the jaw. The buttress material includes a hole in a second end of the buttress material for receipt of the post.",
    "claims": "\n1. An anvil buttress retention system, comprising:\nan anvil including a tissue facing surface defining a longitudinal slot therein, the tissue facing surface including a post extending therefrom, the post defining a channel therethrough that is aligned with the longitudinal slot; and\na buttress material disposed on the tissue facing surface of the anvil and releasably engaged with the post.\n2. The anvil buttress retention system according to claim 1, wherein the buttress material includes a hole defined therethrough that is engaged with the post.\n3. The anvil buttress retention system according to claim 1, wherein the post includes an enlarged cap having a flange facing the tissue facing surface, the buttress material positioned between the flange and the tissue facing surface.\n4. The anvil buttress retention system according to claim 1, wherein the tissue facing surface of the anvil includes a projection extending therefrom, the post disposed at a first end portion of the anvil and the projection disposed at a second end portion of the anvil, the buttress material releasably engaged with the projection.\n5. The anvil buttress retention system according to claim 4, wherein the projection is disposed laterally of the longitudinal slot.\n6. The anvil buttress retention system according to claim 4, wherein the projection is a first projection and the tissue facing surface of the anvil includes a second projection extending therefrom, the second projection disposed substantially parallel to the first projection and releasably engaged with the buttress material.\n7. The anvil buttress retention system according to claim 4, wherein the buttress material includes a cutout defined therethrough that is engaged with the projection.\n8. The anvil buttress retention system according to claim 7, wherein the cutout of the buttress material is defined through an outer terminal edge of the buttress material.\n9. A cartridge buttress retention system, comprising:\na staple cartridge including a tissue facing surface defining a knife channel therethrough, the tissue facing surface including a post extending therefrom, the post defining a channel therethrough that is aligned with the knife channel; and\na buttress material disposed on the tissue facing surface of the staple cartridge and releasably engaged with the post.\n10. The cartridge buttress retention system according to claim 9, wherein the buttress material includes a hole defined therethrough that is engaged with the post.\n11. The cartridge buttress retention system according to claim 9, wherein the post includes an enlarged cap having a flange facing the tissue facing surface, the buttress material positioned between the flange and the tissue facing surface.\n12. The cartridge buttress retention system according to claim 9, wherein the tissue facing surface of the staple cartridge includes a projection extending therefrom, the post disposed at a first end portion of the staple cartridge and the projection disposed at a second end portion of the staple cartridge, the buttress material releasably engaged with the projection.\n13. The cartridge buttress retention system according to claim 12, wherein the projection is disposed laterally of the knife channel.\n14. The cartridge buttress retention system according to claim 12, wherein the projection is a first projection and the tissue facing surface of the staple cartridge includes a second projection extending therefrom, the second projection disposed substantially parallel to the first projection and releasably engaged with the buttress material.\n15. The cartridge buttress retention system according to claim 12, wherein the buttress material includes a cutout defined therethrough that is engaged with the projection.\n16. The cartridge buttress retention system according to claim 15, wherein the cutout of the buttress material is defined through an outer terminal edge of the buttress material."
}