{
    "patent_id": "US-11704642-B2",
    "title": "Blaze non-browser based application for purchasing digital products ",
    "assignee": "Michelle Fisher",
    "publication_date": "2023-07-18",
    "patent_link": "https://patents.google.com/patent/US11704642B2/en",
    "inventors": [
        "Michelle Fisher"
    ],
    "classifications": [
        "G06Q20/20",
        "G06Q10/10",
        "G06Q20/00",
        "G06Q20/108",
        "G06Q20/16",
        "G06Q20/202",
        "G06Q20/204",
        "G06Q20/206",
        "G06Q20/32",
        "G06Q20/322",
        "G06Q20/3223",
        "G06Q20/3226",
        "G06Q20/3227",
        "G06Q20/325",
        "G06Q20/3255",
        "G06Q20/326",
        "G06Q20/3278",
        "G06Q20/3674",
        "G06Q20/382",
        "G06Q20/3821",
        "G06Q20/40",
        "G06Q20/4012",
        "G06Q20/4014",
        "G06Q20/409",
        "G06Q30/02",
        "G06Q30/0222",
        "G06Q30/0238",
        "G06Q30/0251",
        "G06Q30/0253",
        "G06Q30/0255",
        "G06Q30/0267",
        "G06Q30/0268",
        "G06Q30/06",
        "G06Q30/0613",
        "G06Q30/0635",
        "G06Q40/10",
        "G06Q40/12",
        "H04B5/0025",
        "H04M1/72445",
        "H04W4/18",
        "H04W4/21",
        "H04W8/205",
        "G06Q20/10",
        "G06Q20/105",
        "G06Q40/00",
        "G07F7/1008",
        "H04N21/812",
        "H04W4/02",
        "H04W4/029",
        "H04W4/80",
        "H04W88/02"
    ],
    "abstract": "A method and system for conducting an online payment transaction through a point of sale device. The method includes receiving input from a user selecting an item for purchase through the point of sale device; calculating a total purchase amount for the item in response to a request from the user to purchase the item; and sending payment authorization for the total purchase amount from the point of sale device to a payment entity, in which the payment authorization is sent to the payment entity via a mobile communication device of the user. The method further includes receiving a result of the payment authorization from the payment entity through the mobile communication device; and completing the payment transaction based on the result of the payment authorization.",
    "claims": "\n1. A method for processing a transaction to purchase a product, comprising:\nmaintaining a non-browser based application in a mobile device memory included in a mobile device, wherein the non-browser based application is a mobile operating system platform based mobile application with a graphical user interface which includes a graphical icon that is preinstalled or downloaded and installed on the mobile device, the mobile device comprising the mobile device memory, a mobile device display, a mobile device processor, a mobile device wireless radio interface that supports voice and data interactions through a first wireless communication channel, and a mobile device wireless fidelity (Wi-Fi) transceiver;\nreceiving, at the non-browser based application, a list of products from a remote management server for display using the non-browser based application;\nreceiving, at the non-browser based application an identification of one or more products selected from the list of products, wherein the non-browser based application receives the identification of the one or more products selected from the list of products through user input via the mobile device display;\ntransmitting, from the non-browser based application, the identification of the one or more products to the remote management server;\nreceiving, at the non-browser based application, a transaction purchase request for the one or more products, wherein the non-browser based application receives the transaction purchase request for the one or more products through user input via the mobile device display;\nafter receiving the transaction purchase request for the one or more products, transmitting, from the non-browser based application, the transaction purchase request for the one or more products to the remote management server;\nafter transmitting the transaction purchase request for the one or more products, receiving, at the non-browser based application, user input login information including a userID, wherein the non-browser based application receives the user input information including a userID through user input via the mobile device display;\nafter receiving the user input login information including the userID, transmitting, from the non-browser based application, the user input login information to the remote management server which authenticates the user associated with the user input login information;\nreceiving, at the mobile device, the one or more products from the remote management server after a transaction server processes the transaction using a payment method that corresponds to the userID, wherein the payment method is maintained at the remote management server; and\nreceiving, at the non-browser based application, digital artifact from the remote management server.\n2. The method of claim 1, wherein the payment method is a credit card, debit card, or prepaid card.\n3. The method of claim 1, wherein the user input login information includes information related to biometric data.\n4. The method of claim 1, wherein the user input login information includes information related to a personal identification number (PIN).\n5. The method of claim 1, wherein the digital artifact comprises a receipt, advertisement, coupon, content, media, or a ticket.\n6. The method of claim 1, further wherein the digital artifact is stored in the mobile device memory and accessible by the non-browser based application.\n7. The method of claim 6, further wherein the digital artifact is stored in the mobile device memory to improve the mobile performance, mobile device usability, user experience, and user convenience.\n8. The method of claim 1, further wherein the non-browser based application displays the digital artifact while the mobile device maintains a connection to a wireless network; and\nfurther comprises:\nlosing the connection of the mobile device to the wireless network while the non-browser based application displays the digital artifact; and\nin an offline mode, after losing the connection, continuing to display the digital artifact within the non-browser based application.\n9. The method of claim 1, further wherein the non-browser based application monitors for access to a wireless network and automatically reconnects to the wireless network when the wireless network is available.\n10. The method of claim 1, further wherein the non-browser based application generates an alert if it has not received the one or more products from the remote management server within a certain period of time.\n11. The method of claim 1, further wherein the non-browser based application requests retransmission of the one or more products from the remote management server.\n12. The method of claim 1, wherein the remote management server sends the digital artifact to the non-browser based application based on the geographical location of the mobile device.\n13. The method of claim 1, further wherein the non-browser based application receives input to zoom into an image associated with the product which results in an updated image of the product being displayed, wherein the non-browser based application receives the input to zoom into the image associated with the product via the mobile device display of the mobile device.\n14. The method of claim 1, further wherein the remote management server is configured to store a single userID for a plurality of mobile devices.\n15. The method of claim 1, further wherein no sensitive data is stored on the mobile device.\n16. The method of claim 15, wherein the sensitive data is information related to the payment method.\n17. The method of claim 1, further wherein the non-browser based application is configured to use a structured format and further wherein the structured format means the non-browser based application can store and display the digital artifact on the mobile device in an organized and easily retrievable fashion.\n18. A mobile device to process a transaction for purchasing a product, comprising:\na mobile device memory included in the mobile device, the mobile device memory configured to store a non-browser based application, wherein the non-browser based application is a mobile operating system platform based mobile application with a graphical user interface which includes a graphical icon that is preinstalled or downloaded and installed on the mobile device;\na mobile device wireless interface consisting of at least one of a wireless fidelity (Wi-Fi) interface; and\na mobile device wireless radio interface that supports voice and data interactions through a first wireless communication channel device configured to:\nreceive, at the non-browser based application, a list of products from a remote management server for display using the non-browser based application;\ntransmit, from the mobile device, an identification of one or more products to the remote management server;\ntransmit, from the non-browser based application, a transaction purchase request for the one or more products to the remote management server;\ntransmit, from the non-browser based application, user input login information including a userID to the remote management server which authenticates the user associated with the user input login information,\nreceive, at the mobile device, the one or more products from the remote management server after a transaction server processes the transaction using a payment method that corresponds to the userID, wherein the payment method is maintained at the remote management server; and\nreceive, at the non-browser based application, a digital artifact from the remote management server;\na mobile device input interface configured to:\nreceive, at the non-browser based application, the identification of the one or more products selected from the list of products, wherein the non-browser based application receives the receives the identification of the one or more products selected from the list of products through user input via the mobile device display;\nreceive, at the non-browser based application, the transaction purchase request for the one or more products, wherein the non-browser based application receives the transaction purchase request for the one or more products through user input via the mobile device display; and\nreceive, at non-browser based application, the user input login information including the userID, wherein the non-browser based application receives the user input login information including userID through user input via the mobile device display.\n19. The mobile device of claim 18, wherein the payment method is a credit card, debit card, or prepaid card.\n20. The mobile device of claim 18, wherein the user input login information includes information related to biometric data.\n21. The mobile device of claim 18, wherein the user input login information includes information related to a personal identification number (PIN).\n22. The mobile device of claim 18, wherein the digital artifact comprises a receipt, advertisement, coupon, content, media, or a ticket.\n23. The mobile device of claim 18, further wherein the digital artifact is stored in the mobile device memory and accessible by the non-browser based application.\n24. The mobile device of claim 23, further wherein the digital artifact is stored in the mobile device memory to improve the mobile performance, mobile device usability, user experience, and user convenience.\n25. The mobile device of claim 18, further wherein the non-browser based application displays the digital artifact while the mobile device maintains a connection to a wireless network; and\nfurther comprises:\nlosing the connection of the mobile device to the wireless network while the non-browser based application displays the digital artifact; and\nin an offline mode, after losing the connection, continuing to display the digital artifact within the non-browser based application.\n26. The mobile device of claim 18, further wherein the non-browser based application monitors for access to a wireless network and automatically reconnects to the wireless network when the wireless network is available.\n27. The mobile device of claim 18, further wherein the, non-browser based application generates an alert if it has not received the one or more products from the remote management server within a certain period of time.\n28. The mobile device of claim 18, further wherein the non-browser based application requests retransmission of the one or more products from the remote management server.\n29. The mobile device of claim 18, wherein the remote management server sends the digital artifact to the non-browser based application based on the geographical location of the mobile device.\n30. The mobile device of claim 18, further wherein the non-browser based application receives input to zoom into an image associated with the product which results in an updated image of the product being displayed, wherein the non-browser based application receives the input to zoom into the image associated with the product via the mobile device display of the mobile device.\n31. The mobile device of claim 18, further wherein the remote management server is configured to store a single userID for a plurality of mobile devices.\n32. The mobile device of claim 18, further wherein no sensitive data is stored on the mobile device.\n33. The mobile device of claim 32, wherein the sensitive data is information related to the payment method.\n34. The mobile device of claim 18, further wherein the non-browser based application is configured to use a structured format and further wherein the structured format means the non-browser based application can store and display the digital artifact on the mobile device in an organized and easily retrievable fashion.\n35. The method of claim 1, further wherein the non-browser based application triggers a call to action using metadata associated with the digital artifact.\n36. The method of claim 14, further wherein a configuration means the remote management server scales.\n37. The method of claim 1, further wherein maintaining the payment method at the remote management server results in a more secure system.\n38. The method of claim 1, the non-browser based application is stored in a local mobile device memory during execution of the non-browser based application, a bulk storage mobile device memory when the non-browser based application is not being executed, and a cache mobile device memory to provide temporary storage of at least some non-browser based application in order to reduce the number of times the non-browser based application must be retrieved from the bulk storage mobile device memory during the execution.\n39. The mobile device of claim 18, further wherein the non-browser based application triggers a call to action using metadata associated with the digital artifact.\n40. The mobile device of claim 31, further wherein a configuration means the remote management server scales.\n41. The mobile device of claim 18, further wherein maintaining the payment method at the remote management server results in a more secure system.\n42. The mobile device of claim 18, the non-browser based application is stored in a local mobile device memory during execution of the non-browser based application, a bulk storage mobile device memory when the non-browser based application is not being executed, and a cache mobile device memory to provide temporary storage of at least some non-browser based application in order to reduce the number of times the non-browser based application must be retrieved from the bulk storage mobile device memory during the execution.\n43. The method of claim 35, wherein the call to action comprises redeeming a coupon, entering an email address, accepting a coupon, accepting a reward, receiving alerts, or receiving notification information.\n44. The mobile device of claim 39, wherein the call to action comprises redeeming a coupon, entering an email address, accepting a coupon, accepting a reward, receiving alerts, or receiving notification information."
}