{
    "patent_id": "US-11573909-B2",
    "title": "Apparatus, system, and method for managing commands of solid-state storage using bank interleave ",
    "assignee": "Unification Technologies Llc",
    "publication_date": "2023-02-07",
    "patent_link": "https://patents.google.com/patent/US11573909B2/en",
    "inventors": [
        "David Flynn",
        "Bert Lagerstedt",
        "John Strasser",
        "Jonathan Thatcher",
        "Michael Zappe"
    ],
    "classifications": [
        "G06F12/121",
        "G06F15/16",
        "G06F1/183",
        "G06F11/10",
        "G06F11/108",
        "G06F12/0246",
        "G06F12/0804",
        "G06F12/0868",
        "G06F12/12",
        "G06F12/123",
        "G06F13/28",
        "G06F13/4022",
        "G06F13/426",
        "G06F15/173",
        "G06F3/06",
        "G06F3/0604",
        "G06F3/0608",
        "G06F3/0613",
        "G06F3/0619",
        "G06F3/0643",
        "G06F3/065",
        "G06F3/0652",
        "G06F3/0656",
        "G06F3/0659",
        "G06F3/0679",
        "G06F3/0685",
        "G06F3/0688",
        "G06F9/52",
        "G06F9/54",
        "H04L67/02",
        "H05K7/1444",
        "H05K7/1487",
        "G06F2211/002",
        "G06F2211/103",
        "G06F2212/1032",
        "G06F2212/1044",
        "G06F2212/2022",
        "G06F2212/222",
        "G06F2212/70",
        "G06F2212/7203",
        "G06F2212/7205",
        "G06F2212/7208",
        "H04L67/1097",
        "Y02D10/00"
    ],
    "abstract": "An apparatus, system, and method are disclosed for efficiently managing commands in a solid-state storage device that includes a solid-state storage arranged in two or more banks. Each bank is separately accessible and includes two or more solid-state storage elements accessed in parallel by a storage input/output bus. The solid-state storage includes solid-state, non-volatile memory. The solid-state storage device includes a bank interleave that directs one or more commands to two or more queues, where the one or more commands are separated by command type into the queues. Each bank includes a set of queues in the bank interleave controller. Each set of queues includes a queue for each command type. The bank interleave controller coordinates among the banks execution of the commands stored in the queues, where a command of a first type executes on one bank while a command of a second type executes on a second bank.",
    "claims": "\n1. A system comprising:\na first controller that directs at least one command to a plurality of queues, wherein the at least one command is separated into the plurality of queues based on a command type of each command of the at least one command, and the plurality of queues comprises a first queue configured to store management commands and a second queue configured to store other commands; and\na second controller configured to receive the at least one command from the plurality of queues, generate subcommands based on the at least one command, and direct the subcommands to at least one bank of a solid state storage.\n2. The system of claim 1, wherein the first controller communicates with the second controller using a PCI-e bus.\n3. The system of claim 1, wherein the management commands are executable in an order different from the order in which the command were received in the first queue.\n4. The system of claim 1, wherein the at least one command is executable in an order different from the order in which the at least one command was received by the plurality of queues."
}