{
    "patent_id": "US-11296937-B2",
    "title": "Decentralized data storage and processing for IoT devices ",
    "assignee": "Intel Corporation",
    "publication_date": "2022-04-05",
    "patent_link": "https://patents.google.com/patent/US11296937B2/en",
    "inventors": [
        "Keith Nolan",
        "Mark Kelly",
        "Michael Nolan",
        "Davide Carboni",
        "John Brady",
        "Niall Cahill",
        "Ned M. Smith",
        "Gregory Burns"
    ],
    "classifications": [
        "H04L67/104",
        "H04L41/0806",
        "G06F16/1824",
        "G06F16/1834",
        "H04L41/12",
        "H04L41/5054",
        "H04L45/20",
        "H04L61/1505",
        "H04L61/2069",
        "H04L61/4505",
        "H04L61/5069",
        "H04L63/123",
        "H04L67/10",
        "H04L67/1046",
        "H04L67/1093",
        "H04L67/12",
        "H04L67/2809",
        "H04L67/303",
        "H04L67/562",
        "H04L69/18",
        "H04L69/22",
        "H04L9/0825",
        "H04L9/3239",
        "H04L9/50",
        "H04W12/106",
        "H04W12/69",
        "H04W12/76",
        "H04W4/08",
        "H04W4/70",
        "H04W84/22",
        "H04L2209/38",
        "H04L2209/56",
        "H04L41/0816",
        "H04L41/0886",
        "H04L41/16",
        "H04W84/18"
    ],
    "abstract": "Methods, apparatus, and articles of manufacture for decentralized data storage and processing for IoT devices are disclosed. An example apparatus includes memory; and a processor to cause storage of a contract in an off-chain datastore; generate a hash value of the contract; cause storage of the hash value on a blockchain to be accessible to multiple nodes in an IoT network; and cause storage of a transaction on the blockchain, the transaction corresponding to an objective of the contract based on data sensed by an IoT device in the IoT network.",
    "claims": "\n1. At least one non-transitory computer readable storage medium comprising instructions which, when executed, cause one or more processors to at least:\ncause storage of a contract in an off-chain datastore;\ngenerate a hash value of the contract;\ncause storage of the hash value on a blockchain to be accessible to multiple nodes in an IoT network; and\ncause storage of a transaction on the blockchain, the transaction corresponding to an objective of the contract based on data sensed by an IoT device in the IoT network.\n2. The at least one non-transitory computer readable storage medium of claim 1, wherein the hash value is a first hash value, the instructions to cause the one or more processors to at least:\ncause storage of a file in the off-chain datastore;\ngenerate a second hash value of the file;\ncause storage of the second hash value on the blockchain; and\nverify contents of the file have not changed based on the second hash value on the blockchain.\n3. The at least one non-transitory computer readable storage medium of claim 1, wherein the instructions cause the one or more processors to at least verify contents of the contract have not changed based on the hash value on the blockchain.\n4. The at least one non-transitory computer readable storage medium of claim 1, wherein at least one of the blockchain or the transaction is distributed to at least one of the multiple nodes in the IoT network.\n5. The at least one non-transitory computer readable storage medium of claim 1, wherein the blockchain is a ledger and the contract is a smart contract.\n6. The at least one non-transitory computer readable storage medium of claim 1, wherein the instructions cause the one or more processors to at least initiate the blockchain.\n7. The at least one non-transitory computer readable storage medium of claim 1, wherein the instructions cause the one or more processors to at least cause deployment of the blockchain to the multiple nodes in the IoT network.\n8. The at least one non-transitory computer readable storage medium of claim 1, wherein the instructions cause the one or more processors to at least access the transaction from the IoT network.\n9. An apparatus comprising:\nmemory; and\na processor to:\ncause storage of a contract in an off-chain datastore;\ngenerate a hash value of the contract;\ncause storage of the hash value on a blockchain to be accessible to multiple nodes in an IoT network; and\ncause storage of a transaction on the blockchain, the transaction corresponding to an objective of the contract based on data sensed by an IoT device in the IoT network.\n10. The apparatus of claim 9, wherein the hash value is a first hash value, the processor to:\ncause storage of a file in the off-chain datastore;\ngenerate a second hash value of the file;\ncause storage of the second hash value on the blockchain; and\nverify contents of the file have not changed based on the second hash value on the blockchain.\n11. The apparatus of claim 9, wherein the processor is to verify contents of the contract have not changed based on the hash value on the blockchain.\n12. The apparatus of claim 9, wherein at least one of the blockchain or the transaction is distributed to at least one of the multiple nodes in the IoT network.\n13. The apparatus of claim 9, wherein the blockchain is a ledger and the contract is a smart contract.\n14. The apparatus of claim 9, wherein the processor is to initiate the blockchain.\n15. The apparatus of claim 9, wherein the processor is to cause deployment of the blockchain to multiple nodes in the IoT network.\n16. The apparatus of claim 9, wherein the processor is to access the transaction from the IoT network.\n17. A system comprising:\nan off-chain datastore to store a contract; and\nan IoT device to:\ngenerate a hash value of the contract;\nstore the hash value on a blockchain accessible to multiple nodes in the system;\nsense data using a sensor;\ndetermine whether an objective of the contract is satisfied based on sensed data; and\nstore a transaction corresponding to the determination on the blockchain.\n18. The system of claim 17, wherein the hash value is a first hash value, wherein:\nthe off-chain datastore is to store a file; and\nthe IoT device is to:\ngenerate a second hash value of the file;\nstore the second hash value on the blockchain; and\nverify contents of the file have not changed based on the second hash value on the blockchain.\n19. The system of claim 17, wherein the IoT device is to verify contents of the contract have not changed based on the hash value on the blockchain.\n20. The system of claim 17, wherein the IoT device is to distribute at least one of the blockchain or the transaction to a second IoT device in the system.\n21. The system of claim 17, wherein the blockchain is a ledger and the contract is a smart contract."
}