{
    "patent_id": "US-11307048-B2",
    "title": "Method and system for providing travel time information ",
    "assignee": "Edward H. Nortrup",
    "publication_date": "2022-04-19",
    "patent_link": "https://patents.google.com/patent/US11307048B2/en",
    "inventors": [
        "Edward H. Nortrup"
    ],
    "classifications": [
        "G01C21/3694",
        "G01C21/3407",
        "G01C21/3415",
        "G01C21/3492",
        "G01C21/3608",
        "G01C21/362",
        "G01C21/3629",
        "G01C21/3667",
        "G01C21/3697",
        "G01S19/42",
        "G01S19/52",
        "G06Q30/0207",
        "G06Q30/0266",
        "G06Q30/0269",
        "G08G1/0112",
        "G08G1/012",
        "G08G1/0129",
        "G08G1/0133",
        "G08G1/0141",
        "G08G1/052",
        "G08G1/091",
        "G08G1/0967",
        "G08G1/096741",
        "G08G1/096775",
        "G08G1/096811",
        "G08G1/096883",
        "H04W4/024",
        "H04W4/025",
        "H04W4/027",
        "H04W4/12",
        "H04W4/40",
        "H04W4/48",
        "H04W4/80",
        "G06F8/60",
        "G06N5/022",
        "G06Q10/00",
        "G06Q10/06",
        "G06Q30/02",
        "H04M1/72457",
        "H04M1/72463",
        "H04M2250/10",
        "H04W4/02"
    ],
    "abstract": "Location technologies are combined with other information systems to provide augmented information for individuals such as a traveler in an automobile.",
    "claims": "\n1. An in-vehicle computer system, comprising:\nan in-vehicle data receiver forming a part of a vehicle configured to receive a roadway map of an area proximate a current location of a first cell phone, as determined by the first cell phone, and a route from the current location to a destination based, at least in part, on an estimated roadway traffic condition, and\nan in-vehicle computer display forming a part of the vehicle configured to display the roadway map and the route,\nwherein the estimated roadway traffic condition is estimated based, at least in part, on data representative of a location of each of a plurality of other cell phones determined to be moving vehicles based, at least in part, on each of the plurality of other cell phones' calculated proximity to a roadway or calculated speed.\n2. The in-vehicle computer system of claim 1, wherein the data representative of a location of each of a plurality of other cell phones is further representative of a user permission setting on each of the plurality of other cell phones allowing collection of its location.\n3. The in-vehicle computer system of claim 1, wherein the in-vehicle data receiver is configured to receive the roadway map and the route from the first cell phone via a wireless communication connection.\n4. The in-vehicle computer system of claim 1, wherein the in-vehicle data receiver is configured to receive the roadway map and the route from the first cell phone via a wired communication connection.\n5. The in-vehicle computer system of claim 1, wherein the roadway map further includes an estimated travel time to an arrival at the destination based at least in part on the estimated roadway traffic condition.\n6. The in-vehicle computer system of claim 1, wherein the route is a plurality of routes.\n7. The in-vehicle computer system of claim 6, wherein the roadway map further includes a travel time estimate for each of the plurality of routes.\n8. The in-vehicle computer system of claim 1, further comprising an in-vehicle audio system.\n9. The in-vehicle computer system of claim 1, further comprising an in-vehicle microphone system.\n10. The in-vehicle computer system of claim 1, wherein the in-vehicle computer display is a liquid crystal display (LCD).\n11. The in-vehicle computer of claim 1, wherein the in-vehicle computer display is mounted in a dashboard of the vehicle.\n12. The in-vehicle computer system of claim 1, wherein the in-vehicle computer system provides an alert that is received from another vehicle.\n13. An in-vehicle computer system, comprising:\nan in-vehicle data receiver forming a part of a vehicle configured to receive a roadway map of an area proximate a current location and a route from the current location to a destination based on an estimated roadway traffic condition; and\nan in-vehicle computer display forming a part of the vehicle configured to display the roadway map and the route,\nwherein the estimated roadway traffic condition is estimated, at least in part, on data representative of a location of a plurality of other cell phones presumed as being in moving vehicles based, at least in part, on each of the plurality of other cell phones' calculated proximity to a roadway or calculated speed.\n14. The in-vehicle computer system of claim 13, wherein the data representative of a location of a plurality of other cell phones is further representative of a user permission setting on each of the plurality of other cell phones allowing collection of its location.\n15. An in-vehicle computer system, comprising:\nan in-vehicle data receiver forming a part of a vehicle configured to receive a roadway map of an area proximate a current location and a visual indication of estimated roadway traffic condition; and\nan in-vehicle computer display forming a part of the vehicle configured to display the roadway map and a route,\nwherein the estimated roadway traffic condition is estimated, at least in part, on data representative of a location of a plurality of other cell phones presumed as being in moving vehicles based, at least in part, on each of the plurality of other cell phones' calculated proximity to a roadway or calculated speed.\n16. The in-vehicle computer system of claim 15, wherein the data representative of a location of a plurality of other cell phones is further representative of a user permission setting on each of the plurality of other cell phones allowing collection of its location.\n17. A computer system, comprising:\na data receiver configured to receive a roadway map of an area proximate a current location of a first cell phone, as determined by the first cell phone, and a route from the current location to a destination based on an estimated roadway traffic condition; and\na display configured to display the roadway map and the route,\nwherein the estimated roadway traffic condition is estimated, at least in part, on data representative of a location of a plurality of other cell phones presumed as being in moving vehicles based, at least in part, on each of the plurality of other cell phones' calculated proximity to a roadway or calculated speed.\n18. The in-vehicle computer system of claim 17, wherein the data representative of a location of a plurality of other cell phones is further representative of a user permission setting on each of the plurality of other cell phones allowing collection of its location."
}