{
    "patent_id": "US-11734607-B2",
    "title": "Data clean-up method for improving predictive model training ",
    "assignee": "Brighterion, Inc.",
    "publication_date": "2023-08-22",
    "patent_link": "https://patents.google.com/patent/US11734607B2/en",
    "inventors": [
        "Akli Adjaoute"
    ],
    "classifications": [
        "G06N20/00",
        "G06F16/215",
        "G06N5/04"
    ],
    "abstract": "A method that improves the training of predictive models. Better trained predictive models make better predictions, and can classify transactions with reduced levels of false positives and false negative. Included is an apparatus for executing a data clean-up algorithm that harmonizes a wide range of real world supervised and unsupervised training data into a single, error-free, uniformly formatted record file that has every field coherent and well populated with information.",
    "claims": "\n1. A computer-implemented method for training a predictive model, comprising:\nreceiving, at one or more processors, a record including a plurality of data fields;\ndetermining, via the one or more processors, that a data field of the plurality of data fields includes invalid contents using a data dictionary;\ngenerating a revised record based on the record at least in part by substituting, via the one or more processors, a replacement data value for the invalid contents of the data field based on the corresponding determination of invalidity;\ngenerating, via the one or more processors, a record file comprising a plurality of records including the revised record;\nexecuting, via the one or more processors, a computer learning training algorithm to train the predictive model based on the record file, the predictive model—\ncomprising a plurality of smart agents and a classification model including one or more of data mining logic, a neural network, case-based-reasoning, clustering, and business rules,\nbeing configured to combine a plurality of scores into a single predictive result.\n2. The computer-implemented method of claim 1, wherein the data dictionary is a numeric data dictionary, further comprising—\ndetermining, via the one or more processors, that the data field is a numeric data field based at least in part on detecting a corresponding numeric data field type;\naccessing, via the one or more processors and in connection with determination that the contents of the data field are invalid, the numeric data dictionary based at least in part on the determination of the numeric data field type.\n3. The computer-implemented method of claim 1, wherein the data dictionary is a symbolic data dictionary, further comprising—\ndetermining, via the one or more processors, that the data field is a symbolic data field based at least in part on detecting a corresponding symbolic data field type;\naccessing, via the one or more processors and in connection with determination that the contents of the data field are invalid, the symbolic data dictionary based at least in part on the determination of the symbolic data field type.\n4. The computer-implemented method of claim 2, wherein determining that the contents of the data field are invalid includes determining either: (A) that the contents are not numeric, or (B) that the contents are not within a numeric range.\n5. The computer-implemented method of claim 3, wherein determining that the contents of the data field are invalid includes determining one or more of the following: (A) that the data field is empty; (B) that the data field includes contents comprising allowed values not allowed in a set; (C) that the data field is of a zipcode type and includes contents comprising a zipcode that is not valid; (D) that the data field is of a telephone or fax type and includes contents comprising a telephone number or fax number that is not valid; (E) that the data field is of a date/time field type and does not contain at least one of a valid date and time.\n6. The computer-implemented method of claim 1, further comprising determining, via the one or more processors, the replacement data value according to at least one of the following: (A) a default value; (B) an average value; (C) a minimum value; (D) a maximum value; (E) a null value.\n7. The computer-implemented method of claim 1, wherein the replacement data value is a replacement symbolic data value, further comprising determining, via the one or more processors, the replacement symbolic data value according to at least one of the following: (A) a default value; (B) a most frequent value; and (C) a null value.\n8. The computer-implemented method of claim 1, wherein generating the record file includes—\nexecuting, via the one or more processors, a sampling algorithm to classify the plurality of records as supervised;\ndividing, via the one or more processors, the plurality of records into a first class and a second class;\ndetermining, via the one or more processors, that the first class is abnormal;\ndetermining, via the one or more processors, that the second class is normal;\ndown-sampling and generating sampled records from, via the one or more processors, the second class of the plurality of records based at least in part on the determination that the second class is normal;\nwherein the record file includes the sampled records of the second class and the first class of the plurality of records.\n9. At least one server for training a predictive model, comprising:\none or more processors;\nnon-transitory computer-readable storage media having computer-executable instructions stored thereon, wherein when executed by the one or more processors the computer-readable instructions cause the one or more processors to—\nreceive a record including a plurality of data fields;\ndetermine that a data field of the plurality of data fields includes invalid contents using a data dictionary;\ngenerate a revised record based on the record at least in part by substituting a replacement data value for the invalid contents of the data field based on the corresponding determination of invalidity;\ngenerate a record file comprising a plurality of records including the revised record;\nexecute a computer learning training algorithm to train the predictive model based on the record file, the predictive model—\ncomprising a plurality of smart agents and a classification model including one or more of data mining logic, a neural network, case-based-reasoning, clustering, and business rules,\nbeing configured to combine a plurality of scores into a single predictive result.\n10. The at least one server of claim 9, wherein the data dictionary is a numeric data dictionary and the computer-readable instructions, when executed by the one or more processors, further cause the one or more processors to—\ndetermine that the data field is a numeric data field based at least in part on detecting a corresponding numeric data field type;\naccess, in connection with determination that the contents of the data field are invalid, the numeric data dictionary based at least in part on the determination of the numeric data field type.\n11. The at least one server of claim 9, wherein the data dictionary is a symbolic data dictionary and the computer-readable instructions, when executed by the one or more processors, further cause the one or more processors to—\ndetermine that the data field is a symbolic data field based at least in part on detecting a corresponding symbolic data field type;\naccess, in connection with determination that the contents of the data field are invalid, the symbolic data dictionary based at least in part on the determination of the symbolic data field type.\n12. The at least one server of claim 10, wherein determining that the contents of the data field are invalid includes determining either: (A) that the contents are not numeric, or (B) that the contents are not within a numeric range.\n13. The at least one server of claim 11, wherein determining that the contents of the data field are invalid includes determining one or more of the following: (A) that the data field is empty; (B) that the data field includes contents comprising allowed values not allowed in a set; (C) that the data field is of a zipcode type and includes contents comprising a zipcode that is not valid; (D) that the data field is of a telephone or fax type and includes contents comprising a telephone number or fax number that is not valid; (E) that the data field is of a date/time field type and does not contain at least one of a valid date and time.\n14. The at least one server of claim 9, wherein the computer-readable instructions, when executed by the one or more processors, further cause the one or more processors to determine the replacement data value according to at least one of the following: (A) a default value; (B) an average value; (C) a minimum value; (D) a maximum value; (E) a null value.\n15. The at least one server of claim 9, wherein the replacement data value is a replacement symbolic data value and the computer-readable instructions, when executed by the one or more processors, further cause the one or more processors to determine the replacement symbolic data value according to at least one of the following: (A) a default value; (B) a most frequent value; and (C) a null value.\n16. The at least one server of claim 9, wherein generating the record file includes—\nexecuting a sampling algorithm to classify the plurality of records as supervised;\ndividing the plurality of records into a first class and a second class;\ndetermining that the first class is abnormal;\ndetermining that the second class is normal;\ndown-sampling and generating sampled records from the second class of the plurality of records based at least in part on the determination that the second class is normal;\nwherein the record file includes the sampled records of the second class and the first class of the plurality of records.\n17. Non-transitory computer-readable storage media having computer-executable instructions for training a predictive model, wherein when executed by at least one processor the computer-readable instructions cause the at least one processor to:\nreceive a record including a plurality of data fields;\ndetermine that a data field of the plurality of data fields includes invalid contents using a data dictionary;\ngenerate a revised record based on the record at least in part by substituting a replacement data value for the invalid contents of the data field based on the corresponding determination of invalidity:\ngenerate a record file comprising a plurality of records including the revised record;\nexecute a computer learning training algorithm to train the predictive model based on the record file, the predictive model—\ncomprising a plurality of smart agents and a classification model including one or more of data mining logic, a neural network, case-based-reasoning, clustering, and business rules,\nbeing configured to combine a plurality of scores into a single predictive result.\n18. The non-transitory computer-readable storage media of claim 17, wherein the data dictionary is a numeric data dictionary and the computer-readable instructions, when executed by the one or more processors, further cause the one or more processors to—\ndetermine that the data field is a numeric data field based at least in part on detecting a corresponding numeric data field type;\naccess, in connection with determination that the contents of the data field are invalid, the numeric data dictionary based at least in part on the determination of the numeric data field type.\n19. The non-transitory computer-readable storage media of claim 17, wherein the data dictionary is a symbolic data dictionary and the computer-readable instructions, when executed by the one or more processors, further cause the one or more processors to—\ndetermine that the data field is a symbolic data field based at least in part on detecting a corresponding symbolic data field type;\naccess, in connection with determination that the contents of the data field are invalid, the symbolic data dictionary based at least in part on the determination of the symbolic data field type.\n20. The non-transitory computer-readable storage media of claim 17, wherein generating the record file includes—\nexecuting a sampling algorithm to classify the plurality of records as supervised;\ndividing the plurality of records into a first class and a second class;\ndetermining that the first class is abnormal;\ndetermining that the second class is normal;\ndown-sampling and generating sampled records from the second class of the plurality of records based at least in part on the determination that the second class is normal:\nwherein the record file includes the sampled records of the second class and the first class of the plurality of records."
}