{
    "patent_id": "US-11743275-B2",
    "title": "Machine learning based anomaly detection and response ",
    "assignee": "Netskope, Inc.",
    "publication_date": "2023-08-29",
    "patent_link": "https://patents.google.com/patent/US11743275B2/en",
    "inventors": [
        "Jeevan TAMBULURI",
        "Ravi Ithal",
        "Steve Malmskog",
        "Abhay Kulkarni",
        "Ariel Faigon",
        "Krishna Narayanaswamy"
    ],
    "classifications": [
        "H04L63/1416",
        "G06F21/554",
        "G06F21/6209",
        "G06N20/00",
        "G06N5/02",
        "G06N7/01"
    ],
    "abstract": "The technology relates to machine responses to anomalies detected using machine learning based anomaly detection. In particular, to receiving evaluations of production events, prepared using activity models constructed on per-tenant and per-user basis using an online streaming machine learner that transforms an unsupervised learning problem into a supervised learning problem by fixing a target label and learning a regressor without a constant or intercept. Further, to responding to detected anomalies in near real-time streams of security-related events of tenants, the anomalies detected by transforming the events in categorized features and requiring a loss function analyzer to correlate, essentially through an origin, the categorized features with a target feature artificially labeled as a constant. An anomaly score received for a production event is determined based on calculated likelihood coefficients of categorized feature-value pairs and a prevalencist probability value of the production event comprising the coded features-value pairs.",
    "claims": "\n1. A method of responding to a detected anomaly event that has not frequently been observed in an ongoing event stream of security-related events of one or more organizations, the method including:\nobtaining an evaluation of a plurality of production events with production space IDs, wherein the evaluation has been prepared for a production event by:\ntransforming features of the production event into categorical bins of a hash-space;\napplying a hash function to the production space ID and the features of the production event as transformed to retrieve likelihood coefficients for the transformed features of the production event and a standard candle for the production space ID;\ncalculating an anomaly score; and\nwhen the anomaly score represents a detected anomaly event, accessing history associated with the production space ID to construct a contrast between feature-event pairs of the detected anomaly event and non-anomalous feature-value pairs of prior events for the production space ID; and\nbased upon the evaluation as obtained, invoking one or more security actions including at least one of a quarantine, and an encryption, to be performed when at least one detected anomaly event is represented in the evaluation as obtained;\n2. The method of claim 1, wherein the loosely supervised machine learning of observed features in security-related events using a loss function analyzer and recording a standard candle, further includes:\ntransforming training events by assigning the observed features into categorical bins and coding assigned observed features with a Boolean value as present in their respective categorical bins; and\nanalyzing transformed training events using the loss function analyzer, treating the security-related events as having occurred with certainty, requiring the loss function analyzer to analyze the security-related events by a space identifier (ID), and requiring the loss function analyzer to fit the observed features as transformed essentially through an origin.\n3. The method of claim 1, further including generating for display the anomaly event in naturally processed language.\n4. The method of claim 1, further including:\nstoring a set of coded feature-value pairs and corresponding likelihood coefficients in a persistent storage using a dense feature representation; and\nstoring the set of coded feature-value pairs and corresponding likelihood coefficients on memory using a sparse feature representation.\n5. The method of claim 1, wherein the loss function analyzer is a stochastic gradient descent (SGD) analyzer.\n6. The method of claim 1, wherein events are annotated with prevalencist probability values of between 0 to 1, indicative of an occurrence frequency of the events.\n7. The method of claim 6, wherein a prevalencist probability value of 0 indicates previously unseen events.\n8. The method of claim 6, wherein a prevalencist probability value of 1 indicates frequently appearing events.\n9. The method of claim 6, further including:\nstoring the likelihood coefficients and prevalencist probability values for multiple space IDs of an organization in a hash-space as a tenant activity model, indicative of activity habits of users in the organization; and\nupdating the tenant activity model with new events to incorporate changes to one or more activity habits.\n10. The method of claim 6, further including:\nstoring the likelihood coefficients and prevalencist probability values for a particular space ID in a hash-space as a user activity model, indicative of activity habits of a user; and\nupdating the user activity model with new events to incorporate changes to one or more activity habits.\n11. The method of claim 6, further including:\ndetermining a relative-error ratio for a particular production event with a production space ID based on a predicted prevalencist probability value of the particular production event and an observed prevalencist probability value of the particular production event;\ndetermining a standard candle value for the production space ID based on a maximum likelihood coefficient feature-value pair in the particular production event;\nevaluating likelihood coefficients of individual feature-value pairs in the particular production event and determining one or more lowest likelihood coefficient feature-value pairs in the particular production event;\ncalculating an overall likelihood coefficient for the particular production event based on the one or more lowest likelihood coefficient feature-value pairs; and\ndetermining the particular production event to be an anomaly event when the relative-error ratio, the standard candle value and the overall likelihood coefficient exceed a threshold.\n12. The method of claim 11, further including distinguishing between a seasoned user and an unseasoned user by:\nrequiring initialization and analysis of a space ID by the loss function analyzer with the standard candle value; and\nmaturing the standard candle value of the production space ID to a target value responsive to a threshold number of events received for the space ID, wherein seasoned space IDs have non-zero standard candle values.\n13. The method of claim 11, further including:\nclustering a plurality of production events with lowest likelihood coefficient feature-value pairs based on a feature-dimension type; and\ngenerating for display clustered productions events for different feature-dimension types.\n14. The method of claim 1, further including updating tenant and user activity models over time, including maturing and storing frequently occurring anomalous events as normal user activity.\n15. A method of responding to detected anomalies in an event stream of security-related events of one or more organizations, the method including:\nobtaining an evaluation of a received security-related event that includes a space identifier (ID) and features with certain values; wherein the evaluation has been prepared by:\ntransforming feature-value pairs into categorical bins of a hash-space;\napplying a hash function to a combination of the space ID and the transformed feature-value pairs to retrieve likelihood coefficients for the transformed feature-value pairs and a standard candle for the space ID;\nscoring the likelihood coefficients and any transformed feature-value pairs that do not have likelihood coefficients because the transformed feature-value pairs that do not have likelihood coefficients were not previously observed for the space ID, in combination with evaluating the standard candle, to produce an anomaly score; and\nwhen the anomaly score represents a detected anomaly event, accessing history associated with the space ID to construct a contrast between feature-event pairs of the detected anomaly event and non-anomalous feature-value pairs of prior security-related events for the space ID; and\nbased upon the evaluation as obtained, invoking one or more security actions including at least one of a quarantine, and an encryption, to be performed when at least one detected anomaly event is represented in the evaluation as obtained.\n16. The method of claim 15, wherein a compressed set of stored likelihood coefficients and stored standard candles for a plurality of users has been expanded into a hash-space.\n17. A non-transitory computer readable storage medium impressed with computer program instructions to respond to a detected anomaly event that has not frequently been observed in an ongoing event stream of security-related events of one or more organizations, which computer program instructions, when executed on a processor, implement a method comprising:\nobtaining an evaluation of a plurality of production events with production space IDs, wherein the evaluation has been prepared for a production event by:\ntransforming features of the production event into categorical bins of a hash-space;\napplying a hash function to the production space ID and the features of the production event as transformed to retrieve likelihood coefficients for the transformed features of the production event and a standard candle for the production space ID;\ncalculating an anomaly score; and\nwhen the anomaly score represents a detected anomaly event, accessing history associated with the production space ID to construct a contrast between feature-event pairs of the detected anomaly event and non-anomalous feature-value pairs of prior events for the production space ID; and\nbased upon the evaluation as obtained, invoking one or more security actions including at least one of a quarantine, and an encryption, to be performed when at least one detected anomaly event is represented in the evaluation as obtained;\n18. A non-transitory computer readable storage medium impressed with computer program instructions to respond to detected anomalies in an event stream of security-related events of one or more organizations, which computer program instructions, when executed on a processor, implement the method of claim 15.\n19. A system including one or more processors coupled to memory loaded with computer instructions, which computer instructions, when executed on the processors, implement the method of claim 1.\n20. A system including one or more processors coupled to memory loaded with computer instructions, which computer instructions, when executed on the processors, implement the method of claim 15."
}