{
    "patent_id": "US-11681953-B2",
    "title": "Machine learning implementation for multi-analyte assay development and testing ",
    "assignee": "Freenome Holdings, Inc.",
    "publication_date": "2023-06-20",
    "patent_link": "https://patents.google.com/patent/US11681953B2/en",
    "inventors": [
        "Adam Drake",
        "Daniel Delubac",
        "Katherine Niehaus",
        "Eric Ariazi",
        "Imran Haque",
        "Tzu-Yu Liu",
        "Nathan Wan",
        "Ajay KANNAN",
        "Brandon White"
    ],
    "classifications": [
        "G16H50/20",
        "G06N20/10",
        "G16B20/00",
        "G16B40/20",
        "G16H20/10",
        "G16H50/70",
        "G06F18/24",
        "G06K9/6267",
        "G06N20/20",
        "G06N3/08",
        "G06N7/01",
        "Y02A90/10"
    ],
    "abstract": "Systems and methods that analyze blood-based cancer diagnostic tests using multiple classes of molecules are described. The system uses machine learning (ML) to analyze multiple analytes, for example cell-free DNA, cell-free microRNA, and circulating proteins, from a biological sample. The system can use multiple assays, e.g., whole-genome sequencing, whole-genome bisulfite sequencing or EM-seq, small-RNA sequencing, and quantitative immunoassay. This can increase the sensitivity and specificity of diagnostics by exploiting independent information between signals. During operation, the system receives a biological sample, and separates a plurality of molecule classes from the sample. For a plurality of assays, the system identifies feature sets to input to a machine learning model. The system performs an assay on each molecule class and forms a feature vector from the measured values. The system inputs the feature vector into the machine learning model and obtains an output classification of whether the sample has a specified property.",
    "claims": "\n1. A method of using a classifier capable of distinguishing a population of individuals having a specified property, the method comprising:\na) assaying a plurality of classes of molecules in a biological sample using a plurality of assays, wherein the assaying provides a plurality of sets of measured values representative of the plurality of classes of molecules, wherein the plurality of classes of molecules include cell-free nucleic acids and polyamino acids, wherein a first assay is applied to the cell-free nucleic acids to obtain a first set of measured values, and wherein a second assay is applied to the polyamino acids to obtain a second set of measured values, the plurality of sets of measured values including the first set of measured values from the first assay and the second set of measured values from the second assay;\nb) identifying a set of features corresponding to properties of each of the plurality of classes of molecules to be input to a machine learning model;\nc) preparing a feature vector of feature values from the plurality of sets of measured values representative of the plurality of classes of molecules, each feature value corresponding to a feature of the set of features, and each feature value including one or more measured values from the plurality of sets of measured values, wherein the feature vector includes at least one feature value obtained using each set of the plurality of sets of measured values representative of the plurality of classes of molecules;\nd) loading, into a memory of a computer system, the machine learning model comprising the classifier, the machine learning model trained using training vectors obtained from training biological samples, a first subset of the training biological samples identified as having the specified property and a second subset of the training biological samples identified as not having the specified property; and\ne) inputting the feature vector into the machine learning model to obtain an output classification of whether the biological sample has the specified property, thereby distinguishing the population of individuals having the specified property.\n2. The method of claim 1, wherein the specified property is a cancer selected from the group consisting of adenoma (adenomatous polyps), sessile serrated adenoma (SSA), advanced adenoma, colorectal dysplasia, colorectal adenoma, colorectal cancer, colon cancer, rectal cancer, colorectal carcinoma, colorectal adenocarcinoma, carcinoid tumors, gastrointestinal carcinoid tumors, gastrointestinal stromal tumors (GISTs), lymphomas, and sarcomas.\n3. The method of claim 1, wherein one or more additional classes of the plurality of classes of molecules are selected from a group consisting of cellular deoxyribonucleic acid (DNA), plasmid DNA, complementary DNA (cDNA), mitochondrial DNA (miDNA), an artificial nucleic acid analog, recombinant nucleic acid, plasmids, viral vectors, chromatin, peripheral blood mononuclear cell-derived (PBMC-derived) genomic DNA, ribonucleic acid (RNA), messenger RNA (mRNA), transfer RNA (tRNA), micro RNA (mitoRNA), ribosomal RNA (rRNA), circulating RNA (cRNA), alternatively spliced mRNAs, small nuclear RNAs (snRNAs), antisense RNA, short hairpin RNA (shRNA), small interfering RNA (siRNA), or fragments thereof.\n4. The method of claim 1, wherein the classifier has at least 90% specificity at 90% sensitivity in distinguishing the population of individuals having the specified property.\n5. The method of claim 1, wherein the feature values comprise values selected from a group consisting of a read count, a tumor fraction, a single nucleotide polymorphism, a copy number variation, translocations, an indel, a structural variant, fusions, mutations, differentially methylated regions (DMRs), haplotype blocks, transcription factor binding site coverage, transcription start sites, histone marker data, deoxyribonuclease (DNAse) hypersensitivity sites, telomere attrition, chromatin state, nucleosome occupancy, and distribution feature data.\n6. The method of claim 1, wherein each of the plurality of assays is applied to a different class of the plurality of classes of molecules.\n7. The method of claim 1, wherein one or more additional classes of the plurality of classes of molecules are selected from a group consisting of cfRNA molecules, circulating proteins, antibodies, carbohydrates, and metabolites.\n8. The method of claim 1, wherein one or more additional classes of the plurality of classes of molecules are selected from a group consisting of: 1) cfDNA, cfRNA, and small chemical molecules, or 2) cfRNA and small chemical molecules, or 3) cfRNA and small chemical molecules, or 4) cfDNA and cfRNA, or 5) cfDNA and small chemical molecules.\n9. The method of claim 1, wherein the cell-free nucleic acids are cell-free DNA or cell-free RNA.\n10. The method of claim 1, wherein the plurality of assays include at least two of: whole-genome sequencing (WGS), whole-genome bisulfate sequencing (WGSB), enzymatic methyl sequencing (EM-seq), small-ribonucleic acid (RNA) sequencing, quantitative immunoassay, enzyme-linked immunosorbent assay (ELISA), proximity extension assay (PEA), protein microarray, mass spectrometry, low-coverage Whole-Genome Sequencing (lcWGS); selective tagging 5mC sequencing, copy number variants (CNV) calling; tumor fraction (TF) estimation; LINE-1 CpG methylation; CpG methylation of at least 56 genes; cell-free Protein Immuno-Quant ELISAs, single molecule array (SIMOA); and cell-free micro RNA (miRNA) sequencing, and cell type or cell phenotype mixture proportions derived from any of the above assays.\n11. The method of claim 1, wherein the specified property is a responsiveness to a treatment.\n12. The method of claim 1, wherein the classifier is trained and constructed according to one or more of: linear discriminant analysis (LDA), partial least squares (PLS), random forest, k-nearest neighbor (KNN), support vector machine (SVM) with radial basis function kernel (SVMRadial), SVM with linear basis function kernel (SVMLinear), SVM with polynomial basis function kernel (SVMPoly), decision trees, multilayer perceptron, mixture of experts, sparse factor analysis, hierarchical decomposition, and combinations of linear algebra routines and statistics.\n13. The method of claim 1, wherein the specified property is a presence of a clinically-diagnosed disorder.\n14. The method of claim 1, wherein the specified property is a cancer selected from the group consisting of colorectal cancer, liver cancer, lung cancer, pancreatic cancer, and breast cancer.\n15. A method of determining responsiveness of an individual to a cancer treatment comprising:\na) assaying a plurality of classes of molecules in a biological sample wherein the assaying provides a plurality of sets of measured values representative of the plurality of classes of molecules, wherein the plurality of classes of molecules include cell-free nucleic acids and polyamino acids, wherein a first assay is applied to the cell-free nucleic acids to obtain a first set of measured values, and wherein a second assay is applied to the polyamino acids to obtain a second set of measured values, the plurality of sets of measured values including the first set of measured values from the first assay and the second set of measured values from the second assay;\nb) identifying a set of features corresponding to properties of each of the plurality of classes of molecules to be input to a machine learning model;\nc) preparing a feature vector of feature values from each of the plurality of sets of measured values representative of the plurality of classes of molecules, each feature value corresponding to a feature of the set of features, and each feature value including one or more measured values from the plurality of sets of measured values, wherein the feature vector includes at least one feature value obtained using each set of the plurality of sets of measured values representative of the plurality of classes of molecules;\nd) loading, into memory of a computer system, the machine learning model that is trained using training vectors obtained from training biological samples, a first subset of the training biological samples identified from individuals responding to the cancer treatment and a second subset of the training biological samples identified from individuals not responding to the cancer treatment; and\ne) inputting the feature vector into the machine learning model to obtain an output classification of whether the biological sample is associated with treatment response thereby determining the responsiveness to the cancer treatment.\n16. The method of claim 15, wherein the feature values comprise values selected from a group consisting of a read count, a tumor fraction, a single nucleotide polymorphism, a copy number variation, translocations, an indel, a structural variant, fusions, mutations, differentially methylated regions (DMRs), haplotype blocks, transcription factor binding site coverage, transcription start sites, histone marker data, deoxyribonuclease (DNAse) hypersensitivity sites, telomere attrition, chromatin state, nucleosome occupancy, and distribution feature data.\n17. He method of claim 15, wherein the individual has cancer, and wherein the cancer is colorectal cancer, liver cancer, lung cancer, pancreatic cancer, or breast cancer.\n18. The method of claim 15, wherein the cancer treatment is selected from alkylating agents, plant alkaloids, antitumor antibiotics, antimetabolites, topoisomerase inhibitors, retinoids, checkpoint inhibitor therapy, or VEGF inhibitors."
}