{
    "patent_id": "US-11732297-B2",
    "title": "Methods and apparatus for measuring analytes using large scale FET arrays ",
    "assignee": "Life Technologies Corporation",
    "publication_date": "2023-08-22",
    "patent_link": "https://patents.google.com/patent/US11732297B2/en",
    "inventors": [
        "Jonathan Rothberg",
        "Wolfgang Hinz",
        "Kim Johnson",
        "James Bustillo"
    ],
    "classifications": [
        "C12Q1/6869",
        "C12Q1/6874",
        "C12Q2533/101",
        "C12Q2565/301",
        "C12Q2565/607",
        "G01N27/414",
        "G01N27/4145",
        "G01N27/4148",
        "H01L21/306",
        "H01L24/18",
        "H01L24/20",
        "H01L24/82",
        "H01L27/088",
        "H01L29/78",
        "H01L2224/04105",
        "H01L2224/16",
        "H01L2224/76155",
        "H01L2224/82102",
        "H01L2924/00",
        "H01L2924/01005",
        "H01L2924/01006",
        "H01L2924/01011",
        "H01L2924/01012",
        "H01L2924/01013",
        "H01L2924/01015",
        "H01L2924/01019",
        "H01L2924/0102",
        "H01L2924/01023",
        "H01L2924/01024",
        "H01L2924/01027",
        "H01L2924/01029",
        "H01L2924/0103",
        "H01L2924/01033",
        "H01L2924/01046",
        "H01L2924/01047",
        "H01L2924/01052",
        "H01L2924/01056",
        "H01L2924/01059",
        "H01L2924/01073",
        "H01L2924/01074",
        "H01L2924/01075",
        "H01L2924/01082",
        "H01L2924/1306",
        "H01L2924/13091",
        "H01L2924/14",
        "H01L2924/1433",
        "H01L2924/19041",
        "H01L2924/19042",
        "H01L2924/19043",
        "H01L2924/30105",
        "H01L2924/3011",
        "H01L2924/3025"
    ],
    "abstract": "Methods and apparatus relating to very large scale FET arrays for analyte measurements. ChemFET (e.g., ISFET) arrays may be fabricated using conventional CMOS processing techniques based on improved FET pixel and array designs that increase measurement sensitivity and accuracy, and at the same time facilitate significantly small pixel sizes and dense arrays. Improved array control techniques provide for rapid data acquisition from large and dense arrays. Such arrays may be employed to detect a presence and/or concentration changes of various analyte types in a wide variety of chemical and/or biological processes. In one example, chemFET arrays facilitate DNA sequencing techniques based on monitoring changes in hydrogen ion concentration (pH), changes in other analyte concentration, and/or binding events associated with chemical processes relating to DNA synthesis.",
    "claims": "\n1. A semiconductor device comprising:\na sensor array arranged in a plurality of rows and a plurality of columns, and a microwell array formed over the sensor array, wherein the sensor array comprises a first group of sensors and a second group of sensors; and\nsensor array circuitry on the semiconductor device for separate control of the first group of sensors and the second group of sensors; said sensor array circuitry including:\na first row select register to apply a sequence of row select signals to enable the first group of sensors and a second row select register to apply a sequence of row select signals to enable the second group of sensors;\na first column select register to acquire output signals from respective columns of the first group of sensors and a second column select-register to acquire output signals from respective columns of the second group of sensors; and\na first column bias/readout circuit for receiving column output signals from the first group of sensors and a second column bias/readout circuit for receiving column output signals from the second group of sensors.\n2. The semiconductor device of claim 1, wherein least one sensor of the sensor array is capacitively coupled to a microwell.\n3. The semiconductor device of claim 1, wherein the sensor array circuitry further includes an first output driver and a second output driver each configured to receive the column output signal from the first column bias/readout circuit and second column bias/readout circuit, respectively.\n4. The semiconductor device of claim 1, wherein the first and second bias/readout circuits include a diode-connected transistor for maintaining a substantially constant bias voltage between a source terminal and a drain terminal of each enabled sensor in the first group of sensors and the second group of sensors.\n5. The semiconductor device of claim 1, wherein the sensor array is a chemically-sensitive filed effect transistor (chemFET) senor array.\n6. The semiconductor device of claim 5, wherein each sensor in the chemFET sensor array includes a floating gate.\n7. The semiconductor device of claim 6, wherein the floating gate of each sensor in the chemFET sensor array includes an analyte-sensitive passivation layer disposed on the floating gate.\n8. The semiconductor device of claim 7, wherein the analyte-sensitive passivation layer is sensitive to hydrogen ion concentration.\n9. The semiconductor device of claim 8, wherein the analyte-sensitive passivation layer is sensitive to hydrogen ion concentration in a range from pH 6 to pH 9.\n10. The semiconductor device of claim 7, wherein the analyte-sensitive passivation layer is sensitive to pyrophosphate ion concentration.\n11. The semiconductor device of claim 1, wherein each sensor in the sensor array has a threshold voltage over of range of approximately 0 volts to 2 volts.\n12. The semiconductor device of claim 1, wherein the sensor array comprises at least 105 sensors.\n13. The semiconductor device of claim 1, wherein the sensor array has a pitch of 10μ or less between sensors of the sensor array.\n14. An apparatus comprising:\na semiconductor device comprising:\na sensor array arranged in a plurality of rows and a plurality of columns, wherein the sensor array comprises a first group of sensors and a second group of sensors; and\na microwell array formed over the sensor array, wherein least one sensor of the sensor array is capacitively coupled to a microwell;\nsensor array circuitry on the semiconductor device for separate control of the first group of sensors and the second group of sensors; and\nan array controller including a timing generator to control row selection and column selection for acquiring output signals from the sensor array.\n15. The apparatus of claim 14, wherein the semiconductor device further comprises at least one component of the array controller integrated on the semiconductor device.\n16. The apparatus of claim 15, wherein the at least one component of the array controller integrated on the semiconductor device includes circuitry to perform analog-to-digital conversion of the output signals.\n17. The apparatus of claim 14, wherein the array controller acquires a frame of data at a frame rate between 1 to 100 frames per second.\n18. The apparatus of claim 14, further comprising a reference electrode to provide a stable reference voltage to the sensor array.\n19. The apparatus of claim 18, wherein the output signals are voltage signals measured in reference to a voltage of the reference electrode.\n20. The semiconductor device of claim 14, wherein the sensor array is a chemically-sensitive filed effect transistor (chemFET) senor array."
}