{
    "patent_id": "US-11106664-B2",
    "title": "Systems and methods for generating a contextually and conversationally correct response to a query ",
    "assignee": "Thomson Reuters Enterprise Centre Gmbh",
    "publication_date": "2021-08-31",
    "patent_link": "https://patents.google.com/patent/US11106664B2/en",
    "inventors": [
        "Gayle McElvain",
        "Tonya Custis",
        "Matthew A. Surprenant",
        "Erik Lindberg"
    ],
    "classifications": [
        "G06F16/243",
        "G06F16/3329",
        "G06F16/248",
        "G06N20/20",
        "G06N3/08",
        "G06N5/022",
        "G06N5/041",
        "G06N5/046",
        "G06N5/01",
        "G06N5/048",
        "G06N7/01"
    ],
    "abstract": "The present disclosure relates to systems and methods for generating contextually, grammatically, and conversationally correct answers to input questions. Embodiments provide for linguistic and syntactic structure analysis of a submitted question in order to determine whether the submitted question may be answered by at least one headnote. The question is then further analyzed to determine more details about the intent and context of the question. A federated search process, based on the linguistic and syntactic structure analysis, and the additional analysis of the question is used to identify candidate question-answer pairs from a corpus of previously created headnotes. Machine learning models are used to analyze the candidate question-answer pairs, additional rules are applied to rank the candidate answers, and dynamic thresholds are applied to identify the best potential answers to provide to a user as a response to the submitted question.",
    "claims": "\n1. A method comprising:\nreceiving a query from a user terminal, the query including a question having a linguistic and syntactic structure;\nanalyzing the linguistic and syntactic structure of the question to determine at least a context of the question;\npre-processing the received question prior to the analyzing, wherein the pre-processing includes determining whether the question is of a type that can be answered by a headnote,\ngenerating at least one search query based on the analyzing the linguistic and syntactic structure of the question;\ncausing the at least one search query to be executed on at least one data store;\nobtaining a plurality of candidate answers in response to the execution of the search query, wherein each candidate answer of the plurality of candidate answers is a headnote;\nobtaining a linguistic and syntactic analysis of each candidate answer of the plurality of candidate answers, wherein the question is paired with each candidate answer of the plurality of candidate answers to form a plurality of question-answer pairs;\nextracting at least one feature for each question-answer pair of the plurality of question-answer pairs;\nfeeding the extracted at least one feature for each question-answer pair into a ranking model;\nscoring, by the ranking model, for each feature of the at least one feature, each question-answer pair, wherein a score for a particular question-answer pair resulting from the scoring represents a probability that the particular candidate answer of the particular question-answer pair is a correct answer to the question;\nranking the candidate answers of the plurality of candidate answers based on the score of each candidate answer; and\nproviding at least one of the ranked candidate answers as answer to the question in the query.\n2. The method of claim 1, wherein the analyzing the linguistic and syntactic structure of the question includes one of: natural language processing, entity recognition, frame classification, key number classification, and embeddings analysis.\n3. The method of claim 2, wherein the context of the question includes the intent of the question, and wherein the frame classification includes classifying the question into at least one frame category associated with the intent of the question.\n4. The method of claim 2, wherein the at least one frame category is one of: Admissibility, Availability of Damages or Remedy, Burden of Proof, Construction of Instruments, Court Authority, Elements, Factors, and Tests, Accrual of Statute of Limitations, Tolling of Statute of Limitations, Duration of Statute of Limitations, Standard of Review, Enforceability of Contracts, and Others.\n5. The method of claim 1, wherein the obtaining the linguistic and syntactic analysis of each candidate answer of the plurality of candidate answers includes analyzing the linguistic and syntactic structure of each candidate answer subsequent to the obtaining the plurality of candidate answers in response to the execution of the search query.\n6. The method of claim 1, wherein the obtaining the linguistic and syntactic analysis of each candidate answer of the plurality of candidate answers includes analyzing the linguistic and syntactic structure of each candidate answer prior to the obtaining the plurality of candidate answers in response to the execution of the search query, wherein the linguistic and syntactic analysis of each candidate answer is obtained from a database.\n7. The method of claim 1, further comprising post-processing the ranked candidate answers, wherein the post-processing includes one of:\napplying constraint rules to the ranked candidate answers, to ensure that the candidate answers contain required elements, wherein a particular ranked candidate answer is eliminated as a candidate answer based on a constraint rule being met; and\napplying weighting rules to one of penalize and boost a ranked candidate answer.\n8. The method of claim 1, wherein the providing at least one of the ranked candidate answers as answer to the question in the query includes performing a threshold determination to the at least one of the ranked candidate answers to determine whether the at least one of the ranked candidate answers will be provided as an answer to the question based on a threshold.\n9. The method of claim 8, wherein the threshold is a threshold value of a probability that the at least one of the ranked candidate answers is a correct answer, wherein the at least one of the ranked candidate answers is determined to be provided as an answer to the question when a probability score of the at least one of the ranked candidate answers exceeds the threshold value.\n10. The method of claim 1, wherein the extracted at least one feature includes at least one of: a linguistic similarity feature, a concept coordination feature, a topicality feature, an abstract/concrete classification feature, and a key number scoring function feature.\n11. The method of claim 1, wherein the search query includes one of: a natural language search query, a more-like-this search query, and a semantic search query.\n12. The method of claim 11, wherein the analyzing the linguistic and syntactic structure of the question includes determining a frame into which the question is classified, wherein the semantic search query includes:\nobtaining a frame-specific search template, the frame-specific search template associated with the frame of the question, and wherein the frame-specific search template defines at least one placeholder corresponding to an element of the frame of the question;\nidentifying an entity in the question corresponding to the element of the frame corresponding to the at least one placeholder; and\nreplacing the placeholder in the frame-specific search template with the identified entity to generate a complete frame-specific search template, wherein the generating at least one search query is based on the complete frame-specific search template.\n13. A system comprising:\na question/answer processor configured to:\nreceive a query from a user terminal, the query including a question having a linguistic and syntactic structure;\nanalyze the linguistic and syntactic structure of the question to determine at least a context of the question; and\npre-process the received question prior to analyzing the linguistic and syntactic structure of the question, wherein pre-processing includes determining whether the question is of a type that can be answered by a headnote;\na query generator configured to:\ngenerate at least one search query based on the analyzing the linguistic and syntactic structure of the question;\ncause the at least one search query to be executed on at least one data store; and\nobtain a plurality of candidate answers in response to the execution of the search query, wherein each candidate answer of the plurality of candidate answers is a headnote, wherein the question/answer processor is further configured to obtain a linguistic and syntactic analysis of each candidate answer of the plurality of candidate answers, and to pair the question with each candidate answer of the plurality of candidate answers to form a plurality of question-answer pairs;\na feature extractor configured to:\nextract at least one feature for each question-answer pair of the plurality of question-answer pairs; and\nfeed the extracted at least one feature for each question-answer pair into a candidate ranker;\nthe candidate ranker configured to:\nscore, using a ranking model, for each feature of the at least one feature, each question-answer pair, wherein a score for a particular question-answer pair resulting from the scoring represents a probability that the particular candidate answer of the particular question-answer pair is a correct answer to the question; and\nrank the candidate answers of the plurality of candidate answers based on the score of each candidate answer; and\nan answer detector configured to provide at least one of the ranked candidate answers as answer to the question in the query.\n14. The system of claim 13, wherein the configuration of the question/answer processor to analyze the linguistic and syntactic structure of the question includes configuration of the question/answer processor to perform one of: natural language processing, entity recognition, frame classification, key number classification, and embeddings analysis.\n15. The system of claim 13, wherein the configuration of the question/answer processor to obtain the linguistic and syntactic analysis of each candidate answer of the plurality of candidate answers includes configuration of the question/answer processor to one of:\nanalyze the linguistic and syntactic structure of each candidate answer subsequent to obtaining the plurality of candidate answers in response to the execution of the search query; and\nanalyze the linguistic and syntactic structure of each candidate answer prior to obtaining the plurality of candidate answers in response to the execution of the search query, wherein the linguistic and syntactic analysis of each candidate answer is obtained from a database.\n16. The system of claim 13, wherein the configuration of the answer detector to provide at least one of the ranked candidate answers as answer to the question in the query includes configuration of the answer detector to perform a threshold determination to the at least one of the ranked candidate answers to determine whether the at least one of the ranked candidate answers will be provided as an answer to the question based on a threshold, wherein the threshold is a threshold value of a probability that the at least one of the ranked candidate answers is a correct answer, wherein the at least one of the ranked candidate answers is determined to be provided as an answer to the question when a probability score of the at least one of the ranked candidate answers exceeds the threshold value.\n17. The system of claim 13, wherein the search query includes one of: a natural language search query, a more-like-this search query, and a semantic search query.\n18. The system of claim 17, wherein the configuration of the question/answer processor to analyze the linguistic and syntactic structure of the question includes configuration to determine a frame into which the question is classified, wherein the semantic search query includes:\nobtaining a frame-specific search template, the frame-specific search template associated with the frame of the question, and wherein the frame-specific search template defines at least one placeholder corresponding to an element of the frame of the question;\nidentifying an entity in the question corresponding to the element of the frame corresponding to the at least one placeholder; and\nreplacing the placeholder in the frame-specific search template with the identified entity to generate a complete frame-specific search template, wherein the generating at least one search query is based on the complete frame-specific search template.\n19. A computer-based tool including non-transitory computer readable media having stored thereon computer code which, when executed by a processor, causes a computing device to perform operations comprising:\nreceiving a query from a user terminal, the query including a question having a linguistic and syntactic structure;\nanalyzing the linguistic and syntactic structure of the question to determine at least a context of the question;\npre-processing the received question prior to the analyzing, wherein the pre-processing includes determining whether the question is of a type that can be answered by a headnote,\ngenerating at least one search query based on the analyzing the linguistic and syntactic structure of the question;\ncausing the at least one search query to be executed on at least one data store;\nobtaining a plurality of candidate answers in response to the execution of the search query, wherein each candidate answer of the plurality of candidate answers is a headnote;\nobtaining a linguistic and syntactic analysis of each candidate answer of the plurality of candidate answers, wherein the question is paired with each candidate answer of the plurality of candidate answers to form a plurality of question-answer pairs;\nextracting at least one feature for each question-answer pair of the plurality of question-answer pairs;\nfeeding the extracted at least one feature for each question-answer pair into a ranking model;\nscoring, by the ranking model, for each feature of the at least one feature, each question-answer pair, wherein a score for a particular question-answer pair resulting from the scoring represents a probability that the particular candidate answer of the particular question-answer pair is a correct answer to the question;\nranking the candidate answers of the plurality of candidate answers based on the score of each candidate answer; and\nproviding at least one of the ranked candidate answers as answer to the question in the query."
}