{
    "patent_id": "US-11526808-B2",
    "title": "Machine learning based generation of ontology for structural and functional mapping ",
    "assignee": "The Board Of Trustees Of The Leland Stanford Junior University, The United States Government As Represented By The Department Of Veterans Affairs",
    "publication_date": "2022-12-13",
    "patent_link": "https://patents.google.com/patent/US11526808B2/en",
    "inventors": [
        "Amit Etkin",
        "Elizabeth Beam"
    ],
    "classifications": [
        "G16H50/30",
        "G06F18/23213",
        "G06F18/2415",
        "G06K9/6223",
        "G06K9/6277",
        "G06N20/00",
        "G06N3/02",
        "G06N3/045",
        "G06N5/022",
        "G06N5/042",
        "G06N5/046",
        "G06V10/768",
        "G16H10/60",
        "G16H20/70",
        "G16H30/40",
        "G16H50/20",
        "G06N3/08"
    ],
    "abstract": "A method may include applying, to a corpus of data, a first machine learning technique to identify candidate domains of an ontology mapping brain structure to mental function. The corpus of data may include textual data describing a plurality of mental functions and spatial data corresponding to a plurality of brain structures. A second machine technique may be applied to optimize a quantity of domains included in the ontology and/or a quantity of mental function terms included in each domain. The ontology may be applied to phenotype an electronic medical record and predict a clinical outcome for a patient associated with the electronic medical record. Related systems and articles of manufacture, including computer program products, are also provided.",
    "claims": "\n1. A computer-implemented method, comprising:\napplying, to a corpus of data, a first machine learning technique to identify one or more candidate domains of an ontology mapping brain structure to mental function, the corpus of data including textual data describing a plurality of mental functions and spatial data corresponding to a plurality of brain structures, and the ontology including a plurality of domains each of which (1) corresponding to a neural circuiting including one or more brain structures and including (2) one or more mental function terms associated with the one or more brain structures;\napplying a second machine technique to optimize a quantity of domains included in the ontology and/or a quantity of mental function terms included in each of the plurality of domains, the second machine learning technique including a forward inference model trained to predict an occurrence of a brain structure based on an occurrence various quantities of mental function term, and the second machine learning technique further including a reverse inference model trained to predict the occurrence of the various quantities of mental function terms based on the occurrence of a brain structure; and\napplying the ontology to process an electronic medical record.\n2. The method of claim 1, wherein the first machine learning technique comprises an unsupervised machine learning technique, and wherein the second machine learning technique comprises a supervised machine learning technique.\n3. The method of claim 1, wherein the first machine learning technique comprises a k-means clustering algorithm configured to cluster the plurality of brain structures include in the corpus of data based at least on a co-occurrence value between each of the plurality of brain structures and each of the plurality of mental function terms.\n4. The method of claim 3, wherein the co-occurrence value corresponds to a frequency at which a brain structure and a mental function term appear in a same article in the corpus of data, and wherein the co-occurrence value is further weighted based on a pointwise mutual information (PMI) corresponding to a probability that the brain structure and the mental function term appear in the same article.\n5. The method of claim 1, wherein an optimal quantity of domains in the ontology and/or an optimal quantity of mental function terms included in each of the plurality of domains are selected to maximize a performance of the forward inference model and/or a performance of the reverse inference model.\n6. The method of claim 5, wherein the performance of the forward inference model and/or the performance of the reverse inference model comprise an average area under the receiver operating characteristic curve (ROC-AUC).\n7. The method of claim 1, wherein the forward inference model and/or the reverse inference model comprise a multilayer neural network classifier.\n8. The method of claim 1, further comprising:\napplying a natural language processing (NLP) technique to preprocess the corpus of data prior to applying the first machine learning technique, the preprocessing includes one or more of a case-folding, a removal of stop words and punctuation, and a lemmatization.\n9. The method of claim 1, wherein the electronic medical record is processed by at least determining, based at least on the ontology, one or more phenotypes associated with the electronic medical record and (2) predicting, based at least on the one or more phenotypes, a clinical outcome for a patient associated with the electronic medical record.\n10. The method of claim 9, wherein the one or more phenotypes for the electronic medical record may be determined by at least determining, for each of the plurality of domains of the ontology, a rating corresponding to a proportion of mental function terms associated with the domain that is present in the electronic medical record, and wherein the one or more phenotypes correspond to one or more highest rated domains and/or one or more domains having an above-threshold rating.\n11. The method of claim 9, wherein the clinical outcome includes a duration of hospital stay, a quantity of office visits, a quantity of emergency room visits, healthcare cost, prescriptions, refills, comorbid conditions, and/or the like.\n12. The method of claim 1, wherein the plurality of domains include emotion, retrieval, language, arousal, and movement.\n13. A system, comprising:\nat least one data processor; and\nat least one memory storing instructions, which when executed by the at least one data processor, result in operations comprising:\napplying, to a corpus of data, a first machine learning technique to identify one or more candidate domains of an ontology mapping brain structure to mental function, the corpus of data including textual data describing a plurality of mental functions and spatial data corresponding to a plurality of brain structures, and the ontology including a plurality of domains each of which (1) corresponding to a neural circuiting including one or more brain structures and including (2) one or more mental function terms associated with the one or more brain structures;\napplying a second machine technique to optimize a quantity of domains included in the ontology and/or a quantity of mental function terms included in each of the plurality of domains, the second machine learning technique including a forward inference model trained to predict an occurrence of a brain structure based on an occurrence various quantities of mental function term, and the second machine learning technique further including a reverse inference model trained to predict the occurrence of the various quantities of mental function terms based on the occurrence of a brain structure; and\napplying the ontology to process an electronic medical record.\n14. The system of claim 13, wherein the first machine learning technique comprises an unsupervised machine learning technique, and wherein the second machine learning technique comprises a supervised machine learning technique.\n15. The system of claim 13, wherein the first machine learning technique comprises a k-means clustering algorithm configured to cluster the plurality of brain structures include in the corpus of data based at least on a co-occurrence value between each of the plurality of brain structures and each of the plurality of mental function terms, and wherein the co-occurrence value corresponds to a frequency at which a brain structure and a mental function term appear in a same article in the corpus of data, and wherein the co-occurrence value is further weighted based on a pointwise mutual information (PMI) corresponding to a probability that the brain structure and the mental function term appear in the same article.\n16. The system of claim 13, wherein an optimal quantity of domains in the ontology and/or an optimal quantity of mental function terms included in each of the plurality of domains are selected to maximize a performance of the forward inference model and/or a performance of the reverse inference model.\n17. The system of claim 13, wherein the electronic medical record is processed by at least determining, based at least on the ontology, one or more phenotypes associated with the electronic medical record and (2) predicting, based at least on the one or more phenotypes, a clinical outcome for a patient associated with the electronic medical record.\n18. A non-transitory computer readable medium storing instructions, which when executed by at least one data processor, result in operations comprising:\napplying, to a corpus of data, a first machine learning technique to identify one or more candidate domains of an ontology mapping brain structure to mental function, the corpus of data including textual data describing a plurality of mental functions and spatial data corresponding to a plurality of brain structures, and the ontology including a plurality of domains each of which (1) corresponding to a neural circuiting including one or more brain structures and including (2) one or more mental function terms associated with the one or more brain structures;\napplying a second machine technique to optimize a quantity of domains included in the ontology and/or a quantity of mental function terms included in each of the plurality of domains, the second machine learning technique including a forward inference model trained to predict an occurrence of a brain structure based on an occurrence various quantities of mental function term, and the second machine learning technique further including a reverse inference model trained to predict the occurrence of the various quantities of mental function terms based on the occurrence of a brain structure; and\napplying the ontology to process an electronic medical record."
}