{
    "patent_id": "US-10816506-B2",
    "title": "Method for measuring analytes using large scale chemfet arrays ",
    "assignee": "Life Technologies Corporation",
    "publication_date": "2020-10-27",
    "patent_link": "https://patents.google.com/patent/US10816506B2/en",
    "inventors": [
        "Jonathan Rothberg",
        "Wolfgang Hinz",
        "Kim Johnson",
        "James Bustillo"
    ],
    "classifications": [
        "C12Q1/6874",
        "G01N27/4148",
        "C12Q1/6818",
        "C12Q2533/101",
        "C12Q2565/301",
        "C12Q2565/607",
        "G01N27/414",
        "G01N27/4145",
        "G01N33/543",
        "G01N33/54373",
        "G01N33/5438",
        "H01L27/088",
        "H01L29/78",
        "H01L29/42324",
        "H01L2924/01006",
        "H01L2924/01013",
        "H01L2924/01015",
        "H01L2924/01073",
        "H01L2924/14",
        "H01L2924/1433",
        "Y10T436/22"
    ],
    "abstract": "Methods and apparatus relating to very large scale FET arrays for analyte measurements. ChemFET (e.g., ISFET) arrays may be fabricated using conventional CMOS processing techniques based on improved FET pixel and array designs that increase measurement sensitivity and accuracy, and at the same time facilitate significantly small pixel sizes and dense arrays. Improved array control techniques provide for rapid data acquisition from large and dense arrays. Such arrays may be employed to detect a presence and/or concentration changes of various analyte types in a wide variety of chemical and/or biological processes. In one example, chemFET arrays facilitate DNA sequencing techniques based on monitoring changes in hydrogen ion concentration (pH), changes in other analyte concentration, and/or binding events associated with chemical processes relating to DNA synthesis.",
    "claims": "\n1. A method for acquiring data from a chemically-sensitive field-effect transistor (chemFET) device, comprising:\ninitiating a chemical reaction in each of a plurality of microwells of a microwell array formed over the chemFET device, said chemFET device including an array of chemFET sensors formed in rows and columns, wherein each column includes corresponding column bias/readout circuitry, and wherein at least one chemFET sensor is in contact with each microwell;\nacquiring a frame of data during the chemical reaction, said frame of data comprising a data set including an output signal for each chemFET sensor in the array, comprising:\nenabling a first row of chemFET sensors, wherein enabling includes coupling a terminal of each chemFET sensor of the first row of chemFET sensors to each corresponding column bias/readout circuitry in response to a first row select signal;\nstoring the output signal for each first-row chemFET sensor in each of a readout circuit in response to a sample and hold signal after a settling time of the first row of chemFET sensors;\nenabling a second-row of chemFET sensors, wherein enabling includes coupling a terminal of each chemFET sensor of the second row of chemFET sensors to each corresponding column bias/readout circuitry in response to a second row-select signal;\nreading each first-row output signal sequentially in response to a column select signal during a settling time of second-row chemFET sensors; and\nrepeating storing an output signal for a previously-settling row, enabling a next sequential row, and reading each row output signal for the previously-settling row during a settling time for the next sequential row for each additional row in the array until each last-row chemFET sensor is read.\n2. The method of claim 1, wherein storing the output signal for each chemFET sensor in an enabled row further comprises:\nclosing each of a sample and hold switch in each readout circuit in response to a column sample and hold signal, and\nstoring an output signal for each chemFET sensor in an enabled row on each of a corresponding sample and hold capacitor of each corresponding readout circuit.\n3. The method of claim 2, further comprising:\ndecoupling each of a column output buffer amplifier of each readout circuit from a column output amplifier in response to de-asserting the column sample and hold signal.\n4. The method of claim 1, wherein reading each chemFET sensor further comprises:\nreading each of an output signal sequentially in response to a select signal for a first set of chemFET sensors coupled to a first column output driver; and\nsimultaneously reading each of an output signal sequentially in response to a select signal for a second set of chemFET sensors coupled to a second column output driver.\n5. The method of claim 4, further comprising:\ndigitizing output signals from the first set of chemFET sensors and the second set of chemFET sensors; and\nproviding the digitized output signals as data to a computer for processing.\n6. The method of claim 1, wherein acquiring the frame of data occurs at a defined frame rate of between 10 frames per second to 100 frames per second.\n7. The method of claim 5, wherein the chemFET sensor array is an ISFET sensor array, and the chemical reaction is a sequencing reaction, the method comprising:\ndigitizing output signals from a first set of ISFET sensors and a second set of ISFET sensors; and\nproviding the digitized output signals as sequencing data to a computer for processing.\n8. The method of claim 1, further comprising before storing the output signal for each first-row chemFET sensor, the method further comprising:\napplying a reference voltage to each of a column output buffer amplifier of each corresponding readout circuit in response to a calibrate signal; and\ncharacterizing column-to-column non-uniformities due to buffer-amplifier response.\n9. The method of claim 8, further comprising:\napplying a post-read correction to data based on the characterization of column-to-column non-uniformities."
}