{
    "patent_id": "US-11347803-B2",
    "title": "Systems and methods for adaptive question answering ",
    "assignee": "Cuddle Artificial Intelligence Private Limited",
    "publication_date": "2022-05-31",
    "patent_link": "https://patents.google.com/patent/US11347803B2/en",
    "inventors": [
        "Neha Prabhugaonkar",
        "Abhay Parab",
        "Natwar Mall"
    ],
    "classifications": [
        "G06F16/24522",
        "G06F16/3329",
        "G06F16/3338",
        "G06F16/90332",
        "G06F40/284",
        "G06F40/295",
        "G06N20/00",
        "G06N3/049",
        "G06N5/022",
        "G06N5/041",
        "G06F40/205",
        "G06N3/044",
        "G06N7/01"
    ],
    "abstract": "Systems and methods for adaptive question answering are provided in which an answer is adaptive to a user's characteristics, goals and needs by continuously learning from user interactions and adapting both the context and data visualization. An exemplary system comprises software modules embodied on a computer network, and the software modules comprise an interpretation engine, an answering engine and a learning engine.",
    "claims": "\n1. A system for adaptive question answering comprising software modules and a computer network, wherein\nthe computer network comprises a first subnetwork for data processing and a second subnetwork for data storage comprising usage knowledge; and\nthe software modules comprise\na first instruction to receive a question in natural language from a user;\na second instruction to identify, through three levels of parsers, a plurality of entities in the question, wherein the entities comprise periods, business objects, measures and conditions;\na third instruction to disambiguate lexical entities at a word level using word-sense disambiguation and entities at an entire context level of the question using rules for preposition;\na fourth instruction to validate a user's authorization for information retrieval through a fine-grained authorization control, wherein the fine-grained authorization control comprises a row level access, a column level access and a cell level access;\na fifth instruction to identify, by a machine-learning based parser, an intent of the user through the usage knowledge, wherein the machine learning-based parser comprises a recurrent neural network and a logistic regression model;\na sixth instruction to generate an interpretation comprising period identification, business object identification, measure inference, condition identification, and intent identification, wherein the interpretation is implemented by an analytic specific meta ontology comprising a concept map, wherein the concept map is generated by automatically creating a keyword list through applying word dependency and part of speech (POS) tagging to extract domain and organization specific knowledge;\na seventh instruction to formulate a plurality of intermediate queries based on the interpretation, wherein formulation of the intermediate queries comprises inferring a missing period through exploration and exploitation algorithms in reinforcement learning, merging business objects having common attributes, inferring measures relevant to the user based on past interactions of the user, and validating the user's authorization;\nan eighth instruction to convert each intermediate query into a database-aware structured query language query;\na ninth instruction to identify a transaction table for each database-aware structured query language query;\na tenth instruction to retrieve data values from the transaction table for each database-aware structured query language query;\nan eleventh instruction to convert the data values to valid display formats to form an answer corresponding to each intermediate query;\na twelfth instruction to determine a visualization preference based on the usage knowledge;\na thirteenth instruction to recommend follow-up or drilldown actions to aid the user in his information needs and further analysis; and\na fourteenth instruction to aggregate and rank the answer;\nwherein the system is configured to continuously learn about the user based on interactions of the user through a user session, wherein the user session is configured to keep track of what the user is performing by monitoring interactive information interchanged between the user and the system.\n2. The system of claim 1, wherein the three levels of parsers comprise a constituency parser, stop words parser, and a relaxation parser.\n3. The system of claim 1, wherein the periods are identified using a SUTime temporal tagger.\n4. The system of claim 1, wherein the measures are identified and ranked using a Bayesian learning and weighted context similarity approach.\n5. The system of claim 1, wherein the conditions are identified through a forward-backward parsing algorithm.\n6. The system of claim 1, wherein the usage knowledge based on user interactions comprises data inquiry, correction of ambiguous entities, actions on the interpretation, actions on the answer, tracking of the answer, drilling down on data, visualization changes, up-vote/down-vote on the answer, actions on a suggested analysis, and follow-up on suggested questions.\n7. The system of claim 1, wherein the first subnetwork for data processing comprises at least one virtual or physical server node for executing the software modules.\n8. The system of claim 1, wherein the first subnetwork for data processing comprises serverless architectures.\n9. The system of claim 1, wherein the first subnetwork for data processing comprises a multi-server-node cluster for executing the software modules.\n10. The system of claim 1, wherein the second subnetwork for data storage comprises a big data framework and a database system for data inquiry and retrieval.\n11. A method for adaptive question answering, comprising steps of\nreceiving, by an adaptive question answering system implemented by a computer network, a question in natural language from a user, wherein the computer network comprises a first subnetwork for data processing and a second subnetwork for data storage comprising usage knowledge, wherein the computer network is configured to execute software modules;\nidentifying, through three levels of parsers, a plurality of entities in the question, wherein the entities comprise periods, business objects, measures and conditions;\ndisambiguating lexical entities at a word level using word-sense disambiguation and entities at an entire context level of the question using rules for preposition;\nvalidating a user's authorization for information retrieval through a fine-grained authorization control, wherein the fine-grained authorization control comprises a row level access, a column level access and a cell level access;\nidentifying, by a machine-learning based parser, an intent of the user through the usage knowledge, wherein the machine learning-based parser comprises a recurrent neural network and a logistic regression model;\ngenerating an interpretation comprising period identification, business object identification, measure inference, condition identification, and intent identification, wherein the interpretation is implemented by an analytic specific meta ontology comprising a concept map, wherein the concept map is generated by automatically creating a keyword list through applying word dependency and part of speech (POS) tagging to extract domain and organization specific knowledge;\nformulating a plurality of intermediate queries based on the interpretation, wherein formulation of the intermediate queries comprises inferring a missing period through exploration and exploitation algorithms in reinforcement learning, merging business objects having common attributes, inferring measures relevant to the user based on past interactions of the user, and validating the user's authorization;\nconverting each intermediate query into a database-aware structured query language query;\nidentifying a transaction table for each database-aware structured query language query;\nretrieving data values from the transaction table for each database-aware structured query language query;\nconverting the data values to valid display formats to form an answer corresponding to each intermediate query;\ndetermining a visualization preference based on the usage knowledge;\nrecommending follow-up or drilldown actions to aid the user in his information needs and further analysis; and\naggregating and ranking the answer;\nwherein the system is configured to continuously learn about the user based on interactions of the user through a user session, wherein the user session is configured to keep track of what the user is performing by monitoring interactive information interchanged between the user and the system.\n12. The method of claim 11, wherein the three levels of parsers comprise a constituency parser, stop words parser, and a relaxation parser.\n13. The method of claim 11, wherein the periods are identified using a SUTime temporal tagger.\n14. The method of claim 11, wherein the measures are identified and ranked using a Bayesian learning and weighted context similarity approach.\n15. The method of claim 11, wherein the conditions are identified through a forward-backward parsing algorithm.\n16. The method of claim 11, wherein the usage knowledge based on user interactions comprises data inquiry, correction of ambiguous entities, actions on the interpretation, actions on the answer, tracking of the answer, drilling down on data, visualization changes, up-vote/down-vote on the answer, actions on a suggested analysis, and follow-up on suggested questions.\n17. The system of claim 11, wherein the first subnetwork for data processing comprises at least one virtual or physical server node for executing the software modules.\n18. The system of claim 11, wherein the first subnetwork for data processing comprises serverless architectures.\n19. The system of claim 11, wherein the first subnetwork for data processing comprises a multi-server-node cluster for executing the software modules.\n20. The system of claim 11, wherein the second subnetwork for data storage comprises a big data framework and a database system for data inquiry and retrieval."
}