{
    "patent_id": "US-11102221-B2",
    "title": "Intelligent security management ",
    "assignee": "Amazon Technologies, Inc.",
    "publication_date": "2021-08-24",
    "patent_link": "https://patents.google.com/patent/US11102221B2/en",
    "inventors": [
        "Alexander Watson",
        "Daniel Brim",
        "Christopher Simmons",
        "Paul Radulovic",
        "Tyler Stuart Bray",
        "Jennifer Anne Brinkley",
        "Eric Johnson",
        "Victor Chin",
        "Jack Rasgaitis",
        "Nai Qin Cai",
        "Michael Gough",
        "Max Anger"
    ],
    "classifications": [
        "H04L63/1416",
        "G06F21/554",
        "G06F16/35",
        "G06F16/951",
        "G06N20/20",
        "G06N3/044",
        "G06N3/0445",
        "G06N3/08",
        "G06N5/003",
        "G06N5/01",
        "G06N5/045",
        "G06N7/005",
        "G06N7/01",
        "G06Q20/4016",
        "H04L63/083",
        "H04L63/0861",
        "H04L63/101",
        "G06N3/084"
    ],
    "abstract": "A corpus of documents (and other data objects) stored for an entity can be analyzed to determine one or more topics for each document. Elements of the documents can be analyzed to also assign a risk score. The types of topics and security elements, and the associated risk scores, can be learned and adapted over time using, for example, a topic model and random forest regressor. Activity with respect to the documents is monitored, and expected behavior for a user determined using a trained recurrent neural network. Ongoing user activity is processed to determine whether the activity excessively deviates from the expected user activity. The activity can also be compared against the activity of user peers to determine whether the activity is also anomalous among the user peer group. For anomalous activity, risk scores of the accessed documents can be analyzed to determine whether to generate an alert.",
    "claims": "\n1. A computer-implemented method comprising:\ncrawling a plurality of documents, stored for an entity across an electronic resource environment, to locate and index the plurality of documents;\ndetermining, using a trained topic model, one or more topics for each document of the plurality of documents;\ndetermining risk scores for documents of the plurality of documents using a risk analysis algorithm, respective risk scores based at least in part on an element contained within respective documents of the plurality of documents; and\nproviding security information for access by an authorized user associated with the entity, the security information including information for the identified topics and risk scores for the plurality of documents stored for the entity.\n2. The method of claim 1, further comprising training a topic model to generate the trained topic model using a set of training documents, each training document of the set having at least one identified topic and an assigned risk score.\n3. The method of claim 1, further comprising:\ndetecting updated document data corresponding to at least one of new documents or document changes stored for the entity in the electronic resource environment; and\nfurther training the trained topic model for each instance of the updated document data.\n4. The method of claim 1, wherein determining one or more topics for each document of the plurality of documents further comprises utilizing natural language understanding (NLU) to analyze the plurality of documents to determine topics associated the plurality of documents.\n5. The method of claim 1, further comprising:\ndetermining a plurality of elements contained in the plurality of documents, each element of the plurality of elements posing a potential security risk to the entity;\nassigning a respective risk score for each element of the plurality of elements; and\ndetermining the risk score for a specified document of the plurality of documents based at least in part upon a highest respective risk score for one of the elements associated with the specified document.\n6. The method of claim 1, further comprising:\ndetecting a new document stored for the entity in the electronic resource environment;\ndetermining one or more topics associated with the new document;\nassigning the new document to a document bucket associated with other documents having the one or more topics of the new document; and\nassigning a risk score to the new document based at least in part upon a bucket risk score for the document bucket.\n7. The method of claim 1, further comprising:\nenabling types of documents to be classified by the trained topic model that are specific to an industry of the entity and do not contain content previously associated with a topic.\n8. A computer-implemented method, comprising:\nmonitoring activity of a user with respect to a set of documents, the set of documents stored for an entity across an electronic resource environment;\ndetermining a peer group for the user based at least in part on the monitored activity;\ndetermining that an action of the monitored activity is anomalous to expected activity for the peer group by processing the monitored activity data using a neural network;\nclassifying the action with at least one label using an unsupervised or semi-trained classifier; and\ngenerating an alarm based on the at least one label of the action.\n9. The method of claim 8, wherein the peer group is determined, based at least in part, on using a topic model comprising a recurrent neural network.\n10. The method of claim 8, wherein the monitored activity data is smoothed using a Kalman filter prior to processing the monitored activity data using the neural network.\n11. The method of claim 8, wherein the at least one label is used to further train the unsupervised or semi-trained classifier.\n12. The method of claim 9, wherein the topic model is based at least in part on Latent Dirichlet allocation.\n13. The method of claim 8, wherein each of the at least one labels is associated with a risk score, and wherein the alarm is further based on a risk threshold being satisfied by the risk score.\n14. The method of claim 8, further comprising:\ndetermining, using a topic model, a second peer group for the user based in part on the monitored activity; and\ndetermining that the action of the monitored activity is anomalous to the expected activity for the second peer group using the neural network.\n15. The method of claim 8, further comprising:\ndetermining a risk score for documents of the set of documents, wherein the alarm is further based on at least one risk score for a document associated with the user activity.\n16. A system, comprising:\nat least one processor; and\nmemory including instructions that, when executed by the at least one processor, cause the system to:\ndetermine an expected activity of a specified user with respect to the plurality of documents using a trained neural network;\ndetect user activity, over at least a determined period of time, with respect to at least a specified document of a plurality of documents, the user activity associated with the specified user;\nprocess the user activity using the trained neural network to determine whether the user activity deviates from the expected activity; and\nperform a determined action if the user activity is determined to deviate from an expected range of user activity for the expected activity.\n17. The system of claim 16, the memory further including instructions that, when executed by the at least one processor, cause the system to:\ndetermine the action to be performed based at least in part upon a determined risk score and at least one risk threshold associated with a possible action to be performed.\n18. The system of claim 16, wherein the system is configured to, as the determined action, generate a security alert, log anomalous activity data, or adjust access permissions associated with at least one of the specified user or the specified document.\n19. The system of claim 16, the memory further comprising instructions that, when executed by the at least one processor, cause the system to:\nreceive user input specifying a plurality of determined actions, each of the actions of the plurality of determined actions corresponding with a risk score or a range of risk scores.\n20. The system of claim 19, the memory further comprising instructions that, when executed by the at least one processor, cause the system to:\nreceive a risk score for each of at least a subset of the plurality of documents; and\nselect the determined action from the plurality of determined actions based at least in part on a risk score associated with the specified document."
}