{
    "patent_id": "US-11238366-B2",
    "title": "Adaptive object modeling and differential data ingestion for machine learning ",
    "assignee": "International Business Machines Corporation",
    "publication_date": "2022-02-01",
    "patent_link": "https://patents.google.com/patent/US11238366B2/en",
    "inventors": [
        "Michael Josiah Bolding",
        "Matthew Elsner",
        "Jian Lin",
        "Matthew Paul Ouellette",
        "Yun Pan"
    ],
    "classifications": [
        "H04L63/1416",
        "G06N20/00",
        "G06F21/552",
        "H04L63/1433",
        "H04L63/20"
    ],
    "abstract": "A machine learning (ML)-based technique for user behavior analysis that detects when users deviate from expected behavior. A ML model is trained using training data derived from activity data from a first set of users. The model is refined in a computationally-efficient manner by identifying a second set of users that constitute a “watch list.” At a given time, a differential data ingestion operation is then performed to incorporate data for the second set of users into the training data, while also pruning at least a portion of the data set corresponding to data associated with any user included in the first set but not in the second set. These operations update the training data used for the machine learning. The machine learning model is then refined based on the updated training data that incorporates the activity data ingested from the users identified in the watch list.",
    "claims": "\n1. A method of training and using a machine learning model to identify suspicious behavior in a network, the machine learning model using training data that is based on data associated with a first set of users, comprising:\nconstructing a watch list comprising a second set of users as the machine learning model is being operating in an ingest mode against data being ingested for a first set of users;\nupon a given occurrence, interrupting the ingest mode and ingesting data associated with the second set of users;\nfollowing data ingestion associated with the second set of users, pruning at least a portion of the ingested data to generate updated training data, the portion corresponding to data for any user included in the first set of users but not included in the second set of users;\nrefining the machine learning model based at least in part on the updated training data; and\nswitching back to the ingest mode and operating the refined machine learning model against data being ingested for the second set of users to enable identification and tracking of the suspicious behavior.\n2. The method as described in claim 1 wherein, following ingesting and pruning, additional data associated with the second set of users is ingested.\n3. The method as described in claim 1 wherein the second set of users includes users that have been found to have a highest moving average risk score for the machine learning model.\n4. The method as described in claim 3 wherein the second set of users also includes one or more users that are newly-active in the network.\n5. The method as described in claim 1 wherein the given occurrence is receipt of a request for an updated machine learning model.\n6. The method as described in claim 1 wherein the first set of users includes all or a subset of the users in the network.\n7. The method as described in claim 1 wherein the refined machine learning model is applied to enable identification and tracking of the suspicious behavior associated with one or more users in the first set of users that have been determined to satisfy a given risk condition.\n8. An apparatus, comprising:\na processor;\ncomputer memory holding computer program instructions executed by the processor to train and use a machine learning model to identify suspicious behavior in a network, the machine learning model using training data that is based on data associated with a first set of users, the computer program instructions comprising program code configured to:\nconstruct a watch list comprising a second set of users as the machine learning model is being operating in an ingest mode against data being ingested for a first set of users;\nupon a given occurrence, interrupt the ingest mode and ingest data associated with the second set of users;\nfollowing data ingestion associated with the second set of users, prune at least a portion of the ingested data to generate updated training data, the portion corresponding to data for any user included in the first set of users but not included in the second set of users;\nrefine the machine learning model based at least in part on the updated training data; and\nswitch back to the ingest mode and operate the refined machine learning model against data being ingested for the second set of users to enable identification and tracking of the suspicious behavior.\n9. The apparatus as described in claim 8 wherein the program code is further configured, following ingesting and pruning, to ingest additional data associated with the second set of users.\n10. The apparatus as described in claim 8 wherein the second set of users includes users that have been found to have a highest moving average risk score for the machine learning model.\n11. The apparatus as described in claim 10 wherein the second set of users also includes one or more users that are newly-active in the network.\n12. The apparatus as described in claim 8 wherein the given occurrence is receipt of a request for an updated machine learning model.\n13. The apparatus as described in claim 8 wherein the first set of users includes all or a subset of the users in the network.\n14. The apparatus as described in claim 8 wherein the refined machine learning model is applied to enable identification and tracking of the suspicious behavior associated with one or more users in the first set of users that have been determined to satisfy a given risk condition.\n15. A computer program product in a non-transitory computer readable medium for use in a data processing system to train and use a machine learning model to identify suspicious behavior in a network, the machine learning model using training data that is based on data associated with a first set of users, the computer program product holding computer program instructions that, when executed by the data processing system, are configured to:\nconstruct a watch list comprising a second set of users as the machine learning model is being operating in an ingest mode against data being ingested for a first set of users;\nupon a given occurrence, interrupt the ingest mode and ingest data associated with the second set of users;\nfollowing data ingestion associated with the second set of users, prune at least a portion of the ingested data to generate updated training data, the portion corresponding to data for any user included in the first set of users but not included in the second set of users;\nrefine the machine learning model based at least in part on the updated training data; and\nswitch back to the ingest mode and operate the refined machine learning model against data being ingested for the second set of users to enable identification and tracking of the suspicious behavior.\n16. The computer program product as described in claim 15 wherein the program code is further configured, following ingesting and pruning, to ingest additional data associated with the second set of users.\n17. The computer program product as described in claim 15 wherein the second set of users includes users that have been found to have a highest moving average risk score for the machine learning model.\n18. The computer program product as described in claim 17 wherein the second set of users also includes one or more users that are newly-active in the network.\n19. The computer program product as described in claim 15 wherein the given occurrence is receipt of a request for an updated machine learning model.\n20. The computer program product as described in claim 15 wherein the first set of users includes all or a given subset of the users in the network.\n21. The computer program product as described in claim 15 wherein the refined machine learning model is applied to enable identification and tracking of the suspicious behavior associated with one or more users in the first set of users that have been determined to satisfy a given risk condition."
}