{
    "patent_id": "US-11774944-B2",
    "title": "Methods and systems for the industrial internet of things ",
    "assignee": "Strong Force Iot Portfolio 2016, Llc",
    "publication_date": "2023-10-03",
    "patent_link": "https://patents.google.com/patent/US11774944B2/en",
    "inventors": [
        "Charles Howard Cella",
        "Mehul Desai",
        "Gerald William Duffy, JR.",
        "Jeffrey P. McGuckin",
        "Tracey Ho",
        "John Segui",
        "Steven Blumenthal",
        "Chun Meng"
    ],
    "classifications": [
        "G05B19/4155",
        "G05B19/4183",
        "G05B23/0221",
        "G06N20/00",
        "G06N3/006",
        "G06N3/044",
        "G06N3/086",
        "G06N3/126",
        "G05B2219/31156",
        "G05B2219/31282",
        "G05B2219/33039",
        "G06N20/10",
        "G06N3/042",
        "G06N3/045",
        "G06N3/047",
        "G06N3/048",
        "G06N3/049",
        "G06N3/084",
        "G06N3/088",
        "G06N7/01",
        "G06N7/02",
        "Y02P80/10",
        "Y02P90/02"
    ],
    "abstract": "An example data collection system in an industrial environment includes a data collector in communication with a number of input channels for acquiring collected data. The system includes a data storage that stored the collected data as a number of data pools. The system includes a self-organizing data marketplace engine that receives the data pools, and that is organized based on training a marketplace self-organization with a training set, and further based on feedback from measures of marketplace success with respect to the data pools.",
    "claims": "\n1. A monitoring system for data collection in an industrial environment, the system comprising:\na plurality of sensors communicatively coupled to a data collector having a controller;\na data collection band circuit structured to determine at least one collection parameter for at least one of the plurality of sensors from which to process output data; and\na machine learning data analysis circuit structured to receive output data from the at least one of the plurality of sensors and learn received output data patterns indicative of a state,\nwherein the data collection band circuit alters the at least one collection parameter for the at least one of the plurality of sensors based on one or more of the learned received output data patterns and the state, and\nwherein the at least one collection parameter is a bandwidth parameter.\n2. The system of claim 1, wherein the state corresponds to an outcome relating to a machine in the industrial environment.\n3. The system of claim 1, wherein the state corresponds to an anticipated outcome relating to a machine in the industrial environment.\n4. The system of claim 1, wherein the state corresponds to an outcome relating to a process in the industrial environment.\n5. The system of claim 1, wherein the state corresponds to an anticipated outcome relating to a process in the industrial environment.\n6. The system of claim 1, wherein the at least one collection parameter is used to govern a multiplexing of the plurality of the sensors.\n7. The system of claim 1, wherein the at least one collection parameter is a timing parameter.\n8. The system of claim 1, wherein the at least one collection parameter relates to a frequency range.\n9. The system of claim 1, wherein the at least one collection parameter relates to a granularity of a collection of sensor data.\n10. The system of claim 1, wherein the at least one collection parameter is a storage parameter for the collected output data.\n11. The system of claim 1, wherein the machine learning data analysis circuit is structured to learn received output data patterns by being seeded with a model.\n12. The system of claim 11, wherein the model is a physical model, an operational model, or a system model.\n13. The system of claim 1, wherein the machine learning data analysis circuit is structured to learn received output data patterns based on the state.\n14. The system of claim 13, wherein the data collection band circuit alters at least one subset of the plurality of sensors when the learned received output data pattern does not reliably predict the state.\n15. The system of claim 14, wherein altering the at least one subset comprises discontinuing collection of data from the at least one subset.\n16. A monitoring device for data collection in an industrial environment, the monitoring device comprising:\na plurality of sensors communicatively coupled to a controller, the controller comprising:\na data collection band circuit structured to determine at least one subset of the plurality of sensors from which to process output data; and\na machine learning data analysis circuit structured to receive output data from the at least one subset of the plurality of sensors and learn received output data patterns indicative of a state,\nwherein the data collection band circuit alters an aspect of the at least one subset of the plurality of sensors based on one or more of the learned received output data patterns and the state, and\nwherein the aspect that the data collection band circuit alters is a number of data points collected from one or more members of the at least one subset of the plurality of sensors.\n17. The monitoring device of claim 16, wherein the aspect that the data collection band circuit alters is a frequency of data points collected from the one or more members of the at least one subset of plurality of sensors.\n18. The monitoring device of claim 16, wherein the aspect that the data collection band circuit alters is a bandwidth parameter.\n19. The monitoring device of claim 16, wherein the aspect that the data collection band circuit alters is a timing parameter.\n20. The monitoring device of claim 16, wherein the aspect that the data collection band circuit alters relates to a frequency range.\n21. The monitoring device of claim 16, wherein the aspect that the data collection band circuit alters relates to a granularity of collection of sensor data.\n22. The monitoring device of claim 16, wherein the altered aspect is a storage parameter for the collected output data.\n23. A monitoring system for data collection in an industrial environment, the system comprising:\na plurality of sensors communicatively coupled to a data collector having a controller;\na data collection band circuit structured to determine at least one collection parameter for at least one of the plurality of sensors from which to process output data; and\na machine learning data analysis circuit structured to receive output data from the at least one of the plurality of sensors and learn received output data patterns indicative of a state,\nwherein the data collection band circuit alters the at least one collection parameter for the at least one of the plurality of sensors based on one or more of the learned received output data patterns and the state, and\nwherein the collection parameter is used to govern a multiplexing of a plurality of the sensors.\n24. The system of claim 23, wherein the state corresponds to an outcome relating to a machine in the environment.\n25. The system of claim 23, wherein the state corresponds to at least one of: an anticipated outcome relating to a machine in the environment, an outcome relating to a process in the environment, or an anticipated outcome relating to a process in the environment.\n26. The system of claim 23 wherein the collection parameter is at least one of: a bandwidth parameter, a storage parameter for the collected data, or a timing parameter.\n27. The system of claim 23, wherein the collection parameter relates to at least one of: a frequency range, a granularity of collection of sensor data.\n28. The system of claim 23, wherein the machine learning data analysis circuit is structured to learn received output data patterns by being seeded with a model, wherein the model is a physical model, an operational model, or a system model.\n29. The system of claim 23, wherein the machine learning data analysis circuit is structured to learn received output data patterns based on the state.\n30. The system of claim 23, wherein the data collection band circuit alters at least one subset of the plurality of sensors when the learned received output data pattern does not reliably predict the state, and wherein altering the at least one subset comprises discontinuing collection of data from the at least one subset.\n31. A monitoring system for data collection in an industrial environment, the system comprising:\na plurality of sensors communicatively coupled to a data collector having a controller;\na data collection band circuit structured to determine at least one collection parameter for at least one of the plurality of sensors from which to process output data; and\na machine learning data analysis circuit structured to receive output data from the at least one of the plurality of sensors and learn received output data patterns indicative of a state,\nwherein the data collection band circuit alters the at least one collection parameter for the at least one of the plurality of sensors based on one or more of the learned received output data patterns and the state, and\nwherein the collection parameter is a storage parameter for the collected data.\n32. The system of claim 31, wherein the state corresponds to at least one of: an outcome relating to a machine in the environment, an anticipated outcome relating to a machine in the environment, an outcome relating to a process in the environment, or an anticipated outcome relating to a process in the environment.\n33. The system of claim 31 wherein the collection parameter is at least one of: a bandwidth parameter, or used to govern a multiplexing of a plurality of the sensors.\n34. The system of claim 31, wherein the collection parameter relates to at least one of: a frequency range, or a granularity of collection of sensor data.\n35. The system of claim 31, wherein the machine learning data analysis circuit is structured to learn received output data patterns by being seeded with a model, wherein the model is a physical model, an operational model, or a system model, and wherein the machine learning data analysis circuit is structured to learn received output data patterns based on the state.\n36. The system of claim 31, wherein the data collection band circuit alters at least one subset of the plurality of sensors when the learned received output data pattern does not reliably predict the state, and wherein altering the at least one subset comprises discontinuing collection of data from the at least one subset.\n37. A monitoring system for data collection in an industrial environment, the system comprising:\na plurality of sensors communicatively coupled to a data collector having a controller;\na data collection band circuit structured to determine at least one collection parameter for at least one of the plurality of sensors from which to process output data; and\na machine learning data analysis circuit structured to receive output data from the at least one of the plurality of sensors and learn received output data patterns indicative of a state,\nwherein the data collection band circuit alters the at least one collection parameter for the at least one of the plurality of sensors based on one or more of the learned received output data patterns and the state, and wherein the machine learning data analysis circuit is structured to learn the received output data patterns by being seeded with a model.\n38. The system of claim 37, wherein the model is a physical model, an operational model, or a system model.\n39. The system of claim 37, wherein the machine learning data analysis circuit is structured to learn received output data patterns based on the state.\n40. The system of claim 37, wherein the collection parameter is at least one of: a timing parameter, or a storage parameter for the collected data.\n41. The system of claim 37, wherein the collection parameter relates to at least one of: a frequency range or a granularity of collection of sensor data.\n42. A monitoring system for data collection in an industrial environment, the system comprising:\na plurality of sensors communicatively coupled to a data collector having a controller;\na data collection band circuit structured to determine at least one collection parameter for at least one of the plurality of sensors from which to process output data; and\na machine learning data analysis circuit structured to receive output data from the at least one of the plurality of sensors and learn received output data patterns indicative of a state,\nwherein the data collection band circuit alters the at least one collection parameter for the at least one of the plurality of sensors based on one or more of the learned received output data patterns and the state, and\nwherein the data collection band circuit alters at least one subset of the plurality of sensors when the learned received output data pattern does not reliably predict the state.\n43. The system of claim 42, wherein altering the at least one subset comprises discontinuing collection of data from the at least one subset.\n44. The system of claim 42, wherein the collection parameter is used to govern a multiplexing of a plurality of the sensors.\n45. The system of claim 42, wherein the state corresponds to at least one of: an outcome relating to a machine in the environment, an anticipated outcome relating to a machine in the environment, an outcome relating to a process in the environment, or an anticipated outcome relating to a process in the environment.\n46. A monitoring device for data collection in an industrial environment, the monitoring device comprising:\na plurality of sensors communicatively coupled to a controller, the controller comprising:\na data collection band circuit structured to determine at least one subset of the plurality of sensors from which to process output data; and\na machine learning data analysis circuit structured to receive output data from the at least one subset of the plurality of sensors and learn received output data patterns indicative of a state,\nwherein the data collection band circuit alters an aspect of the at least one subset of the plurality of sensors based on one or more of the learned received output data patterns and the state, and\nwherein the aspect that the data collection band circuit alters is a frequency of data points collected from one or more members of the at least one subset of the plurality of sensors.\n47. The monitoring device of claim 46, wherein the aspect that the data collection band circuit alters further comprises a timing parameter.\n48. The monitoring device of claim 46, wherein the aspect that the data collection band circuit alters further comprises a storage parameter for the collected output data.\n49. A monitoring device for data collection in an industrial environment, the monitoring device comprising:\na plurality of sensors communicatively coupled to a controller, the controller comprising:\na data collection band circuit structured to determine at least one subset of the plurality of sensors from which to process output data; and\na machine learning data analysis circuit structured to receive output data from the at least one subset of the plurality of sensors and learn received output data patterns indicative of a state,\nwherein the data collection band circuit alters an aspect of the at least one subset of the plurality of sensors based on one or more of the learned received output data patterns and the state, and\nwherein the aspect that the data collection band circuit alters is a bandwidth parameter.\n50. The monitoring device of claim 49, wherein the aspect that the data collection band circuit alters further relates to a granularity of collection of sensor data.\n51. The monitoring device of claim 49, wherein the aspect that the data collection band circuit alters further comprises a storage parameter for the collected data.\n52. A monitoring device for data collection in an industrial environment, the monitoring device comprising:\na plurality of sensors communicatively coupled to a controller, the controller comprising:\na data collection band circuit structured to determine at least one subset of the plurality of sensors from which to process output data; and\na machine learning data analysis circuit structured to receive the output data from the at least one subset of the plurality of sensors and learn received output data patterns indicative of a state,\nwherein the data collection band circuit alters an aspect of the at least one subset of the plurality of sensors based on one or more of the learned received output data patterns and the state, and\nwherein the altered aspect is a storage parameter for the received output data.\n53. The monitoring device of claim 52, wherein the aspect that the data collection band circuit alters further comprises a timing parameter."
}