{
    "patent_id": "US-11614306-B2",
    "title": "Target analysis and recommendation ",
    "assignee": "Philip Lyren",
    "publication_date": "2023-03-28",
    "patent_link": "https://patents.google.com/patent/US11614306B2/en",
    "inventors": [
        "Philip Lyren"
    ],
    "classifications": [
        "F41G3/04",
        "F41G3/02",
        "F41G3/165",
        "F41H13/00",
        "G02B27/0172",
        "G02B27/0189",
        "G06N20/00",
        "G06T19/006",
        "F41G3/06",
        "G02B2027/0138",
        "G02B2027/014",
        "G02B2027/0141",
        "G02B2027/0178",
        "G06N20/20",
        "G06T2207/30201",
        "G06T2219/024"
    ],
    "abstract": "An electronic device determines target information about a target and recommends a target based on the target information.",
    "claims": "\n1. A method comprising:\nreceiving, at a user interface of a wearable electronic device (WED) worn on a head of a user, selection of a person in a field-of-view of the WED;\ntransmitting, over a wireless network, a location of the person to other WEDs worn on heads of other users; and\ndisplaying, with the other WEDs worn on the heads of the other users, the person as a virtual image on a map that shows the location of the person and identifies the person as a combatant.\n2. The method of claim 1 further comprising:\nsimultaneously displaying, with the other WEDs and on the map, virtual images that include locations of combatants that are people, a location of the user, and locations of the other users.\n3. The method of claim 1 further comprising:\ndisplaying, with the other WEDs, the virtual image on the map along with a compass direction to the person who is the combatant.\n4. The method of claim 1 further comprising:\ndisplaying, with the other WEDs, the virtual image on the map in a color red to identify the person as the combatant and virtual images of the other users in color green or blue.\n5. The method of claim 1 further comprising:\ndisplaying, with the WED, a virtual image on the person in color red to identify the person as the combatant; and\nmoving the virtual image so the virtual image remains on the person as the person moves.\n6. The method of claim 1 further comprising:\ndisplaying, with the other WEDs, the virtual image on the map in color red to instruct the other users to fire upon the person.\n7. The method of claim 1 further comprising:\ndisplaying, with the WED worn on the head of the user, a three-dimensional (3D) map that displays a path for where the user should move.\n8. The method of claim 1 further comprising:\ndisplaying, with a see-thru display of the WED worn on the head of the user, a distance to the person, a compass direction to the person, and a virtual object with a color red identifying the person as the combatant.\n9. A wearable electronic device (WED) worn on a head of a user, the WED comprising:\na user interface that receives, from the user wearing the WED on the head, selection of a target in a field-of-view of the WED; and\na display that displays, over the target and in response to receiving the selection, a virtual image that identifies the target as a combatant who is a person and displays a map that shows virtual images of other users, wherein the WED includes or is in communication with a transmitter that transmits a location of the target to WEDs of the other users.\n10. The WED of claim 9, wherein the display displays a compass direction to the combatant and a distance to the combatant.\n11. The WED of claim 9, wherein the display displays a map that simultaneously shows the other users with color blue or green and the combatant with color red.\n12. The WED of claim 9, wherein the virtual image being displayed on the person moves and remains on the person as the person moves in the field-of-view of the WED.\n13. The WED of claim 9, wherein the display is a see thru display that displays the virtual image on the person with a color red to identify the person as the combatant.\n14. The WED of claim 9 further comprising:\na receiver that receives, from a flying drone, images of targets at a geographical location of the user, wherein the display displays virtual images on the targets to assist the user in distinguishing the targets from non-targets.\n15. The WED of claim 9, wherein the display assists the user in moving to a safe area by displaying a virtual path that shows a path to the safe area.\n16. A wearable electronic device (WED) worn on a head of a user, the WED comprising:\na user interface that receives, from the user wearing the WED on the head, selection of a person in a field-of-view of the WED; and\na display that displays, on the person, a virtual image that visually identifies the person as a combatant, wherein the display moves the virtual image so that the virtual image remains on the person as the person moves in the field-of-view of the WED.\n17. The WED of claim 16 further comprising:\na transmitter that transmits, over a wireless peer-to-peer (P2P) network, a location of the person to other WEDs worn on heads of other users.\n18. The WED of claim 16, wherein the virtual image has a color red to identify the person as the combatant and to instruct the user to fire a firearm at the combatant.\n19. The WED of claim 16, wherein the display displays a map that shows a compass direction to the combatant, virtual objects of other users wearing WEDs, and virtual objects of other combatants.\n20. The WED of claim 16, wherein the display displays the virtual image in color red to identify the person as the combatant and other virtual images in colors blue or green to identify other people as not being combatants."
}