{
    "patent_id": "US-11008590-B2",
    "title": "Methods and compositions for RNA-directed target DNA modification and for RNA-directed modulation of transcription ",
    "assignee": "The Regents Of The University Of California, University Of Vienna, Emmanuelle Charpentier",
    "publication_date": "2021-05-18",
    "patent_link": "https://patents.google.com/patent/US11008590B2/en",
    "inventors": [
        "Jennifer A. DOUDNA",
        "Martin Jinek",
        "Krzysztof Chylinski",
        "Emmanuelle Charpentier"
    ],
    "classifications": [
        "C12N15/907",
        "A01H6/4684",
        "A01K67/027",
        "A61K38/465",
        "A61P31/00",
        "A61P31/04",
        "A61P31/12",
        "A61P35/00",
        "A61P43/00",
        "C12N15/102",
        "C12N15/111",
        "C12N15/113",
        "C12N15/63",
        "C12N15/70",
        "C12N15/746",
        "C12N15/90",
        "C12N15/902",
        "C12N5/10",
        "C12Q1/686",
        "C12Y301/04",
        "H01L21/02312",
        "H01L21/02365",
        "H01L33/0075",
        "A61K48/00",
        "C07K2319/71",
        "C07K2319/85",
        "C12N2310/11",
        "C12N2310/13",
        "C12N2310/14",
        "C12N2310/20",
        "C12N2310/31",
        "C12N2310/32",
        "C12N2310/33",
        "C12N2310/3519",
        "C12N2310/531",
        "C12N2800/80",
        "C12N9/22",
        "Y02A50/30"
    ],
    "abstract": "The present disclosure provides a DNA-targeting RNA that comprises a targeting sequence and, together with a modifying polypeptide, provides for site-specific modification of a target DNA and/or a polypeptide associated with the target DNA. The present disclosure further provides site-specific modifying polypeptides. The present disclosure further provides methods of site-specific modification of a target DNA and/or a polypeptide associated with the target DNA The present disclosure provides methods of modulating transcription of a target nucleic acid in a target cell, generally involving contacting the target nucleic acid with an enzymatically inactive Cas9 polypeptide and a DNA-targeting RNA. Kits and compositions for carrying out the methods are also provided. The present disclosure provides genetically modified cells that produce Cas9; and Cas9 transgenic non-human multicellular organisms.",
    "claims": "\n1. A composition comprising\n(1) a Cas9 protein or a nucleic acid encoding the Cas9 protein, wherein the Cas9 protein is a Streptococcus pyogenes Cas9; and\n(2) a DNA-targeting RNA, or one or more nucleic acids encoding the DNA-targeting RNA, wherein the DNA-targeting RNA comprises:\n(a) a targeter-RNA comprising:\n(i) a first nucleotide sequence that is complementary to a target sequence of a target DNA, and (ii) a second nucleotide sequence that hybridizes with an activator-RNA, wherein the first and second nucleotide sequences are heterologous to one another; and\n(b) the activator-RNA, which hybridizes with the second nucleotide sequence of the targeter-RNA to form a double-stranded RNA (dsRNA) duplex, wherein the activator-RNA hybridizes with the targeter-RNA to form a total of 8 to 15 base pairs,\nwherein the DNA-targeting RNA is capable of forming a complex with the Cas9 protein and guiding the complex to the target sequence of the target DNA.\n2. The composition of claim 1, wherein the targeter-RNA and the activator-RNA are not covalently linked to one another by intervening nucleotides.\n3. The composition of claim 1, wherein the targeter-RNA and the activator-RNA are two separate RNA molecules.\n4. The composition of claim 1, wherein the first nucleotide sequence is 18 to 25 nucleotides long.\n5. The composition of claim 1, further comprising a nuclease inhibitor.\n6. The composition of claim 1, wherein the Cas9 protein comprises a mutation in a RuvC and/or an HNH domain.\n7. The composition of claim 1, wherein the Cas9 protein comprises a heterologous polypeptide.\n8. The composition of claim 7, wherein the heterologous polypeptide comprises an endosomolytic domain, an influenza HA domain, an IF2 domain, a GST domain, a GRPE domain, a 6×His tag, a hemagglutinin (HA) tag, or green fluorescent protein.\n9. The composition of claim 1, wherein the Cas9 protein is fused to a protein transduction domain (PTD).\n10. The composition of claim 1, wherein the DNA-targeting RNA is capable of firming a complex with the Cas9 protein and guiding the complex to the target sequence to cleave the target DNA.\n11. The composition of claim 10, further comprising a donor polynucleotide.\n12. The composition of claim 1, wherein the DNA-targeting RNA is capable of forming a complex with the Cas9 protein and guiding the complex to the target sequence to cleave the target DNA.\n13. The composition of claim 12, further comprising a donor polynucleotide.\n14. The composition of claim 1, wherein the composition comprises a protein-RNA complex comprising the Cas9 protein and the DNA-targeting RNA.\n15. The composition of claim 1, comprising the DNA-targeting RNA and the nucleic acid encoding the Cas9 protein.\n16. The composition of claim 1, comprising the nucleic acid encoding the Cas9 protein and/or the one or more nucleic acids encoding the DNA-targeting RNA.\n17. The composition of claim 16, wherein the nucleic acid encoding the Cas9 protein is an RNA.\n18. The composition of claim 16, wherein the nucleic acid encoding the Cas9 protein is a DNA.\n19. The composition of claim 16, wherein the nucleic acid encoding the Cas9 protein and/or the one or more nucleic acids encoding the DNA-targeting RNA, is a plasmid, a cosmid, a minicircle, a phage, or a viral vector.\n20. The composition of claim 1, wherein the activator-RNA comprises the 67 nt tracrRNA sequence UAGCAAGUUAAAAUAAGGCUAGUCCGUUAUCAACUUGAAAAAGUGGCACCGAGUCGGU GCUUUUUUU (SEQ ID NO: 432); or the 26 nucleotide tracrRNA sequence UAGCAAGUUAAAAUAAGGCUAGUCCG (SEQ ID NO: 397).\n21. The composition of claim 1, comprising the DNA-targeting RNA, wherein the DNA-targeting RNA comprises one or more non-natural internucleoside linkages, one or more nucleic acid mimetics, one or more modified sugar moieties, and/or one or more modified nucleobases.\n22. The composition of claim 1, comprising the DNA-targeting RNA, wherein the DNA-targeting RNA comprises one or more phosphorothioates, one or more inverted polarity linkages, one or more abasic nucleoside linkages, one or more locked nucleic acids (LNAs), one or more 2′-O-methoxyethyl modified sugar moieties, one or more 2′-O-methyl modified sugar moieties, one or more 2′-O-(2-methoxyethyl) modified sugar moieties, one or more 2′-fluoro modified sugar moieties, one or more 2′-dimethylaminooxyethoxy modified sugar moieties, one or more 2′-dimethylaminoethoxyethoxy modified sugar moieties, one or more peptide nucleic acids (PNAs), one or more morpholino nucleic acids, and/or one or more cyclohexenyl nucleic acids (CeNAs).\n23. The composition of claim 22, wherein the DNA-targeting RNA comprises said one or more 2′-O-methyl modified sugar moieties and/or said one or more 2′-fluoro modified sugar moieties.\n24. The composition of claim 1, comprising the DNA-targeting RNA, wherein the targeter-RNA and/or the activator-RNA are conjugated to a heterologous moiety.\n25. A composition comprising\n(1) a Cas9 protein or a nucleic acid encoding the Cas9 protein, wherein the Cas9 protein is a Streptococcus pyogenes Cas9; and\n(2) a DNA-targeting RNA, or one or more nucleic acids encoding the DNA-targeting RNA, wherein the DNA-targeting RNA comprises:\n(a) a targeter-RNA comprising:\n(i) a first nucleotide sequence that is complementary to a target sequence of a target DNA, and (ii) a second nucleotide sequence that hybridizes with an activator-RNA, wherein the first and second nucleotide sequences are heterologous to one another; and\n(b) the activator-RNA, which hybridizes with the second nucleotide sequence of the targeter-RNA to form a double-stranded RNA (dsRNA) duplex, wherein the activator-RNA hybridizes with the targeter-RNA to form a total of 8 to 15 base pairs,\nwherein the activator-RNA comprises the 67 nt tracrRNA sequence UAGCAAGUUAAAAUAAGGCUAGUCCGUUUAUCAACUUGAAAAAGUGGCACCGAGUCGGU GCUUUUUUU (SEQ ID NO: 432), and\nwherein the DNA-targeting RNA is capable of forming a complex with the Cas9 protein and guiding the complex to the target sequence of the target DNA.\n26. A kit comprising:\n(1) a Cas9 protein or a nucleic acid encoding the Cas9 protein, wherein the Cas9 protein is a Streptococcus pyogenes Cas9; and\n(2) a DNA-targeting RNA, or one or more nucleic acids encoding the DNA-targeting RNA, wherein the DNA-targeting RNA comprises:\n(a) a targeter-RNA comprising:\n(i) a first nucleotide sequence that is complementary to a target sequence of a target DNA, and (ii) a second nucleotide sequence that hybridizes with an activator-RNA, wherein the first and second nucleotide sequences are heterologous to one another; and\n(b) the activator-RNA, which hybridizes with the second nucleotide sequence of the targeter-RNA to form a double-stranded RNA (dsRNA) duplex, wherein the activator-RNA hybridizes with the targeter-RNA to form a total of 8 to 1 base pairs,\nwherein the DNA-targeting RNA is capable of forming a complex with the Cas9 protein and guiding the complex to the target sequence of the target DNA; and\nwherein (a) and (b) are separated.\n27. The kit of claim 26, wherein the first nucleotide sequence is 18 to 25 nucleotides long.\n28. The kit of claim 26, wherein the activator-RNA comprises the 67 in tracrRNA sequence UAGCAAGUUAAAAUAAGGCUAGUCCGUUAUCAACUUGAAAAAGUGGCACCGAGUCGGU GCUUUUUUU (SEQ ID NO: 432); or the 26 nucleotide tracrRNA sequence UAGCAAGUUAAAAUAAGGCUAGUCCG (SEQ 11) NO: 397).\n29. The kit of claim 26, wherein the Cas9 protein comprises a mutation in a RuvC and/or an HNH domain.\n30. The kit of claim 26, wherein the Cas9 protein comprises a heterologous polypeptide."
}