{
    "patent_id": "US-11482300-B2",
    "title": "Methods for preparing a DNA fraction from a biological sample for analyzing genotypes of cell-free DNA ",
    "assignee": "Natera, Inc.",
    "publication_date": "2022-10-25",
    "patent_link": "https://patents.google.com/patent/US11482300B2/en",
    "inventors": [
        "Matthew Rabinowitz",
        "George Gemelos",
        "Milena Banjevic",
        "Allison Ryan",
        "Zachary Demko",
        "Matthew Hill",
        "Bernhard Zimmermann",
        "Johan Baner",
        "Styrmir Sigurjonsson"
    ],
    "classifications": [
        "G16B20/00",
        "C12Q1/6804",
        "C12Q1/6806",
        "C12Q1/6827",
        "C12Q1/6844",
        "C12Q1/6851",
        "C12Q1/6855",
        "C12Q1/686",
        "C12Q1/6862",
        "C12Q1/6869",
        "C12Q1/6874",
        "C12Q1/6876",
        "C12Q1/6881",
        "C12Q1/6883",
        "C12Q2537/161",
        "C12Q2537/165",
        "G01N33/50",
        "G06N7/01",
        "G16B20/10",
        "G16B20/20",
        "G16B20/40",
        "G16B30/00",
        "G16B40/00",
        "C12Q2525/179",
        "C12Q2527/113",
        "C12Q2527/143",
        "C12Q2537/143",
        "C12Q2537/149",
        "C12Q2537/159",
        "C12Q2545/114",
        "C12Q2600/156",
        "C12Q2600/16"
    ],
    "abstract": "The present disclosure provides methods for determining the ploidy status of a chromosome in a gestating fetus from genotypic data measured from a mixed sample of DNA comprising DNA from both the mother of the fetus and from the fetus, and optionally from genotypic data from the mother and father. The ploidy state is determined by using a joint distribution model to create a plurality of expected allele distributions for different possible fetal ploidy states given the parental genotypic data, and comparing the expected allelic distributions to the pattern of measured allelic distributions measured in the mixed sample, and choosing the ploidy state whose expected allelic distribution pattern most closely matches the observed allelic distribution pattern. The mixed sample of DNA may be preferentially enriched at a plurality of polymorphic loci in a way that minimizes the allelic bias, for example using massively multiplexed targeted PCR.",
    "claims": "\n1. A method for preparing a deoxyribonucleic acid (DNA) fraction from a biological sample useful for analyzing genotypes of cell-free DNA in the biological sample, comprising:\n(a) extracting cell-free DNA from the biological sample;\n(b) producing a fraction of the DNA extracted in (a), comprising: performing multiplex targeted pre-amplification on the DNA, wherein the pre-amplification is a linear amplification; performing a first PCR to simultaneously amplify at least 10 target loci using at least 10 different target-specific primers in one reaction volume; and performing a second PCR to simultaneously amplify the at least 10 target loci in one reaction volume, wherein the second PCR is nested PCR;\n(c) analyzing the fraction of the DNA produced in (b) by performing high-throughput sequencing on the amplified DNA to obtain sequence reads and determining the sequence of the target loci based on the sequence reads.\n2. The method of claim 1, wherein the biological sample is a blood, plasma, serum, or urine sample.\n3. The method of claim 1, wherein the cell-free DNA comprises cancer DNA.\n4. The method of claim 1, wherein the target loci comprise single nucleotide polymorphism or variant loci.\n5. The method of claim 1, wherein the first PCR comprises simultaneously amplifying at least 20 target loci in one reaction volume.\n6. The method of claim 1, wherein the first PCR comprises simultaneously amplifying at least 50 target loci in one reaction volume.\n7. The method of claim 1, wherein the second PCR comprises simultaneously amplifying at least 20 target loci in one reaction volume.\n8. The method of claim 1, wherein the second PCR comprises simultaneously amplifying at least 50 target loci in one reaction volume.\n9. The method of claim 1, wherein the nested PCR is semi-nested PCR, hemi-nested PCR, one-sided nested PCR, or fully nested PCR.\n10. The method of claim 1, wherein the amplified DNA are tagged with molecular barcodes.\n11. The method of claim 10, wherein the amplified DNA are tagged with up to 1024 molecular barcodes.\n12. The method of claim 10, wherein the amplified DNA are tagged with 1024-65536 molecular barcodes.\n13. The method of claim 1, wherein at least 80% of the sequence reads map to the target loci.\n14. The method of claim 1, wherein at least 90% of the sequence reads map to the target loci.\n15. The method of claim 1, wherein the method further comprises barcoding PCR to introduce a sample barcode, and wherein amplified DNA from multiple samples are pooled together and sequenced in a single sequencing lane.\n16. The method of claim 1, wherein the method further comprises determining the presence of cancer DNA.\n17. A method for preparing a deoxyribonucleic acid (DNA) fraction from a biological sample useful for analyzing genotypes of cell-free DNA in the biological sample, comprising:\n(a) extracting cell-free DNA from the biological sample;\n(b) producing a fraction of the DNA extracted in (a), comprising: performing multiplex targeted pre-amplification on the DNA, wherein the pre-amplification is a linear amplification, and performing a multiplex targeted nested PCR to simultaneously amplify at least 10 target single nucleotide polymorphism or variant loci using at least 10 different target-specific primers in one reaction volume;\n(c) analyzing the fraction of the DNA produced in (b) by performing high-throughput sequencing on the amplified DNA to obtain sequence reads and determining the sequence of the target loci based on the sequence reads.\n18. The method of claim 17, wherein the biological sample is a blood, plasma, serum, or urine sample, wherein the multiplex targeted nested PCR simultaneously amplifies at least 20 target single nucleotide polymorphism or variant loci in one reaction volume, and wherein at least 80% of the sequence reads map to the target single nucleotide polymorphism or variant loci.\n19. The method of claim 17, wherein the biological sample is a blood, plasma, serum, or urine sample, wherein the multiplex targeted nested PCR simultaneously amplifies at least 50 target single nucleotide polymorphism or variant loci in one reaction volume, and wherein at least 90% of the sequence reads map to the target single nucleotide polymorphism or variant loci.\n20. The method of claim 17, wherein the amplified DNA are tagged with molecular barcodes."
}