{
    "patent_id": "US-10542046-B2",
    "title": "Systems and methods for blockchain security data intelligence ",
    "assignee": "Unifyvault LLC",
    "publication_date": "2020-01-21",
    "patent_link": "https://patents.google.com/patent/US10542046B2/en",
    "inventors": [
        "Rakesh Babu Katragadda",
        "Juan Ramirez",
        "G. Krishna Kumar",
        "Chandana Karipineni",
        "Saritha Vellanki",
        "Sudha Kolachalam"
    ],
    "classifications": [
        "H04L63/1433",
        "H04L63/20",
        "G06F21/56",
        "G06F21/57",
        "G06F21/6245",
        "G06F21/645",
        "G06N20/00",
        "G06N3/006",
        "G06N5/025",
        "G06N5/043",
        "H04L63/1425",
        "H04L63/1441",
        "H04L63/302"
    ],
    "abstract": "Embodiments are directed to systems and methods configured to gather, transmit, share and process security related data between end users and security applications/devices across multiple platforms using blockchain open implementation as the backend and smart contracts integrated with artificial intelligence and behavior analysis using rule engines to enforce/implement data decisions. The system is designed to continuously predict, monitor, prevent, detect, response and mitigate cyber threats. The process includes a self-enforced adaptable engine that has a fast incident response time and makes quick smart decisions. This is a resilient system that is constantly capturing data, learning, tracking and enforcing. Computational power is maximized by leveraging smart contracts to validate transactions between network devices, share encrypted and protected information about their functions, events across the network of nodes and make smart swarm decisions.",
    "claims": "\n1. A method of detecting vulnerabilities and anomalies in a distributed computational environment, the method comprising the steps of:\nreceiving, from a client environment, at least one input data distributed among a plurality of nodes within a particular network;\nreceiving, from at least one of the plurality of nodes, the at least one input data into a curator engine, receiving, from the curator engine, the at least one input data into a transaction engine;\nevaluating the at least one input data for information and events or vectors of attack;\nvalidating the information and events or vectors of attack;\nranking the information and events or vectors of attack as an indicator;\nlogging the indicator into the node of the particular network;\nrecording the indicator into a blockchain database as a transaction having a unique transaction identifier;\nreading, by a rule engine, the transaction from the blockchain database;\nprocessing, by the rule engine, the transaction so to make a decision to transform or analyze the transaction based on a predetermined set of rules;\nreceiving, by an action engine, transaction from the rule engine; and\nprocessing, by the action engine, the transaction received from the rule engine, wherein the action engine decides a predetermined action and generates feedback to the client environment based on the predetermined action.\n2. The method of claim 1, wherein the validating, the evaluating, the ranking, the recording, and the logging are performed by a plurality of researchers, an automated analysis or a network consensus from the client environment.\n3. The method of claim 2, wherein the plurality of researchers, a plurality of external individuals or a plurality of machines that provide legitimate intelligence are rewarded.\n4. The method of claim 1, wherein the rule engine input is swarm intelligence using a plurality of data inputs.\n5. The method of claim 4, wherein to detect an anomaly through an outside intruder stationed illegally in the client environment, the swarm intelligence is configured to utilize particle swarm optimization techniques.\n6. The method of claim 5, wherein the swarm intelligence comprises a plurality of nodes, each node having at least one blockchain database and at least one smart contract.\n7. The method of claim 6, wherein the plurality of nodes are in communication with each other so to securely share information.\n8. The method of claim 7, wherein the plurality of nodes act as at least a processor, a storage, a router, or a relay whether or not in communication with the client environment.\n9. The method of claim 1, further comprising: validating, within a swarm intelligence, the at least one input data from the client environment;\ngenerating, by the transaction engine, a second unique identifier;\nrecording the second unique identifier into the blockchain database as a new transaction;\nanalyzing, by the rule engine, the second unique identifier from the blockchain database; and\nprocessing, by the action engine, the recorded second unique identifier from the rule engine, wherein the rule engine decides on direction and flow of an analysis such that a notification or alert is triggered to other nodes and other agents outside of the client environment.\n10. The method of claim 9, further comprising: creating, by a client agent, at least one new rule; validating, by the rule engine, the at least one new rule; and recording the at least one new rule in the blockchain database, wherein each new rule must adhere to the predetermined set of rules.\n11. The method of claim 10, wherein the swarm intelligence comprises a plurality of nodes, each node having at least one blockchain database and at least one smart contract.\n12. The method of claim 11, wherein the plurality of nodes are in communication with each other so to securely share information.\n13. The method of claim 12, further comprising: organizing and integrating, by the curator engine, the at least one input data so to be transferred to a swarm application program interface;\nperforming, by the swarm intelligence, machine learning on the at least the one input data;\ncommunicating, by the swarm application program interface the machine learned at least one input data; and\nrecording the machine learned at least one input data in the blockchain database.\n14. The method of claim 13, further comprising: transferring, from a web, the at least one input data into a data aggregator; transferring, by the data aggregator, to the curator engine, processing, by the curator engine, the at least one input data so to transfer the data to the swarm intelligence.\n15. The method of claim 14, wherein the web is a deep web or a dark web.\n16. The method of claim 15, wherein the swarm intelligence is configured to scan the deep web or the dark web to gather information to predict an attack while simultaneously scanning for stolen information or gather intelligence on a plurality of zero day vulnerabilities.\n17. The method of claim 16, wherein an open source and a third party source require a connector to transfer data to the data aggregator.\n18. The method of claim 13, wherein the machine learning is unsupervised or supervised."
}