{
    "patent_id": "US-11259800-B2",
    "title": "Retraction mechanism with clutch-less drive for use with surgical apparatus ",
    "assignee": "Covidien Lp",
    "publication_date": "2022-03-01",
    "patent_link": "https://patents.google.com/patent/US11259800B2/en",
    "inventors": [
        "Stanislaw Marczyk",
        "Joseph Bender-Zanoni"
    ],
    "classifications": [
        "A61B17/068",
        "A61B17/07207",
        "A61B2017/00398",
        "A61B2017/2923",
        "A61B2017/2943"
    ],
    "abstract": "A retraction mechanism allows the full distal retraction of the firing drive from various positions. The retraction mechanism has been developed for use with a hand held surgical apparatus. An embodiment of the retraction mechanism includes a drive member, a first pulley, a second pulley, and a firing drive. The drive mechanism is configured to be driven by a motor. The first pulley is configured to rotate when the motor drives the drive mechanism. The second pulley is movable relative to the first pulley between a proximal position and a distal position. The firing drive is movable relative to the first pulley between proximal and distal positions. In operation, the first pulley rotates in a first direction in response to a distal translation of the firing drive and wherein the firing drive moves proximally upon rotation of the first pulley in a second direction.",
    "claims": "\n1. A retraction mechanism for use with a surgical apparatus, comprising:\na shaft defining a longitudinal axis;\na worm disposed in mechanical cooperation with the shaft and configured to rotate about the longitudinal axis;\na worm gear operatively associated with the worm, the worm gear configured to rotate about a worm gear axis in response to rotation of the worm about the longitudinal axis, wherein rotation of the worm gear about the worm gear axis causes a firing drive of the surgical apparatus to move longitudinally;\na pulley operatively connected to the worm gear; and\na flexible member interconnecting the pulley and the firing drive of the surgical apparatus.\n2. The retraction mechanism according to claim 1, wherein the shaft is configured to rotate about the longitudinal axis.\n3. The retraction mechanism according to claim 2, wherein the worm is configured to rotate about the longitudinal axis concomitantly with the shaft.\n4. The retraction mechanism according to claim 1, wherein the worm is configured to move longitudinally relative to the shaft.\n5. The retraction mechanism according to claim 1, wherein rotation of the worm gear in a first direction about the worm gear axis moves the firing drive proximally.\n6. The retraction mechanism according to claim 1, wherein the worm and the shaft are coaxial.\n7. The retraction mechanism according to claim 1, wherein at least a portion of the worm radially surrounds the shaft.\n8. The retraction mechanism according to claim 1, wherein the worm includes a thread formed thereabout.\n9. The retraction mechanism according to claim 1, further including a spring motor operatively connected to the flexible member, wherein the spring motor is configured to maintain the flexible member in tension.\n10. The retraction mechanism according to claim 1, further including a post rotatably connected to the worm gear, wherein the post is configured to rotate in a first direction when the worm gear rotates in the first direction.\n11. The retraction mechanism according to claim 1, wherein the worm is configured to move along the first shaft upon rotation of the first shaft.\n12. The retraction mechanism according to claim 1, wherein the shaft includes a plurality of keys, the plurality of keys configured to engage the worm to rotatably fix the worm relative to the shaft.\n13. The retraction mechanism according to claim 1, further including a frame supporting at least a portion of the shaft.\n14. The retraction mechanism according to claim 1, further including a motor configured to lock rotation of the shaft when the motor is in an off position."
}