{
    "patent_id": "US-11373743-B2",
    "title": "System and method for providing patient-specific dosing as a function of mathematical models updated to account for an observed patient response ",
    "assignee": "Diane R. MOULD",
    "publication_date": "2022-06-28",
    "patent_link": "https://patents.google.com/patent/US11373743B2/en",
    "inventors": [
        "Diane R. MOULD"
    ],
    "classifications": [
        "G01N33/48",
        "G16H20/10",
        "G06N7/005",
        "G06N7/01",
        "G16H50/50"
    ],
    "abstract": "A system and method for predicting, proposing and/or evaluating suitable medication dosing regimens for a specific individual as a function of individual-specific characteristics and observed responses of the specific individual. Mathematical models of observed patient responses are used in determining an initial dose. The system and method use the patient's observed response to the initial dose to refine the model for use to forecast expected responses to proposed dosing regimens more accurately for a specific patient. More specifically, the system and method uses Bayesian averaging, Bayesian updating and Bayesian forecasting techniques to develop patient-specific dosing regimens as a function of not only generic mathematical models and patient-specific characteristics accounted for in the models as covariate patient factors, but also observed patient-specific responses that are not accounted for within the models themselves, and that reflect variability that distinguishes the specific patient from the typical patient reflected by the model.",
    "claims": "\n1. A method for treating a patient with a personalized therapeutic dosing regimen, the method comprising:\naccessing a processor coupled to a memory;\nreceiving by the processor a first model stored in the memory, the first model being configured to indicate responses of patients in a population to a therapeutic administered to such patients based on a time course of exposure of the therapeutic in blood of the patients in the population;\nreceiving by the processor first data indicative of an exposure of the therapeutic in the patient's blood after receiving a dose of the therapeutic, the exposure of the therapeutic being determined from a blood sample taken from the patient;\nreceiving by the processor second data indicative of one or more characteristics specific to the patient, wherein the one or more characteristics are shared by patients in the population of the first model; the processor having third data indicative of a target exposure threshold of the therapeutic in the patient's blood;\npreparing a patient-specific model by performing, using the processor, a Bayesian update to the first model based on the first data and the second data, the patient-specific model providing a predicted time course of exposure profile of the therapeutic in the patient's blood that accounts for the patient's response to the first dose of the therapeutic;\nproviding one or more proposed dosing regimens to achieve the target exposure of the therapeutic in the patient's blood, the one or more proposed dosing regimens based on the patient-specific model and the second data, wherein the memory further comprises a database coupled to the processor, and further comprising storing information indicative of the one or more proposed dosing regimens in the database;\nselecting, from among the one or more proposed dosing regimens, a patient-specific dosing regimen for the therapeutic; and\nadministering the therapeutic to the patient according to the selected patient-specific dosing regimen.\n2. The method of claim 1, wherein the time course of exposure of the therapeutic in the patient's blood is a concentration of the therapeutic in the patient's blood.\n3. The method of claim 1, wherein parameters of the patient-specific model are stored in the memory.\n4. The method of claim 3, wherein the one or more characteristics specific to the patient comprise at least one of: a body size indicator, gender, race, lab results, disease stage, disease status, prior therapy, concomitantly administered therapeutics, concomitant diseases, and demographic information.\n5. The method of claim 4, further comprising outputting a subset of the one or more proposed dosing regimens as updated dosing regimens.\n6. The method of claim 4, wherein the therapeutic is administered to the patient on a first day, and the method further comprising receiving by the processor fourth data indicative of concentration of the therapeutic in the patient's blood in samples taken from the patient after the administration of the therapeutic.\n7. The method of claim 6, wherein at least one sample providing the fourth data is taken from the patient's blood on the first day.\n8. The method of claim 6, further comprising receiving an input signal indicative of the target exposure threshold of the therapeutic in the blood of the patient; and periodically updating the patient-specific model stored in the memory based on exposure of the therapeutic in one or more additional patient blood samples, until the target exposure threshold of the therapeutic in the blood of the patient is achieved.\n9. The method of claim 8, comprising determining a revised dose based on whether the fourth data is above a predicted exposure level of the therapeutic in the blood of the patient.\n10. The method of claim 8, comprising adjusting the dosing regimen after updating the patient-specific model by one or more of increasing dose and shortening dose interval.\n11. The method of claim 8, comprising adjusting the dosing regimen after updating the patient-specific model by one or more of decreasing dose and lengthening dose interval.\n12. The method of claim 11, wherein the first model and the patient-specific model include a PK model.\n13. The method of claim 12, wherein the first model is a composite model prepared from a plurality of mathematical models derived from data obtained from the patients in the population.\n14. The method of claim 13, further comprising preparing the composite model using Bayesian model averaging.\n15. The method of claim 14, further comprising performing the Bayesian update on each of the plurality of mathematical models.\n16. The method of claim 15, wherein performing the Bayesian analysis further comprises performing Bayesian forecasting to forecast a typical patient's response for each of the one or more proposed dosing regimens based on the patient-specific model and the second data.\n17. The method of claim 8, comprising calculating an updated patient-specific dosing regimen of the therapeutic by selecting a dosing regimen corresponding to a minimum of an objective function.\n18. The method claim 8, wherein the one or more proposed dosing regimens comprises a therapeutic-dosing interval of less than 4 weeks.\n19. The method claim 8, wherein the one or more proposed dosing regimens comprises a therapeutic-dosing interval of 8 weeks.\n20. The method of claim 19, wherein the therapeutic administered to the patient is infliximab, and wherein the first dose of infliximab is determined by a Bayesian composite model.\n21. The method of claim 20, wherein the first dose of infliximab is 5-7 mg/kg and has a therapeutic-dosing interval of 8 weeks."
}