{
    "patent_id": "US-11571212-B2",
    "title": "Surgical stapling system including an impedance sensor ",
    "assignee": "Cilag Gmbh International",
    "publication_date": "2023-02-07",
    "patent_link": "https://patents.google.com/patent/US11571212B2/en",
    "inventors": [
        "David C. Yates",
        "Frederick E. Shelton, IV"
    ],
    "classifications": [
        "A61B17/07207",
        "A61B18/1482",
        "A61B18/18",
        "A61B34/71",
        "A61B17/064",
        "A61B17/068",
        "A61B17/072",
        "A61B17/105",
        "A61B18/1445",
        "A61B2017/00022",
        "A61B2017/00115",
        "A61B2017/00203",
        "A61B2017/00398",
        "A61B2017/00734",
        "A61B2017/07214",
        "A61B2017/07242",
        "A61B2017/0725",
        "A61B2017/07271",
        "A61B2017/07278",
        "A61B2017/2927",
        "A61B2090/0811",
        "A61B34/70",
        "A61B90/98"
    ],
    "abstract": "A surgical stapling system comprising an end effector, a firing member, a motor, and a control system is disclosed. The end effector comprises an elongate channel, a staple cartridge, and an anvil. The staple cartridge comprises staples removably stored therein. The elongate channel and the anvil are configurable in a closed configuration to capture tissue therebetween. The anvil comprises an impedance sensor configured to sense an impedance of the tissue. The firing member is moveable between a starting position and an ending position. The staples are deployable from the staple cartridge based on the firing member moving toward the ending position. The motor is configured to drive the firing member toward the ending position. The control system comprises a multiplexer configured to control the impedance sensor. The control system is configured to interrogate the impedance sensor to determine the impedance and control the motor based on the determined impedance.",
    "claims": "\n1. A surgical stapling system, comprising:\nan end effector, comprising:\nan elongate channel;\na staple cartridge removably positioned in said elongate channel, wherein said staple cartridge comprises a plurality of staples removably stored therein;\nan anvil movable relative to the elongate channel from an open position toward a closed position to capture tissue therebetween;\nan RF sensor configured to sense an impedance of the tissue;\na firing member moveable between an unfired position and a fired position, wherein said staples are deployable from said staple cartridge based on said firing member moving toward said fired position;\na motor configured to drive said firing member toward said fired position; and\na control system in communication with said RF sensor, wherein said control system is configured to:\ninterrogate said RF sensor to determine said impedance; and\ncontrol said motor based on said determined impedance.\n2. The surgical stapling system of claim 1, wherein said control system is configured to control said motor by controlling a speed at which said motor drives said firing member.\n3. The surgical stapling system of claim 1, wherein said control system is configured to control said motor by controlling a power output of said motor.\n4. The surgical stapling system of claim 1, wherein said anvil comprises said RF sensor.\n5. The surgical stapling system of claim 1, wherein said end effector comprises an RF sensor array comprising said RF sensor.\n6. The surgical stapling system of claim 5, wherein said RF sensor array comprises a first sensor segment comprising said RF sensor and a second sensor segment positioned distal to said first sensor segment, and wherein a multiplexer is configured to selectively energize said first sensor segment and said second sensor segment.\n7. The surgical stapling system of claim 1, wherein said control system further comprises an RF energy source operably coupled to said RF sensor.\n8. A surgical fastening system, comprising:\nan end effector, comprising:\nan elongate channel;\na fastener cartridge removably positioned in said elongate channel, wherein said fastener cartridge comprises a plurality of fasteners removably stored therein;\nan anvil movable relative to the elongate channel from an open position toward a clamped position to capture tissue therebetween;\nan RF sensor array configured to sense an impedance of the tissue;\na firing member moveable between a proximal position and a distal position, wherein said fasteners are deployable from said fastener cartridge based on said firing member moving toward said distal position;\na motorized system configured to drive said firing member toward said distal position; and\na control system comprising a multiplexer configured to control the RF sensor array, wherein said control system is configured to:\nreceive a signal from said RF sensor array indicative of said impedance of said tissue; and\ncontrol said motorized system based on said signal.\n9. The surgical fastening system of claim 8, wherein said control system is configured to control said motorized system by controlling a speed at which said motorized system drives said firing member.\n10. The surgical fastening system of claim 8, wherein said control system is configured to control said motorized system by controlling a power output of said motorized system.\n11. The surgical fastening system of claim 8, wherein said anvil comprises said RF sensor array.\n12. The surgical fastening system of claim 11, wherein said RF sensor array comprises a first sensor segment and a second sensor segment positioned distal to said first sensor segment, and wherein said multiplexer is configured to selectively energize said first sensor segment and said second sensor segment.\n13. The surgical fastening system of claim 12, wherein said anvil comprises a knife channel, and wherein said first sensor segment comprises a first sensor positioned on a first side of the knife channel and a second sensor positioned on a second side of the knife channel.\n14. The surgical fastening system of claim 8, wherein said control system further comprises an RF energy source operably coupled to said RF sensor array.\n15. A surgical stapling system, comprising:\nan end effector, comprising:\nan elongate channel;\na staple cartridge removably positioned in said elongate channel, wherein said staple cartridge comprises a plurality of staples removably stored therein; and\nan anvil, wherein said elongate channel and said anvil are configurable in a closed configuration to capture tissue therebetween, wherein said anvil comprises an impedance sensor configured to sense an impedance of the tissue;\na firing member moveable between a starting position and an ending position, wherein said staples are deployable from said staple cartridge based on said firing member moving toward said ending position;\na motor configured to drive said firing member toward said ending position; and\na control system comprising a multiplexer configured to control the impedance sensor, wherein said control system is configured to:\ninterrogate said impedance sensor to determine said impedance; and\ncontrol said motor based on said determined impedance.\n16. The surgical stapling system of claim 15, wherein said control system is configured to control said motor by controlling a speed at which said motor drives said firing member.\n17. The surgical stapling system of claim 15, wherein said control system is configured to control said motor by controlling a power output of said motor.\n18. The surgical stapling system of claim 15, wherein said end effector comprises an impedance sensor array comprising said impedance sensor.\n19. The surgical stapling system of claim 18, wherein said impedance sensor array comprises a first sensor segment comprising said impedance sensor and a second sensor segment positioned distal to said first sensor segment, and wherein said multiplexer is configured to selectively energize said first sensor segment and said second sensor segment.\n20. The surgical stapling system of claim 15, wherein said control system further comprises an RF energy source operably coupled to said impedance sensor."
}