{
    "patent_id": "US-11335200-B2",
    "title": "Method and system for providing artificial intelligence analytic (AIA) services using operator fingerprints and cloud data ",
    "assignee": "Xevo Inc.",
    "publication_date": "2022-05-17",
    "patent_link": "https://patents.google.com/patent/US11335200B2/en",
    "inventors": [
        "Richard Chia Tsing Tong",
        "Robert Victor Welland",
        "John Hayes Ludwig",
        "John Palmer Cordell",
        "Samuel James McKelvie"
    ],
    "classifications": [
        "G06N20/00",
        "B60R16/0231",
        "G06F18/25",
        "G06K9/00791",
        "G06K9/00845",
        "G06K9/6288",
        "G06N5/022",
        "G06N7/005",
        "G06N7/01",
        "G06Q10/20",
        "G06Q30/014",
        "G06V10/80",
        "G06V20/56",
        "G06V20/597",
        "G07C5/006",
        "G07C5/008",
        "G07C5/0808",
        "G07C5/0841",
        "G07C5/10",
        "G08G1/143",
        "G08G1/168",
        "H04L12/40",
        "H04N7/181",
        "B60Y2400/3015",
        "G06K9/00812",
        "G06N5/04",
        "G06Q40/08",
        "G06V20/586",
        "H04L2012/40215"
    ],
    "abstract": "One embodiment of the present invention discloses a process of providing a report predicting potential risks relating to an operator driving a vehicle using information obtained from various interior and exterior sensors, vehicle onboard computer (“VOC”), and cloud network. After activating interior and exterior sensors mounted on a vehicle operated by a driver for obtaining data relating to external surroundings and internal environment, the data is forwarded to VOC for generating a current fingerprint associated with the driver. The current fingerprint represents current driving status in accordance with the collected real-time data. Upon uploading the current fingerprint to the cloud via a communications network, a historical fingerprint which represents historical driving information associated with the driver is retrieved. In one aspect, the process is capable of generating a driving analysis report which predicts potential risks associated with the driver according to the current and historical fingerprints.",
    "claims": "\n1. A method, comprising:\nactivating an interior sensor on a vehicle operated by an elderly driver to obtain first data relating to an internal environment within the vehicle;\nactivating an exterior sensor on the vehicle to obtain second data relating to external surroundings outside the vehicle;\ngenerating a current driver fingerprint for the elderly driver representing a current driving status based on an analysis of the first and second data;\nretrieving a historical driver fingerprint for the elderly driver representing historical-driving-related information for the elderly driver;\ncomparing the current driver fingerprint with the historical driver fingerprint and data describing aggregated driving skills of a group of elderly drivers to identify a rate of degradation of driving ability associated with the elderly driver; and\ngenerating a driving analysis report predicting potential risks associated with the elderly driver in response to the rate of degradation.\n2. The method of claim 1, further comprising:\nuploading the current fingerprint to a remote computer via a communications network.\n3. The method of claim 1, further comprising:\ngenerating a prediction indicting potential future risk associated with the elderly driver in response to the rate of degradation.\n4. The method of claim 1, further comprising:\nforwarding the driving analysis report to an insurance subscriber for analyzing potential risks.\n5. The method of claim 1, further comprising:\nforwarding the driving analysis report to authority for analyzing elderly driving ability relating to public safety.\n6. The method of claim 1, further comprising:\nupdating the historical fingerprint in response to the current fingerprint.\n7. The method of claim 1, wherein activating the interior and exterior sensors to generate the first and second data includes:\ndetermining a response time of the elderly driver based on current road conditions and vehicle information.\n8. A computing device, comprising:\na memory that stores computer instructions; and\na processor that executes the computer instructions to:\nactivate an interior sensor on a vehicle operated by an elderly driver to obtain first data relating to an internal environment within the vehicle;\nactivate an exterior sensor on the vehicle to obtain second data relating to external surroundings outside the vehicle;\ngenerate a current driver fingerprint for the elderly driver representing a current driving status based on an analysis of the first and second data;\nretrieve a historical driver fingerprint for the elderly driver representing historical-driving-related information for the elderly driver;\ncompare the current driver fingerprint with the historical driver fingerprint and data describing aggregated driving skills of a group of elderly drivers to identify a rate of degradation of driving ability associated with the elderly driver; and\ngenerate a driving analysis report predicting potential risks associated with the elderly driver in response to the rate of degradation.\n9. The computing device of claim 8, wherein the processor executes further computer instructions to:\nupload the current fingerprint to a remote computer via a communications network.\n10. The computing device of claim 8, wherein the processor executes further computer instructions to:\ngenerate a prediction indicting potential future risk associated with the elderly driver in response to the rate of degradation.\n11. The computing device of claim 8, wherein the processor executes further computer instructions to:\nforward the driving analysis report to an insurance subscriber for analyzing potential risks.\n12. The computing device of claim 8, wherein the processor executes further computer instructions to:\nforward the driving analysis report to authority for analyzing elderly driving ability relating to public safety.\n13. The computing device of claim 8, wherein the processor executes further computer instructions to:\nupdate the historical fingerprint in response to the current fingerprint.\n14. The computing device of claim 8, wherein activation of the interior and exterior sensors to generate the first and second data includes:\ndetermine a response time of the elderly driver based on current road conditions and vehicle information.\n15. A system, comprising:\nan interior camera on a vehicle operated by an elderly driver to capture first data relating to an internal environment within the vehicle;\nan exterior camera on the vehicle to capture second data relating to external surroundings outside the vehicle;\na memory that stores computer instructions; and\na processor that executes the computer instructions to:\nobtain the first data from the interior camera;\nobtain the second data from the exterior camera;\ngenerate a current driver fingerprint for the elderly driver representing a current driving status based on an analysis of the first and second data;\nretrieve a historical driver fingerprint for the elderly driver representing historical-driving-related information for the elderly driver;\ncompare the current driver fingerprint with the historical driver fingerprint and data describing aggregated driving skills of a group of elderly drivers to identify a rate of degradation of driving ability associated with the elderly driver; and\ngenerate a driving analysis report predicting potential risks associated with the elderly driver in response to the rate of degradation.\n16. The system of claim 15, wherein the processor executes further computer instructions to:\ngenerate a prediction indicting potential future risk associated with the elderly driver in response to the rate of degradation.\n17. The system of claim 15, wherein the processor executes further computer instructions to:\nforward the driving analysis report to an insurance subscriber for analyzing potential risks.\n18. The system of claim 15, wherein the processor executes further computer instructions to:\nforward the driving analysis report to authority for analyzing elderly driving ability relating to public safety.\n19. The system of claim 15, wherein the processor executes further computer instructions to:\nupdate the historical fingerprint in response to the current fingerprint.\n20. The system of claim 15, wherein the processor executes further computer instructions to:\ndetermine current road conditions from the second data;\ndetermine vehicle information from the first data; and\ndetermine a response time of the elderly driver based on the current road conditions and the vehicle information."
}