{
    "patent_id": "US-11522882-B2",
    "title": "Detection of adversary lateral movement in multi-domain IIOT environments ",
    "assignee": "Accenture Global Solutions Limited",
    "publication_date": "2022-12-06",
    "patent_link": "https://patents.google.com/patent/US11522882B2/en",
    "inventors": [
        "Amin Hassanzadeh",
        "Azzedine Benameur",
        "Robin Lynn Burkett",
        "Apoorv Krishak",
        "Chien An Chen",
        "Nahid Farhady Ghalaty"
    ],
    "classifications": [
        "H04L63/1416",
        "G06F21/552",
        "G06F21/556",
        "G06N20/00",
        "G06N7/005",
        "G06N7/01",
        "H04L41/0631",
        "H04L41/147",
        "H04L41/22",
        "H04L63/0227",
        "H04L63/1425",
        "H04L63/1433",
        "H04L67/10"
    ],
    "abstract": "Implementations are directed to methods for detecting and identifying advanced persistent threats (APTs) in networks, including receiving first domain activity data from a first network domain and second domain activity data from a second network domain, including multiple alerts from the respective first and second network domains and where each alert of the multiple alerts results from one or more detected events in the respective first or second network domains. A classification determined for each alert of the multiple alerts with respect to a cyber kill chain. A dependency is then determined for each of one or more pairs of alerts and a graphical visualization of the multiple alerts is generated, where the graphical visualization includes multiple nodes and edges between the nodes, each node corresponding to the cyber kill chain and representing at least one alert, and each edge representing a dependency between alerts.",
    "claims": "\n1. A computer-implemented method for detecting and identifying advanced persistent threats (APTs) in networks, the method being executed by one or more processors and comprising:\nreceiving first domain activity data from a first network domain and second domain activity data from a second network domain, the first domain activity data and the second domain activity data including a plurality of alerts from the respective first and second network domains, each alert of the plurality of alerts resulting from one or more detected events in the respective first or second network domains;\ndetermining, for each alert of the plurality of alerts, a respective classification of the alert with respect to a cyber kill chain;\ndetermining, a dependency for each of one or more pairs of alerts, wherein the dependency of each pair of alerts depends in part on the respective classifications of the alerts in the pair of alerts and wherein each dependency defines a relationship between the pair of alerts, wherein the relationship between the pair of alerts indicates that a classified alert includes at least one of a prerequisite alert and a consequence alert in an attack path, wherein the prerequisite alert is an alert classified as a preceding step that preceded the classified alert, the consequence alert is an alert classified as a subsequent step that follows the classified alert; and\ngenerating, from the plurality of alerts, a graphical visualization of the plurality of alerts, the graphical visualization comprising a plurality of nodes, and edges between nodes, each node corresponding to the cyber kill chain, and representing at least one classified alert, and each edge representing the dependency defining the relationship between the classified alerts.\n2. The method of claim 1, wherein the dependency of the pair of alerts includes a prerequisite dependency or a consequence dependency between the pair of alerts.\n3. The method of claim 1, wherein an alert of the plurality of alerts comprises a plurality of dependencies, each dependency of the plurality of dependencies defining a relationship to a different alert of the plurality of alerts.\n4. The method of claim 1, wherein classifying the alert with respect to the cyber kill chain comprises classifying the alert as indicative of one or more steps of an IT cyber kill chain and/or an ICS cyber kill chain.\n5. The method of claim 4, wherein classifying the alert with respect to the cyber kill chain comprises utilizing an attack path database.\n6. The method of claim 1, wherein generating the graphical visualization of the plurality of alerts further comprises generating an adversary prediction model, wherein for at least one alert of the plurality of alerts a prediction is made of one or more steps that an adversary may take based at least in part on the graphical visualization.\n7. The method of claim 1, wherein determining the dependency for each of one or more pairs of alerts comprises determining that a first timestamp for a first alert of the one or more pairs of alerts and a second timestamp for a second alert of the one or more pairs of alerts are within a time threshold value.\n8. The method of claim 1, wherein determining, for each alert of the plurality of alerts, the classification of the alert with respect to the cyber kill chain comprises:\nreceiving enriched alerts appended with additional information from one or more of local devices and threat intelligence data from a threat knowledge database; and\nclassifying the alert based in part on the additional information.\n9. A system comprising:\none or more processors; and\na computer-readable storage device coupled to the one or more processors and having instructions stored thereon which, when executed by the one or more processors, cause the one or more processors to perform operations for detecting advanced persistent threats (APTs) in networks, the operations comprising:\nreceiving first domain activity data from a first network domain and second domain activity data from a second network domain, the first domain activity data and the second domain activity data including a plurality of alerts from the respective first and second network domains, each alert of the plurality of alerts resulting from one or more detected events in the respective first or second network domains;\ndetermining, for each alert of the plurality of alerts, a respective classification of the alert with respect to a cyber kill chain;\ndetermining, a dependency for each of one or more pairs of alerts, wherein the dependency of each pair of alerts depends in part on the respective classifications of the alerts in the pair of alerts and wherein each dependency defines a relationship between the pair of alerts, wherein the relationship between the pair of alerts indicates that a classified alert includes at least one of a prerequisite alert and a consequence alert in an attack path, wherein the prerequisite alert is an alert classified as a preceding step that preceded the classified alert, the consequence alert is an alert classified as a subsequent step that follows the classified alert; and\ngenerating, from the plurality of alerts, a graphical visualization of the plurality of alerts, the graphical visualization comprising a plurality of nodes, and edges between nodes, each node corresponding to the cyber kill chain, and representing at least one classified alert, and each edge representing the dependency defining the relationship between the classified alerts.\n10. The system of claim 9, wherein the dependency of the pair of alerts includes a prerequisite dependency or a consequence dependency between the pair of alerts.\n11. The system of claim 9, wherein an alert of the plurality of alerts comprises a plurality of dependencies, each dependency of the plurality of dependencies defining a relationship to a different alert of the plurality of alerts.\n12. The system of claim 9, wherein classifying the alert with respect to the cyber kill chain comprises classifying the alert as indicative of one or more steps of an IT cyber kill chain and/or an ICS cyber kill chain.\n13. The system of claim 12, wherein classifying the alert with respect to the cyber kill chain comprises utilizing an attack path database.\n14. The system of claim 9, wherein generating the graphical visualization of the plurality of alerts further comprises generating an adversary prediction model, wherein for at least one alert of the plurality of alerts a prediction is made of one or more steps that an adversary may take based at least in part on the graphical visualization.\n15. The system of claim 9, wherein determining the dependency for each of one or more pairs of alerts comprises determining that a first timestamp for a first alert of the one or more pairs of alerts and a second timestamp for a second alert of the one or more pairs of alerts are within a time threshold value.\n16. The system of claim 9, wherein determining, for each alert of the plurality of alerts, the classification of the alert with respect to the cyber kill chain comprises:\nreceiving enriched alerts appended with additional information from one or more of local devices and threat intelligence data from a threat knowledge database; and\nclassifying the alert based in part on the additional information.\n17. One or more non-transitory computer-readable storage media coupled to one or more processors and having instructions stored thereon which, when executed by the one or more processors, cause the one or more processors to perform operations for detecting advanced persistent threats (APTs) in networks, the operations comprising:\nreceiving first domain activity data from a first network domain and second domain activity data from a second network domain, the first domain activity data and the second domain activity data including a plurality of alerts from the respective first and second network domains, each alert of the plurality of alerts resulting from one or more detected events in the respective first or second network domains;\ndetermining, for each alert of the plurality of alerts, a respective classification of the alert with respect to a cyber kill chain;\ndetermining, a dependency for each of one or more pairs of alerts, wherein the dependency of each pair of alerts depends in part on the respective classifications of the alerts in the pair of alerts and wherein each dependency defines a relationship between the pair of alerts, wherein the relationship between the pair of alerts indicates that a classified alert includes at least one of a prerequisite alert and a consequence alert in an attack path, wherein the prerequisite alert is an alert classified as a preceding step that preceded the classified alert, the consequence alert is an alert classified as a subsequent step that follows the classified alert; and\ngenerating, from the plurality of alerts, a graphical visualization of the plurality of alerts, the graphical visualization comprising a plurality of nodes, and edges between nodes, each node corresponding to the cyber kill chain, and representing at least one classified alert, and each edge representing the dependency defining the relationship between the classified alerts.\n18. The computer-readable storage media of claim 17, wherein the dependency of the pair of alerts includes a prerequisite dependency or a consequence dependency between the pair of alerts.\n19. The computer-readable storage media of claim 17, wherein an alert of the plurality of alerts comprises a plurality of dependencies, each dependency of the plurality of dependencies defining a relationship to a different alert of the plurality of alerts.\n20. The computer-readable storage media of claim 17, wherein classifying the alert with respect to the cyber kill chain comprises classifying the alert as indicative of one or more steps of an IT cyber kill chain and/or an ICS cyber kill chain."
}