{
    "patent_id": "US-11666327-B2",
    "title": "Device and method for controlling compression of tissue ",
    "assignee": "Covidien Lp",
    "publication_date": "2023-06-06",
    "patent_link": "https://patents.google.com/patent/US11666327B2/en",
    "inventors": [
        "Michael P. Whitman",
        "Donald Malinouskas",
        "David Zeichner"
    ],
    "classifications": [
        "A61B17/068",
        "A61B17/1155",
        "A61B17/0686",
        "A61B17/072",
        "A61B17/07207",
        "A61B17/08",
        "A61B17/32093",
        "A61B17/1114",
        "A61B17/115",
        "A61B2017/00017",
        "A61B2017/00022",
        "A61B2017/00119",
        "A61B2017/00123",
        "A61B2017/00398",
        "A61B2017/07214",
        "A61B2017/2927",
        "A61B2017/2943",
        "A61B2090/032",
        "A61B2090/064",
        "A61B2090/0803",
        "A61B34/30",
        "A61B34/76"
    ],
    "abstract": "A method and device for controlling the compression of tissue include clamping tissue between a first clamping member and a second clamping member by driving at least one of the clamping members with an electric motor toward a predetermined tissue gap between the clamping members and, during the clamping, monitoring a parameter of the electric motor indicative of a clamping force exerted to the tissue by the clamping members. The method and device include, during the clamping, controlling the electric motor, based on the monitored parameter, to limit the clamping force to a predetermined maximum limit.",
    "claims": "\n1. A surgical device comprising:\na first clamping member;\na second clamping member;\na motor configured to move at least one of the first clamping member or the second clamping member relative to each other; and\na controller configured to:\nreceive each of a current drive signal, a velocity drive signal and a position drive signal;\nselect a smallest drive signal from the current drive, the velocity drive and the position drive; and\ncontrol the motor based on the selected drive signal.\n2. The surgical device according to claim 1, further comprising:\na plurality of sensors coupled to the motor, the plurality of sensors is configured to sense a plurality of operational properties of the motor.\n3. The surgical device according to the claim 2, wherein the controller is further configured to calculate the current drive, the velocity drive and the position drive based on the plurality of operational properties.\n4. The surgical device according to claim 3, wherein the controller is further configured to calculate the position drive signal based on a difference between a target position and the measured position.\n5. The surgical device according to claim 3, wherein the controller is further configured to calculate the velocity drive signal based on a difference between a target velocity and the measured velocity.\n6. The surgical device according to claim 2, wherein one sensor of the plurality of sensors is a current sensor configured to measure a current being drawn by the motor.\n7. The surgical device according to claim 2, wherein one sensor of the plurality of sensors is a position sensor configured to measure a position of the motor.\n8. The surgical device according to claim 2, wherein one sensor of the plurality of sensors is a velocity sensor configured to measure a velocity of the motor.\n9. The surgical device according to claim 2, wherein the controller is further configured to determine a current offset based on a current drawn by the motor corresponding to a frictional loss during clamping of the first and second clamping members with no tissue disposed therebetween.\n10. The surgical device according to claim 9, wherein the controller is further configured to subtract the current offset from the measured current to determine a calibrated current.\n11. The surgical device according to claim 10, wherein the controller is further configured to calculate the current drive signal based on a difference between a target current and the calibrated current.\n12. The surgical device according to claim 10, wherein the controller is further configured to calculate torque applied by the motor based on the calibrated current.\n13. The surgical device according to claim 12, wherein the controller is further configured to calculate mechanical energy applied to the tissue by the first and second clamping members based on the applied torque."
}