{
    "patent_id": "US-11426245-B2",
    "title": "Surgical guidance system and method with acoustic feedback ",
    "assignee": "Mako Surgical Corp.",
    "publication_date": "2022-08-30",
    "patent_link": "https://patents.google.com/patent/US11426245B2/en",
    "inventors": [
        "Arthur Quaid",
        "Hyosig Kang",
        "Dennis Moses",
        "Rony Abovitz",
        "Scott Illsley"
    ],
    "classifications": [
        "A61B34/30",
        "A61B17/1675",
        "A61B17/1695",
        "A61B17/1703",
        "A61B17/1764",
        "A61B34/10",
        "A61B34/20",
        "A61B34/35",
        "A61B34/37",
        "A61B34/70",
        "A61B34/71",
        "A61B34/74",
        "A61B34/76",
        "A61B90/36",
        "A61B90/361",
        "A61B90/37",
        "A61F2/30942",
        "A61N1/0534",
        "A61N1/3605",
        "A61N1/372",
        "G06F3/016",
        "G16Z99/00",
        "A61B17/1677",
        "A61B17/17",
        "A61B17/1739",
        "A61B17/1767",
        "A61B2017/00115",
        "A61B2017/00119",
        "A61B2017/00725",
        "A61B2034/102",
        "A61B2034/105",
        "A61B2034/107",
        "A61B2034/108",
        "A61B2034/2048",
        "A61B2034/2051",
        "A61B2034/2055",
        "A61B2034/2059",
        "A61B2034/2068",
        "A61B2034/207",
        "A61B2034/252",
        "A61B2034/254",
        "A61B2034/305",
        "A61B2090/08021",
        "A61B2090/365",
        "A61B2090/3937",
        "A61B2090/3983",
        "A61B34/25",
        "A61B5/1127",
        "A61B5/745",
        "A61B90/14",
        "A61F2/38",
        "A61F2002/4632",
        "A61F2002/4633",
        "G05B2219/36432",
        "G05B2219/39196",
        "G05B2219/40478",
        "G05B2219/45117",
        "G05B2219/45171",
        "G16H20/40",
        "G16H40/63"
    ],
    "abstract": "A surgical system includes a surgical tool, a tracking system configured to obtain tracking data indicative of positions of the surgical tool relative to an anatomical feature, an acoustic device, and a computer system programmed to control the acoustic device to provide acoustic feedback to a user based on the tracking data.",
    "claims": "\n1. A surgical system, comprising:\na cutting tool;\na tracking system configured to obtain tracking data indicative of positions of the cutting tool relative to an anatomical feature as the cutting tool cuts into the anatomical feature;\nan acoustic device; and\na computer system programmed to control the acoustic device to provide acoustic feedback to a user indicating a cutting depth of the cutting tool into the anatomical feature based on the tracking data by indicating when the cutting depth is too shallow, too deep, and correct relative to a planned implant depth.\n2. The surgical system of claim 1, wherein the acoustic feedback further comprises an audible indication of a distance between the cutting tool and a virtual object defined relative to the anatomical feature, the virtual object defined based on a planned implant placement.\n3. The surgical system of claim 1, wherein the computer system is programmed to control the acoustic device to further provide further acoustic feedback in response to determining, based on the tracking data, completion of a bone sculpting step of a surgical procedure by the cutting tool;\nwherein the bone sculpting step comprises moving the cutting tool through the anatomical feature in at least two translational degrees of freedom.\n4. The surgical system of claim 3, wherein the acoustic feedback comprises a synthesized voice stating “DONE” to indicate the completion of the bone sculpting step.\n5. The surgical system of claim 1, wherein the computer system is programmed to control the acoustic device to further provide the acoustic feedback in response to determining, based on the tracking data, that the cutting tool is nearing a critical portion of a soft tissue.\n6. The surgical system of claim 1, wherein:\nthe tracking system comprises a marker coupled to the anatomical feature and a camera; and\nthe computer system is further programmed to control the acoustic device to produce sound in response to occlusion of the tracking system caused by the camera losing visibility of the marker.\n7. The surgical system of claim 1, wherein the acoustic feedback comprises a beep.\n8. The surgical system of claim 1, wherein the computer system is further programmed to define a virtual object relative to the anatomical feature in accordance with a surgical plan; and\nwherein the computer system is programmed to control the acoustic device based on the tracking data by comparing the positions of the cutting tool to the virtual object.\n9. The surgical system of claim 8, wherein the tracking data is further indicative of motion of the anatomical feature; and wherein the computer system is programmed to adjust the virtual object based on the motion of the anatomical feature.\n10. The surgical system of claim 1, wherein the acoustic device comprises a speaker."
}