{
    "patent_id": "US-2019034785-A1",
    "title": "System and method for program induction using probabilistic neural programs ",
    "assignee": "The Allen Institute For Artificial Intelligence",
    "publication_date": "2019-01-31",
    "patent_link": "https://patents.google.com/patent/US20190034785A1/en",
    "inventors": [
        "Kenton W. Murray",
        "Jayant Krishnamurthy"
    ],
    "classifications": [
        "G06N3/0454",
        "G06N3/045",
        "G06N3/084",
        "G06F9/30003",
        "G06N20/00",
        "G06N3/047",
        "G06N3/105",
        "G06N5/022",
        "G06N5/04",
        "G06N7/005",
        "G06N99/005",
        "G06N7/01"
    ],
    "abstract": "Embodiments are directed to probabilistic neural programs, a framework for program induction that permits flexible specification of the computational model and inference algorithm, while simultaneously enabling the use of deep neural networks. The approach implemented by one or more embodiments builds on computation graph frameworks for specifying neural networks by adding an operator for weighted nondeterministic choice that is used to specify the computational model. Thus, a program sketch describes both the decisions to be made and the architecture of the neural network used to score these decisions. The computation graph interacts with nondeterminism: the scores produced by the neural network determine the weights of nondeterministic choices, while the choices determine the network's architecture.",
    "claims": "\n1. A method for generating a computation graph describing a computation, the method comprising:\nrepresenting the computation by a set of graph nodes and edges, wherein each graph node is associated with a corresponding value and each edge represents a relationship between a pair of nodes;\nusing an operator to determine a value in the computation graph, wherein the operator performs a nondeterministic operation that is implemented at least in part by a neural network; and\nstoring a representation of the computation graph in an electronic data storage element.\n2. The method of claim 1, wherein the nondeterministic operation is one that selects between two or more options for the computation based on a score associated with each option, and further, wherein the score is determined by the neural network.\n3. The method of claim 2, wherein the operator is a choose function, the choose function operating to determine the value by selecting between the two or more options.\n4. The method of claim 3, wherein the score represents a weight associated with a choice.\n5. The method of claim 4, wherein the score is a value of a computation graph node that has the same number of elements as the two or more options.\n6. The method of claim 1, further comprising:\nproviding an input to the generated computation graph; and\nusing the computation graph to generate an output corresponding to the provided input.\n7. The method of claim 6, wherein the input is a representation of an image.\n8. The method of claim 4, further comprising applying an inference algorithm to the computation graph and using the output of applying the inference algorithm to determine the score associated with an option.\n9. The method of claim 1, further comprising evaluating the operator with a tensor to generate a program sketch object that represents a function from the neural network parameters to a probability distribution over values.\n10. An apparatus for generating a computation graph for a computation, comprising:\na processor programmed to execute a set of instructions;\na data storage element in which the set of instructions are stored, wherein when executed by the processor the set of instructions cause the apparatus to\nrepresent the computation by a set of graph nodes and edges, wherein each graph node is associated with a corresponding value and each edge represents a relationship between a pair of nodes;\nuse an operator to determine a value in the computation graph, wherein the operator performs a nondeterministic operation that is implemented at least in part by a neural network; and\nstore a representation of the computation graph in an electronic data storage element.\n11. The apparatus of claim 10, wherein the nondeterministic operation is one that selects between two or more options for the computation based on a score associated with each option, and further, wherein the score is determined by the neural network.\n12. The apparatus of claim 11, wherein the added operator is a choose function, the choose function operating to determine the value by selecting between the two or more options.\n13. The apparatus of claim 12, wherein the score represents a weight associated with a choice.\n14. The apparatus of claim 12, wherein the score is a value of a computation graph node that has the same number of elements as the two or more options.\n15. The apparatus of claim 10, further comprising instructions that cause the apparatus to:\nreceive an input to the generated computation graph; and\nuse the computation graph to generate an output corresponding to the input.\n16. The apparatus of claim 15, wherein the input is a representation of an image.\n17. The apparatus of claim 13, further comprising instructions that cause the apparatus to apply an inference algorithm to the computation graph and use the output of applying the inference algorithm to determine the score associated with an option.\n18. The apparatus of claim 10, further comprising instructions that cause the apparatus to evaluate the operator with a tensor to generate a program sketch object that represents a function from the neural network parameters to a probability distribution over values."
}