{
    "patent_id": "US-2022076165-A1",
    "title": "Systems and methods for automating data science machine learning analytical workflows ",
    "assignee": "U2 Science Labs, Inc.",
    "publication_date": "2022-03-10",
    "patent_link": "https://patents.google.com/patent/US20220076165A1/en",
    "inventors": [
        "Andrew M. Minkin",
        "Mark McNally",
        "William Knight",
        "Stephane Major",
        "Richard Lamoreaux",
        "Leandro Hernandez"
    ],
    "classifications": [
        "G06N20/00",
        "G06N5/022",
        "G06Q10/06"
    ],
    "abstract": "Systems and methods for automating data science machine learning using analytical workflows are disclosed that provide for user interaction and iterative analysis including automated suggestions based on at least one analysis of a dataset.",
    "claims": "\n1. A system for automating data science, comprising:\ninstructions stored in non-transitory computer readable media, that when executed by a processor of the system cause the system to perform:\nsteps for machine learning via a computer network using analytical workflows on a dataset that can adapt to user inputs and automatically suggest possibilities for further analysis,\nwherein the steps are iterative.\n2. The system for automating data science of claim 1, further comprising:\nat least one step for a third-party user query for input.\n3. The system for automating data science of claim 1, further comprising:\nat least one step for querying and analyzing data from a related dataset.\n4. The system for automating data science of claim 1, further comprising:\nat least one step for displaying analysis to a user at a user interface and suggesting a refinement based on a first analysis output.\n5. The system for automating data science of claim 1, further comprising:\nat least one step for generating analytic context from statistical aggregations and observations of the data, analytic context of semantic representations and implicit models of simple machine learning outputs in order to create a consistent mapping to an Analytic Domain feature space.\n5. The system for automating data science of claim 1, further comprising:\nat least one step for analyzing the Analytic Domain mappings generated in several iterations of permutations of different analytic workflows to generate machine learning models that can be applied to suggest optimal data science tasks a to a user's current actions.\n6. The system for automating data science of claim 1, further comprising:\nat least one step for reviewing the Analytic Domain mappings' state, resolving a subset of applicable task and workflows and suggesting changes based on finding applicable data science tasks using the machine learning models derived for Analytic Domain analysis.\n7. The system for automating data science of claim 1, further comprising:\nat least one step for analyzing the interactions generated by Auto-curious and developing metaperception machine learning models that combine Analytic Domain properties for workflow analytics and visual analytics that recognize insights from user interactions\n8. The system for automating data science of claim 1, further comprising:\nat least one step for applying the Analytic Domain suggestion models generated by Auto-curious integrating the APIs of external analytic engines and driving remote execution of machine learning tasks via an external application of an analytic event orchestrator"
}