{
    "patent_id": "US-2021234767-A1",
    "title": "Vehicle middleware ",
    "assignee": "Autoconnect Holdings Llc",
    "publication_date": "2021-07-29",
    "patent_link": "https://patents.google.com/patent/US20210234767A1/en",
    "inventors": [
        "Christopher P. Ricci",
        "Douglas W. Swartz"
    ],
    "classifications": [
        "H04L41/14",
        "G08C19/00",
        "B60K35/00",
        "B60K37/00",
        "B60K37/02",
        "B60K37/06",
        "B60R16/037",
        "B60R21/01512",
        "B60R7/04",
        "B60W30/182",
        "B60W40/04",
        "B60W40/08",
        "B60W40/09",
        "B60W50/0098",
        "B60W50/08",
        "G01C21/20",
        "G01S19/13",
        "G02B27/0101",
        "G06F11/2023",
        "G06F11/3013",
        "G06F11/3065",
        "G06F11/328",
        "G06F13/14",
        "G06F13/364",
        "G06F16/24",
        "G06F16/29",
        "G06F17/00",
        "G06F21/10",
        "G06F21/121",
        "G06F21/32",
        "G06F21/335",
        "G06F21/42",
        "G06F21/629",
        "G06F3/017",
        "G06F3/0481",
        "G06F3/04817",
        "G06F3/0482",
        "G06F3/0484",
        "G06F3/04842",
        "G06F3/04847",
        "G06F3/0486",
        "G06F3/0488",
        "G06F3/04883",
        "G06F8/61",
        "G06F9/44505",
        "G06F9/54",
        "G06K9/00355",
        "G06K9/00362",
        "G06K9/00832",
        "G06N5/02",
        "G06Q30/0265",
        "G06Q40/08",
        "G06Q50/26",
        "G06T19/006",
        "G06V20/59",
        "G06V40/10",
        "G06V40/28",
        "G07C5/006",
        "G07C5/008",
        "G07C5/02",
        "G07C5/08",
        "G07C5/0808",
        "G07C5/0825",
        "G07C5/0833",
        "G07C5/085",
        "G07C5/0866",
        "G08G1/0112",
        "G08G1/0116",
        "G08G1/012",
        "G08G1/0129",
        "G08G1/0133",
        "G08G1/0137",
        "G08G1/0141",
        "G08G1/017",
        "G08G1/09",
        "G08G1/096716",
        "G08G1/096725",
        "G08G1/096775",
        "G08G1/096783",
        "G08G1/096791",
        "G08G1/096827",
        "G08G1/096844",
        "G08G1/143",
        "G08G1/16",
        "H04L51/36",
        "H04L51/56",
        "H04L63/10",
        "H04L67/02",
        "H04L67/12",
        "H04L67/125",
        "H04N21/41422",
        "H04N21/4331",
        "H04N21/482",
        "H04W4/40",
        "H04W4/48",
        "H04W4/50",
        "H04W4/80",
        "H04W4/90",
        "H04W8/22",
        "H04W84/005",
        "B60K2370/11",
        "B60K2370/1438",
        "B60K2370/146",
        "B60K2370/1464",
        "B60K2370/1472",
        "B60K2370/1476",
        "B60K2370/164",
        "B60K2370/166",
        "B60K2370/21",
        "B60K2370/566",
        "B60K2370/5894",
        "B60K2370/5899",
        "B60K2370/691",
        "B60K2370/81",
        "B60W2040/0872",
        "B60W2040/0881",
        "B60W2050/0095",
        "B60W2540/043",
        "B60W2540/22",
        "B60W2540/221",
        "B60W2540/26",
        "B60W2555/60",
        "G06F21/1062",
        "G06F2203/04808",
        "G06N5/048",
        "G06V40/15",
        "H04W84/12"
    ],
    "abstract": "The present disclosure describes a vehicle implementing one or more processing modules. These modules are configured to connect and interface with the various buses in the vehicle, where the various buses are connected with the various components of the vehicle to facilitate information transfer among the vehicle components. Each processing module is further modularized with the ability to add and replace other functional modules now or in the future. These functional modules can themselves act as distinct vehicle components. Each processing modules may hand-off processing to other modules depending on its health, processing load, or by third-party control. Thus, the plurality of processing modules helps to implement a middleware point of control to the vehicle with redundancy in processing and safety and security awareness in their applications.",
    "claims": "\n1-20. (canceled)\n21. A method for remotely controlling a vehicle, comprising:\ngenerating, at a mobile device, a graphical user interface (GUI);\nreceiving, at the mobile device, a user request for controlling a vehicle configuration of the vehicle;\nreceiving, using a biometric sensor of the mobile device, biometric information of the user;\nauthenticating, using at least one of the mobile device or a server and based at least in part on the received biometric information, a user accessing the mobile device, wherein the server remotely communicates with the mobile device and the vehicle;\nbased on the user being authenticated, determining, using the mobile device and the server, that the user is privileged to make the user request;\nbased on the determination, generating, at the server, a remote control command that represents the user request;\ntransmitting, to the vehicle, the remote control command;\ncontrolling, at the vehicle, a vehicle configuration based on the remote control command;\ncollecting, at the vehicle, vehicle state data;\ntransmitting, from the vehicle to the server, the vehicle state data and an identifier of the vehicle;\nstoring, at the server, the vehicle state data and the identifier of the vehicle;\ntransmitting, from the server to the mobile device, the vehicle state data; and\ndisplaying, using the GUI at the mobile device, the vehicle state data.\n22. The method of claim 21, wherein authenticating comprises:\ntransmitting, to the server, the biometric information of the user; and\nreceiving, from the server, confirmation that the user is authenticated based on the biometric information of the user.\n23. The method of claim 21, wherein the user is authenticated based on at least one of encrypted symmetric or asymmetric key exchange, public and private key cryptography, a secure remote password, multi-factor authentication, or biometric data of the user.\n24. The method of claim 21, further comprising:\ndetermining the user request is from a first user; and\ndetermining whether the first user is entitled to a first set of privileges with respect to access to vehicle configurations.\n25. The method of claim 24, further comprising:\ndetermining the user request is from a second user being different from the first user; and\ndetermining whether the second user is entitled to a first set of privileges with respect to access to vehicle configurations, the second set being different from the first set of privileges.\n26. The method of claim 21, wherein the vehicle configuration includes at least one of on-board input/output system display appearance and movement, on-board input/output system content, on-board input/output system icon configuration, on-board cached media selection, alteration of vehicle performance parameters, or vehicle status.\n27. The method of claim 21, wherein the vehicle configuration includes at least one of alteration of vehicle speed, engine shutdown, remote start, vehicle tracking, and door locks.\n28. The method of claim 21, wherein the vehicle state data include at least one of vehicle diagnostics, maintenance alerts, vehicle or part recall notifications, predictive analytics of vehicle status, vehicle location, vehicle lock status, and vehicle shutdown status.\n29. The method of claim 21, wherein the vehicle state data include diagnostics of one or more components of the vehicle.\n30. A remote vehicle control system comprising:\na vehicle configured to receive a remote control command and control a vehicle configuration based on the remote control command; and\na remote control system that communicates with the vehicle over a cellular network and is configured to:\ngenerate a graphical user interface (GUI);\nreceive a user request for controlling a vehicle configuration of the vehicle;\nreceive biometric information of the user;\nauthenticate, based at least in part on the received biometric information, a user accessing the mobile device;\nbased on the user being authenticated, determine that the user is privileged to make the user request;\nbased on the determination, generate a remote control command that represents the user request;\ntransmit, to the vehicle, the remote control command;\nwherein the vehicle is further configured to:\nreceive the remote control command from the remote control system;\ncontrol a vehicle configuration based on the remote control command;\ncollect vehicle state data; and\ntransmit, to the remote control system, the vehicle state data and an identifier of the vehicle,\nwherein the remote control system is further configured to:\nstore the vehicle state data and the identifier of the vehicle; and\ndisplay the vehicle state data to the user.\n31. The system of claim 30, wherein the remote control system includes a server and a mobile device that communicates with the server.\n32. The system of claim 30, wherein the user is authenticated based on at least one of encrypted symmetric or asymmetric key exchange, public and private key cryptography, a secure remote password, multi-factor authentication, or biometric data of the user.\n33. The system of claim 21, wherein the remote control system is further configured to:\ndetermine the user request is from a first user; and\ndetermine whether the first user is entitled to a first set of privileges with respect to access to vehicle configurations.\n34. The system of claim 33, wherein the remote control system is further configured to:\ndetermine the user request is from a second user being different from the first user; and\ndetermine whether the second user is entitled to a first set of privileges with respect to access to vehicle configurations, the second set being different from the first set of privileges.\n35. The system of claim 30, wherein the vehicle configuration includes at least one of on-board input/output system display appearance and movement, on-board input/output system content, on-board input/output system icon configuration, on-board cached media selection, alteration of vehicle performance parameters, or vehicle status.\n36. The system of claim 30, wherein the vehicle configuration includes at least one of alteration of vehicle speed, engine shutdown, remote start, vehicle tracking, and door locks.\n37. The system of claim 30, wherein the vehicle state data include at least one of vehicle diagnostics, maintenance alerts, vehicle or part recall notifications, predictive analytics of vehicle status, vehicle location, vehicle lock status, and vehicle shutdown status.\n38. The system of claim 30, wherein the vehicle state data include diagnostics of one or more components of the vehicle.\n39. A remote vehicle control system comprising:\na vehicle including a remote control module configured to receive a remote control command and control a vehicle configuration based on the remote control command;\na mobile device outputting a graphical user interface (GUI) that includes user selectable features and displays information, the mobile device including a biometric sensor; and\na server configured to communicate with the vehicle and the mobile device;\nwherein the mobile device is configured to:\nreceive, via the GUI, a user request for controlling a vehicle configuration of the vehicle;\nreceive, using the biometric sensor of the mobile device, biometric information of the user;\nauthenticate, based in part on the received biometric information of the user, a user accessing the mobile device;\ndetermine that the user is privileged to make the user request;\ntransmit, to the server, the user request and an identifier of the vehicle;\nreceive, from the server, vehicle state data; and\ndisplay, via the GUI, the vehicle state data,\nwherein the server is configured to:\nreceive, from the mobile device, the user request and the identifier of the vehicle;\ngenerate a remote control command based on the user request and the identifier of the vehicle;\ntransmit, to the vehicle, the remote control command;\nreceive, from the vehicle, vehicle state data;\nstore the vehicle state data; and\ntransmit, to the mobile device, the vehicle state data;\nwherein the vehicle is configured to:\nreceive, from the server, the remote control command;\ncontrol the vehicle configuration based on the remote control command;\ncollect vehicle state data; and\ntransmit, to the server, the vehicle state data and the identifier of the vehicle.\n40. The system of claim 39, wherein the mobile device is further configured to:\ntransmitting, to the server, the biometric information of the user; and\nreceiving, from the server, confirmation that the user is authenticated based on the biometric information of the user."
}