{
    "patent_id": "US-2021217484-A1",
    "title": "Variational autoencoder for biological sequence generation ",
    "assignee": "Modernatx, Inc.",
    "publication_date": "2021-07-15",
    "patent_link": "https://patents.google.com/patent/US20210217484A1/en",
    "inventors": [
        "Andrew GIESSEL",
        "Athanasios Dousis",
        "Iain McFadyen"
    ],
    "classifications": [
        "G16B5/20",
        "G16B20/50",
        "G06F17/18",
        "G06N3/08",
        "G06N3/126",
        "G06N7/01",
        "G16B20/20",
        "G16B40/00"
    ],
    "abstract": "Techniques for manufacturing a variant of a target protein. The techniques may include accessing a latent variable statistical model (LVSM) configured to generate output indicating one or more biological sequences corresponding to one or more variants of the target protein and using the LVSM to generate a first output indicating a first biological sequence associated with a first variant of the target protein. The techniques further include manufacturing, using the first biological sequence, a first biological molecule to produce the first variant of the target protein.",
    "claims": "\n1. A method of manufacturing a variant of a target protein, comprising:\naccessing a latent variable statistical model (LVSM) configured to generate output indicating one or more biological sequences corresponding to one or more variants of the target protein;\nusing the LVSM to generate a first output indicating a first biological sequence associated with a first variant of the target protein; and\nmanufacturing, using the first biological sequence, a first biological molecule to produce the first variant of the target protein.\n2. The method of claim 1, wherein the first variant of the target protein has at least the same activity as the target protein.\n3. The method of claim 1, wherein the first variant of the target protein has enhanced activity in comparison to the target protein.\n4. The method of claim 1, wherein the target protein is a human protein, and manufacturing the first biological molecule further comprises synthesizing the first biological molecule for administration to a human subject.\n5. The method of claim 4, further comprising:\nadministering a treatment comprising the first biological molecule to the human subject.\n6. The method of claim 4, wherein the LVSM was trained using biological sequences including a human biological sequence corresponding to the human protein.\n7. The method of claim 6, wherein the biological sequences further include biological sequences corresponding to the target protein occurring in organisms other than a human.\n8. The method of claim 7, wherein the biological sequences correspond to proteins having substantially similar functions in different species.\n9. The method of claim 7, wherein training the LVSM comprises aligning the biological sequences and using the aligned biological sequences to train the LVSM.\n10. The method of claim 1, wherein the first variant has at least 30 residues having a different amino acid than the target protein.\n11. The method of claim 1, wherein the first variant has at least 5 residues having a different amino acid than the target protein.\n12. The method of claim 1, wherein the first variant has at least 95% sequence similarity with the target protein for at least one conserved region.\n13. The method of claim 1, wherein a surface site of the first variant has a different amino acid than the target protein.\n14. The method of claim 1, wherein a core site of the first variant has a different amino acid than the target protein.\n15. The method of claim 1, wherein a boundary site of the first variant has a different amino acid than the target protein.\n16. The method of claim 1, wherein the first biological molecule includes a nucleotide sequence that encodes for the first variant.\n17. The method of claim 16, wherein the first biological molecule is a messenger ribonucleic acid (mRNA).\n18. The method of claim 16, wherein the first biological molecule is a deoxyribonucleic acid (DNA).\n19. The method of claim 1, wherein manufacturing the first biological molecule further comprises using the first biological molecule to synthesize the first variant of the target protein.\n20. The method of claim 1, wherein the first biological molecule is the first variant of the target protein.\n21. The method of claim 1, wherein using the LVSM further comprises:\nidentifying parameters of a distribution over a latent space of the LVSM corresponding to an input biological sequence obtained at least in part by sequencing a biological sample of a human;\nidentifying, using the parameters, a point in the latent space of the LVSM; and\nidentifying, using the point and the LVSM, the first biological sequence associated with the first variant of the target protein.\n22. The method of claim 1, wherein the first output generated from the LVSM indicates a plurality of biological sequences associated with a respective plurality of variants of the target protein including the first variant, and the method further comprises:\ndetermining a characteristic for each of the plurality of variants; and\nselecting, from among the plurality of biological sequences, the first biological sequence based on the characteristic.\n23. The method of claim 22, wherein the protein characteristic is selected from the group consisting of protein expression level, protein half-life, protein subcellular localization, protein tissue specificity, protein immunogenicity, and protein cofactor-dependence specificity.\n24. The method of claim 1, wherein the LVSM includes a multi-layer neural network.\n25. The method of claim 1, wherein the LVSM includes a neural network having one or more convolutional layers.\n26. The method of claim 1, wherein the LVSM includes a variational autoencoder.\n27. A method of determining a variant of a target protein, comprising:\nidentifying, for a latent variable statistical model (LVSM) configured to generate output indicating one or more biological sequences corresponding to one or more variants of the target protein, parameters of a distribution over a latent space of the LVSM corresponding to an input biological sequence obtained at least in part by sequencing a biological sample of a human;\nidentifying, using the parameters, a point in the latent space of the LVSM; and\nidentifying, using the point and the LVSM, a first output biological sequence associated with a first variant of the target protein.\n28. A system comprising:\nat least one hardware processor; and\nat least one non-transitory computer-readable storage medium storing processor- executable instructions that, when executed by the at least one hardware processor, cause the at least one hardware processor to perform:\nidentifying, for a latent variable statistical model (LVSM) configured to generate output indicating one or more biological sequences corresponding to one or more variants of the target protein, parameters of a distribution over a latent space of the LVSM corresponding to an input biological sequence obtained at least in part by sequencing a biological sample of a human;\nidentifying, using the parameters, a point in the latent space of the LVSM; and\nidentifying, using the point and the LVSM, a first output biological sequence associated with a first variant of the target protein.\n29. At least one non-transitory computer-readable storage medium storing processor- executable instructions that, when executed by at least one hardware processor, cause the at least one hardware processor to perform a method comprising:\nidentifying, for a latent variable statistical model (LVSM) configured to generate output indicating one or more biological sequences corresponding to one or more variants of the target protein, parameters of a distribution over a latent space of the LVSM corresponding to an input biological sequence obtained at least in part by sequencing a biological sample of a human;\nidentifying, using the parameters, a point in the latent space of the LVSM; and\nidentifying, using the point and the LVSM, a first output biological sequence associated with a first variant of the target protein."
}