{
    "patent_id": "US-2020065728-A1",
    "title": "Facilitation of cognitive conflict resolution between parties ",
    "assignee": "International Business Machines Corporation",
    "publication_date": "2020-02-27",
    "patent_link": "https://patents.google.com/patent/US20200065728A1/en",
    "inventors": [
        "John D. Wilson",
        "Shikhar KWATRA",
        "Paul Krystek",
        "Sarbajit K. Rakshit"
    ],
    "classifications": [
        "G06Q10/0637",
        "G06F15/18",
        "G06K9/00335",
        "G06N20/00",
        "G06N20/10",
        "G06N5/01",
        "G06N5/025",
        "G06Q50/182",
        "G06V40/20",
        "G06N20/20",
        "G06N3/084",
        "G06N3/088",
        "G06N3/126",
        "G06N5/041",
        "G06N5/048",
        "G06N7/01",
        "G06Q50/188"
    ],
    "abstract": "Embodiments for facilitating cognitive conflict resolution between parties by a processor. An appropriateness of communications, behavior, actions or events associated with one or more users may be cognitively interpreted according to a plurality of identified contextual factors during a conflict resolution. One or more corrective actions may be suggested to mitigate a possible negative impact of the communications, behavior, actions or events upon the one or more users if the interpreted appropriateness is less than a predetermined threshold.",
    "claims": "\n1. A method for facilitating cognitive conflict resolution between parties by a processor, comprising:\ncognitively interpreting an appropriateness of communications, behavior, actions or events associated with one or more users according to a plurality of identified contextual factors during a conflict resolution; and\nsuggesting one or more corrective actions to mitigate a possible negative impact of the communications, behavior, actions or events upon the one or more users if the interpreted appropriateness is less than a predetermined threshold.\n2. The method of claim 1, wherein cognitively interpreting the appropriateness of the communications based on the plurality of identified contextual factors further includes interpreting legal, ethical, moral, behavior, emotion, hazards, hostility, or courteous ones of the contextual factors in view of the communications, behavior, actions or events.\n3. The method of claim 1, further including analyzing related and similar communications, behaviors, actions or events to determine if an identified contextual factor in the related and similar communications, behaviors, actions or events is similar to one of the identified contextual factors in the communications, behaviors, actions or events.\n4. The method of claim 1, further including implementing a series of corrective actions to de-escalate the possible negative impact of the communications, behavior, actions or events upon the one or more users based on the identified contextual factors.\n5. The method of claim 1, further including monitoring the communications, behavior, actions or events of the one or more users using one or more internet of things (IoT) computing devices.\n6. The method of claim 1, further including identifying an increase in hostility, a negative emotional response, or combination thereof of the one or more users in response to the communications, behavior, actions or events.\n7. The method of claim 5, further including initializing a machine learning mechanism to:\ncollect feedback data from the one or more users;\nlearn the one or more corrective actions; and\nlearn the one or more corrective actions having a greatest amount of effectiveness in minimizing the possible negative impact of the communications, behavior, actions or events upon the one or more users.\n8. A system for facilitating cognitive conflict resolution between parties, comprising:\none or more computers with executable instructions that when executed cause the system to:\ncognitively interpret an appropriateness of communications, behavior, actions or events associated with one or more users according to a plurality of identified contextual factors during a conflict resolution; and\nsuggest one or more corrective actions to mitigate a possible negative impact of the communications, behavior, actions or events upon the one or more users if the interpreted appropriateness is less than a predetermined threshold.\n9. The system of claim 8, wherein the executable instructions, pursuant to cognitively interpreting the appropriateness of the communications, behavior, actions or events based on the plurality of identified contextual factors further interpret legal, ethical, moral, behavior, emotion, hazards, hostility, or courteous ones of the contextual factors in view of the communications, behavior, actions or events.\n10. The system of claim 8, wherein the executable instructions further analyze related and similar communications, behaviors, actions or events to determine if an identified contextual factor in the related and similar communications, behaviors, actions or events is similar to one of the identified contextual factors in the communications, behaviors, actions or events.\n11. The system of claim 8, wherein the executable instructions further implement a series of the corrective actions to de-escalate the possible negative impact of the communications, behavior, actions or events upon the one or more users based on the identified contextual factors.\n12. The system of claim 8, wherein the executable instructions further monitor the communications, behavior, actions or events of the one or more users using one or more internet of things (IoT) computing devices.\n13. The system of claim 8, wherein the executable instructions further identify an increase in hostility, a negative emotional response, or combination thereof of the one or more users in response to the communications, behavior, actions or events.\n14. The system of claim 8, wherein the executable instructions further initialize a machine learning mechanism to:\ncollect feedback data from the one or more users;\nlearn the one or more corrective actions; and\nlearn the one or more corrective actions having a greatest amount of effectiveness in minimizing the possible negative impact of the communications, behavior, actions or events upon the one or more users.\n15. A computer program product for, by a processor, reusing application solutions for an application the computer program product comprising a non-transitory computer-readable storage medium having computer-readable program code portions stored therein, the computer-readable program code portions comprising:\nan executable portion that cognitively interprets an appropriateness of communications, behavior, actions or events associated with one or more users according to a plurality of identified contextual factors during a conflict resolution; and\nan executable portion that suggests one or more corrective actions to mitigate a possible negative impact of the communications, behavior, actions or events upon the one or more users if the interpreted appropriateness is less than a predetermined threshold.\n16. The computer program product of claim 15, further including an executable portion that, pursuant to cognitively interpreting the appropriateness of the communications, behavior, actions or events based on the plurality of identified contextual factors, further interprets legal, ethical, moral, behavior, emotion, hazards, hostility, or courteous ones of the contextual factors in view of the communications, behavior, actions or events.\n17. The computer program product of claim 15, further including an executable portion that analyzes related and similar communications, behaviors, actions or events to determine if an identified contextual factor in the related and similar communications, behaviors, actions or events is similar to one of the identified contextual factors in the communications, behaviors, actions or events.\n18. The computer program product of claim 15, further including an executable portion that implements a series of corrective actions to de-escalate the possible negative impact of the communications, behavior, actions or events upon the one or more users based on the identified contextual factors.\n19. The computer program product of claim 15, further including an executable portion that:\nmonitors the communications, behavior, actions or events of the one or more users using one or more internet of things (IoT) computing devices; and\nidentifies an increase in hostility, a negative emotional response, or combination thereof of the one or more users in response to the communications, behavior, actions or events.\n20. The computer program product of claim 15, further including an executable portion that initializes a machine learning mechanism to:\ncollect feedback data from the one or more users;\nlearn the one or more corrective actions; and\nlearn the one or more corrective actions having a greatest amount of effectiveness in minimizing the possible negative impact of the communications, behavior, actions or events upon the one or more users."
}