{
    "patent_id": "US-2018191867-A1",
    "title": "Systems, methods, and devices for an enterprise ai and internet-of-things platform ",
    "assignee": "C3 loT, Inc.",
    "publication_date": "2018-07-05",
    "patent_link": "https://patents.google.com/patent/US20180191867A1/en",
    "inventors": [
        "Thomas M. Siebel",
        "Edward Y. Abbo",
        "Houman Behzadi",
        "John Coker",
        "Scott Kurinskas",
        "Thomas Rothwein",
        "David Tchankotadze"
    ],
    "classifications": [
        "G06F8/10",
        "G06F16/254",
        "H04L67/34",
        "G06F16/25",
        "G06F16/283",
        "G06F16/288",
        "G06F8/24",
        "G06F8/35",
        "G06F8/77",
        "G06F9/54",
        "G06N20/00",
        "G06N20/20",
        "G06N5/01",
        "G06Q10/06",
        "H04L67/02",
        "H04L67/10",
        "H04L67/12",
        "H04L67/322",
        "H04L67/42",
        "H04L67/53",
        "H04L67/566",
        "H04L67/60",
        "H04L67/61",
        "H04L69/16",
        "H04L69/40",
        "H04L67/565",
        "H04L67/5651",
        "Y02P90/80",
        "Y02P90/84",
        "Y04S40/18"
    ],
    "abstract": "Systems, methods, and devices for a cyberphysical (IoT) software application development platform based upon a model driven architecture and derivative IoT SaaS applications are disclosed herein. The system may include concentrators to receive and forward time-series data from sensors or smart devices. The system may include message decoders to receive messages comprising the time-series data and storing the messages on message queues. The system may include a persistence component to store the time-series data in a key-value store and store the relational data in a relational database. The system may include a data services component to implement a type layer over data stores. The system may also include a processing component to access and process data in the data stores via the type layer, the processing component comprising a batch processing component and an iterative processing component.",
    "claims": "\n1. A method comprising:\nobtaining and aggregating data from a plurality of different sources comprising smart devices, sensors, enterprise systems, extraprise and/or Internet sources, wherein the data is persisted in a plurality of data stores and comprises structured data, time-series data, unstructured data, and relational data; and\nimplementing abstraction and continuous processing of the aggregated data using a model driven architecture comprising a type system, thereby simplifying or unifying access or processing of the aggregated data using programmatic interfaces, rules, and/or machine learning algorithms to make inferences or draw conclusions to inform end users and/or machine-to-machine actions.\n2. The method of claim 1, wherein the method is implemented on a platform as a service (PaaS) that is used in conjunction with one or more remote cloud-based virtual computing and storage platforms.\n3. The method of claim 1, wherein the method is implemented on a platform as a service (PaaS) that is used in conjunction with one or more on-premise computing and storage platforms.\n4. The method of claim 1, wherein the method is implemented on a platform as a service (PaaS) that is used in conjunction with one or more hybrid cloud platforms comprising integrated on-premise resources and cloud resources.\n5. The method of claim 2, 3, or 4, wherein the PaaS is configured to enable the end users to design, develop, deploy and/or operate one or more classes of applications comprising of big data applications, wherein said classes of applications comprise (1) distributed computing applications and (2) non-distributed computing applications.\n6. The method of claim 5, wherein the one or more classes of applications further comprises descriptive, predictive and/or prescriptive analytics applications.\n7. The method of claim 6, wherein the one or more classes of applications further comprises Internet-of-Things applications.\n8. The method of claim 1, wherein the unstructured data comprises text, audio data, image data and/or video.\n9. The method of claim 1, wherein the data further comprises geospatial and/or temporal data.\n10. The method of claim 1, wherein the type system comprises conceptual domain models of various attributes and processes related to different entities or domains.\n11. The method of claim 10, wherein the various attributes and processes comprise persistence, data representations, data interrelationships, computing processes, and/or the machine learning algorithms.\n12. The method of claim 10, wherein the data, associated metadata, processes, and their interrelationships are represented as a plurality of types in the type system.\n13. The method of claim 12, wherein a type selected from the plurality of types may comprise aggregations of two or more types, while ensuring automatic and guaranteed referential integrity of the underlying two or more types.\n14. The method of claim 13, wherein the plurality of types and/or collections of types are automatically exposed and accessible through RESTful interfaces.\n15. The method of claim 1, wherein the type system comprises a plurality of defined types comprising of (1) objects/entities, fields and functions; (2) mix ins; (3) value types; (4) primitive types, (5) collection types; (6) reference types; (7) lambdas, and/or (8) machine learning algorithms.\n16. The method of claim 15, wherein the mix ins comprise multiple types that are mixed in.\n17. The method of claim 16, wherein the mix ins are parametric and have unbound variables that are defined by the types that mixed in.\n18. The method of claim 17, wherein different types are configured to bind the variables in different ways.\n19. The method of claim 1, wherein the data is persisted differently to the plurality of data stores depending on the data type and underlying data storage technologies, and the type system provides type-relational and data stores mapping based on a plurality of types for use in a variety of applications.\n20. The method of claim 1, wherein the type system is configured to abstract: (1) underlying storage details comprising of database type, database language, or storage format from applications or other services, and (2) processing technology comprising of data transposition, queues, stream processing, batch processing, data encryption, authorization, and/or authentication.\n21. The method of claim 1, wherein the plurality of data stores comprises (1) a key value store, (2) a distributed file system, (3) graph stores, (4) a relational database, and/or (5) a multi-dimensional data store.\n22. The method of claim 21, comprising: (1) persisting the time-series data in the key value store, (2) persisting the unstructured data in the distributed file system, and (3) persisting the relational data in the relational database.\n23. The method of claim 21, wherein the plurality of types form a type layer that provides a common abstraction layer at or above the plurality of data stores comprising the key value store, distributed file system, graph stores, relational database, and multi-dimensional data store, thereby permitting abstraction of details of the underlying data stores and/or data store access methods.\n24. The method of claim 23, wherein the abstraction permits changes to be dynamically made to the type system in a seamless manner without requiring the end users to be made aware of, or to consider updates that are being made to the applications, the underlying technologies, programming languages, or associated business logic.\n25. The method of claim 24, wherein improvements or upgrades to one or more of the machine learning algorithms are made substantially instantaneously available to one or more types or applications that utilize said machine learning algorithms, without requiring changes to be made to the one or more types or business logic for those applications.\n26. The method of claim 1, wherein the type system includes a collection of types that are grouped based on related types of functionality, and wherein the collection of types comprises definitions for types, platform services, data, data shapes, application logic functions, validation constraints, machine learning algorithms, optimizations, and/or user interface (UI) layouts.\n27. The method of claim 1, wherein the data is transformed to a unified federated data image using the type system, and the machine learning algorithms are configured to analyze the persisted and/or stream data in the unified federated data image.\n28. The method of claim 1, wherein data representing an accuracy of the inferences is further obtained and aggregated to inform the machine learning algorithms.\n29. The method of claim 1, wherein the machine learning algorithms are configured to make the inferences, draw the conclusions, and/or learn directly from massive sets of the data on a large scale as the data is being aggregated, abstracted and processed.\n30. The method of claim 29, wherein subsets of the data need not be extracted for analysis by the machine learning algorithms.\n31. The method of claim 1, wherein the model driven architecture comprising the type system provides: (1) abstract representations of knowledge and activities governing different application domains; (2) an abstraction layer that is available and common to the end users comprising of programmers, data scientists, and/or business analysts; and (3) enables types to be aggregated and published subject to access controls.\n32. The method of claim 1, wherein the method further comprises:\nautomatically adding storage nodes and processing nodes to a storage cluster to accommodate and process incoming data; and\nautomatically rebalancing and partitioning the incoming data into the time-series data, unstructured and relational data across the storage cluster as the nodes are being added.\n33. The method of claim 1, wherein the plurality of different sources utilize different underlying technologies or programming languages, and the type system is configured to provide an interface across the different underlying technologies and programming languages.\n34. The method of claim 1, wherein a complexity of a machine learning and/or Internet-of-Things application is reduced by orders of magnitude when the data is abstracted and processed using the model driven architecture, as compared to processing of the data using a structured programming architecture.\n35. The method of claim 1, wherein the model driven architecture is configured to enforce validation of data or type structure using annotations or keywords.\n36. The method of claim 1, wherein the type system is logically separated into four or more distinct layers comprising an entity layer, an application (business logic and optimization) layer, a machine learning inference layer, and a user interface (UI) layer.\n37. The method of claim 36, wherein (1) the entity layer includes definitions for base data types associated with devices, entities, and/or customers, (2) the application layer includes definitions for application logic functions, (3) the machine learning inference layer includes one or more machine learning algorithms, and (4) the UI layer defines default view definitions for how specific types of data, types, or results of application logic functions are displayed.\n38. The method of claim 37, wherein the type system is configured to merge the definitions for the different layers at runtime, and generate composite types that include metadata from all four layers of the type system.\n39. The method of claim 1, wherein a type defined by the type system includes one or more defined methods or functions with a standards-based interface (API) for said type.\n40. The method of claim 39, comprising:\n(1) explicitly calling the one or more defined methods or functions within business logic; and/or\n(2) automatically triggering the one or more defined methods or functions based on requests or functions made by business logic or time or data completeness-based triggers via the type system.\n41. The method of claim 1, wherein the abstraction is implemented via an abstraction layer, and the type system is configured to (1) abstract details above the abstraction layer and (2) abstract details between a plurality of types.\n42. The method of claim 41, wherein the plurality of types comprises type definitions indicating one or more properties, relationships, and functions relative to the plurality of data stores and processing technologies.\n43. The method of claim 41, wherein the plurality of types comprises canonical types that include (1) a canonical type definition that defines an interface used for integration of the data, and (2) one or more transformation types that are used to transform a selected canonical type to a corresponding type selected from said plurality of types.\n44. The method of claim 1, wherein the time-series data comprises data from one or more of a smart meter, a smart appliance, a smart device, a monitoring system, a telemetry device, or a sensor.\n45. The method of claim 1, wherein the relational data comprises data from one or more of a customer system, an enterprise system, an operational system, a website, or web accessible application program interface (API).\n46. The method of claim 1, wherein the method is capable of being used in one or more of the following classes of applications: market segmentation and targeting, customer relationship management (CRM), customer churn, predictive maintenance, sensor network health, fraud detection, connected home/building analytics, enterprise energy management, health care analytics, inventory optimization, supply network risk management, production optimization, vehicle fleet analytics, digital oil field, smart grid analytics and operations, fraud detection, traffic flow optimization, and/or telecommunication services and analytics.\n47. The method of claim 1, wherein the data is obtained, aggregated, and processed from the plurality of different sources substantially in real-time.\n48. The method of claim 1, wherein the continuous processing of the data comprises batch processing, stream processing, iterative processing, and/or continuous analytic processing of the data.\n49. The method of claim 1, wherein the data from the plurality of different sources is integrated based on a canonical data model into a common format and/or into one or more of the data stores.\n50. The method of claim 49, wherein the canonical data model is application agnostic in nature, and enables different applications to communicate with each other in the common format.\n51. The method of claim 50, wherein a change in internal format of a selected application only requires a corresponding change in transformation logic between the selected application and the canonical data model, without affecting all other applications and their associated transformation logic.\n52. The method of claim 1, wherein flexible input and output connectors are provided for batch and stream processing and data storage.\n53. A system comprising:\nan integration component for obtaining and aggregating data from a plurality of different sources comprising smart devices, sensors, enterprise systems, extraprise and/or Internet sources, wherein the data is persisted into a plurality of data stores and comprises structured data, time-series data, unstructured data, and relational data; and\na data services component for implementing abstraction and continuous processing of the aggregated data using a model driven architecture comprising a type system, thereby simplifying or unifying access or processing of the aggregated data using programmatic interfaces, rules, and/or machine learning algorithms to make inferences or draw conclusions to inform end users and/or machine-to-machine actions.\n54. A non-transitory computer readable medium storing instructions that, when executed by one or more servers and/or devices, causes the one or more servers and/or devices to perform a method, the method comprising:\nobtaining and aggregating data from a plurality of different sources comprising smart devices, sensors, enterprise systems, extraprise and/or Internet sources, wherein the data is persisted into a plurality of data stores and comprises structured data, time-series data, unstructured data, and relational data; and\nimplementing abstraction and continuous processing of the aggregated data using a model driven architecture comprising a type system, thereby simplifying or unifying access or processing of the aggregated data using programmatic interfaces, rules, and/or machine learning algorithms to make inferences or draw conclusions to inform end users and/or machine-to-machine actions."
}