{
    "patent_id": "US-2019156222-A1",
    "title": "Artificial intelligence platform with improved conversational ability and personality development ",
    "assignee": "Maria Emma, Gregory Alexander D'Amico",
    "publication_date": "2019-05-23",
    "patent_link": "https://patents.google.com/patent/US20190156222A1/en",
    "inventors": [
        "Maria Emma",
        "Gregory Alexander D'Amico"
    ],
    "classifications": [
        "G06N5/022",
        "G06F16/22",
        "G06F16/3329",
        "G06F17/30312",
        "G06N20/00",
        "G06N3/006",
        "G06N5/041",
        "G10L15/08",
        "G10L15/22",
        "G10L13/00",
        "G10L15/16",
        "G10L17/18",
        "G10L2015/088",
        "G10L25/63"
    ],
    "abstract": "System, methods, and apparatuses for an artificial intelligence (AI) toy with improved conversational dialogue and personality development. The AI toy determines responses to stimuli based on user profiles and personality profiles that are developed through user interaction and external media inputs. Natural Language Processing (NLP) and other semantic interaction processing is paired with the profiles to develop AI personality and conversational ability.",
    "claims": "\n1. An artificial intelligence (AI) system for improved conversation and artificial personality development comprising:\na handheld toy, wherein the handheld toy includes at least one processor, at least one memory with at least one database, at least one motion sensor, at least one camera, at least one speaker, and at least one microphone;\na virtual assistant (VA) service hosted on at least one server, wherein the VA service includes at least one VA processor and at least one VA memory with at least one VA database;\nwherein the at least one speaker and the at least one microphone are embedded in the handheld toy;\nwherein the handheld toy is in network communication with the VA service;\nwherein the handheld toy is operable to detect and record a stimulus and transmit the stimulus to the VA service via a network;\nwherein the stimulus includes a movement of the handheld toy, a sound, an image, or a video;\nwherein the VA service is operable to determine if the stimulus is a predefined movement, a speech input, a predefined face, or a gesture;\nwherein the VA service is operable to extract user personality features from gestures, tones, keywords, or phrases of the stimulus and determine a user personality score based on the user personality features;\nwherein the VA service is operable to construct at least one user profile and at least one personality profile and store the at least one user profile and the at least one personality profile in the at least one VA database;\nwherein constructing the at least one user profile includes matching the stimulus to personal data, including the user personality score, personally identifiable information, settings, and preferences;\nwherein constructing the at least one personality profile includes:\nreceiving media inputs including a video, an audio clip, and/or text;\nextracting personality features from gestures, tones, keywords, or phrases of the media inputs; and\ndetermining a personality score based on the personality features of the media inputs;\nwherein the VA service is operable to construct a response based on the personality score and the user personality score and transmit the response to the handheld toy;\nwherein the response is a movement response, a sound response, an image response, or a video response; and\nwherein the handheld toy is operable to demonstrate the response.\n2. The system of claim 1, wherein the VA service is further operable to extract and correlate meanings, emotions, and ideas to the keywords of the media inputs.\n3. The system of claim 1, wherein the response is constructed with a response personality score that is equal to the personality score based on the personality features of the media inputs.\n4. The system of claim 1, wherein the at least one user profile is operable to include a content module;\nwherein the content module includes at least one goal and at least one lesson plan;\nwherein the VA service is operable to construct the response based on the at least one goal and the at least one lesson plan; and\nwherein the VA service is operable to update the at least one goal or the at least one lesson plan based on a second stimulus.\n5. The system of claim 1, wherein the handheld toy is in network communication with a mobile device and a mobile application on the at least one device, wherein the mobile application is operable to receive a profile input and transmit the profile input to the handheld toy.\n6. The system of claim 5, wherein the handheld toy is operable to transmit the profile input to the VA service, and wherein the VA service is operable to construct or identify a corresponding user profile based on the profile input and construct the response based on the corresponding user profile.\n7. The system of claim 1, wherein the VA system is operable to process the stimulus and the media inputs with natural language processing (NLP).\n8. A method for using artificial intelligence (AI) for conversational interaction and artificial personality development comprising:\nproviding a handheld toy, wherein the handheld toy includes at least one processor, at least one memory with at least one database, at least one motion sensor, at least one camera, at least one speaker, and at least one microphone;\nproviding a virtual assistant (VA) service hosted on at least one server, wherein the VA service includes at least one VA processor and at least one VA memory with at least one VA database;\nwherein the at least one speaker and the at least one microphone are embedded in the handheld toy;\nwherein the handheld toy is in network communication with the VA service;\nthe handheld toy receiving a stimulus, recording the stimulus, and transmitting the stimulus to the VA service via a network;\nwherein the stimulus is a movement of the handheld toy, a sound, an image, or a video;\nthe VA service determining if the stimulus is a predefined movement, a speech input, a predefined face, or a gesture;\nthe VA service extracting user personality features from gestures, tones, keywords, or phrases of the stimulus and determining a user personality score based on the user personality features;\nthe VA service constructing at least one user profile and at least one personality profile and storing the at least one user profile and the at least one personality profile in the at least one VA database;\nwherein constructing the at least one user profile includes matching the stimulus to personal data, including the user personality score, personally identifiable information, settings, and preferences;\nwherein constructing the at least one personality profile includes:\nreceiving media inputs including a video, an audio clip, and/or text;\nextracting personality features from gestures, tones, keywords, or phrases of the media inputs; and\ndetermining a personality score based on the personality features of the media inputs;\nthe VA service constructing a response based on the personality score and the user personality score and transmitting the response to the handheld toy;\nwherein the response is a movement response, a sound response, an image response, or a video response; and\nthe handheld toy demonstrating the response.\n9. The method of claim 8, further comprising the VA service extracting and determining meanings, emotions, and ideas from keywords of the media inputs.\n10. The method of claim 8, further comprising constructing the response with a response personality score that is equal to the personality score based on the personality features of the media inputs.\n11. The method of claim 8, further comprising:\nconstructing the at least one user profile to include a content module, wherein the content module includes at least one goal and at least one lesson plan;\nconstructing the response based on the at least one goal and the at least one lesson plan; and\nupdating the at least one goal or the at least one lesson plan based on a second stimulus.\n12. The method of claim 8, further comprising constructing a new personality profile from the at least one user profile, wherein constructing the response is based on the new personality profile.\n13. The method of claim 8, further comprising continuously developing the at least one user profile based on additional stimuli and using machine learning to extract additional personal information from the additional stimuli.\n14. The method of claim 8, further comprising continuously importing the media inputs from an external server and storing the media inputs in the at least one VA memory of the VA service.\n15. An apparatus for using artificial intelligence (AI) for conversational interaction and artificial personality development comprising:\na handheld toy, wherein the handheld toy includes at least one processor, at least one memory with at least one database, at least one motion sensor, at least one camera, at least one speaker, and at least one microphone;\nwherein the at least one speaker and the at least one microphone are embedded in the handheld toy;\nwherein the handheld toy includes a virtual assistant (VA) service stored on the at least one memory;\nwherein the handheld toy is operable to detect and record a stimulus and process the stimulus via the VA service;\nwherein the stimulus is a movement of the handheld toy, a sound, an image, or a video;\nwherein the VA service is operable to determine if the stimulus is a predefined movement, a speech input, a predefined face, or a gesture;\nwherein the VA service is operable to extract user personality features from gestures, tones, keywords, or phrases of the stimulus and determine a user personality score based on the user personality features;\nwherein the VA service is operable to construct at least one user profile and at least one personality profile and store the at least one user profile and the at least one personality profile in the at least one database;\nwherein constructing the at least one user profile includes matching the stimulus to personal data, including the user personality score, personally identifiable information, settings, and preferences;\nwherein constructing the at least one personality profile includes:\nreceiving media inputs including a video, an audio clip, and/or text;\nextracting personality features from gestures, tones, keywords, or phrases of the media inputs; and\ndetermining a personality score based on the personality features of the media inputs;\nwherein the VA service is operable to construct a response based on the personality score and the user personality score;\nwherein the response is a movement response, a sound response, an image response, or a video response; and\nwherein the handheld toy is operable to demonstrate the response.\n16. The apparatus of claim 15, wherein upon detection of the predefined face, the handheld toy is operable to load a corresponding user profile.\n17. The apparatus of claim 15, wherein the response is constructed with a response personality score that is equal to the personality score based on the personality features of the media inputs.\n18. The apparatus of claim 15, wherein the at least one user profile is operable to include a content module;\nwherein the content module includes at least one goal and at least one lesson plan;\nwherein the response is constructed based on the at least one goal and the at least one lesson plan; and\nwherein the VA service is operable to update the at least one goal or the at least one lesson plan based on a second stimulus.\n19. The apparatus of claim 15, wherein the handheld toy is operable to share the at least one user profile or the at least one personality profile by transmitting the at least one user profile or the at least one personality profile to another handheld device.\n20. The apparatus of claim 15, wherein the handheld toy is operable to provide behavior analytics based on stimuli records stored in the at least one memory of the handheld toy."
}