{
    "patent_id": "US-4912648-A",
    "title": "Expert system inference engine ",
    "assignee": "International Business Machines Corporation",
    "publication_date": "1990-03-27",
    "patent_link": "https://patents.google.com/patent/US4912648A/en",
    "inventors": [
        "Irwin Tyler"
    ],
    "classifications": [
        "G06N5/02",
        "G06N5/04"
    ],
    "abstract": "An expert system includes a knowledge base manager which is fact-based, as opposed to rule-based; i.e., a semantic network with tangled hierarchies. The system includes an inference engine which is capable of providing solutions to indeterminate problems with a high degree of confidence. \"Entities\"(e.g., propositions, fact and ideas) are understood in eight different ways depending on the context of entity relationships. Each such relationship may be characterized anywhere along a spectrum from strong to weak. The knowledge base is designed so that entities and relationships are easily modified. The analysis performed may be at any of various levels of detail. The system can accept data as keyed input as well as from independently executed programs. Results developed by the inference engine are presented in various levels of detail in terms of relative degree of agreement or divergence from anticipated conclusions and the inference engine's degree of confidence in the results.",
    "claims": "\n1. A method of inference processing in a fact-based expert system comprising the steps of:\ngenerating a knowledge base by inputting and linking conceptual entities to create a network;\nassigning a qualitative value to relationships between entities;\nprocessing said knowledge base to solve a problem within a domain defined by said network by traversing said network following all linkages forward and backward;\nadjusting and accumulating said qualitative values for each entity processed; and\ngenerating a result and confidence measure thereof based on the assigned relationship values.\n2. A method of inference processing in a fact-based expert system comprising the steps of:\ngenerating a knowledge base by inputting assertions, assigning confidence levels to the assertions, and linking the assertions to create a network;\nprocessing said knowledge base to solve a problem within a domain made up of a network of assertions, wherein any assertion may be simultaneously linked to any number of other assertions in the network located at any level, said processing step including\ntraversing said network following all linkages forward and backward,\nfor each completed supporting assertion, retrieving its stated or inferred influence and confidence while following user directives to ignore specified supporting assertions,\nadjusting stated or inferred influence according to a strength and confidence adjustment algorithm,\napplying an arithmetic sign according to a context direction of the assertion,\naccumulating a confidence level for the assertion according to a confidence adjustment algorithm,\nthen normalizing an inference for completed assertions; and\nposting the results of said processing step with a confidence level.\n3. The method according to claim 2 wherein the step of adjusting is performed with a strength and confidence adjustment algorithm that reflects a hypothesized reaction of the human brain to extremes in intensity of belief.\n4. The method according to claim 3 wherein the algorithm used in the step of adjusting further reflects a hypothesized reaction of the human brain to the simultaneous existence of multiple supporting facts, some of which may conflict with one another, some of which may, in isolation, infer different conclusions, and some of which may be more consequential than others.\n5. The method according to claim 4 wherein the context direction in the applying step is the link between the supported and supporting assertion and the sign is developed as the result of analysis of the context and the current nature of the supporting influence as stated or previously inferred.\n6. The method according to claim 5 wherein there are eight possible contexts."
}