{
    "patent_id": "US-7725416-B2",
    "title": "Method for rule locating, ordering and combining in a polyhierarichical environment ",
    "assignee": "Novell, Inc.",
    "publication_date": "2010-05-25",
    "patent_link": "https://patents.google.com/patent/US7725416B2/en",
    "inventors": [
        "Duane Buss"
    ],
    "classifications": [],
    "abstract": "System and method for rule location, ordering, and combining in a polyhierarchical environment are described. In one embodiment, a polyhierarchical environment contains at least one rule, at least one logical structure representable by a graph and at least two connections between one or more of the logical structures and a rule set evaluator (RSE). The RSE retrieves an assembly definition associated with a particular ordering or combination of rules. Each assembly definition is associated with one or more location chains, and each location chain is associated with one of the connections to a logical structure. For each location chain, a rule location policy is invoked, returning a rule. An assembly policy is invoked upon the returned rules, forming the returned rule into a dataset that conforms to the ordering or combination associated with the assembly definition.",
    "claims": "\n1. A computer-implemented method for rule location, ordering, and combining in a polyhierarchical environment, the polyhierarchical environment comprising at least one rule, at least one logical structure representable by a graph and a plurality of connections between one or more of the logical structures and a rule set evaluator (RSE), the method comprising:\nretrieving from a storage medium connected to the computer an assembly definition associated with the RSE, the assembly definition comprising a set assembly rule including an assembly rule policy, at least one location chain, and an evaluation completeness rule and defining a particular ordering, combination, or transformation of rules;\nretrieving from a storage medium connected to the computer the at least one location chain, wherein the retrieved location chain is associated with a connection to a logical structure;\nfor each retrieved location chain, invoking a rule location policy for the retrieved location chain that returns either the null rule or one or more positive rules; and\ninvoking the assembly policy upon the returned rules to produce a dataset that conforms to at least one ordering, combination, and transformation defined by the assembly definition.\n2. The computer-implemented method as recited in claim 1, wherein the at least one location chain comprises a first location chain and a second location chain, wherein the first and second location chains correspond to first and second hierarchy targets, respectively.\n3. The computer-implemented method as recited in claim 1, wherein the invoking the assembly policy is governed by the evaluation completeness rule.\n4. The computer-implemented method as recited in claim 1, wherein a result of the invoking the assembly policy is a ruleset.\n5. The computer-implemented method as recited in claim 4 further comprising evaluating the ruleset using a rule engine.\n6. The computer-implemented method as recited in claim 4, wherein the ruleset is assembled via one of a late-binding, lazy and partial procedure.\n7. The computer-implemented method as recited in claim 4, wherein the ruleset is evaluated using at least one evaluation method selected from a group consisting of a late-binding method, a lazy method, a partial method, a forward-chaining method, a backward-chaining method, an iterative method, a recursive method, a fuzzy method, a confidence-generating method, an evolutionary method, and a method governed by an evaluation completeness rule.\n8. The computer-implemented method as recited in claim 1 further comprising, responsive to the invoking the assembly policy, performing a rule ordering in accordance with ordering metadata associated with an object selected from the group consisting of the rule, the polyhierarchical environment, and the RSE.\n9. A system for rule location, ordering, and combining in a polyhierarchical environment, the system comprising:\na processor;\nstorage media associated with and accessible by the processor;\nat least one rule hierarchy stored in the storage media and comprising a plurality of computing modules and at least one rule, wherein the rule describes an aspect of a problem domain wherein a plurality of connections are defined between at least one hierarchy and a rule set evaluator module (RSE), the connections providing at least two means whereby the RSE can access one or more rule hierarchies; and\nat least one assembly definition defining a particular ordering, combination, or transformation of rule, the at least one assembly definition comprising:\na set assembly rule comprising an assembly rule policy for assembling the result into a ruleset;\nat least one location chain including instructions whereby the RSE can use a connection to a hierarchy to return a result; and\nan evaluation completeness rule.\n10. The system as recited in claim 9 further comprising a rule engine module for performing logical operations on the ruleset.\n11. The system as recited in claim 9, wherein the RSE comprises one or more assembly definitions.\n12. The system as recited in claim 9, wherein the assembly definition comprises at least first and second policy location chains, wherein the first and second policy location chains correspond to first and second hierarchy targets, respectively.\n13. The system as recited in claim 9, wherein the assembly definition comprises at least one of a set assembly rule, an assembly rule identifier, an assembly rule policy, an assembly rule parameter, a transformation rule, a policy location chain, a location chain identifier, a location rule policy, a traversal point, a retrieval mechanism, a caching parameter, a metadata indicator, a chop specification, an ordering, and an evaluation completeness rule.\n14. A system for rule location, ordering, and combining in a polyhierarchical environment, the system comprising:\na processor;\nstorage media accessible by the processor;\na rule polyhierarchy stored in at least a portion of the storage media, the rule polyhierarchy comprising a plurality of computing modules and at least one rule, wherein the rule describes an aspect of a problem domain;\na rule set evaluator module (RSE), wherein a plurality of connections exist between the polyhierarchy to the RSE, the connections providing at least two means whereby the RSE can access one or more rule hierarchies;\nan assembly definition associated with the RSE, the assembly definition comprising a set assembly rule including an assembly rule policy, at least one location chain, and an evaluation completeness rule, the assembly definition defining a particular ordering, combination, or transformation of rules wherein the at least one location chain comprises means for locating and retrieving one or more rules associated with a particular connection to the polyhierarchy; and\nmeans for assembling the rules from the plurality of connections into a ruleset, the ruleset conforming to the particular ordering or combination defined.\n15. The system as recited in claim 14, wherein the RSE comprises at least a first and a second policy location chain, wherein the first and second location chains correspond to first and second hierarchy targets, respectively.\n16. The system as recited in claim 14 further comprising means for assembling the ruleset in one of a partial, late-binding and lazy fashion.\n17. The system as recited in claim 14 further comprising a rule engine means for performing logical operations on the ruleset.\n18. The system as recited in claim 17 further comprising means for evaluating the ruleset using at least one of a late-binding, lazy, partial, forward-chaining, backward-chaining, iterative, recursive, fuzzy, confidence-generating and evolutionary method."
}