{
    "patent_id": "US-9916538-B2",
    "title": "Method and system for feature detection ",
    "assignee": "Z Advanced Computing, Inc.",
    "publication_date": "2018-03-13",
    "patent_link": "https://patents.google.com/patent/US9916538B2/en",
    "inventors": [
        "Lotfi A. Zadeh",
        "Saied Tadayon",
        "Bijan Tadayon"
    ],
    "classifications": [
        "G06N7/005",
        "A61B5/7221",
        "A61B5/165",
        "A61B5/4803",
        "A61B5/7267",
        "G06F18/2413",
        "G06K9/627",
        "G06N7/01",
        "A61B5/163",
        "G16H50/70"
    ],
    "abstract": "Specification covers new algorithms, methods, and systems for artificial intelligence, soft computing, and deep learning/recognition, e.g., image recognition (e.g., for action, gesture, emotion, expression, biometrics, fingerprint, facial, OCR (text), background, relationship, position, pattern, and object), Big Data analytics, machine learning, training schemes, crowd-sourcing (experts), feature space, clustering, classification, SVM, similarity measures, modified Boltzmann Machines, optimization, search engine, ranking, question-answering system, soft (fuzzy or unsharp) boundaries/impreciseness/ambiguities/fuzziness in language, Natural Language Processing (NLP), Computing-with-Words (CWW), parsing, machine translation, sound and speech recognition, video search and analysis (e.g. tracking), image annotation, geometrical abstraction, image correction, semantic web, context analysis, data reliability, Z-number, Z-Web, Z-factor, rules engine, control system, autonomous vehicle, self-diagnosis and self-repair robots, system diagnosis, medical diagnosis, biomedicine, data mining, event prediction, financial forecasting, economics, risk assessment, e-mail management, database management, indexing and join operation, memory management, data compression, event-centric social network, Image Ad Network.",
    "claims": "\n1. A system for feature detection, said system comprising:\none or more processors;\nmultiple input units;\nwherein a second set of data determines a first subset of said multiple input units to be clamped to a first set of data;\nwherein in clamping a first input unit of said multiple input units, said one or more processors dynamically set a value of said first input unit in a first memory unit associated with said first input unit to a corresponding value from said first set of data;\none or more layers of stochastic units, comprising a first stochastic unit;\nwherein said first stochastic unit has one or more links traceable to a second subset of said multiple input units, wherein a local coverage extent associated with said first stochastic unit limits said one or more links;\nwherein said one or more links represent first weighted connections between said first stochastic unit and second units;\nwherein said second units are among said second subset of said multiple input units or from said one or more layers of stochastic units between said first stochastic unit and said multiple input units;\nwherein said one or more processors set a memory unit associated with said first stochastic unit to a first value generated based on weighted sum of values of memory units associated with said second units per said first weighted connections represented by said one or more links;\nwherein said one or more processors detect sub-features associated with a higher layer of said one or more layers of stochastic units, based on sub-features detected by a lower layer of said one or more layers of stochastic units;\none or more output units;\nwherein said one or more processors set a memory unit associated with said one or more output units to a value indicating a detected feature based on one or more said detected sub-features associated with one or more layers of one or more units of said one or more layers of stochastic units;\nwherein said one or more processors determine an energy measure corresponding to said first set of data, based on factors comprising of said first weighted connections, said one or more layers of stochastic units, and said first set of data clamped to said first subset of said multiple input units;\nwherein in said determining said energy measure, a contribution of said energy measure from said first stochastic unit is reduced by a coverage factor of said first stochastic unit;\nwherein said coverage factor of said first stochastic unit is determined based on a value representing fraction of input units within said second subset of said multiple input units traceable from said first stochastic unit that are also in said first subset of said multiple input units clamped to said first set of data;\nwherein said one or more processors output to a second memory unit a value representing a quality measure associated with said detected feature determined based on said energy measure and a baseline.\n2. The system for feature detection as recited in claim 1, wherein said system is feeding or is fed by an ad network.\n3. The system for feature detection as recited in claim 1, wherein one or more units of said multiple input units not belonging to said first subset of said multiple input units are reconstructed based on said one or more layers of stochastic units or said detected feature.\n4. The system for feature detection as recited in claim 1, wherein said system is part of an image ad network.\n5. The system for feature detection as recited in claim 1, wherein said system recognizes objects or people.\n6. The system for feature detection as recited in claim 1, wherein said first stochastic unit is binary.\n7. The system for feature detection as recited in claim 1, wherein said system recognizes emotions.\n8. The system for feature detection as recited in claim 1, wherein said system recognizes human behavior.\n9. The system for feature detection as recited in claim 1, wherein said system matches ads with merchant catalogs.\n10. The system for feature detection as recited in claim 1, wherein said system recognizes natural language.\n11. The system for feature detection as recited in claim 1, wherein said system recognizes voice.\n12. The system for feature detection as recited in claim 1, wherein said system is a part of a search engine.\n13. The system for feature detection as recited in claim 1, wherein said system is connected to or associated with a web.\n14. The system for feature detection as recited in claim 1, wherein said system recognizes patterns in social networks.\n15. The system for feature detection as recited in claim 1, wherein said system recognizes actions in video.\n16. The system for feature detection as recited in claim 1, wherein said system is associated with a classifier.\n17. The system for feature detection as recited in claim 1, wherein said system recognizes components of an object.\n18. The system for feature detection as recited in claim 1, wherein said system learns by itself.\n19. A system for feature detection with reliability measure, said system comprising:\none or more processors;\nmultiple input units;\nwherein a second set of data determines a first subset of said multiple input units to be clamped to a first set of data;\nwherein in clamping a first input unit of said multiple input units, said one or more processors dynamically set a value of said first input unit in a first memory unit associated with said first input unit to a corresponding value from said first set of data;\none or more layers of stochastic units, comprising a first stochastic unit;\nwherein said first stochastic unit has one or more links traceable to a second subset of said multiple input units, wherein a local coverage extent associated with said first stochastic unit limits said one or more links;\nwherein said one or more links represent first weighted connections between said first stochastic unit and second units;\nwherein said second units are among said second subset of said multiple input units or from said one or more layers of stochastic units between said first stochastic unit and said multiple input units;\nwherein said one or more processors set a memory unit associated with said first stochastic unit to a first value generated based on weighted sum of values of memory units associated with said second units per said first weighted connections represented by said one or more links;\nwherein said one or more processors detect sub-features associated with a higher layer of said one or more layers of stochastic units, based on sub-features detected by a lower layer of said one or more layers of stochastic units;\none or more output units;\nwherein said one or more processors set a memory unit associated with said one or more output units to a value indicating a detected feature based on one or more said detected sub-features associated with one or more layers of one or more units of said one or more layers of stochastic units;\nwherein said one or more processors determine an energy measure corresponding to said first set of data, based on factors comprising of said first weighted connections, said one or more layers of stochastic units, and said first set of data clamped to said first subset of said multiple input units;\nwherein in said determining said energy measure, a contribution of said energy measure from said first stochastic unit is reduced by a coverage factor of said first stochastic unit;\nwherein said coverage factor of said first stochastic unit is determined based on a value representing fraction of input units within said second subset of said multiple input units traceable from said first stochastic unit that are also in said first subset of said multiple input units clamped to said first set of data;\nwherein said one or more processors output to a second memory unit a value representing a quality measure associated with said detected feature determined based on said energy measure and a baseline;\nwherein said quality measure indicates a degree of conformity, a degree of confidence, relative probability, or a degree of reliability associated with said detected feature for said first set of data.\n20. A system for feature detection with conformity measure, said system comprising:\none or more processors;\nmultiple input units;\nwherein a second set of data determines a first subset of said multiple input units to be clamped to a first set of data;\nwherein in clamping a first input unit of said multiple input units, said one or more processors dynamically set a value of said first input unit in a first memory unit associated with said first input unit to a corresponding value from said first set of data;\none or more layers of stochastic units, comprising a first stochastic unit;\nwherein said first stochastic unit has one or more links traceable to a second subset of said multiple input units, wherein a local coverage extent associated with said first stochastic unit limits said one or more links;\nwherein said one or more links represent first weighted connections between said first stochastic unit and second units;\nwherein said second units are among said second subset of said multiple input units or from said one or more layers of stochastic units between said first stochastic unit and said multiple input units;\nwherein said one or more processors set a memory unit associated with said first stochastic unit to a first value generated based on weighted sum of values of memory units associated with said second units per said first weighted connections represented by said one or more links;\nwherein said one or more processors detect sub-features associated with a higher layer of said one or more layers of stochastic units, based on sub-features detected by a lower layer of said one or more layers of stochastic units;\none or more output units;\nwherein said one or more processors set a memory unit associated with said one or more output units to a value indicating a detected feature based on one or more said detected sub-features associated with one or more layers of one or more units of said one or more layers of stochastic units;\nwherein said one or more processors determine an energy measure corresponding to said first set of data, based on factors comprising of said first weighted connections, said one or more layers of stochastic units, and said first set of data clamped to said first subset of said multiple input units;\nwherein in said determining said energy measure, a contribution of said energy measure from said first stochastic unit is reduced by a coverage factor of said first stochastic unit;\nwherein said coverage factor of said first stochastic unit is determined based on a value representing fraction of input units within said second subset of said multiple input units traceable from said first stochastic unit that are also in said first subset of said multiple input units clamped to said first set of data;\nwherein said one or more processors output to a second memory unit a value representing a quality measure associated with said detected feature determined based on said energy measure and a baseline;\nwherein said local coverage extent associated with said first stochastic unit is defined by a patch shape covering said second units.\n21. The system for feature detection as recited in claim 20, wherein said patch shape is circular, square-shape, rectangular, hexagonal, or polygonal.\n22. The system for feature detection as recited in claim 20, wherein pattern of arrangement of said patch shape is non-uniformly distributed.\n23. The system for feature detection as recited in claim 20, wherein pattern of arrangement of said patch shape is regularly distributed.\n24. The system for feature detection as recited in claim 1, wherein one or more units of said multiple input units not belonging to said first subset of said multiple input units are initialized randomly.\n25. The system for feature detection as recited in claim 1, wherein one or more units of said multiple input units are stochastic.\n26. The system for feature detection as recited in claim 1, wherein in said determining said energy measure corresponding to said first set of data, a contribution to said energy measure from a unit of said first subset of said multiple input units is ignored.\n27. The system for feature detection as recited in claim 1, wherein said coverage factor of said first stochastic unit is determined or estimated based on coverage factors associated with said second units.\n28. The system for feature detection as recited in claim 1, wherein said coverage factor of said first stochastic unit is determined or estimated based on a value representing fraction of said multiple input units belonging to said first subset of said multiple input units clamped to said first set of data.\n29. The system for feature detection as recited in claim 1, wherein a weight value represented by one of said first weighted connections between said first stochastic unit and second units is shared with one of second weighted connections of a second stochastic unit."
}