{
    "patent_id": "US-9535563-B2",
    "title": "Internet appliance system and method ",
    "assignee": "Blanding Hovenweep, Llc",
    "publication_date": "2017-01-03",
    "patent_link": "https://patents.google.com/patent/US9535563B2/en",
    "inventors": [
        "Steven M. Hoffberg",
        "Linda I. Hoffberg-Borghesani"
    ],
    "classifications": [
        "G06F3/048",
        "G05B15/02",
        "G06N5/025",
        "G06Q30/02",
        "G06Q30/0248",
        "G06Q30/0255",
        "G06Q30/0267",
        "G06Q30/0269",
        "G06Q30/0273",
        "H04N21/4131",
        "H04N21/42201",
        "H04N21/44222",
        "H04N21/44224",
        "H04N21/4532",
        "H04N21/47",
        "H04N5/782",
        "H04N5/913",
        "G06N20/00",
        "H04N2005/91328",
        "H04N2005/91364"
    ],
    "abstract": "An Internet appliance, comprising, within a single housing, packet data network interfaces, adapted for communicating with the Internet and a local area network, at least one data interface selected from the group consisting of a universal serial bus, an IEEE-1394 interface, a voice telephony interface, an audio program interface, a video program interface, an audiovisual program interface, a camera interface, a physical security system interface, a wireless networking interface; a device control interface, smart home interface, an environmental sensing interface, and an environmental control interface, and a processor, for controlling a data transfer between the local area network and the Internet, and defining a markup language interface communicated through a packet data network interface, to control a data transfer or control a remote device.",
    "claims": "\n1. An Internet appliance comprising:\nat least two packet data network interfaces configured to communicate data packets according to an Internet Protocol with a public network and a private network;\na media stream interface; and\na processor having an associated memory configured to store executable code, wherein said code defines at least a remote virtual interface function, a data packet routing function, and a media stream processing function for controlling the media stream interface.\n2. The Internet appliance of claim 1, further comprising an audio codec coupled to the media stream interface.\n3. The Internet appliance of claim 1, further comprising a speech interface, wherein the processor is configured to recognize human speech based, at least in part, on signals received at the speech interface.\n4. The Internet appliance of claim 1, further comprising a speech interface, wherein the processor is configured to synthesize human speech through the speech interface.\n5. The Internet appliance of claim 1, wherein the processor is configured to communicate with a remote device through at least one of the public network or the private network using a markup language interface.\n6. The Internet appliance of claim 5, wherein the markup language interface comprises XML and the processor is further configured to automatically communicate with a remote automated device.\n7. The Internet appliance of claim 5, wherein the markup language interface comprises HTML and the processor is configured to communicate with a remote HTML browser human user interface.\n8. The Internet appliance of claim 1, further comprising a wireless remote control configured to control at least the media stream interface.\n9. An Internet appliance within a single housing, the Internet appliance comprising:\nat least two packet data network interfaces configured to communicate data packets according to an Internet Protocol with a public network and a private network;\na media stream interface; and\na processor having an associated memory configured to store executable code, wherein said code defines at least a remote virtual interface function, a data packet routing function, and a media stream processing function for controlling the media stream interface.\n10. The Internet appliance of claim 9, further comprising an audio codec coupled to the media stream interface.\n11. The Internet appliance of claim 9, further comprising a speech interface, wherein the processor is configured to recognize human speech based, at least in part, on signals received at the speech interface.\n12. The Internet appliance of claim 9, further comprising a speech interface, wherein the processor is configured to synthesize human speech through the speech interface.\n13. The Internet appliance of claim 9, wherein the processor is configured to communicate with a remote device through at least one of the public network or the private network using a markup language interface.\n14. The Internet appliance of claim 13, wherein the markup language interface comprises XML and the processor is further configured to automatically communicate with a remote automated device.\n15. The Internet appliance of claim 13, wherein the markup language interface comprises HTML and the processor is configured to communicate with a remote HTML browser human user interface.\n16. The Internet appliance of claim 9, further comprising a wireless remote control configured to control at least the media stream interface."
}