{
    "patent_link": "https://patents.google.com/patent/US6205120B1/en",
    "patent_id": "US6205120B1",
    "title": "Method for transparently determining and setting an optimal minimum required TCP window size",
    "abstract": "A method is provided for optimally setting the receiver window size in a flow controlled protocol in order to minimize queuing in a packet telecommunications network. Embodiments according to the present invention are operable at an explicit path to identify per connection information from host address or physical interface, flow direction, or any combination of these elements. The present invention may function in conjunction with a rate detection method that determines both a message serialization delay component and a data size invariant delay component.",
    "inventors": [
        "Robert L. Packer",
        "Guy Riddle"
    ],
    "assignee": "Gen Digital Inc",
    "classifications": [
        "H04L47/10",
        "H04L69/163",
        "H04L69/16"
    ],
    "claims": "\n1. A method for minimizing queuing of data on a transmission link in a digital data packet communication environment having an arbitrary and unknown plurality of digital packet transmission stations interconnectable in data paths through a network, each said data path having associated therewith a flow of data comprising packets, wherein said data packet communication environment uses a sliding window method of rate control wherein a receiver sends a value for a window back to a sender as a receiver-advertised window, wherein said receiver-advertised window is associated with each packet of said particular flow along each said data path, said method comprising the steps of:\n2. The method of claim 1 further comprising the step of:\n3. The method of claim 1 further wherein said digital data packet communication environment is an Internet Protocol (IP) message.\n4. The method of claim 1 wherein said digital data packet communication environment is a Transmission Control Protocol (TCP) connection.\n5. The method of claim 1 wherein said digital data packet communication environment is a User Datagram Protocol (UDP) session.\n6. The method of claim 1 further comprising the step of:\n7. The method of claim 1 further comprising the step of:\n8. A system for transmitting data with minimal queuing on a transmission link in a digital data packet communication environment having an arbitrary and unknown plurality of digital packet transmission stations interconnectable in data paths through a network, each said data path having associated therewith a flow of data comprising packets, wherein said data packet communication environment uses a sliding window method of rate control wherein a receiver sends a value for a window back to a sender as a receiver-advertised window, wherein said window is associated with each packet of said particular flow along each said data path, said system comprising:\n9. The system of claim 8 wherein said receiver is further operative to:\n10. The system of claim 8 further wherein said digital data packet communication environment is an Internet Protocol (IP) message.\n11. The system of claim 8 wherein said digital data packet communication environment is a Transmission Control Protocol (TCP) connection.\n12. The system of claim 8 wherein said digital data packet communication environment is a User Datagram Protocol (UDP) session.\n13. The system of claim 8 wherein said receiver is further operative to:\n14. A method for minimizing queuing of data on a transmission link in a digital data packet communication environment having an arbitrary and unknown plurality of digital packet transmission stations interconnectable in data paths through a network, each said data path having associated therewith a flow of data, wherein said data packet communication environment uses a sliding window method of rate control, wherein a window is associated with each said particular flow along each said data path, said method comprising the steps of:\n15. A method for minimizing queuing of data on a transmission link in a digital data packet communication environment having an arbitrary and unknown plurality of digital packet transmission stations interconnectable in data paths through a network, each said data path having associated therewith a flow of data, wherein said data packet communication environment uses a sliding window method of rate control, wherein a window is associated with each said particular flow along each said data path, said method comprising the steps of:",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5014265A",
        "US5193151A",
        "US5408465A",
        "US5526353A",
        "US5612949A",
        "US5668951A",
        "US5764625A",
        "US5802106A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20020004842A1",
        "WO2002045275A2",
        "WO2002063488A1",
        "US20020141341A1",
        "US20020172153A1",
        "US6493316B1",
        "US20030061263A1",
        "US20030065762A1",
        "US20030065703A1",
        "US20030067903A1",
        "US20030079027A1",
        "US20030103460A1",
        "US20030126282A1",
        "US20040015591A1",
        "US20040017773A1",
        "US6687227B1",
        "US20040100912A1",
        "US6744730B2",
        "US20040120256A1",
        "US6757245B1",
        "US6769030B1",
        "US20040165526A1",
        "US6820129B1",
        "US20040236802A1",
        "US20050013245A1",
        "US20050065915A1",
        "US20050071451A1",
        "US20050232193A1",
        "US20060015574A1",
        "US6992982B1",
        "US7006448B1",
        "US20060080409A1",
        "US7102998B1",
        "US20060209838A1",
        "US20060262738A1",
        "US7158479B1",
        "US20070009015A1",
        "US7203186B1",
        "US7236459B1",
        "US20070206615A1",
        "US7313627B1",
        "CN100377058C",
        "US7369537B1",
        "US7404003B1",
        "US20080215718A1",
        "US20080279222A1",
        "US20090046586A1",
        "US7543052B1",
        "US20100091699A1",
        "US20100232294A1",
        "US20100296485A1",
        "US20100332595A1",
        "US7869366B1",
        "US7953888B2",
        "US8239532B1",
        "US8325623B1",
        "US8468196B1",
        "US8543901B1",
        "US8549135B1",
        "US8553699B2",
        "US8576711B1",
        "US8743718B2",
        "US8930538B2",
        "US8964543B1",
        "US9071543B2",
        "US9450689B2",
        "US9496991B2",
        "US9509802B1",
        "US9606245B1",
        "US9860300B2",
        "US9898855B2",
        "US9984478B2",
        "US9984460B2",
        "US10043482B2",
        "US10070839B2",
        "US10311541B2",
        "US10430914B2",
        "US10540803B2",
        "US10614543B2",
        "US10909679B2",
        "US10924573B2",
        "US11183292B2",
        "US11197051B2",
        "US11244495B2",
        "US11599672B2"
    ],
    "citedby_ftf": [
        "US6959006B1",
        "US6847609B1"
    ]
}