{
    "patent_link": "https://patents.google.com/patent/US20040064395A1/en",
    "patent_id": "US20040064395A1",
    "title": "System and method for simulating an electronic trading environment",
    "abstract": "Market data is recorded from a real live exchange. The recording data can be played back in real time or delayed, in any manner, to simulate the recorded market. Moreover, one or more users can participate in the simulated market just as if they were participating in a real-live market. The system provides a realistic trading environment without the associated risks of trading in a live-market such as losing money and the cost of making trades. The system may be used for training purposes and for purposes of testing and analyzing various trading strategies. Software developers and testers may also the realistic environment to develop trading products or applications. Additionally, the system provides a means for demonstrating trading application products.",
    "inventors": [
        "Sagy Mintz",
        "Robert West",
        "Christos Kondilis"
    ],
    "assignee": "Trading Technologies International Inc",
    "classifications": [
        "G06Q40/04",
        "G06Q40/06"
    ],
    "claims": "\n1. A system for simulating an electronic trading environment, the system comprising:\nan exchange;\na client device for communicating orders to the exchange; and\na market simulator for generating orders based on recorded information from a live market, wherein the generated orders are communicated to the exchange, and wherein orders from the market simulator and the orders from the client device are matched at the exchange.\n2. The system of claim 1 wherein the system is implemented in computer software on one computing device.\n3. The system of claim 1 wherein the system is implemented in computer software on at least two computing devices connected by a network.\n4. The system of claim 1 wherein the exchange implements a user configurable matching algorithm.\n5. The system of claim 1 wherein the exchange disseminates market information to the market simulator and to the client device.\n6. The system of claim 1 further comprising a second client device for communicating orders to the exchange, wherein orders from the market simulator, orders from the first client device, and orders from the second client device are matched at the exchange.\n7. The system of claim 1 wherein a user of the client device logs onto the exchange in the same fashion as the user of the client device logs onto a live exchange.\n8. The system of claim 1 further comprising a live exchange, wherein a user of the client device can log onto the exchange or the user of the client device can log onto the live exchange.\n9. The system of claim 1 wherein the market simulator records the information from a live market at a live exchange.\n10. The system of claim 1 wherein the system allows real time playback by generating orders as soon as data from the live exchange is received.\n11. The system of claim 1 further comprising an interface for recording a live market.\n12. The system of claim 1 further comprising an interface for navigating information recorded from a live exchange by providing a means for rewinding and a means for fast forwarding.\n13. The system of claim 1 wherein the market simulator records news associated with the information from the live exchange.\n14. A method for recording market information from a live exchange, the method comprising:\nconnecting to an exchange to receive a plurality of price updates corresponding to a market at the exchange, wherein the plurality of price updates comprise inside market information and market depth information;\nretrieving the plurality of price updates and associating each of the plurality of price updates with a time stamp; and storing the plurality of price updates and time stamps for later display.\n15. The method of claim 14 wherein inside market information represents the best bid price and the best ask price, and market depth information represents quantities at price levels other than the inside market.\n16. The method of claim 14 wherein the step of storing comprises storing into a file format suitable for playing forward in time and reverse in time.\n17. A method for playing market information recorded from a live exchange, the method comprising:\nretrieving stored market information and updating a stored market order book in response to the stored market information; retrieving order information and fill information from an exchange and updating a simulated market order book in response to the order information and fill information; comparing the stored market order book to the simulated market order book;\ndetermining adjustments to conform the stored market order book to the simulated market order book; and\nsubmitting any adjustments to the exchange.\n18. The method of claim 15 wherein the stored market order book maintains the state of the recorded market and wherein the simulated market order book maintains the current state of the market.\n19. The method of claim 15 wherein comparing is performed to prevent the current state of the market from deviating from the stored market information.\n20. The method of claim 15 wherein the adjustments are submitted as orders over a period of time.\n21. The method of claim 15 wherein the adjustments are submitted as orders instantaneously.",
    "status": "Active",
    "citations_own": [
        "US4674044A",
        "US4750135A",
        "US4807158A",
        "US4903201A",
        "US5038284A",
        "US5077665A",
        "US5101353A",
        "US5136501A",
        "US5270922A",
        "US5297031A",
        "US5297032A",
        "US5689651A",
        "US5719796A",
        "US5727165A",
        "US5774877A",
        "US5797002A",
        "US5845266A",
        "US5924082A",
        "US5924083A",
        "US5946667A",
        "US5953708A",
        "US5963923A",
        "US6014643A",
        "US6035287A",
        "US6044361A",
        "US6098051A",
        "US6131087A",
        "US6134511A",
        "US6134535A",
        "US6195647B1",
        "US6272474B1",
        "US6278982B1",
        "US6282521B1",
        "US6317728B1",
        "US6321212B1",
        "US20020023038A1",
        "US20020026321A1",
        "US20020035534A1",
        "US6377940B2",
        "US20020055899A1",
        "US20020059135A1",
        "US6405180B2",
        "US20020073016A1",
        "US6408282B1",
        "US6411998B1",
        "US20020103741A1",
        "US20020107748A1",
        "US20020138401A1",
        "US20020161693A1",
        "US20020161687A1",
        "US20020178102A1",
        "US20030004853A1",
        "US20030009411A1",
        "US6634950B2",
        "US6939137B1",
        "US20060259399A1"
    ],
    "citations_ftf": [
        "NL183484C",
        "JPH03505498A",
        "EP0388162A3",
        "JPH03505938A",
        "US5135501A",
        "US5294083A",
        "WO1995006918A2",
        "GB2298951B",
        "CN1261450A",
        "US20020138390A1",
        "EP1067471A1",
        "US6211880B1",
        "WO2000011587A1",
        "WO2000048113A1",
        "AU3247600A",
        "US7212999B2",
        "WO2000065510A1",
        "AU6768300A",
        "WO2001016852A2",
        "US7685048B1",
        "US8311926B1",
        "GB2366630A",
        "US7127424B2",
        "US7389268B1",
        "US6772132B1",
        "US7742959B2",
        "US7246092B1",
        "KR100403990B1",
        "AU2001271864A1",
        "KR20020007860A",
        "US20020069152A1",
        "AU2002237829A1",
        "EP1321870A1"
    ],
    "citedby_own": [
        "US20030004853A1",
        "US20030009411A1",
        "US20030069830A1",
        "US20040243502A1",
        "US20040249740A1",
        "US20060010066A1",
        "US20060026090A1",
        "US20060082061A1",
        "US20060085321A1",
        "US20060106708A1",
        "US20060253373A1",
        "US20060259399A1",
        "US20070088658A1",
        "US20070118459A1",
        "US20070118453A1",
        "US20070118455A1",
        "US20070168275A1",
        "US20070244769A1",
        "US20070244772A1",
        "US20070244801A1",
        "US20070244770A1",
        "US20070244793A1",
        "US20070253544A1",
        "US20070255624A1",
        "US20070265953A1",
        "US20080027880A1",
        "US20080059846A1",
        "US20080071663A1",
        "US20080109351A1",
        "US20080162378A1",
        "US20080243572A1",
        "US20080243669A1",
        "US20080243672A1",
        "US20080243671A1",
        "US20080243670A1",
        "US20080270289A1",
        "US20080288391A1",
        "US20090061995A1",
        "US20090062016A1",
        "US20090089202A1",
        "US20090171832A1",
        "US20090276373A1",
        "US7620586B2",
        "US20100010937A1",
        "US7657477B1",
        "US20100035673A1",
        "US20100094777A1",
        "US20100138360A1",
        "US20100145844A1",
        "US20100174633A1",
        "US7801810B2",
        "US7801801B2",
        "US20100241588A1",
        "US20100306133A1",
        "US7849000B2",
        "US20110012357A1",
        "US7890412B2",
        "US20110055067A1",
        "US20110066536A1",
        "US20110066537A1",
        "US20110066568A1",
        "JP2011519073A",
        "US8027900B1",
        "US8229838B2",
        "US8364575B2",
        "US8429059B2",
        "US8510208B2",
        "US8589280B2",
        "JP2013544389A",
        "US20140214646A1",
        "US20150025873A1",
        "US20160224995A1",
        "US20190213678A1",
        "US10803069B2",
        "US11153208B2"
    ],
    "citedby_ftf": [
        "US6993504B1",
        "US7212999B2",
        "US6938011B1",
        "US6772132B1",
        "US7389268B1",
        "US7716112B1",
        "US7610237B1",
        "US8041623B1",
        "JP4318913B2",
        "US10817937B1",
        "US7587357B1",
        "US20110125672A1",
        "US20100312718A1",
        "US20100114753A1",
        "US20100088218A1",
        "US20060161496A1",
        "US7734533B2",
        "US20110022509A1",
        "US7747513B2",
        "KR100775863B1",
        "US8930257B1",
        "US8175941B2",
        "WO2010114862A1",
        "US10096066B2",
        "US8660935B2",
        "US8458079B2",
        "US8566220B2",
        "US10713897B2",
        "US8799143B1",
        "US10565646B2",
        "US11295293B2",
        "US20200301807A1"
    ]
}