{
    "patent_id": "US-10656711-B2",
    "title": "Methods and apparatus for inferring user intent based on neuromuscular signals ",
    "assignee": "Facebook Technologies, Llc",
    "publication_date": "2020-05-19",
    "patent_link": "https://patents.google.com/patent/US10656711B2/en",
    "inventors": [
        "Patrick Kaifosh",
        "Timothy Machado",
        "Thomas Reardon",
        "Erik Schomburg"
    ],
    "classifications": [
        "G06F3/015",
        "A61B5/0488",
        "A61B5/389",
        "A61B5/7267",
        "G06N20/00",
        "G06N3/044",
        "G06N3/0445",
        "G06N7/005",
        "G06N7/01",
        "A61B5/7282",
        "G06N20/10",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/084",
        "G16H50/70"
    ],
    "abstract": "Methods and system for predicting the onset of a motor action using neuromuscular signals. The system comprises a plurality of sensors configured to continuously record a plurality of neuromuscular signals from a user and at least one computer processor programmed to provide as input to a trained statistical model, the plurality of neuromuscular signals or information based on the plurality of neuromuscular signals, predict, based on an output of the trained statistical model, whether an onset of a motor action will occur within a threshold amount of time; and send a control signal to at least one device based, at least in part, on the output probability, wherein the control signal is sent to the at least one device prior to completion of the motor action by the user.",
    "claims": "\n1. A control system, comprising:\na plurality of sensors configured to continuously record a plurality of neuromuscular signals from a user; and\nat least one computer processor programmed to:\nprovide as input to a trained statistical model, the plurality of neuromuscular signals and/or information based on the plurality of neuromuscular signals, wherein the trained statistical model was trained based, at least in part, on neuromuscular data recorded during at least one previous performance of a motor action by one or more users and result data indicating an outcome of the motor action performed by the one or more users; and\npredict, based on an output of the trained statistical model, whether an onset of the user's motor action will occur within a threshold amount of time.\n2. The control system of claim 1, wherein the at least one computer processor is further programmed to receive as an output from the trained statistical model a set of probabilities, each probability in the set indicating a probability that a respective motor action of a plurality of motor actions will occur within the threshold amount of time.\n3. The control system of claim 1, wherein the output of the trained statistical model comprises a probability that the onset of a sequence of motor actions will occur within the threshold amount of time, and\nwherein predicting that an onset of a motor action will occur within a threshold amount of time comprises determining whether the probability is greater than an operating threshold.\n4. The control system of claim 1, wherein the at least one computer processor is further programmed to retrain the trained statistical model based, at least in part, on at least some of the plurality of neuromuscular signals.\n5. The control system of claim 1, wherein the at least one computer processor is further programmed to:\ndetermine a set of features based on the plurality of neuromuscular signals; and\nprovide as input to a trained statistical model, the set of features as information based on the plurality of neuromuscular signals,\nwherein predicting, based on an output of the trained statistical model, whether an onset of the user's motor action will occur within a threshold amount of time comprises classifying the set of features using the trained statistical model.\n6. The control system of claim 1, wherein the plurality of sensors are arranged on a wearable device configured to be worn on or around a body part of the user.\n7. The control system of claim 6, wherein the wearable device comprises a flexible or elastic band configured to be worn around the body part of the user.\n8. The control system of claim 7, wherein the wearable device comprises an armband configured to be worn around an arm of the user.\n9. The control system of claim 1, further comprising hardware circuitry and/or software configured to process the neuromuscular signals prior to being provided as input to the trained statistical model, wherein processing the neuromuscular signals comprises processing selected from the group consisting of amplification, filtering, and rectification.\n10. The control system of claim 1, wherein the plurality of sensors comprises sensors selected from the group consisting of electromyography (EMG) sensors, mechanomyography (MMG) sensors, and sonomyography (SMG) sensors.\n11. The control system of claim 1, wherein the trained statistical model predicts whether the onset of the user's motor action will occur within a threshold amount of time by determining the probability that the motor action occurs within the threshold amount of time.\n12. The control system of claim 11, wherein the at least one computer processor is further programmed to determine the probability that the onset of the motor action occurs within a threshold amount of time by determining whether the probability is greater than an operating threshold.\n13. The control system of claim 12, wherein the at least one computer processor determines the operating threshold based, at least in part, on an analysis of data obtained from neuromuscular signals recorded by at least some of the plurality of sensors.\n14. The control system of claim 13, wherein determining the operating threshold further comprises:\ndetermining a mean anticipation time based on the data; and determining the operating threshold based, at least in part, on the mean anticipation time.\n15. The control system of claim 12, wherein the at least one computer processor is further programmed to receive at least one performance characteristic for a task to be performed, and wherein the operating threshold is determined based, at least in part, on the received at least one performance characteristic.\n16. The control system of claim 15, wherein the at least one performance characteristic includes a performance characteristic selected from the group consisting of a false positive rate, a false negative rate, a true positive rate, a true negative rate, a positive predictive value, a negative predictive value, and a mean anticipation time.\n17. The control system of claim 1, wherein the threshold amount of time is determined based on the neuromuscular data recorded during the at least one previous performance of the motor action by one or more users, or based on information associated with the user's plurality of neuromuscular signals.\n18. A method of predicting an onset of a motor action, the method comprising\nproviding, as input to a trained statistical model, a plurality of neuromuscular signals recorded from a plurality of sensors arranged on or around a part of a user's body, wherein the trained statistical model was trained based, at least in part, on neuromuscular data recorded during at least one previous performance of a motor action by one or more users and result data indicating an outcome of the motor action performed by the one or more users, and wherein the trained statistical model is configured to predict an onset of the motor action prior to completion of the motor action; and\npredicting, using at least one computer processor, whether the onset of the motor action will occur within a threshold amount of time.\n19. A method of predicting an onset of a motor action, the method comprising:\nproviding, as input to a neural network, a plurality of neuromuscular signals recorded from a plurality of sensors arranged on or around a part of a user's body, wherein the neural network was trained based, at least in part, on neuromuscular data recorded during at least one previous performance of a motor action by one or more users and result data indicating an outcome of the motor action performed by the one or more users, wherein the neural network is configured to predict an onset of the motor action prior to completion of the motor action;\npredicting, using at least one computer processor, whether the onset of the motor action will occur within a threshold amount of time, wherein the threshold amount of time is determined based on the neuromuscular data recorded during the at least one previous performance of the motor action by one or more users, or based on information associated with the user's plurality of neuromuscular signals.\n20. The method of claim 19, wherein the neural network comprises a recurrent neural network.",
    "status": "Active",
    "citations_own": [
        "US4055168A",
        "US4896120A",
        "JPH05277080A",
        "US5625577A",
        "US6005548A",
        "US6009210A",
        "US6244873B1",
        "US6411843B1",
        "US20030144829A1",
        "US20030171921A1",
        "US20030184544A1",
        "US6658287B1",
        "US20040054273A1",
        "US6720984B1",
        "US20040092839A1",
        "US6774885B1",
        "JP2005095561A",
        "US6942621B2",
        "US20060129057A1",
        "US7089148B1",
        "CN1838933A",
        "US20070009151A1",
        "US20070172797A1",
        "US20070177770A1",
        "US20070256494A1",
        "US20070285399A1",
        "US20080052643A1",
        "US20080051673A1",
        "US7351975B2",
        "US20080103639A1",
        "US20080214360A1",
        "US20080221487A1",
        "US20090027337A1",
        "US20090079813A1",
        "US20090082692A1",
        "WO2009042313A1",
        "US20090112080A1",
        "US20090124881A1",
        "US7574253B2",
        "US7580742B2",
        "US20090326406A1",
        "US20090327171A1",
        "US20100030532A1",
        "US20100063794A1",
        "US20100106044A1",
        "US20100113910A1",
        "US7787946B2",
        "US7805386B2",
        "US20100292617A1",
        "US20100293115A1",
        "US20100292595A1",
        "US20100292606A1",
        "US20100315266A1",
        "US7901368B2",
        "US20110077484A1",
        "US20110092826A1",
        "US20110173204A1",
        "US20110173574A1",
        "US20110230782A1",
        "US20120066163A1",
        "US8190249B1",
        "US20120188158A1",
        "US20120265480A1",
        "US20120283526A1",
        "US8311623B2",
        "WO2012155157A1",
        "US20130004033A1",
        "US8351651B2",
        "US20130077820A1",
        "US8421634B2",
        "US8435191B2",
        "US20130123656A1",
        "US20130141375A1",
        "US8484022B1",
        "US20130207889A1",
        "US20130217998A1",
        "US20130317648A1",
        "US20130317382A1",
        "US20140052150A1",
        "US20140092009A1",
        "US20140098018A1",
        "US8718980B2",
        "CN103777752A",
        "US8744543B2",
        "US8754862B2",
        "US20140196131A1",
        "US20140198035A1",
        "US20140223462A1",
        "CA2902045A1",
        "US20140245200A1",
        "US20140249397A1",
        "US20140277622A1",
        "US20140278441A1",
        "US20140297528A1",
        "US20140304665A1",
        "US8880163B2",
        "US20140330404A1",
        "US20140334083A1",
        "USD717685S1",
        "US8890875B2",
        "US20140344731A1",
        "WO2014194257A1",
        "US20140355825A1",
        "US20140358024A1",
        "US20140361988A1",
        "WO2014197443A1",
        "US20140364703A1",
        "US20140365163A1",
        "US20140376773A1",
        "US20150006120A1",
        "US20150010203A1",
        "US20150025355A1",
        "US20150029092A1",
        "US20150035827A1",
        "US20150045689A1",
        "US20150045699A1",
        "US20150051470A1",
        "US20150057770A1",
        "US20150070274A1",
        "US20150070270A1",
        "US20150084860A1",
        "US20150109202A1",
        "US20150128094A1",
        "US20150124566A1",
        "WO2015073713A1",
        "US20150141784A1",
        "US20150148641A1",
        "US20150157944A1",
        "US20150169074A1",
        "US20150182165A1",
        "US20150193949A1",
        "US20150223716A1",
        "CA2939644A1",
        "US20150261306A1",
        "US20150261318A1",
        "US20150277575A1",
        "US20150296553A1",
        "US20150302168A1",
        "US20150309563A1",
        "US20150309582A1",
        "US20150313496A1",
        "US20150325202A1",
        "US20150332013A1",
        "US20150346701A1",
        "US9218574B2",
        "US20150366504A1",
        "US20150370333A1",
        "US20150370326A1",
        "WO2015199747A1",
        "US9235934B2",
        "US20160011668A1",
        "US9240069B1",
        "US20160049073A1",
        "WO2016041088A1",
        "US20160092504A1",
        "USD756359S1",
        "US20160144172A1",
        "US9351653B1",
        "US20160162604A1",
        "US20160187992A1",
        "US20160235323A1",
        "US20160239080A1",
        "US20160262687A1",
        "US20160274758A1",
        "US20160275726A1",
        "US9459697B2",
        "US20160292497A1",
        "US20160313890A1",
        "US20160313801A1",
        "US20160313798A1",
        "US20160313899A1",
        "US20160350973A1",
        "US20170031502A1",
        "US20170035313A1",
        "US20170061817A1",
        "US20170068445A1",
        "US9597015B2",
        "US20170080346A1",
        "US20170091567A1",
        "US20170090604A1",
        "US9612661B2",
        "US9613262B2",
        "WO2017062544A1",
        "US20170123487A1",
        "US20170124816A1",
        "US20170119472A1",
        "US9654477B1",
        "US9659403B1",
        "US20170161635A1",
        "WO2017092225A1",
        "US9687168B2",
        "US20170188980A1",
        "WO2017120669A1",
        "US9741169B1",
        "US20170259167A1",
        "US9766709B2",
        "US20170285756A1",
        "US20170285848A1",
        "WO2017172185A1",
        "US9785247B1",
        "US9788789B2",
        "US20170296363A1",
        "US20170301630A1",
        "KR101790147B1",
        "US20170308118A1",
        "US20170344706A1",
        "US20170347908A1",
        "WO2017208167A1",
        "US20180000367A1",
        "US9864431B2",
        "US20180020978A1",
        "US20180024635A1",
        "US20180020951A1",
        "US20180024634A1",
        "US20180081439A1",
        "US20180092599A1",
        "US20180101235A1",
        "US20180140441A1",
        "US20180153430A1",
        "US20180154140A1",
        "US20180153444A1",
        "US20180178008A1",
        "US20180301057A1",
        "US20180307314A1",
        "US20180333575A1",
        "US20180360379A1",
        "US20190008453A1",
        "US20190025919A1",
        "US20190033974A1",
        "US20190038166A1",
        "US10203751B2",
        "US20190076716A1",
        "US20190121306A1",
        "US20190146809A1",
        "US20190150777A1",
        "US20190228579A1",
        "US20190228533A1",
        "US20190223748A1",
        "US20190228591A1",
        "US20190227627A1",
        "US20190228590A1",
        "US20190228330A1",
        "US20190247650A1",
        "US20190324549A1",
        "US20190362557A1",
        "US20190357787A1"
    ],
    "citations_ftf": [
        "JP4078419B2",
        "JP2006314670A",
        "CN101987048B",
        "KR101159475B1",
        "US20140276238A1",
        "US9149938B1",
        "CN105654037B"
    ],
    "citedby_own": [
        "US11461991B2",
        "US11816266B2"
    ],
    "citedby_ftf": [
        "US11253781B2",
        "US10042422B2",
        "US10188309B2",
        "US20150124566A1",
        "US9880632B2",
        "US11216069B2",
        "US11179066B2",
        "EP3487595A4",
        "US10772519B2",
        "US11331045B1",
        "US11327566B2",
        "CN110300542A",
        "US10409371B2",
        "CN110312471B",
        "CN112040858A",
        "US10460455B2",
        "US11493993B2",
        "US11069148B2",
        "WO2019148002A1",
        "WO2019147996A1",
        "EP3743790A4",
        "US20210158630A1",
        "US11481030B2",
        "US11150730B1",
        "US10970936B2",
        "US10937414B2",
        "WO2019147958A1",
        "US10592001B2",
        "CN112424727A",
        "EP3801216A4",
        "CN112585600A",
        "US11045137B2",
        "WO2020047429A1",
        "CN112789577A",
        "US10921764B2",
        "TWI685330B",
        "EP3886693A4",
        "KR20210099141A",
        "US11426114B2",
        "US10905383B2",
        "EP3953794A4",
        "CN110974172A",
        "CN111184512B",
        "CN111898205B",
        "CN111976733B",
        "CN112137591B",
        "CN113177359B",
        "CN115317207B"
    ]
}