{
    "patent_id": "US-2006167917-A1",
    "title": "System, methods and apparatus for complex behaviors of collectives of intelligent mobile software agents ",
    "assignee": "Solomon Research Llc",
    "publication_date": "2006-07-27",
    "patent_link": "https://patents.google.com/patent/US20060167917A1/en",
    "inventors": [
        "Neal Solomon"
    ],
    "classifications": [
        "G05B19/418",
        "G06N3/004",
        "G06N5/04",
        "G05B2219/33055",
        "Y02P90/02"
    ],
    "abstract": "A system, methods and apparatus are described involving the self-organizing dynamics of networks of distributed computers. The system uses intelligent mobile software agents in a multi-agent system to perform numerous functions, including search, analysis, collaboration, negotiation, decision making and structural transformation. Data are continuously input, analyzed, organized, reorganized, used and output for specific commercial and industrial applications. The system uses combinations of AI techniques, including evolutionary computation, genetic programming and evolving artificial neural networks; consequently, the system learns, anticipates and adapts. The numerous categories of applications of the system include optimizing network dynamics, collective robotics systems, automated commercial systems and molecular modeling systems. Given the application of complexity theory and modal and temporal logics to self-organizing dynamic networks, a novel model of intelligent systems is presented.",
    "claims": "\n1. A dynamic system for complex behaviors of collectives of intelligent mobile software agents having a plurality of system layers interconnected to one another, comprising:\na computer and communications network adapted to provide active network plasticity;\na plurality of intelligent mobile software agents in a multi-agent system the agents managed by\nintelligent mobile software agent analytical methods;\nintelligent mobile software agent group learning processes;\nintelligent mobile software agent active simulation modeling processes;\nintelligent mobile software agent group scenario generation processes;\nintelligent mobile software agent group decision-making processes;\nintelligent mobile software agent aggregation and re-aggregation processes;\nintelligent mobile software agent team competition and coalition formation processes;\nautomated computer programming in a multi-agent system; and\na plurality of functional applications, including at least one of the group consisting of: collective robotics systems, automated commerce systems, communications network management systems, enterprise resource management systems and bioinformatics systems.\n2. The method of claim 1, in which the behavior of groups of intelligent mobile software agents is organized to learn.\n3. The method of claim 1, in which the intelligent mobile software agents organize active simulations.\n4. The method of claim 1, in which intelligent mobile software agents generate scenarios of possible behaviors and make a decision based on an optimal scenario.\n5. The method of claim 1, in which intelligent mobile software agents in a collective initiate aggregation processes and re-aggregation processes to organize the collective.\n6. The method of claim 1, in which teams of intelligent mobile software agents are organized to compete with other teams of intelligent mobile software agents.\n7. The method of claim 1, in which collectives of intelligent mobile software agents continuously evolve coalitions.\n8. The method of claim 1, in which collectives of intelligent mobile software agents are organized to achieve adaptive network plasticity behaviors.\n9. The method of claim 1, in which the collective behavior of intelligent mobile software agents displays automated programming.\n10. The method of claim 1, in which an application includes at least one of:\ncollective robotics systems;\nautomated commercial systems, including commercial trading networks for supply chain management solutions;\ncommunications network systems;\nenterprise resource management systems and;\nbioinformatics systems, including structural proteomics, functional proteomics and personalized solutions modeling.",
    "status": "Abandoned",
    "citations_own": [
        "US5761381A",
        "US6581048B1",
        "US6882992B1",
        "US20060036559A1",
        "US7181302B2"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20080004096A1",
        "US20080222065A1",
        "US20090113083A1",
        "US20090228499A1",
        "US20090234786A1",
        "US20100173689A1",
        "EP2206283A1",
        "US7840506B1",
        "US7979578B2",
        "CN102982236A",
        "US20140278918A1",
        "US20140272907A1",
        "US20140330636A1",
        "CN104731603A",
        "US9215217B2",
        "WO2016034167A3",
        "US9338597B2",
        "US9426602B2",
        "US20170061362A1",
        "US9922090B1",
        "US9940640B2",
        "US9940639B2",
        "US9984332B2",
        "US9990433B2",
        "WO2018200111A1",
        "WO2018200113A1",
        "US10140629B2",
        "US10152504B2",
        "US10176491B2",
        "US10438231B2",
        "US10438230B2",
        "US10636052B2",
        "US10789609B2",
        "US10846736B2",
        "US10909561B2",
        "CN112327921A",
        "US10915912B2",
        "US10984441B2",
        "US11017330B2",
        "US11138628B2",
        "CN113672362A",
        "US11200509B2",
        "US20220067012A1",
        "US11270325B2",
        "US11288696B2",
        "US11288698B2",
        "US11314826B2",
        "US11507574B1",
        "US11621969B2",
        "US11734711B2",
        "US11734590B2"
    ],
    "citedby_ftf": [
        "US8065173B2",
        "CN106249717B"
    ]
}