{
    "patent_link": "https://patents.google.com/patent/US5680573A/en",
    "patent_id": "US5680573A",
    "title": "Method of buffering data objects in a database",
    "abstract": "Computer systems and computer implemented methods are provided for managing memory in a database management system. The computer memory is partitioned into a plurality of buffer caches, each of which is separately addressable. One buffer cache is set aside as a default buffer cache, while the other buffer caches are reserved for specific data objects meeting certain predefined criteria. Those objects meeting the predefined criteria are stored in reserved buffer caches where they are likely to remain for a relatively long period of time (in comparison to data objects stored in the default buffer caches). A buffer cache may have a plurality of memory pools, each of which contains multiple storage blocks. The storage blocks in a given memory pool are identically sized, while the storage blocks in one memory pool are sized differently from the storage blocks in another memory pool.",
    "inventors": [
        "David S. Rubin",
        "Robert E. Mihalyi",
        "David A. Marshall"
    ],
    "assignee": "Sybase Inc",
    "classifications": [
        "G06F12/0875",
        "G06F12/0866",
        "G06F16/24552",
        "G06F12/023",
        "G06F2212/311"
    ],
    "claims": "\n1. A method of buffering data objects in a database of a computer system, the computer system having one or more storage devices on which the data objects of the database are stored, the computer system also having a memory on which the data objects may be stored temporarily and accessed relatively faster than from the one or more storage devices, the computer system also supporting an on line transaction processing (OLTP) environment in which data objects are retrieved randomly and a decision support system (DSS) environment in which data objects are retrieved non-randomly, the method comprising the following steps:\n(a) allocating a portion of the memory as a buffer cache;\n(b) allocating at least a first memory pool and a second memory pool each having a user configurable size within the buffer cache, the first memory pool having multiple identical storage blocks, each having a first storage capacity, and the second memory pool also having multiple identical storage blocks, each having a second storage capacity, the second storage capacity being greater than the first storage capacity;\n(c) identifying a selected data object;\n(d) determining whether the selected data object is selected randomly;\n(e) based upon whether the selected data object is selected randomly or non-randomly, determining in which memory pool to copy the selected data object; and\n(f) storing the data object in the memory pool identified in step (e)\nwherein the step of determining in which memory pool of the buffer cache to copy the data object determines that the data object should be copied to the first memory pool if the selected that object is randomly selected, and that the data object should be copied to the second memory pool if the selected data object is not randomly, selected.\n2. The method of claim 1 wherein the step of allocating a portion of the memory as a buffer cache allocates at least two buffer caches, each of which is separately addressable.\n3. The method of claim 1 further comprising a step of queuing data objects in the each memory pool of the buffer cache according to least recently used--most recently used rules.\n4. The method of claim 1 wherein the step of allocating at least a first memory pool and a second memory pool within the buffer cache includes allocating at least a third memory pool with a plurality of identical storage blocks, said storage blocks of the third memory pool having a third storage capacity that is intermediate in size between the first and second storage capacities.\n5. A computer system for managing the storage of data objects in a database, the computer system comprising:\none or more storage devices on which the data objects of a database are stored;\na memory in which the data objects can be stored temporarily and accessed at relatively faster rate than from the one or more storage devices;\nmeans for copying data objects from the one or more storage devices to the memory;\na portion of the memory allocated as a buffer cache having at least a first memory pool and a second memory pool each having a user configurable size, the first memory pool having multiple identical storage blocks, each of a first storage capacity, and the second memory pool also having identical multiple storage blocks each of a second storage capacity, the second storage capacity being greater than the first storage capacity; and\nmeans for copying a selected data object to the first or second memory pool based on whether the selected data object is randomly selected,\nwherein the means for copying copies the selected data object to the first memory pool if the selected data object is randomly selected in an on line transaction processing (OLTP) environment and copies the selected data object to the second memory pool if the selected data object is not randomly selected in a decision support system (DSS) environment.\n6. The computer system of claim 5 wherein the buffer cache further includes at least a third memory pool having a plurality of identical storage blocks having a third storage capacity that is between the first and second storage capacities.\n7. In a computer comprising a processor, a memory, and a storage device, said computer including a database system storing a plurality of database tables, each table comprising a plurality of data records, a method for accessing said data records, the method comprising:\n(a) allocating a portion of the memory as a buffer cache;\n(b) allocating at least a first memory pool and a second memory pool each having a user configurable size within the buffer cache, the first memory pool having multiple identical storage blocks, each having a first storage capacity, and the second memory pool also having multiple identical storage block, each having a second storage capacity, the second storage capacity being greater than the first storage capacity;\n(c) receiving a request for performing a database operation which require access to data objects stored within said plurality of database tables;\n(d) determining whether said request occurs in response to an OLTP query or a DSS query;\n(e) if said request is determined to be in response to a DSS query copying said data objects to said second memory pool, and if said request is determined to be in response to an OLTP query, copying said data objects to said first memory pool.\n8. The method of claim 7, wherein said first buffer pool has storage blocks which are 2K in size and said second buffer pool has storage blocks which are greater than 2K in size.\n9. The method of claim 7, wherein determining whether said request occurs in response to an OLTP query or a DSS query determines that said request is in response to an OLTP query when said database operation comprises a database query which results in random access of data records from said first database table.\n10. The method of claim 7, wherein determining whether said request occurs in response to an OLTP query or a DSS query determines that said request is in response to a DSS query when said database operation comprises a database query which results in non-random access of data records from said first database table.\n11. The method of claim 7, wherein said second buffer pool comprises storage blocks which are at least 64K in size.\n12. The method of claim 7, wherein said database operation comprises a database query operation.\n13. The method of claim 12, wherein the database query operation comprises a Structured Query Language (SQL) command submitted by a client to said computer.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4989132A",
        "US5452445A"
    ],
    "citations_ftf": [
        "EP0389151A3",
        "US5655013A"
    ],
    "citedby_own": [
        "US5592149A",
        "US5884313A",
        "US5901333A",
        "US5950205A",
        "US5983293A",
        "US6000011A",
        "US6035424A",
        "US6098096A",
        "US6122630A",
        "US6226746B1",
        "US6237024B1",
        "US6237009B1",
        "US6243716B1",
        "US6247026B1",
        "US6253256B1",
        "US6263404B1",
        "US6272559B1",
        "US6275916B1",
        "US6282652B1",
        "US6370614B1",
        "US6370619B1",
        "US6389513B1",
        "US6389540B1",
        "US6393497B1",
        "US6408357B1",
        "US6421704B1",
        "US6438614B2",
        "US6446070B1",
        "US20020133507A1",
        "US6463509B1",
        "US6463446B1",
        "US6466947B2",
        "US6470360B1",
        "US6480863B1",
        "WO2002091244A1",
        "US6487607B1",
        "US6560678B1",
        "US6560656B1",
        "US6578044B1",
        "US6591347B2",
        "US6598094B1",
        "US6604127B2",
        "US6629154B1",
        "US6631446B1",
        "US6643650B1",
        "US6654793B1",
        "US6662196B2",
        "US6708171B1",
        "US6728737B2",
        "US6728726B1",
        "US6748384B1",
        "US6760815B1",
        "US20040133591A1",
        "US6763440B1",
        "US6772411B2",
        "US6789126B1",
        "US6789077B1",
        "US6792466B1",
        "US6801207B1",
        "US6832223B1",
        "US6845393B1",
        "US6850979B1",
        "US6854115B1",
        "US6862594B1",
        "US6865657B1",
        "US6868447B1",
        "US6877163B1",
        "US6898618B1",
        "US6901518B1",
        "US6917976B1",
        "US6918084B1",
        "US6924810B1",
        "US20050193160A1",
        "US6941410B1",
        "US6950875B1",
        "US6957237B1",
        "US6957427B1",
        "US6970869B1",
        "US6973493B1",
        "US7010573B1",
        "US7016966B1",
        "US7035990B1",
        "US7065574B1",
        "US7072967B1",
        "US20060149703A1",
        "US7080078B1",
        "US7117535B1",
        "US7124266B1",
        "US20070050662A1",
        "US7188251B1",
        "US7200848B1",
        "US7222117B1",
        "US20070136238A1",
        "US20070156640A1",
        "US7243356B1",
        "US7260543B1",
        "US7296275B2",
        "US7334062B1",
        "US20080065644A1",
        "US20080071987A1",
        "US20080086446A1",
        "US7370091B1",
        "US20080120463A1",
        "US20080140937A1",
        "US7395333B1",
        "US7398533B1",
        "US20080199158A1",
        "US20090240891A1",
        "US7660887B2",
        "US7680641B1",
        "US7716492B1",
        "US7734747B2",
        "US7756969B1",
        "US7792874B1",
        "US20100250506A1",
        "US20100250505A1",
        "CN102110163A",
        "US8001232B1",
        "US20110219169A1",
        "US8082491B1",
        "US20120047346A1",
        "US8135796B1",
        "US8291269B1",
        "US8332349B1",
        "US8458217B1",
        "US20140095449A1",
        "US8886880B2",
        "US8886671B1",
        "US8930619B2",
        "US9053038B2",
        "US9104583B2",
        "US9152563B2",
        "US9158687B2",
        "US9197716B2",
        "US9235531B2",
        "US9286328B2",
        "US9465555B2",
        "US9514174B2",
        "US9552297B2",
        "US9684455B2",
        "US20180173629A1",
        "US10642609B1",
        "US10700949B1",
        "EP3696688A1",
        "US10789220B2",
        "US10853693B2",
        "US10891217B2",
        "US11121943B2",
        "US11232126B2",
        "US11379410B2"
    ],
    "citedby_ftf": [
        "GB9727485D0",
        "US6490670B1",
        "JP3585091B2",
        "US6349363B2",
        "US6687719B1",
        "US6591346B1",
        "US6492881B2",
        "US7266541B2",
        "US7266542B2",
        "US6957294B1",
        "US7596793B2",
        "JP4313068B2",
        "US7783852B2",
        "US7346401B2",
        "US7200693B2",
        "US7209405B2",
        "US7827141B2",
        "US8223935B2",
        "JP4664410B2",
        "US20070028027A1",
        "CA2616194C",
        "US7937257B2",
        "US8223777B2",
        "US8086817B2",
        "DE102007026693A1",
        "US8775479B2",
        "US8019831B2",
        "US20090327377A1",
        "US8356060B2",
        "US8935223B2",
        "US8645337B2",
        "US8296517B2",
        "US8832142B2",
        "US8656133B2",
        "US8793444B2",
        "US8683169B2",
        "US8799611B2",
        "US9495466B2",
        "US9990308B2",
        "US10901937B2",
        "US10713211B2",
        "JP6693547B2",
        "US11403367B2"
    ]
}