{
    "patent_id": "US-11120266-B2",
    "title": "Augmented reality display device with deep learning sensors ",
    "assignee": "Magic Leap, Inc.",
    "publication_date": "2021-09-14",
    "patent_link": "https://patents.google.com/patent/US11120266B2/en",
    "inventors": [
        "Andrew Rabinovich",
        "Tomasz Jan Malisiewicz",
        "Daniel DeTone"
    ],
    "classifications": [
        "G06K9/00671",
        "G06F3/011",
        "A63F13/00",
        "A63F13/211",
        "A63F13/212",
        "A63F13/213",
        "A63F13/428",
        "G02B27/017",
        "G06F1/163",
        "G06F18/214",
        "G06F18/2413",
        "G06F3/0338",
        "G06F3/0346",
        "G06F3/04842",
        "G06K9/00255",
        "G06K9/00288",
        "G06K9/4628",
        "G06K9/627",
        "G06N3/006",
        "G06N3/04",
        "G06N3/044",
        "G06N3/0445",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/08",
        "G06N5/01",
        "G06N7/01",
        "G06T19/006",
        "G06V10/454",
        "G06V10/764",
        "G06V10/82",
        "G06V20/20",
        "G06V40/166",
        "G06V40/172",
        "G06F2203/012",
        "G06K9/6256",
        "G06N7/005"
    ],
    "abstract": "A head-mounted augmented reality (AR) device can include a hardware processor programmed to receive different types of sensor data from a plurality of sensors (e.g., an inertial measurement unit, an outward-facing camera, a depth sensing camera, an eye imaging camera, or a microphone); and determining an event of a plurality of events using the different types of sensor data and a hydra neural network (e.g., face recognition, visual search, gesture identification, semantic segmentation, object detection, lighting detection, simultaneous localization and mapping, relocalization).",
    "claims": "\n1. A system comprising:\nnon-transitory computer-readable memory storing executable instructions; and\none or more processors programmed by the executable instructions to at least:\ntrain a neural network based on a training set comprising a plurality of sensor data as input data and a plurality of corresponding types of events as output data;\nwherein the neural network comprises:\nan input layer for receiving input of the neural network,\na plurality of intermediate layers including a first intermediate layer of the plurality of intermediate layers coupled to the input layer, and\na plurality of head components including a head output node coupled to a last intermediate layer of the plurality of intermediate layers through a plurality of head component layers.\n2. The system of claim 1, wherein the neural network is configured to detect events based on the sensor data.\n3. The system of claim 2, wherein the events comprise one or more of: face recognition, visual search, gesture identification, semantic segmentation, object detection, lighting detection, simultaneous localization and mapping, or relocalization.\n4. The system of claim 1, wherein the plurality of intermediate layers comprises a plurality of lower layers and a plurality of middle layers,\nwherein the plurality of lower layers is trained to extract lower level features from the sensor data, and\nwherein the plurality of middle layers is trained to extract higher level features from the lower level features extracted.\n5. The system of claim 1, wherein the plurality of intermediate layers or the plurality of head component layers comprises one or more of: a convolution layer, a brightness normalization layer, a batch normalization layer, a rectified linear layer, an upsampling layer, a pooling layer, a concatenation layer, a fully connected layer, a linear fully connected layer, a softsign layer, or a recurrent layer.\n6. The system of claim 1, wherein the plurality of sensor data is received from a plurality of different types of sensors.\n7. The system of claim 6, wherein the plurality of different types of sensors include one or more of: an inertial measurement unit, a depth sensing camera, a microphone, or an eye imaging camera.\n8. The system of claim 4, wherein the plurality of middle layers or the plurality of head component layers comprises a pooling layer.\n9. The system of claim 1, wherein the one or more processors is further programmed by the executable instructions to at least:\nretrain the neural network based on a second training set comprising a second plurality of sensor data;\nwherein a second head component of the plurality of head components comprises a second head output node for outputting results associated with a second different type of event, and\nwherein the head output node is connected to the last intermediate layer through a plurality of second head component layers.\n10. The system of claim 9, wherein said retraining the neural network comprises updating weights associated with the plurality of second head component layers.\n11. The system of claim 9, wherein the neural network is retrained without updating weights associated with the plurality of intermediate layers.\n12. The system of claim 9, wherein the second plurality of sensor data is of a second type different than a first type of the sensor data used in training the neural network.\n13. A computerized method, performed by a computing system having one or more hardware computer processors and one or more non-transitory computer readable storage device storing software instructions executable by the computing system to perform the computerized method comprising:\ntraining a neural network based on a training set comprising a plurality of sensor data as input data and a plurality of corresponding types of events as output data;\nwherein the neural network comprises:\nan input layer for receiving input of the neural network,\na plurality of intermediate layers including a first intermediate layer of the plurality of intermediate layers coupled to the input layer, and\na plurality of head components including a head output node coupled to a last intermediate layer of the plurality of intermediate layers through a plurality of head component layers.\n14. The computerized method of claim 13, wherein the neural network is configured to detect events based on the sensor data.\n15. The computerized method of claim 14, wherein the events comprise one or more of: face recognition, visual search, gesture identification, semantic segmentation, object detection, lighting detection, simultaneous localization and mapping, or relocalization.\n16. The computerized method of claim 13, wherein the plurality of intermediate layers comprises a plurality of lower layers and a plurality of middle layers,\nwherein the plurality of lower layers is trained to extract lower level features from the sensor data, and\nwherein the plurality of middle layers is trained to extract higher level features from the lower level features extracted.\n17. The computerized method of claim 13, wherein the plurality of intermediate layers or the plurality of head component layers comprises one or more of: a convolution layer, a brightness normalization layer, a batch normalization layer, a rectified linear layer, an upsampling layer, a pooling layer, a concatenation layer, a fully connected layer, a linear fully connected layer, a softsign layer, or a recurrent layer.\n18. The computerized method of claim 13, wherein the plurality of sensor data is received from a plurality of different types of sensors.\n19. The computerized method of claim 18, wherein the plurality of different types of sensors include one or more of: an inertial measurement unit, a depth sensing camera, a microphone, or an eye imaging camera.\n20. The computerized method of claim 16, wherein the plurality of middle layers or the plurality of head component layers comprises a pooling layer.",
    "status": "Active",
    "citations_own": [
        "US5291560A",
        "US5583795A",
        "US20040130680A1",
        "US6850221B1",
        "US20060028436A1",
        "US20060088193A1",
        "US20060147094A1",
        "US20070081123A1",
        "US20070140531A1",
        "US7771049B2",
        "US7970179B2",
        "US20110182469A1",
        "US8098891B2",
        "US20120127062A1",
        "US20120162549A1",
        "US20120163678A1",
        "US8341100B2",
        "US8363783B2",
        "US20130083018A1",
        "WO2013049248A2",
        "US20130082922A1",
        "US20130117377A1",
        "US20130125027A1",
        "US20130208234A1",
        "US20130242262A1",
        "US20140071539A1",
        "US20140177023A1",
        "US20140279774A1",
        "US20140270405A1",
        "US20140267420A1",
        "US8845625B2",
        "US20140306866A1",
        "WO2014182769A1",
        "US20140380249A1",
        "US20150016777A1",
        "US8950867B2",
        "US20150103306A1",
        "US20150117760A1",
        "US20150125049A1",
        "US20150134583A1",
        "US20150170002A1",
        "US20150178939A1",
        "US20150205126A1",
        "US20150222884A1",
        "US20150222883A1",
        "US9141916B1",
        "US20150268415A1",
        "US20150278642A1",
        "US20150302652A1",
        "WO2015164807A1",
        "US20150326570A1",
        "US20150346495A1",
        "US20150346490A1",
        "US20160011419A1",
        "US20160026253A1",
        "US20160034811A1",
        "US20160035078A1",
        "US9262680B2",
        "US20160098844A1",
        "US9310559B2",
        "US20160104053A1",
        "US20160104056A1",
        "US20160135675A1",
        "USD758367S1",
        "US20160162782A1",
        "US9430829B2",
        "US20170053165A1",
        "US20180018451A1",
        "US20180018515A1",
        "US20180053056A1",
        "US20180082172A1"
    ],
    "citations_ftf": [
        "WO2004034905A1",
        "JP2007122362A",
        "US20210001862A1",
        "CN102306088A",
        "JP6083251B2",
        "US10295826B2",
        "US20150130799A1",
        "US10417824B2",
        "EP4206870A1",
        "US9418458B2",
        "TR201902908T4",
        "CN105654037B"
    ],
    "citedby_own": [
        "US11797078B2",
        "US11797127B1"
    ],
    "citedby_ftf": [
        "WO2018013200A1",
        "WO2018021071A1",
        "CA3036709A1",
        "CA3043352A1",
        "AU2017370555B2",
        "US10746815B2",
        "US11347054B2",
        "US11308391B2",
        "CA3055597A1",
        "US10762635B2",
        "US10908680B1",
        "KR102368661B1",
        "US10552979B2",
        "US10268205B2",
        "US10671083B2",
        "CN111033524A",
        "FR3072469B1",
        "US10614574B2",
        "US10996742B2",
        "AU2018354257A1",
        "AU2018369757B2",
        "US10514545B2",
        "GB2569603B",
        "KR20200096901A",
        "US10740876B1",
        "KR102395445B1",
        "KR102094953B1",
        "US11119624B2",
        "CN108921893B",
        "EP3794555A4",
        "GB2574372B",
        "US20190362235A1",
        "US10636190B2",
        "US11677796B2",
        "WO2019246613A1",
        "CN108958716A",
        "US10867164B2",
        "US10948297B2",
        "US10754419B2",
        "JP2021530790A",
        "US10943115B2",
        "US10783713B2",
        "JP7365402B2",
        "KR102559203B1",
        "CN109240510A",
        "US10915793B2",
        "EP3881125A4",
        "US10854006B2",
        "CN109685802B",
        "JP2022516074A",
        "CN109858524B",
        "FR3092426B1",
        "US10424048B1",
        "US11009698B2",
        "CN109919128B",
        "US11205112B2",
        "DE102020109121A1",
        "WO2020204939A1",
        "KR102148382B1",
        "US11044462B2",
        "CN110223351B",
        "US11719850B2",
        "US11099641B2",
        "TWI773907B",
        "US11763191B2",
        "US10989916B2",
        "CN110717866B",
        "CN110530356B",
        "CN110602709B",
        "CN110686906B",
        "JP2022505999A",
        "JP7150894B2",
        "CN114830182A",
        "CN110737339B",
        "SG10201910949PA",
        "US20210157394A1",
        "KR102260393B1",
        "CN113031753A",
        "CN111209915B",
        "CN111222468A",
        "CN111330255B",
        "CN111325097B",
        "CN111273777A",
        "US20210256174A1",
        "GB2588470B",
        "US11263818B2",
        "WO2021190280A1",
        "WO2021194487A1",
        "US11314950B2",
        "KR102331172B1",
        "WO2021207162A1",
        "US10996753B1",
        "CN111461251A",
        "KR20210128269A",
        "EP4143739A4",
        "EP4162343A1",
        "CN111881735B",
        "WO2021260694A1",
        "US20210405739A1",
        "CN111935396A",
        "US20230290132A1",
        "CN111896221B",
        "CN111914753A",
        "US11320896B2",
        "US11727719B2",
        "US11113894B1",
        "US11353700B2",
        "WO2022093265A1",
        "CN112433193B",
        "WO2022119759A1",
        "CN112464958A",
        "CN112561978A",
        "CN112702522B",
        "CN113469041A",
        "CN113793389A",
        "US11763496B2",
        "US11417069B1",
        "WO2023096916A1",
        "US20230241491A1",
        "US11776206B1",
        "KR102585261B1"
    ]
}