{
    "patent_id": "US-2019318405-A1",
    "title": "Product identification in image with multiple products ",
    "assignee": "Microsoft Technology Licensing , LLC",
    "publication_date": "2019-10-17",
    "patent_link": "https://patents.google.com/patent/US20190318405A1/en",
    "inventors": [
        "Houdong Hu",
        "Li Huang"
    ],
    "classifications": [
        "G06Q30/0625",
        "G06F16/53",
        "G06F16/532",
        "G06F16/55",
        "G06F17/30277",
        "G06F18/24",
        "G06F3/0482",
        "G06F3/04842",
        "G06K9/6267",
        "G06K9/66",
        "G06N20/00",
        "G06N3/045",
        "G06N3/08",
        "G06N3/084",
        "G06N99/005",
        "G06Q30/0641",
        "G06Q30/0643",
        "G06V10/82",
        "G06V20/00",
        "G06V30/19173",
        "G06N20/10",
        "G06N20/20",
        "G06N3/044",
        "G06N3/048",
        "G06N5/01",
        "G06N5/022",
        "G06N5/041",
        "G06N7/01"
    ],
    "abstract": "Methods, systems, and computer programs are presented for identifying the brand and model of products embedded within an image. One method includes operations for receiving, via a graphical user interface (GUI), a selection of an image, and for analyzing the image to determine a location within the image of one or more products. For each product in the image, determining a unique identification of the product is determined, the unique identification including a manufacturer of the product and a model identifier. The method further includes an operation for presenting information about the one or more products in the GUI with a selection option for selecting each of the one or more products. Additionally, the method includes operations for receiving a product selection for one of the one or more products, and presenting shopping options in the GUI for purchasing the selected product.",
    "claims": "\n1. A method comprising:\nreceiving, via a graphical user interface (GUI), a selection of an image;\nanalyzing, by one or more processors, the image to determine a location within the image of one or more products;\nfor each product in the image, determining, by the one or more processors, a unique identification of the product that includes a manufacturer of the product and a model identifier;\npresenting, by the one or more processors, information about the one or more products in the GUI with a selection option for selecting each of the one or more products;\nreceiving, by the one or more processors, a product selection for one of the one or more products; and\npresenting, by the one or more processors, shopping options in the GUI for purchasing the selected product.\n2. The method as recited in claim 1, wherein determining the unique identification of the product further includes:\nutilizing a machine-learning classifier for visually recognizing image data associated with the product.\n3. The method as recited in claim 2, wherein the machine-learning classifier is trained with labeled data, the labeled data including one or more of information from a vendor's database, a product database, or information gathered from a shopping website.\n4. The method as recited in claim 1, wherein determining the unique identification of the product further includes:\nutilizing a first neural network classifier to determine a category of the product; and\nutilizing a second neural network classifier with bi-linear pooling for visually recognizing image data associated with the product based on the category, the bi-linear pooling including two feature extractors whose outputs are combined to obtain an image descriptor.\n5. The method as recited in claim 1, wherein determining the unique identification of the product further includes:\nperforming an image search of image data associated with the product, the image search producing a plurality of results; and\ndetermining the unique identification of the product based on a plurality of top results from the plurality of results.\n6. The method as recited in claim 5, wherein determining the unique identification of the product based on a plurality of top results further includes:\ndetermining the plurality of top results as a predetermined number of results having a highest probability of being a match for the product; and\nusing the plurality of top results as votes to determine a product with a highest number of matches within the top results.\n7. The method as recited in claim 1, wherein analyzing the image to determine the location within the image of the one or more products further includes:\nidentifying a bounding box within the image for each of the one or more products.\n8. The method as recited in claim 1, wherein presenting information about the one or more products in the GUI further includes:\npresenting a model number next to each of the one or more products; and\npresenting, for each of the one or more products, a bounding box within the image.\n9. The method as recited in claim 1, wherein analyzing the image to determine the location within the image of one or more products further includes:\ntraining a machine-learning program to generate feature maps for feature extraction, object detection, and object classification.\n10. The method as recited in claim 1, wherein presenting the shopping options further includes:\npresenting, for each shopping option, one or more of a shopping website link, a shopping website link, and a price for the product.\n11. A system comprising:\na memory comprising instructions; and\none or more computer processors, wherein the instructions, when executed by the one or more computer processors, cause the one or more computer processors to perform operations comprising:\nreceiving, via a graphical user interface (GUI), a selection of an image;\nanalyzing the image to determine a location within the image of one or more products;\nfor each product in the image, determining a unique identification of the product that includes a manufacturer of the product and a model identifier;\npresenting information about the one or more products in the GUI with a selection option for selecting each of the one or more products;\nreceiving a product selection for one of the one or more products; and\npresenting shopping options in the GUI for purchasing the selected product.\n12. The system as recited in claim 11, wherein determining the unique identification of the product further includes:\nutilizing a machine-learning classifier for visually recognizing image data associated with the product, wherein the machine-learning classifier is trained with labeled data, the labeled data including one or more of information from a vendor's database, a product database, or information gathered from a shopping website.\n13. The system as recited in claim 11, wherein determining the unique identification of the product further includes:\nutilizing neural network classifiers with bi-linear pooling for visually recognizing image data associated with the product, the bi-linear pooling including two feature extractors whose outputs are combined to obtain an image descriptor.\n14. The system as recited in claim 11, wherein determining the unique identification of the product further includes:\nperforming an image search of image data associated with the product, the image search producing a plurality of results; and\ndetermining the unique identification of the product based on a plurality of top results from the plurality of results.\n15. The system as recited in claim 14, wherein determining the unique identification of the product based on a plurality of top results further includes:\ndetermining the plurality of top results as a predetermined number of results having a highest probability of being a match for the product; and\nusing the plurality of top results as votes to determine a product with a highest number of matches within the top results.\n16. A non-transitory machine-readable storage medium including instructions that, when executed by a machine, cause the machine to perform operations comprising:\nreceiving, via a graphical user interface (GUI), a selection of an image;\nanalyzing the image to determine a location within the image of one or more products;\nfor each product in the image, determining a unique identification of the product that includes a manufacturer of the product and a model identifier;\npresenting information about the one or more products in the GUI with a selection option for selecting each of the one or more products;\nreceiving a product selection for one of the one or more products; and\npresenting shopping options in the GUI for purchasing the selected product.\n17. The non-transitory machine-readable storage medium as recited in claim 16, wherein determining the unique identification of the product further includes:\nutilizing a machine-learning classifier for visually recognizing image data associated with the product, wherein the machine-learning classifier is trained with labeled data, the labeled data including one or more of information from a vendor's database, a product database, or information gathered from a shopping website.\n18. The non-transitory machine-readable storage medium as recited in claim 16, wherein determining the unique identification of the product further includes:\nutilizing neural network classifiers with bi-linear pooling for visually recognizing image data associated with the product, the bi-linear pooling including two feature extractors whose outputs are combined to obtain an image descriptor.\n19. The non-transitory machine-readable storage medium as recited in claim 16, wherein determining the unique identification of the product further includes:\nperforming an image search of image data associated with the product, the image search producing a plurality of results; and\ndetermining the unique identification of the product based on a plurality of top results from the plurality of results.\n20. The non-transitory machine-readable storage medium as recited in claim 19, wherein determining the unique identification of the product based on a plurality of top results further includes:\ndetermining the plurality of top results as a predetermined number of results having a highest probability of being a match for the product; and\nusing the plurality of top results as votes to determine a product with a highest number of matches within the top results.",
    "status": "Active",
    "citations_own": [
        "US20150235389A1",
        "US20160042250A1",
        "US20180107902A1",
        "US20190080207A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20190362233A1",
        "CN111259893A",
        "US10776626B1",
        "US10824915B2",
        "CN111914107A",
        "US10853700B2",
        "CN112016617A",
        "CN112052876A",
        "US20210011945A1",
        "CN112328819A",
        "US20210149886A1",
        "US11030763B1",
        "US11036724B2",
        "US11049176B1",
        "WO2021150939A1",
        "US20210232770A1",
        "US11080492B2",
        "US20210264149A1",
        "US11120073B2",
        "US11182408B2",
        "US11195227B2",
        "US11205211B2",
        "US20220004894A1",
        "WO2022006293A1",
        "US11263677B2",
        "US11335087B2",
        "US11361526B2",
        "NL2027356B1",
        "US20220237417A1",
        "US11403285B2",
        "US20220261856A1",
        "US20220300550A1",
        "US11461393B1",
        "US20220342939A1",
        "US11589124B1",
        "WO2023031790A1",
        "US11605176B2",
        "US11776047B1",
        "US11816153B1"
    ],
    "citedby_ftf": [
        "US10949799B2",
        "US20200065706A1",
        "JP7287823B2",
        "US11599572B2",
        "US11727463B2"
    ]
}