{
    "patent_link": "https://patents.google.com/patent/US6327345B1/en",
    "patent_id": "US6327345B1",
    "title": "Method and system therefor of establishing an acceptance threshold for controlling fraudulent telephone calls",
    "abstract": "The present invention advanced voice application system takes advantage of information, or attributes, built into a telecommunications network to determine the risk that a call is a fraudulent call in a voice recognition and verification system. To achieve this end, information relating to the telecommunications network are stored in a database as various risk factors. Thus, depending on the type of risk factors associated with a particular call, the risk assigned to that call can be raised or lowered so that the network would not reject a valid caller even though the voice pattern of the caller does not match exactly with the prestored enrolled voice print of the caller. Such risk assessment allows the management of the network to tighten the security of the system without overburdening the caller with questions and also permits calls to be completed for valid subscribers that otherwise would have been rejected. Past calling history may be added to the database as it relates to the different risk factors so that constantly updated risk factors may be used for further assessing whether a call is to be completed.",
    "inventors": [
        "David P. Jordan"
    ],
    "assignee": "Verizon Patent and Licensing Inc",
    "classifications": [
        "H04M15/47",
        "H04M3/38",
        "H04M3/42",
        "H04M2201/40",
        "H04M2201/41",
        "H04M2203/6027",
        "H04M2215/0148",
        "H04M3/2218",
        "H04M3/382",
        "H04M3/385",
        "H04M7/00"
    ],
    "claims": "\n1. A method of controlling fraudulent telephone calls in a telecommunications network, comprising:\n2. The method of claim 1, wherein said matching is performed using a matching threshold, the matching threshold not being a function of any risk factor associated with the telephone call.\n3. The method of claim 1, wherein said matching is performed using a matching threshold, the matching threshold being predetermined with respect to all callers.\n4. The method of claim 1, wherein said matching is performed using a single matching threshold.\n5. The method of claim 1, wherein the at least one risk factor is further associated with a plurality of callers.\n6. The method of claim 1, wherein the at least one risk factor is further associated with at least one prior telephone call placed by the authentic caller.\n7. The method of claim 1, wherein the at least one risk factor comprises a destination to which the telephone call is placed.\n8. The method of claim 1, wherein the at least one risk factor comprises a location from which the telephone call is placed.\n9. The method of claim 1, further comprising:\n10. The method of claim 1, further comprising:\n11. The method of claim 10, wherein said receiving is performed via at least one of: (i) a voice response received from the caller, (ii) a DTMF tone received from the caller, and (ii) an operator station associated with the telecommunications network.\n12. A method of controlling fraudulent telephone calls in a telecommunications network, comprising:\n13. A system to control fraudulent telephone calls in a telecommunications network, comprising:",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4756020A",
        "US4799255A",
        "US4935956A",
        "US5163083A",
        "US5181238A",
        "US5222120A",
        "US5265191A",
        "US5274695A",
        "US5297194A",
        "US5311594A",
        "US5315649A",
        "US5325421A",
        "US5345595A",
        "US5365574A",
        "US5365580A",
        "US5414755A",
        "US5465290A",
        "US5502759A",
        "US5517558A",
        "US5623539A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6570968B1",
        "US20030187655A1",
        "US20030185361A1",
        "US20030229499A1",
        "US6694001B1",
        "US6754320B2",
        "US20040190688A1",
        "GB2407681A",
        "US20050185779A1",
        "US7042992B1",
        "US20070172049A1",
        "US20070263812A1",
        "US20080095347A1",
        "US20080221887A1",
        "US20090052636A1",
        "US20090228383A1",
        "US7860226B1",
        "US8180028B1",
        "US8903052B2",
        "US9053711B1",
        "US20170006155A1",
        "US9641680B1",
        "US9686402B2",
        "US9876900B2",
        "US10796392B1"
    ],
    "citedby_ftf": [
        "US5937043A",
        "GB2321364A",
        "GB2321363A",
        "GB2321362A",
        "US6157707A",
        "DE19841166A1",
        "DE10032756A1",
        "US6556669B2",
        "CN106302935B"
    ]
}