{
    "patent_id": "US-2013325787-A1",
    "title": "Temporal Predictive Analytics ",
    "assignee": "Intelligent Software Solutions, Inc.",
    "publication_date": "2013-12-05",
    "patent_link": "https://patents.google.com/patent/US20130325787A1/en",
    "inventors": [
        "Mark Gerken",
        "Rick Pavlik",
        "Kevin Daly"
    ],
    "classifications": [
        "G06N5/048",
        "G06N7/01"
    ],
    "abstract": "A fuzzy complex event processing (CEP) system successfully processing noisy, incomplete, multi-source data in support of near real-time decision-making. The fuzzy CEP solution of the present invention supports decision-making by identifying and exploiting patterns hidden in complex data and can operate in a forensic mode against historical data, near real-time mode for proactive decision-making, or any combination thereof. Fusion algorithms and techniques are applied to observation data that may only partially satisfy an event description in time, space, or other relevant dimensions. Using context propagation, Bayesian reasoning, and spatiotemporal analysis, the present invention provides both predictive awareness of upcoming events and likelihood analysis for events that may have already occurred, but were not evident in the collected data, while at the same time minimizing false detections.",
    "claims": "\n1. A system for temporal predictive analytics, comprising:\nan event activity pattern wherein the event activity pattern includes one or more precursory events associated with an initial inquiry; and\nan evidence description for each of the one or more precursory events wherein each evidence description includes one or more evidentiary conditions collectively forming an assessment as to a likelihood that the precursory event has been observed and wherein each of the one or more evidentiary conditions includes a measure of confidence.\n2. The system for temporal predictive analytics according to claim 1, wherein the assessment of the likelihood that the precursory event has been observed is based on a fuzzy logic combination of the measure of confidence of each evidentiary condition.\n3. The system for temporal predictive analytics according to claim 1, wherein the measure of confidence includes sensor accuracy.\n4. The system for temporal predictive analytics according to claim 1, wherein the measure of confidence includes data extraction accuracy.\n5. The system for temporal predictive analytics according to claim 1, wherein the measure of confidence includes information decay.\n6. The system for temporal predictive analytics according to claim 5, wherein information decay includes an asserted confidence.\n7. The system for temporal predictive analytics according to claim 5, wherein information decay includes a computed decayed confidence.\n8. The system for temporal predictive analytics according to claim 1, wherein the assessment of the likelihood that the precursory event has been observed includes discovery of implicit information from existing uncertain data.\n9. The system for temporal predictive analytics according to claim 1, wherein the evidence description includes one or more temporal conditions.\n10. The system for temporal predictive analytics according to claim 9, wherein the one or more temporal conditions are fuzzy temporal constraints.\n11. The system for temporal predictive analytics according to claim 10, wherein the assessment of the likelihood that the precursory event has been observed is based on a combination of a measure of confidence of each evidentiary condition and each fuzzy temporal constraint.\n12. The system for temporal predictive analytics according to claim 1, wherein the assessment of the likelihood that each precursory event has been observed is combined with Bayesian reasoning to propagate probabilities for yet-to-be observed precursory events in the event activity model.\n13. The system for temporal predictive analytics according to claim 1, wherein the event activity pattern includes context propagation.\n14. A method for temporal predictive analytics, comprising:\nforming an event activity pattern wherein the event activity pattern includes one or more precursory events associated with an initial inquiry;\ndescribing, for each of the one or more precursory events, one or more evidentiary conditions collectively wherein each of the one or more evidentiary conditions includes when available a measure of confidence; and\nforming an assessment as to a likelihood that the precursory event has been observed.\n15. The method for temporal predictive analytics according to claim 14, wherein describing includes autonomously identifying the one or more evidentiary conditions from among a collection of possible forensic explanations of the one or more precursory event.\n16. The method for temporal predictive analytics according to claim 14, further comprising combining the measure of confidence of the one or more evidentiary conditions based on fuzzy logic to arrive at the assessment as to the likelihood that the precursory event has been observed.\n17. The method for temporal predictive analytics according to claim 14, further comprising propagating probabilities to yet-to-be observed precursory events using Bayesian reasoning.\n18. The method for temporal predictive analytics according to claim 14, further comprising referencing variables in a precursory event whose value has been established by a preceding precursory event.\n19. The method for temporal predictive analytics according to claim 14, wherein describing includes, for each of the one or more precursory events, one or more fuzzy temporal constraints.\n20. The method for temporal predictive analytics according to claim 19, wherein the assessment of the likelihood that the precursory event has been observed is based on a combination of a measure of confidence of each evidentiary condition and each fuzzy temporal, spatial, entity or entity relationship constraint.\n21. The method for temporal predictive analytics according to claim 14 wherein diverse data sets can be mined for predictive indicators that are integrated into the event activity pattern using statistical and/or temporal correlations between those discovered events.\n22. The method for temporal predictive analytics according to claim 14 wherein forming includes mining diverse data sets for predictive indicators that are assembled into the event activity pattern using statistical and/or temporal correlations between those discovered events.\n23. A computer-readable storage medium tangibly embodying a program of instructions executable by a machine wherein said program of instruction comprises a plurality of program codes for temporal predictive analytics, said program of instruction comprising:\nprogram code for forming an event activity pattern wherein the event activity pattern includes one or more precursory events associated with an initial inquiry;\nprogram code for describing, for each of the one or more precursory events, one or more evidentiary conditions collectively wherein each of the one or more evidentiary conditions includes a measure of confidence; and\nprogram code for forming an assessment as to a likelihood that the precursory event has been observed.\n24. The computer-readable storage medium of claim 23, tangibly embodying a program of instructions, further comprising program code for combining the measure of confidence of the one or more evidentiary conditions based on fuzzy logic to arrive at the assessment as to the likelihood that the precursory event has been observed.\n25. The computer-readable storage medium of claim 23, tangibly embodying a program of instructions, further comprising program code for propagating probabilities to yet-to-be observed precursory events using Bayesian reasoning.\n26. The computer-readable storage medium of claim 23, tangibly embodying a program of instructions, further comprising program code for referencing variables in a precursory event whose value has been established by a preceding precursory event.\n27. The computer-readable storage medium of claim 23, tangibly embodying a program of instructions, wherein the program code for describing includes, for each of the one or more precursory events, one or more fuzzy temporal constraints.\n28. The computer-readable storage medium of claim 27, tangibly embodying a program of instructions, wherein the assessment of the likelihood that the precursory event has been observed is based on a combination of a measure of confidence of each evidentiary condition and each fuzzy temporal constraint.",
    "status": "Abandoned",
    "citations_own": [
        "US20050049986A1",
        "US20070255529A1",
        "US20070260569A1",
        "US20090106701A1",
        "US20090210364A1",
        "US20090271468A1",
        "US20090287628A1",
        "US20110004446A1",
        "US20110270797A1",
        "US20110288692A1"
    ],
    "citations_ftf": [
        "US20110238603A1"
    ],
    "citedby_own": [
        "US20130339375A1",
        "US20150088739A1",
        "US20150199381A1",
        "US20150286709A1",
        "WO2015192090A1",
        "US20150379061A1",
        "US20160034323A1",
        "WO2016043813A1",
        "US9330416B1",
        "US20160299223A1",
        "US20160378980A1",
        "US20170032262A1",
        "US9588961B2",
        "US9632846B2",
        "US9665564B2",
        "US9715488B2",
        "CN107077476A",
        "US20170351754A1",
        "US9904960B2",
        "AU2017265059A1",
        "CN108961199A",
        "US10157345B2",
        "US20180374060A1",
        "US20190012606A1",
        "US10346446B2",
        "CN110109968A",
        "US10552746B2",
        "US10565512B2",
        "US10748071B2",
        "US10839298B2",
        "US10938817B2",
        "US11036718B2",
        "US20210216907A1",
        "US20210224701A1",
        "US11126478B2",
        "US20210312307A1",
        "US20210334312A1",
        "US20210377240A1",
        "US11205086B2",
        "US11233804B2",
        "US11281980B2",
        "US11455298B2",
        "CN115469785A",
        "US11698907B2"
    ],
    "citedby_ftf": []
}