{
    "patent_link": "https://patents.google.com/patent/US6377579B1/en",
    "patent_id": "US6377579B1",
    "title": "Interconnecting a synchronous switching network that utilizes a common time reference with an asynchronous switching network",
    "abstract": "This invention describes a method for exchanging timing messages and data packets between switches of a network with a common time reference, and between end stations and switches of such a network, over an asynchronous sub-network. The method entails transmission of messages conveying the common time reference, and data packets that are sent responsive to the timing information and predetermined scheduled time intervals. The switches of the network maintain a common time reference, which is obtained either from an external source (such as GPS-Global Positioning System) or is generated and distributed internally. The time intervals are arranged in simple periodicity and complex periodicity (like seconds and minutes of a clock).",
    "inventors": [
        "Yoram Ofek"
    ],
    "assignee": "Synchrodyne Networks Inc",
    "classifications": [
        "H04L47/28",
        "H04L12/6418",
        "H04L47/10",
        "H04L47/22",
        "H04L9/40",
        "H04J2203/0082",
        "H04J2203/0083",
        "H04J3/0644",
        "H04J3/0685",
        "H04L69/28"
    ],
    "claims": "\n1. A system for transferring data packets from at least one end-station to a data communications network, the system comprising:\n2. The system as in claim 1, wherein the delay analysis and scheduling controller computes the delay in time frames that each of the data packets should be delayed before being forwarded out of the output port of the respective synchronous virtual pipe switch.\n3. The system as in claim 1, wherein a time-stamp value is attached to each said data packet when it is forwarded by the end-station;\n4. The system as in claim 3, wherein the common time reference is transferred into the end-station by a timing message carried in a data packet from the synchronous virtual pipe switch.\n5. The system as in claim 3, wherein the common time reference is coupled directly to the end-station.\n6. The system as in claim 3, wherein the common time reference is transferred to the end-station by a timing message carried in a data packet from a timing server.\n7. The system as in claim 1, wherein each of the time intervals is comprised of a fixed number of contiguous time frames comprising a time cycle.\n8. The system as in claim 7, wherein the time cycles are contiguous.\n9. The system as in claim 8, wherein a fixed number of a plurality of contiguous ones of the time cycles comprise a super cycle;\n10. The system as in claim 1, wherein the common time reference signal coupled to each of the synchronous virtual pipe switches comes from a GPS (Global Positioning System).\n11. The system as in claim 1, wherein the common time reference signal coupled to each of the synchronous virtual pipe switches conforms to the UTC (Coordinated Universal Time) standard.\n12. The system as in claim 11, wherein the super cycle duration is equal to one second as measured using the UTC (Coordinated Universal Time) standard.\n13. The system as in claim 11, wherein the super cycle duration is equal to a predefined number of seconds as measured using the UTC (Coordinated Universal Time) standard.\n14. The system as in claim 11, wherein the super cycle duration is equal to a predefined fraction of a second measured using the UTC (Coordinated Universal Time) standard.\n15. The system as in claim 1, wherein the communication links are wireless communication links.\n16. The system as in claim 1, wherein the communication links are wireless communication links from a ground station to a satellite.\n17. As the system in claim 1, wherein the communication links are wireless communication links between two satellites orbiting the earth.\n18. The system as in claim 2, wherein the position of said data packet within said time frame is arbitrary.\n19. A system for transferring data packets, each having a pipe identification (PID) field, through a data communications network, the system comprising:\n20. The system as in claim 19, wherein the delay analysis and scheduling controller, responsive to the TOA, computes the delay in time frames that the data packet should be delayed before being forwarded out of the output port of the synchronous virtual pipe switch.\n21. The system as in claim 19, wherein a time-stamp value is attached to each said data packet when it is forwarded by the end-station;\n22. The system as in claim 19, wherein the predefined interval is comprised of a fixed number of contiguous time frames comprising a time cycle.\n23. The system as in claim 22, wherein the time cycles are contiguous.\n24. The system as in claim 23, wherein a fixed number of a plurality of contiguous ones of the time cycles comprise a super cycle;\n25. The system as in claim 20, wherein the position of said data packet within said time frame is arbitrary.\n26. The system as in claim 19, wherein the PID field is at least one of Internet protocol (IP) address, Internet protocol group multicast address, an asynchronous transfer mode (ATM), a virtual circuit identifier (VCI), a virtual path identifier (VPI), user in combination as VCI/VPI, and Internet protocol (IP) address together with IP port number.\n27. A system for transferring data packets from at least one end-station to a data communications network, the system comprising:\n28. The system as in claim 27, wherein there are a plurality of asynchronous switches, wherein the end-station is connected to the asynchronous to synchronous gateway through the plurality of asynchronous switches.\n29. The system as in claim 27, wherein the delay analysis and scheduling controller computes the delay in time frames that the respective data packet is to be delayed before being forwarded out of the respective output port of the asynchronous to synchronous gateway.\n30. The system as in claim 29, wherein the position of said data packet within said time frame is arbitrary.\n31. The system as in claim 27, wherein a time-stamp is attached to each said data packet when it is forwarded by the end-station;\n32. The system as in claim 31, wherein the common time reference is transferred to the end-station by a timing message carried in a data packet from the asynchronous to synchronous gateway.\n33. The system as in claim 31, wherein the common time reference is coupled directly to the end-station.\n34. The system as in claim 31, wherein the common time reference is transferred to the end-station by a timing message carried in a data packet from a timing server.\n35. A system for transferring data packets from at least one end-station to a data communications network, the system comprising:\n36. The system as in claim 35, wherein the are a plurality of asynchronous switches, and wherein the connection of the end station to the synchronous switch is through a plurality of the asynchronous switches.\n37. The system as in claim 35, wherein the delay analysis and scheduling controller computes the delay in time frames that the data packet is to be delayed before being forwarded out of the respective output port of the synchronous virtual pipe switch.\n38. The system as in claim 37, wherein the position of said data packet within said time frame is arbitrary.\n39. The system as in claim 35, wherein a time-stamp value is attached to each said data packet when it is forwarded by the end-station;\n40. The system as in claim 39, wherein the common time reference is transferred to the end-station by a timing message carried in a data packet from the synchronous virtual pipe switch.\n41. The system as in claim 39, wherein the common time reference is coupled directly to the end-station.\n42. The system as in claim 39, wherein the common time reference is transferred to the end-station by a timing message carried in a data packet from a timing server.\n43. The system as in claim 35, wherein the delay and analysis scheduling controller is responsive to the reception of a respective one of the data packets received from the switching fabric, and assigns a first feasible time frame from a plurality of predefined time frames, for transferring said respective data packet out from the respective one of said synchronous virtual pipe switches, responsive to the respective time of arrival, and the unique address of the input port of the synchronous virtual pipe switch.\n44. The system as in claim 43, wherein each of the data packets has a PID field, wherein the delay analysis and scheduling controller is responsive to the respective PID field.\n45. The system as in claim 37, wherein the first feasible time frame is the first time frame with transmission capacity for forwarding said data packet.\n46. The system as in claim 35, wherein the random access memory is partitioned into k+1 buffers;\n47. The system as in claim 35, wherein in each of the k time frames of the time cycle, the select buffer controller enables forwarding of respective ones of the data packets from the corresponding respective ones of the k buffers;\n48. The system as in claim 35, wherein the random access memory is partitioned into (l times k)+1 buffers;\n49. The system as in claim 35, wherein in each of the (l times k) time frames of the super cycle, the select buffer controller forwarded data packets from the corresponding one of the (l times k) buffers;",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4821259A",
        "US5293570A",
        "US5390184A",
        "US5392280A",
        "US5418779A",
        "US5442636A",
        "US5455701A",
        "US5623491A",
        "US5623483A",
        "US6038230A",
        "US6246701B1",
        "US6259695B1",
        "US6272109B1",
        "US6272132B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20020080828A1",
        "US20020186716A1",
        "US20030131121A1",
        "US20030189922A1",
        "US20030214964A1",
        "US6674754B1",
        "US6678264B1",
        "US20040028080A1",
        "US20040052209A1",
        "US6747986B1",
        "US6754210B1",
        "US20040151209A1",
        "US6775280B1",
        "US20040213247A1",
        "US20040240428A1",
        "US20050058083A1",
        "US20050086362A1",
        "US20050094642A1",
        "US20050111357A1",
        "US20050182856A1",
        "US20050220114A1",
        "US20050271071A1",
        "US20060007871A1",
        "US20060077981A1",
        "US20060168380A1",
        "US7114000B1",
        "US7136577B1",
        "US20060271704A1",
        "US20070071026A1",
        "US20070121680A1",
        "US7251246B2",
        "US7283516B1",
        "US7289538B1",
        "US20080022014A1",
        "US7366163B1",
        "US7426206B1",
        "US7508923B1",
        "US7567555B1",
        "US8009666B2",
        "US8165113B1",
        "US8315518B1",
        "US8595478B2",
        "US9015302B2",
        "US9210674B2",
        "US9509507B1",
        "US20170063985A1",
        "US20180295066A1"
    ],
    "citedby_ftf": []
}