{
    "patent_link": "https://patents.google.com/patent/US6549869B1/en",
    "patent_id": "US6549869B1",
    "title": "Expert analysis modules for machine testing",
    "abstract": "A hand-held apparatus gathers and analyzes test data associated with rotating electric machines, where the test data is indicative of one or more operational characteristics of the mechanical equipment. The apparatus, which is operable to be carried by an operator from one machine to another along a test route, includes a sensor input port for receiving a sensor signal from a sensor, where the sensor signal is indicative of one or more operational characteristics of the rotating electric machines. The apparatus also includes a signal conditioning circuit for receiving the sensor signal, and for conditioning the sensor signal to produce a conditioned signal which is appropriate in format to be digitally processed. A processor, which is coupled to the signal conditioner, receives and processes the conditioned signal according to processing instructions and processing parameters to produce a test spectrum. The processing parameters determine one or more characteristics of the test spectrum. A memory device, which is coupled to the processor, stores a plurality of executable test expert modules, each containing the processing instructions for processing the conditioned signal in a particular way to determine one or more of the operational characteristics of the rotating electric machines. An operator input device is coupled to the processor for receiving input from the operator to select one of the test expert modules to be executed to process the conditioned signal according to the processing instructions contained in the selected module. The apparatus further includes a display device for displaying the test spectrum to the operator. The test expert modules contain processing instructions for determining whether the processing parameters have been set according to a predetermined configuration for a particular test point on the test route, and for processing the conditioned signal in a way dependent upon whether or not the processing parameters have been set according to such a predetermined configuration.",
    "inventors": [
        "Kenneth R. Piety",
        "Todd W. Reeves",
        "Jason M. Edwards",
        "Michael D. Rich"
    ],
    "assignee": "Computational Systems Inc",
    "classifications": [
        "G01M13/028",
        "G01H1/003"
    ],
    "claims": "\n1. A hand-held apparatus for gathering and analyzing test data associated with rotating machines, the apparatus operable to be carried by an operator from one machine to another along a test route, the test data indicative of one or more operational characteristics of the rotating machines, the apparatus comprising:\n2. The apparatus of claim 1 further comprising the test expert modules containing processing instructions for determining whether the processing parameters have been set according to a predetermined configuration for a particular test point on the test route, and for processing the conditioned signal in a way dependent upon whether or not the processing parameters have been set according to a predetermined configuration for a particular test point on the test route.\n3. The apparatus of claim 2 further comprising at least one of the test expert modules containing processing instructions for setting a maximum frequency of the test spectrum based upon whether the processing parameters have been set according to a predetermined configuration for a particular test point on the test route.\n4. The apparatus of claim 2 further comprising at least one of the test expert modules containing processing instructions for setting a frequency resolution of the test spectrum based upon whether the processing parameters have been set according to a predetermined configuration for a particular test point on the test route.\n5. The apparatus of claim 2 further comprising:\n6. The apparatus of claim 5 further comprising at least one of the test expert modules containing processing instructions for setting a maximum frequency of the test spectrum based upon a value of the designated frequency.\n7. The apparatus of claim 2 further comprising:\n8. The apparatus of claim 7 further comprising at least one of the test expert modules containing processing instructions for setting a frequency resolution of the test spectrum based upon a value of the designated frequency.\n9. The apparatus of claim 1 further comprising:\n10. A hand-held apparatus for gathering and analyzing test data associated with rotating machines, the apparatus operable to be carried by an operator from one machine to another along a test route, the test data indicative of one or more operational characteristics of the machines, the apparatus comprising:\n11. The apparatus of claim 10 further comprising:\n12. A method for controlling a hand-held machine analyzer to analyze faults in rotating machines, where the analyzer is operable to be carried by an operator from one machine to another along a machine testing route, and where the analyzer includes a sensor for generating sensor signals, conditioning circuits for conditioning the sensor signals to produce conditioned signals appropriate in format to be digitally processed, a processor for processing the conditioned signals according to processing parameters to produce measurement data, a display device for displaying the measurement data to the operator, and an input device for receiving input instructions from the operator, the method comprising:\n13. The method of claim 12 further comprising:\n14. The method of claim 12 wherein the sensor is a vibration sensor, the conditioned signals are vibration signals, and the initial measurement data represent an initial vibration frequency spectrum, and wherein:\n15. The method of claim 12 wherein the sensor is a vibration sensor, the conditioned signals are vibration signals, and the initial measurement data represent an initial vibration frequency spectrum, and wherein:\n16. The method of claim 12 wherein the sensor is a vibration sensor, the conditioned signals are vibration signals, and the initial measurement data represent an initial vibration frequency spectrum, and wherein:\n17. The method of claim 12 wherein the sensor is a vibration sensor, the conditioned signals are vibration signals, and the initial measurement data represent an initial vibration frequency spectrum, further comprising:\n18. The method of claim 12 further comprising:\n19. The method of claim 12 wherein the sensor is a vibration sensor, the conditioned signals are vibration signals, and the initial measurement data represent an initial vibration frequency spectrum, and wherein:\n20. A method for controlling a hand-held machine analyzer operable to be carried by an operator from one machine to another along a machine testing route, and where the analyzer includes a sensor for generating sensor signals, conditioning circuits for conditioning the sensor signals to produce conditioned signals appropriate in format to be digitally processed, a processor for processing the conditioned signals according to processing parameters to produce measurement data, a display device for displaying the measurement data to the operator, and an input device for receiving input instructions from the operator, the method comprising:",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5602761A",
        "US5633811A",
        "US5808903A",
        "US5943634A",
        "US5956658A",
        "US6006164A",
        "US6041287A",
        "US6078874A",
        "US6192325B1",
        "US6208944B1",
        "US6257066B1",
        "US6295510B1",
        "US6298308B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20030130811A1",
        "US20040044499A1",
        "US6748341B2",
        "US20040143567A1",
        "US20040227520A1",
        "US20040236525A1",
        "US20080082296A1",
        "US20090044181A1",
        "US20090070069A1",
        "US20090248326A1",
        "US20110098968A1",
        "WO2011092580A2",
        "US20130173202A1",
        "CN103257044A",
        "US8902302B2",
        "US8996335B2",
        "US9459176B2",
        "US9524629B2",
        "US9927285B2",
        "DE102017124135A1",
        "US10285309B2",
        "RU2700905C2",
        "WO2021249782A1",
        "US11244437B1",
        "US11282213B1",
        "US11429900B1",
        "US11499946B2"
    ],
    "citedby_ftf": []
}