{
    "patent_id": "US-11394778-B2",
    "title": "Distributed storage system with web services client interface ",
    "assignee": "Amazon Technologies, Inc.",
    "publication_date": "2022-07-19",
    "patent_link": "https://patents.google.com/patent/US11394778B2/en",
    "inventors": [
        "Allan Henry Vermeulen",
        "Alan B. Atlas",
        "David M. Barth",
        "John David Cormie",
        "Ami K. Fischman",
        "James Christopher Sorenson, III",
        "Eric M. Wagner"
    ],
    "classifications": [
        "G06F15/00",
        "H04L67/1097",
        "G06F15/16",
        "G06F16/184",
        "G06F9/547",
        "H04L29/06047",
        "H04L67/00",
        "H04L67/01",
        "H04L67/42"
    ],
    "abstract": "A distributed, web-services based storage system. A system may include a web services interface configured to receive, according to a web services protocol, a given client request for access to a given data object, the request including a key value corresponding to the object. The system may also include storage nodes configured to store replicas of the objects, where each replica is accessible via a respective unique locator value, and a keymap instance configured to store a respective keymap entry for each object. For the given object, the respective keymap entry includes the key value and each locator value corresponding to replicas of the object. A coordinator may receive the given client request from the web services interface, responsively access the keymap instance to identify locator values corresponding to the key value and, for a particular locator value, retrieve a corresponding replica from a corresponding storage node.",
    "claims": "\n1. A system, comprising:\na storage system comprising a plurality of storage nodes that include one or more respective storage devices, wherein the storage system is configured to store a plurality of data objects according to an encoding scheme such that each respective data object of the plurality of data objects is stored as a respective plurality of shards, and wherein the respective data object can be reconstructed from a fewer number of shards than a total number of shards for that data object; and a storage manager implemented by one or more hardware processors and configured to:\nreceive, from a client via an application programming interface (API) for accessing a data storage web service, a web services call that includes a request to store a particular data object in the storage system; and\nbased on the request from the client, request that the storage system store the particular data object according to the encoding scheme as a corresponding plurality of shards;\nreceive, from a different client via the API for accessing the data storage web service, a web services call that includes a request to store a different data object in the storage system; and\nbased on the request from the different client, request that the storage system store the different data object according to a different scheme that has a different level of fault tolerance than the encoding scheme for the data object.\n2. The system of claim 1, wherein the storage manager is further configured to encode the data object according to the encoding scheme comprising dividing the particular data object into the corresponding plurality of shards such that the particular data object can be reconstructed from the fewer number of shards than a total number of shards for the particular data object.\n3. The system of claim 1, wherein the storage system is configured to store each shard of the plurality of shards for each respective data object at a different one of the plurality of storage nodes than any other shard of the plurality of shards for the respective data object.\n4. The system of claim 1, wherein the web services call specifies an identifier of the particular data object, and wherein, to retrieve a subset of the plurality of shards, the storage manager is configured to specify a key indicated by the identifier.\n5. The system of claim 1, wherein the storage manager is configured to request that the storage system store the particular data object according to the encoding scheme based on the request from the client specifying that the particular data object be stored according to the encoding scheme.\n6. The system of claim 1, wherein the storage manager is further configured to, based on the request from the client, request that the storage system store the particular data object according to a different scheme, wherein the different scheme is associated with a lower level of fault tolerance than the encoding scheme.\n7. The system of claim 1, wherein the corresponding plurality of shards corresponds to multiple individual complete copies of the data object.\n8. A method, comprising:\nperforming, by a storage manager implemented by one or more hardware processors:\nreceiving, from a client via an application programming interface (API) for accessing a data storage web service, a web services call that includes a request to store a particular data object in a storage system, wherein the storage system comprises a plurality of storage nodes that include one or more respective storage devices, wherein the storage system stores a plurality of data objects according to an encoding scheme such that each respective data object of the plurality of data objects is stored as a respective plurality of shards, and wherein the respective data object can be reconstructed from a fewer number of shards than a total number of shards for that data object; and\nbased on the request from the client, requesting that the storage system store the particular data object according to the encoding scheme as the corresponding plurality of shards receiving, from a different client via the API for accessing the data storage web service, a web services call that includes a request to store a different data object in the storage system; and\nbased on the request from the different client, requesting that the storage system store the different data object according to a different scheme that has a different level of fault tolerance than the encoding scheme for the data object.\n9. The method of claim 8, further comprising encoding, by the storage manager, the data object according to the encoding scheme comprising dividing the particular data object into the corresponding plurality of shards that the particular data object can be reconstructed from the fewer number of shards than a total number of shards for the particular data object.\n10. The method of claim 8, wherein the storage system stores each shard of the plurality of shards for each respective data object at a different one of the plurality of storage nodes than any other shard of the plurality of shards for the respective data object.\n11. The method of claim 8, wherein the web services call specifies an identifier of the particular data object, and wherein, to retrieve the subset of the plurality of shards, the storage manager specifies a key indicated by the identifier.\n12. The method of claim 8, further comprising requesting, by the storage manager, that the storage system store the particular data object according to the encoding scheme based on the request from the client specifying that the particular data object be stored according to the encoding scheme.\n13. The method of claim 8, further comprising, based on the request from the client, requesting, by the storage manager, that the storage system store the particular data object according to a different scheme, wherein the different scheme is associated with a lower level of fault tolerance than the encoding scheme.\n14. The method of claim 8, wherein the corresponding plurality of shards corresponds to multiple individual complete copies of the data object.\n15. One or more non-transitory computer-accessible storage media storing program instructions that when executed on or across one or more processors cause the one or more processors to implement a storage manager to:\nreceive, from a client via an application programming interface (API) for accessing a data storage web service, a web services call that includes a request to store a particular data object in a storage system, wherein the storage system comprises a plurality of storage nodes that include one or more respective storage devices, wherein the storage system stores a plurality of data objects according to an encoding scheme such that each respective data object of the plurality of data objects is stored as a respective plurality of shards, and wherein the respective data object can be reconstructed from a fewer number of shards than a total number of shards for that data object; and\nbased on the request from the client, request that the storage system store the particular data object according to the encoding scheme as a corresponding plurality of shards receive, from a different client via the API for accessing the data storage web service, a web services call that includes a request to store a different data object in the storage system; and\nbased on the request from the different client, request that the storage system store the different data object according to a different scheme that has a different level of fault tolerance than the encoding scheme for the data object.\n16. The one or more storage media as recited in claim 15, wherein the program instructions when executed on or across one or more processors cause the one or more processors to implement the storage manager to: encode the data object according to the encoding scheme comprising dividing the particular data object into the corresponding plurality of shards such that the particular data object can be reconstructed from the fewer number of shards than a total number of shards for the particular data object.\n17. The one or more storage media as recited in claim 15, wherein the program instructions when executed on or across one or more processors cause the one or more processors to implement the storage manager to: store each shard of the plurality of shards for each respective data object at a different one of the plurality of storage nodes than any other shard of the plurality of shards for the respective data object.\n18. The one or more storage media as recited in claim 15, wherein the web services call specifies an identifier of the particular data object, and wherein, to retrieve the subset of the plurality of shards, the program instructions when executed on or across one or more processors cause the one or more processors to: implement the storage manager to specify a key indicated by the identifier.\n19. The one or more storage media as recited in claim 15, wherein the program instructions when executed on or across one or more processors cause the one or more processors to implement the storage manager to: request that the storage system store the particular data object according to the encoding scheme based on the request from the client specifying that the particular data object be stored according to the encoding scheme.\n20. The one or more storage media as recited in claim 15, wherein the program instructions when executed on or across one or more processors cause the one or more processors to implement the storage manager to: based on the request from the client, request that the storage system store the particular data object according to a different scheme, wherein the different scheme is associated with a lower level of fault tolerance than the encoding scheme.",
    "status": "Active",
    "citations_own": [
        "EP0226734A2",
        "US5202986A",
        "US5287500A",
        "US5758359A",
        "US5963944A",
        "WO2000026782A1",
        "US6079028A",
        "US6192405B1",
        "US6226743B1",
        "US6279007B1",
        "EP1160692A2",
        "US6351776B1",
        "US6353878B1",
        "EP1197882A2",
        "US6408298B1",
        "US20020078461A1",
        "US20020080888A1",
        "US20020138559A1",
        "US20020143755A1",
        "US6463454B1",
        "US20020147929A1",
        "US20020161781A1",
        "US6505205B1",
        "US20030028543A1",
        "US20030046270A1",
        "US20030046357A1",
        "US20030061067A1",
        "US20030061456A1",
        "US20030088659A1",
        "US20030154381A1",
        "US20030204515A1",
        "US6704886B1",
        "US20040093515A1",
        "US20040168084A1",
        "US20040193879A1",
        "US20040230572A1",
        "US6832248B1",
        "US20050010609A1",
        "US20050027796A1",
        "US20050055322A1",
        "US20050097286A1",
        "US20050108380A1",
        "US20050144283A1",
        "US20050172323A1",
        "US20050202392A1",
        "US20050240591A1",
        "US20050283649A1",
        "US20060149806A1",
        "US20060168154A1",
        "US20060190556A1",
        "US20060206510A1",
        "US20060271601A1",
        "US7146368B2",
        "US20070027907A1",
        "US7317907B2",
        "US7403987B1",
        "US7529834B1",
        "US7647329B1",
        "US7702640B1",
        "US8825591B1",
        "US10432721B2"
    ],
    "citations_ftf": [
        "US528750A",
        "US5202968A",
        "US6453325B1",
        "JP2000132441A",
        "US6922685B2",
        "US6505200B1",
        "US6910075B2",
        "US20050065879A1",
        "US8856068B2",
        "US7801912B2",
        "KR100793820B1",
        "KR100892313B1"
    ],
    "citedby_own": [
        "US11756550B1"
    ],
    "citedby_ftf": [
        "DE3831695A1",
        "US7130616B2",
        "US7468934B1",
        "US20050210101A1",
        "JP4386732B2",
        "US7363346B2",
        "US8468126B2",
        "US7853563B2",
        "US7917468B2",
        "US8010082B2",
        "US7441271B2",
        "US7706781B2",
        "FI117152B",
        "US7877703B1",
        "US8438633B1",
        "WO2006136660A1",
        "US8392400B1",
        "US7801912B2",
        "US7716180B2",
        "US7496667B2",
        "US7526451B2",
        "US7769395B2",
        "US20070214314A1",
        "US8122087B2",
        "US7707136B2",
        "US7835578B2",
        "US8150805B1",
        "US7962499B2",
        "US8095531B2",
        "US8010565B2",
        "US20080104012A1",
        "US8316227B2",
        "US20080104617A1",
        "US8417537B2",
        "US8533746B2",
        "US20090282105A1",
        "KR101221672B1",
        "CN1996847B",
        "US20080201338A1",
        "US20080263103A1",
        "JP2008234445A",
        "US8640215B2",
        "JP4702314B2",
        "US8095618B2",
        "US8768898B1",
        "US7853669B2",
        "US20080281863A1",
        "ATE429119T1",
        "US8805425B2",
        "US8693494B2",
        "KR100936240B1",
        "US8515988B2",
        "US20090083441A1",
        "US8959085B2",
        "US7836018B2",
        "US9413825B2",
        "EP3296895B1",
        "US9122397B2",
        "US8176084B2",
        "US9027030B2",
        "US7849223B2",
        "US8364181B2",
        "US8793305B2",
        "US7962583B2",
        "US9002828B2",
        "US8588425B1",
        "US8799681B1",
        "US8738841B2",
        "US8498417B1",
        "US8236476B2",
        "US8107921B2",
        "US9122422B2",
        "US9177551B2",
        "US8862657B2",
        "US20090193338A1",
        "US20090210461A1",
        "US20090210400A1",
        "US9935919B2",
        "US7949624B2",
        "US9830278B1",
        "US8065327B2",
        "US20090234858A1",
        "US9298747B2",
        "US8572033B2",
        "US20090241134A1",
        "US9317255B2",
        "US8989388B2",
        "US8103628B2",
        "US8417679B1",
        "US8346824B1",
        "US9619295B1",
        "US8352421B2",
        "US8745502B2",
        "JP5392253B2",
        "WO2009144942A1",
        "US8787947B2",
        "US8078158B2",
        "US8732265B2",
        "US7869383B2",
        "US8108502B2",
        "CN101334797B",
        "ES2575155T3",
        "US7831682B2",
        "US8543713B2",
        "US8245246B2",
        "US20100070360A1",
        "US8073887B2",
        "US8909759B2",
        "US8949915B2",
        "SE533007C2",
        "US9137209B1",
        "US8429444B2",
        "US8239395B2",
        "US8943409B2",
        "US8166067B2",
        "US20100169395A1",
        "US8266107B2",
        "JP5446378B2",
        "US8307003B1",
        "US8296419B1",
        "US8060792B2",
        "US8713060B2",
        "US9207984B2",
        "US8332365B2",
        "US9705888B2",
        "US8886586B2",
        "US20100299447A1",
        "US8886804B2",
        "US20100312749A1",
        "US8407190B2",
        "US8290904B2",
        "US8639724B1",
        "US8621182B1",
        "US8285925B1",
        "US8521771B1",
        "US8316213B1",
        "US9049182B2",
        "WO2011023134A1",
        "US10229191B2",
        "WO2011030324A1",
        "US8364636B2",
        "US9448730B2",
        "US9135283B2",
        "US20110093439A1",
        "US8676753B2",
        "US8074107B2",
        "US8335765B2",
        "US8769035B2",
        "US20110119462A1",
        "US8346722B2",
        "US8578038B2",
        "US9110912B2",
        "US20110153644A1",
        "US8892677B1",
        "US8868508B2",
        "US9305069B2",
        "US8874523B2",
        "EP2534569B1",
        "US8380659B2",
        "US8423517B2",
        "US8862617B2",
        "US8341118B2",
        "US8615485B2",
        "US8352424B2",
        "US8819208B2",
        "US8396873B2",
        "EP2372570B1",
        "US8856593B2",
        "US8725951B2",
        "US8868487B2",
        "US9047351B2",
        "US9164554B2",
        "US8447833B2",
        "US8533299B2",
        "US8181061B2",
        "US9170892B2",
        "US8438244B2",
        "WO2011133440A1",
        "US9813529B2",
        "US8996611B2",
        "US9454441B2",
        "EP2387200B1",
        "US8375066B2",
        "WO2011136767A1",
        "US20110270841A1",
        "US20120016901A1",
        "US8650657B1",
        "US9015126B2",
        "CN108920502B",
        "US10296596B2",
        "US9355109B2",
        "US9002924B2",
        "US8621269B2",
        "US8560698B2",
        "US8666939B2",
        "US8825745B2",
        "WO2012018477A2",
        "GB2500333B",
        "EP2599003B1",
        "US8838783B2",
        "AU2011293350B2",
        "US8768981B1",
        "US8290919B1",
        "US8392368B1",
        "US8468365B2",
        "US8549004B2",
        "US20120102453A1",
        "JP5822452B2",
        "WO2012060995A2",
        "US9060032B2",
        "US8204953B2",
        "US8843153B2",
        "EP2635973A4",
        "US9330196B2",
        "US8484314B2",
        "WO2012060997A2",
        "WO2012061430A2",
        "US8635280B2",
        "US8589479B2",
        "EP2596658B1",
        "EP3422775A1",
        "US9311374B2",
        "US10108500B2",
        "US8335761B1",
        "US9020900B2",
        "US8473775B1",
        "US8504535B1",
        "CN103299295A",
        "US8650156B1",
        "US8849825B1",
        "US9043782B2",
        "US8862870B2",
        "US8639786B2",
        "WO2012094675A2",
        "US9311135B2",
        "US20120209998A1",
        "JP5589205B2",
        "WO2012121316A1",
        "US8538926B2",
        "US8554951B2",
        "US8510267B2",
        "US8712975B2",
        "US9213709B2",
        "US9251097B1",
        "US9563681B1",
        "US9767098B2",
        "US8983960B1",
        "US9384199B2",
        "US11418580B2",
        "US8874515B2",
        "US8825720B1",
        "WO2012145541A2",
        "KR101544485B1",
        "WO2012149434A2",
        "EP2621144B1",
        "US8806223B2",
        "US20120284231A1",
        "US8433681B2",
        "US9396290B2",
        "US8706782B2",
        "CN102833281B",
        "US8843502B2",
        "US8595267B2",
        "US8601000B1",
        "US8572091B1",
        "US9052831B1",
        "US10877669B1",
        "US8732517B1",
        "US20130013888A1",
        "US8825985B2",
        "US8601276B2",
        "EP2737741A4",
        "WO2013018808A1",
        "US8538920B2",
        "KR20130020050A",
        "US8682942B1",
        "US9910904B2",
        "US9021053B2",
        "US9626378B2",
        "US8997124B2",
        "US8650365B2",
        "US8645978B2",
        "US8769138B2",
        "US8176283B1",
        "US9197600B2",
        "US9462466B2",
        "US8949371B1",
        "US8930320B2",
        "KR101862700B1",
        "US11700412B2",
        "US11451618B2",
        "US11792185B2",
        "US8918363B2",
        "CN102609278B",
        "US8934414B2",
        "US8977755B2",
        "US9277443B2",
        "EP2788889A4",
        "WO2013090834A1",
        "US9021021B2",
        "US8861354B2",
        "US8918675B2",
        "JP2013127748A",
        "US9838269B2",
        "WO2013101947A1",
        "US9003021B2",
        "US9054992B2",
        "WO2013103988A1",
        "US20140223026A1",
        "US20130179481A1",
        "US9116862B1",
        "US8930312B1",
        "US9069827B1",
        "US9203864B2",
        "US9852010B2",
        "US8868711B2",
        "US10860384B2",
        "WO2013116852A1",
        "US9330107B1",
        "US9189484B1",
        "GB201203558D0",
        "US9135064B2",
        "US9094309B2",
        "US8832234B1",
        "US8918392B1",
        "US8935203B1",
        "US8930364B1",
        "US9628438B2",
        "US8812695B2",
        "WO2013155208A1",
        "CN103377069A",
        "US11487707B2",
        "US9317511B2",
        "US8504519B1",
        "US9672274B1",
        "US8775631B2",
        "US8935221B1",
        "US10528262B1",
        "US9300569B2",
        "US9250811B1",
        "US8805793B2",
        "US9779035B1",
        "US9652487B1",
        "US9354683B2",
        "US9225675B2",
        "US9904788B2",
        "US9092441B1",
        "US9830111B1",
        "US8959067B1",
        "US10120579B1",
        "US9699263B1",
        "US9778856B2",
        "US9137690B2",
        "US20140089619A1",
        "US10157124B1",
        "US9161258B2",
        "US8959301B2",
        "US9209973B2",
        "US9112809B2",
        "US9063946B1",
        "US9727522B1",
        "US9417917B1",
        "US9002805B1",
        "US9052942B1",
        "US9355060B1",
        "US9658983B1",
        "US9307493B2",
        "US9277010B2",
        "US9501398B2",
        "US9612948B2",
        "US9239751B1",
        "US9454420B1",
        "US9015123B1",
        "JP6306055B2",
        "US10341281B2",
        "US9530020B2",
        "US9576141B2",
        "US9271238B2",
        "US8874761B2",
        "KR101474320B1",
        "US10558581B1",
        "DE102013101863A1",
        "EP2962218B1",
        "US9954843B2",
        "JP2014170491A",
        "US10313345B2",
        "US9002982B2",
        "US9148350B1",
        "US8750123B1",
        "US10142406B2",
        "US20140279946A1",
        "US9870830B1",
        "US10740323B1",
        "CN104050201B",
        "US11176111B2",
        "US9367246B2",
        "US9244763B1",
        "US9236886B1",
        "US10592106B2",
        "US20190005261A1",
        "US10366072B2",
        "US9330158B1",
        "US9471657B1",
        "US9159437B2",
        "US10963431B2",
        "US9304815B1",
        "US9559900B1",
        "IN2013MU02097A",
        "US10158579B2",
        "US10686646B1",
        "US10623243B2",
        "US10862731B1",
        "US10078683B2",
        "US9065765B2",
        "US9253514B2",
        "US9524235B1",
        "US9384126B1",
        "US10419572B2",
        "US10803015B2",
        "US9336265B2",
        "US10116762B2",
        "US10250579B2",
        "US11422907B2",
        "US9235509B1",
        "US9639463B1",
        "US10120868B2",
        "US9313274B2",
        "US9430775B2",
        "US9648040B1",
        "US10203904B1",
        "US9442700B2",
        "JP2015072629A",
        "US9703814B1",
        "US9442662B2",
        "US9298608B2",
        "US9560173B2",
        "US9436831B2",
        "US9263156B2",
        "US9720989B2",
        "US10635644B2",
        "US9276959B2",
        "US9244785B2",
        "US9703816B2",
        "US20150150068A1",
        "US9520197B2",
        "CN103581339A",
        "US9520162B2",
        "US9582058B2",
        "US9235245B2",
        "US9747353B2",
        "US9438506B2",
        "US9251109B2",
        "US10592475B1",
        "US10331895B1",
        "US9519696B1",
        "GB2522432A",
        "US9798631B2",
        "US9213974B2",
        "US9647999B2",
        "US9185101B2",
        "US9286450B2",
        "US9390242B2",
        "US9208301B2",
        "US9213814B2",
        "US9313190B2",
        "US9185117B2",
        "US9317674B2",
        "US9305149B2",
        "US9965606B2",
        "US9331994B2",
        "US9317673B2",
        "US9223951B2",
        "US20150244795A1",
        "US9703636B2",
        "US9721248B2",
        "US9600817B2",
        "US9406065B2",
        "US9721268B2",
        "US9600844B2",
        "JP2015176203A",
        "US9390814B2",
        "US9448876B2",
        "US9454448B2",
        "JP2015179444A",
        "US9626399B2",
        "US10956050B2",
        "US9916356B2",
        "US10372685B2",
        "US9626400B2",
        "CN104954411A",
        "US10264071B2",
        "US9390021B2",
        "US9697267B2",
        "US10025873B2",
        "US10069914B1",
        "US10516732B2",
        "US9864527B1",
        "US11445011B2",
        "US10063625B2",
        "US10503713B1",
        "US10528536B1",
        "US10250519B2",
        "CN104007938B",
        "US10114557B2",
        "US10162748B2",
        "US10656842B2",
        "US10372613B2",
        "US10656840B2",
        "US9703491B2",
        "US10146448B2",
        "US9652381B2",
        "US9779110B2",
        "US10545947B2",
        "US10565611B2",
        "US10277414B2",
        "US9798728B2",
        "US9560136B2",
        "US9860314B2",
        "JP6278121B2",
        "US9514123B2",
        "US9723064B1",
        "US9443601B2",
        "US10133511B2",
        "US9671960B2",
        "US9965627B2",
        "US9537841B2",
        "US10122687B2",
        "US9747297B2",
        "CN105491094B",
        "WO2016051512A1",
        "US9672248B2",
        "JP6492172B2",
        "WO2016061658A1",
        "US10244038B2",
        "US9836229B2",
        "US10073730B1",
        "US20160147458A1",
        "US10277522B1",
        "US9753936B1",
        "US10282371B1",
        "US10887253B1",
        "US9917810B2",
        "US10769023B1",
        "US9525672B2",
        "US9959274B2",
        "EP3040845A1",
        "WO2016118591A1",
        "US9183303B1",
        "US9384226B1",
        "US20180004430A1",
        "US10599621B1",
        "US9720601B2",
        "US10146806B2",
        "US20160239499A1",
        "CN105991720B",
        "US10505862B1",
        "US10970285B2",
        "US10303791B2",
        "US10650011B2",
        "US9922064B2",
        "US9762460B2",
        "US9715502B1",
        "US9967093B2",
        "US10831736B2",
        "US10108653B2",
        "US9710317B2",
        "US9922201B2",
        "US10963430B2",
        "US10540329B2",
        "US10026070B2",
        "US10169125B2",
        "US10270475B1",
        "US9998150B1",
        "US10298259B1",
        "US10977128B1",
        "US10270476B1",
        "US9838041B1",
        "US9866242B1",
        "US9838042B1",
        "US9853662B1",
        "US10311020B1",
        "US9825652B1",
        "US10009044B1",
        "US10623258B2",
        "US10089176B1",
        "US9998539B1",
        "US10108819B1",
        "US10198311B1",
        "US9904589B1",
        "US10162704B1",
        "US10394762B1",
        "US9959167B1",
        "US10762229B2",
        "US10789207B2",
        "US9740566B2",
        "US10846115B1",
        "CN105208141A",
        "US10248678B2",
        "US10153918B2",
        "US10462011B2",
        "US10122626B2",
        "US9928141B1",
        "US10127243B2",
        "US11386060B1",
        "US9940474B1",
        "EP3151481B1",
        "US10133764B2",
        "US10158623B2",
        "US10216748B1",
        "US10148588B1",
        "US10375054B2",
        "US9825956B2",
        "US10691718B2",
        "US9479567B1",
        "US9729536B2",
        "US9641539B1",
        "US9820148B2",
        "US10021565B2",
        "US9619165B1",
        "US10127266B2",
        "US10452681B1",
        "US10733201B1",
        "US10567499B1",
        "US10489230B1",
        "US11640410B1",
        "US10394789B1",
        "US10642813B1",
        "US9785495B1",
        "US10248793B1",
        "US10235402B1",
        "US10324790B1",
        "US10102065B1",
        "US10127105B1",
        "US10180912B1",
        "US10924543B1",
        "US10015274B2",
        "US9537952B1",
        "US10747676B2",
        "US10185658B2",
        "US10289340B2",
        "KR101648568B1",
        "US10592336B1",
        "US10061668B1",
        "US10678664B1",
        "US10366062B1",
        "US20220164840A1",
        "US10929022B2",
        "US10460367B2",
        "CN107346315B",
        "US11336697B2",
        "US10268635B2",
        "US10055351B1",
        "US10261704B1",
        "US10331561B1",
        "US10089025B1",
        "US10037164B1",
        "US10146438B1",
        "US10521311B1",
        "US10565227B1",
        "US11150995B1",
        "US10650621B1",
        "US10642763B2",
        "US10726009B2",
        "US11663227B2",
        "US11250056B1",
        "US11620336B1",
        "US11599541B2",
        "US11003714B1",
        "US11580107B2",
        "US10977260B2",
        "US11126632B2",
        "US20180089324A1",
        "US11222066B1",
        "US11550847B1",
        "US11461334B2",
        "US11023463B2",
        "US11567993B1",
        "US11604795B2",
        "US11416528B2",
        "US11593377B2",
        "US10353965B2",
        "US11294941B1",
        "US10776355B1",
        "US11615104B2",
        "US11243963B2",
        "US11314753B2",
        "US11321321B2",
        "US10984044B1",
        "US10956415B2",
        "US11269939B1",
        "US10795884B2",
        "US11586627B2",
        "US11281706B2",
        "US11232100B2",
        "US11163758B2",
        "US11442935B2",
        "US11562023B1",
        "US11106734B1",
        "US11137980B1",
        "US10496327B1",
        "US10810157B1",
        "US11281624B1",
        "US10657097B1",
        "US10437790B1",
        "US11204895B1",
        "US10614239B2",
        "US10678856B1",
        "CN107959695B",
        "RU2646312C1",
        "CA3043026A1",
        "US10296764B1",
        "US11269888B1",
        "US20180173745A1",
        "US11210134B2",
        "US10209901B2",
        "US11210270B2",
        "US10521344B1",
        "US11356445B2",
        "US10530752B2",
        "US10621055B2",
        "US10282115B2",
        "EP3624462B1",
        "US10701154B2",
        "US10469616B2",
        "CN107295080B",
        "US10313480B2",
        "US10511692B2",
        "US10524165B2",
        "US10789301B1",
        "US10362105B1",
        "US10860346B2",
        "WO2019035878A1",
        "US10922303B1",
        "US10579633B2",
        "US10789267B1",
        "US10896182B2",
        "US11151137B2",
        "CN107659653B",
        "US11048679B2",
        "US10558533B2",
        "CN108196916B",
        "US10762294B2",
        "CN111634160B",
        "US10671709B2",
        "US11144513B1",
        "US11128530B2",
        "US11334543B1",
        "US11269679B2",
        "US20210224242A1",
        "US11256815B2",
        "WO2020010503A1",
        "US10956375B2",
        "CN110740048B",
        "US11216420B2",
        "US11115490B2",
        "US11061609B2",
        "US11134055B2",
        "US10951395B2",
        "US11593291B2",
        "US11003491B1",
        "US11392610B2",
        "US11005775B2",
        "US10768851B2",
        "US11082493B2",
        "US11625273B1",
        "CN111258772B",
        "US11776539B2",
        "US11665757B2",
        "US10922229B2",
        "US11055016B2",
        "US11416159B2",
        "WO2020220216A1",
        "US11715051B1",
        "US10997178B2",
        "CN110334823B",
        "US11388136B2",
        "CN110366049B",
        "CN114761940A",
        "US11403247B2",
        "US20210075745A1",
        "US11231876B2",
        "US11593288B2",
        "US11494380B2",
        "WO2021081409A1",
        "US11570247B2",
        "CN111125002B",
        "US11290531B2",
        "CN111212105B",
        "US11258854B2",
        "CN113285816B",
        "US20210271571A1",
        "US11210288B2",
        "JP2021190150A",
        "US20210406223A1",
        "CN113934361A",
        "WO2022011142A1",
        "US11747996B2",
        "CN111970349B",
        "JPWO2022044459A1",
        "US11593017B1",
        "US11620182B2",
        "CN112118118B",
        "US11356120B1",
        "US20220100878A1",
        "US11704313B1",
        "US11687528B2",
        "US11775348B2",
        "US20220407861A1",
        "US20230019064A1",
        "US11803569B2",
        "US20230325378A1",
        "CN116560859B"
    ]
}