{
    "patent_id": "US-2019079921-A1",
    "title": "Systems and methods for automated question response ",
    "assignee": "Conversica, Inc.",
    "publication_date": "2019-03-14",
    "patent_link": "https://patents.google.com/patent/US20190079921A1/en",
    "inventors": [
        "Alex Terry",
        "Werner Koepf",
        "James Harriger",
        "Will Webb-Purkis",
        "Joseph M. Silverbears",
        "Macgregor S. Gainor",
        "Ryan Ginstrom",
        "Siddhartha Reddy Jonnalagadda"
    ],
    "classifications": [
        "G06F17/2775",
        "G06N20/20",
        "G06F15/18",
        "G06F16/35",
        "G06F17/2785",
        "G06F17/30705",
        "G06F3/04812",
        "G06F40/289",
        "G06F40/30",
        "G06N20/00",
        "G06N5/01",
        "G06N5/02",
        "G06N5/022",
        "G06N5/041",
        "G06N5/046",
        "G06Q30/02",
        "G06Q30/0201",
        "G06Q30/0241",
        "G06Q30/0276",
        "G06F2203/04804",
        "G06N3/044",
        "G06N3/045",
        "G06N5/025",
        "G06N7/01"
    ],
    "abstract": "Systems and methods for natural language processing and classification are provided. In some embodiments, the systems and methods include a communication editor dashboard which receives the message, performs natural language processing to divide the message into component parts. The system displays the message in a first pane with each of the component parts overlaid with a different color, and displaying in a second pane the insights, the confidence scores associated with each insight, the sentiment and the actions. In another embodiment, the systems and methods include combining outputs from multiple machine learned AI models into a unified output. In another embodiment, the systems and methods include responding to simple question using natural language processing.",
    "claims": "\n1. A computer implemented method for responding to simple question using natural language processing comprising:\nreceiving a set of training questions linked to facts answering the associated training question from a campaign manager, wherein the facts are stored in a third party database;\nlinking each of the set of training questions to a fundamental question category;\nreceiving a concept for a message from at least one machine learning AI model, wherein the at least one machine learning AI model utilize a dataset independent from the third party database;\nreferencing the concept for the message to the fundamental question categories;\nretrieving the fact associated with the fundamental question category that the message concept references to, from the third party database;\nretrieving a response template for the fundamental question category that the message concept references to, from the independent dataset;\npopulating the response template with the fact; and\noutputting a response to the message using the populated response template.\n2. The method of claim 1, further comprising training the at least one machine learning AI model using the set of training questions.\n3. The method of claim 2, further comprising linking each of the set of training questions to an associated fundamental question category.\n4. The method of claim 3, further comprising expanding the set of training questions with known variations of the fundamental question category.\n5. The method of claim 4, further comprising augmenting the expanded set of training questions by applying synonym replacement of words in the training questions to generate all possible synonym permutations.\n6. The method of claim 5, wherein the training the at least one machine learning AI model is performed using the augmented set of training questions.\n7. The method of claim 1, wherein the response template mimics human language patterns.\n8. The method of claim 7, wherein the response templates include variable response features.\n9. The method of claim 1, wherein the fundamental question categories include store hours, store location, “how are you”, inventory availability, pricing inquiries, and contact extensions.\n10. The method of claim 1, further comprising delaying the outputting the response based upon time of the day, day of the week, and context of the message.",
    "status": "Active",
    "citations_own": [
        "US5918222A",
        "US20020026435A1",
        "US20030101153A1",
        "US20040260534A1",
        "US7197460B1",
        "US20070174390A1",
        "US20090162824A1",
        "US20090287678A1",
        "US20090307194A1",
        "US20100205167A1",
        "US7869998B1",
        "US7962578B2",
        "US8694541B1",
        "US20140280169A1",
        "US20140358890A1",
        "US20150088998A1",
        "US20150161241A1",
        "US20150161106A1",
        "US9286910B1",
        "US20160132590A1",
        "US20160140958A1"
    ],
    "citations_ftf": [
        "US7043531B1",
        "US7076430B1",
        "US7606714B2",
        "US20050080613A1",
        "US7711103B2",
        "US7512580B2",
        "WO2007056698A2",
        "US7640158B2",
        "US20070129993A1",
        "US8364467B1",
        "US8725729B2",
        "US20080071606A1",
        "US20090048859A1",
        "JP2010533326A",
        "US8738739B2",
        "US20140279050A1",
        "US8694355B2",
        "US8200578B2",
        "US20110060643A1",
        "WO2011085108A1",
        "US20110258016A1",
        "US8751521B2",
        "US20160071132A1",
        "US20120191546A1",
        "US8700543B2",
        "US20120245925A1",
        "US20150019305A1",
        "US8787553B2",
        "WO2013049687A1",
        "US9367814B1",
        "US9258423B1",
        "US20130297442A1",
        "US9678948B2",
        "US20140122407A1",
        "US20140149178A1",
        "US9171267B2",
        "US20140280225A1",
        "US20140280623A1",
        "US9805018B1",
        "US9008283B2",
        "US20140279078A1",
        "US9116938B2",
        "US9053423B2",
        "US20150100364A1",
        "US9413891B2",
        "US9430461B2",
        "US11023864B2",
        "US9317816B2",
        "US9715875B2",
        "US9565305B2",
        "US10043205B2",
        "US20160071117A1",
        "US10803479B2",
        "US10754886B2",
        "US11240189B2",
        "US20180314975A1",
        "US10673787B2"
    ],
    "citedby_own": [
        "US20190065610A1",
        "CN110390005A",
        "US11295235B2",
        "TWI766183B",
        "US11392853B2",
        "US11687778B2"
    ],
    "citedby_ftf": [
        "US11321727B2",
        "US10409913B2",
        "US10374982B2",
        "US10789460B1",
        "US11463441B2",
        "US10565229B2",
        "JP7172226B2",
        "US10885269B2",
        "US11032217B2",
        "US10740371B1",
        "US20210081459A1",
        "KR20210033837A",
        "US11194971B1",
        "US11243991B2",
        "US11263407B1",
        "US11093718B1",
        "WO2022240937A1",
        "US11302314B1",
        "US20230186897A1",
        "US11599713B1"
    ]
}