{
    "patent_link": "https://patents.google.com/patent/US20090132335A1/en",
    "patent_id": "US20090132335A1",
    "title": "Method And System For Developing And Applying Market Data Scenarios",
    "abstract": "A method and system for developing and applying market data scenarios in which market data is received from a market data distribution platform, the market data is stored, the stored market data is replayed, the replayed stored market data is changed with respect to a specific asset included in the market data by applying in an automated manner a market activity scenario to the stored market data, and transmitting the altered market data to a client application so that the client application processes the altered market data as if it were market data transmitted directly from the market data distribution platform. The system for performing the method may include a recording module for receiving a stream of market data over a network from a market data distribution platform, an interface module for enabling a user to specify changes to the replayed stream to form a stream of altered market data and a client application interface for transmitting a stream of altered market data to a client application whereby the stream of altered market data mimics the market data stream from the market data distribution platform such that the client application can process the stream of altered market data as if it were market data from the market data distribution platform.",
    "inventors": [
        "Howard Barry Pein"
    ],
    "assignee": "Tradeweb Markets LLC",
    "classifications": [
        "G06Q30/0202",
        "G06Q10/04",
        "G06Q20/201",
        "G06Q30/02",
        "G06Q30/0201",
        "G06Q40/00",
        "G06Q40/04",
        "G06Q40/06"
    ],
    "claims": "\n1. A method for developing and applying market data scenarios comprising:\nreceiving market data containing values of market items from a market data distribution platform;\nchanging selected values of said market data to create changed market data; and\ntransmitting said changed market data to a client application, whereby said client application is able to process said changed market data as if it were unchanged market data transmitted directly from a market data distribution platform.\n2. The method of claim 1 wherein said changing step includes the step of applying in an automated manner modifications to selected values of said market data, whereby values of said market data are changed to simulate market activity desired by a user.\n3. The method of claim 2 wherein said applying step includes the step of applying in an automated manner market activity scenarios selected from a plurality of different stored market activity scenarios.\n4. The method of claim 2 wherein said applying step includes the step of applying a market activity scenario created by a user in real time.\n5. The method of claim 4 wherein said applying step includes the step of storing said user-created market activity scenario.\n6. The method of claim 1 wherein the step of altering said stored market data includes the step of altering said market data in a manner most appropriate to a specific asset type included in said market data.\n7. The method of claim 1 wherein said altering step includes the step of entering parameters appropriate for a specific asset, whereby update values of said specific asset type are changed from values of said asset in said received market data.\n8. The method of claim 7 wherein said parameter entering step includes the step of shifting a yield curve for fixed income securities.\n9. The method of claim 7 wherein said parameter entering step includes the step of changing a relationship between prices of two selected equities from said stored market data.\n10. The method of claim 9 wherein said relationship changing step includes introducing a relationship between prices of two selected equities from said stored market data that varies over time a predetermined amount.\n11. The method of claim 10 wherein said relationship introducing step includes the step of selecting a function from among a plurality of stored functions, each of said functions including varying a relationship between two equities over time a predetermined amount.\n12. The method of claim 10 wherein said relationship introducing step includes the step of introducing a user-created relationship between prices of at least two equities, futures, options, bonds, structured products and commodities.\n13. The method of claim 1 wherein said changing step includes the step of accelerating or decelerating an update rate of a replay stream of said market data in said replay step.\n14. The method of claim 1 wherein said changing step includes the step of pausing and inserting custom updates in a replay stream of said market data in said replay step.\n15. The method of claim 1 wherein said changing step includes the step of injecting error conditions in said replay stream of said market data.\n16. The method of claim 1 further comprising the steps of storing said received market data and replaying said stored market data; and said changing step includes the step of changing said stored market data.\n17. The method of claim 1 wherein said receiving step includes the step of receiving a stream of market data containing values of market items from a market data distribution platform in real time.\n18. The method of claim 17 further comprising the step of storing said stream of market data in a data store.\n19. The method of claim 18 wherein said changing step includes the step of changing selected values of said stored stream of market data.\n20. The method of claim 19 wherein said changing step includes the step of changing selected values of less than entire stored stream of market data.\n21. A method for developing and applying market data scenarios comprising:\nreceiving market data from a market data distribution platform;\nstoring said received market data;\nreplaying said stored market data;\nchanging said stored market data with respect to a specific asset included in said market data by applying in an automated manner a market activity scenario to said stored market data, including entering parameters directed to said specific asset, whereby performance of said specific asset is changed from performance of said asset in said stored received market data, said automated market activity scenario being selected from a plurality of different stored market activity scenarios, whereby values of said stored market data are changed to simulate market activity desired by a user; and\ntransmitting said altered market data to a client application, whereby said client application is able to process said altered market data as if it were market data transmitted directly from a market data distribution platform.\n22. The system of claim 1 further comprising storing a plurality of snapshots of a complete market data record from said market data distribution platform.\n23. The system of claim 22 further comprising the step of transmitting snapshots of said complete market data record to client applications, whereby said client applications are able to initialize themselves.\n24. A system for developing and applying market data scenarios comprising:\na recording module for receiving a stream of market data over a network from a market data distribution platform;\nan interface module for enabling a user to specify changes to the market data stream to form a stream of altered market data; and\na client application interface for transmitting said stream of altered market data to a client application whereby said stream of altered market data mimics said market data stream from said market data distribution platform such that said client application can process said stream of altered market data as if it were market data from said market data distribution platform.\n25. The system of claim 24 wherein said client application interface includes a replay proxy that transmits said stream of altered market data to a client application.\n26. The system of claim 24 wherein said recording module includes said interface module.\n27. The system of claim 24 wherein said client application interface includes a graphical user interface for controlling recording, replay and alteration of the market data to form said altered market data stream.\n28. The system of claim 24 wherein said client application interface includes a command line interface for controlling recording, replay and alteration of the market data to form said altered market data stream.\n29. The system of claim 24 further comprising storage connected to the recording module for storing received market data; and a replay module for replaying market data from the storage in a replay stream wherein said storage includes a plurality of snapshots of a complete market data record at periodic intervals, whereby said client application interface transmits said snapshots to client applications.\n30. A system for developing and applying market data scenarios comprising:\na recording module for receiving a stream of market data over a network from a market data distribution platform;\nan interface module for enabling a user to specify changes to the market data stream to form a stream of altered market data; and\na client application interface including a replay proxy that transmits said stream of altered market data to a client application for transmitting said stream of altered market data to a client application, a graphical user interface for controlling recording, replay and alteration of the market data to form said altered market data stream and a command line interface for controlling recording, replay and alteration of the market data to form said altered market data stream;\nnon-volatile storage connected to said recording module for storing received market data; and\na replay module for replaying market data from the storage in a replay stream wherein said storage includes a plurality of snapshots of a complete market data record at periodic intervals, whereby said client application interface transmits said snapshots to client applications, whereby said stream of altered market data mimics said market data stream from said market data distribution platform such that said client application can process said stream of altered market data as if it were market data from said market data distribution platform.\n31. The system of claim 30 wherein said client application interface includes a transformation screen that allows a user to specify changes of said market data to create said altered market data.\n32. The system of claim 31 wherein said transformation screen includes a portion that allows a user to create a customized change to said market data.\n33. The system of claim 32 wherein said transformation screen allows a user to store said customized change to said market data.\n34. The system of claim 31 wherein said transformation screen includes a list of pre-existing transformations, and a portion having controls that allow a user to select a pre-existing transformation from among said list and apply said selected pre-existing transformation to said market data.\n35. The system of claim 30 wherein said client application interface includes a screen displaying a recorded stream of market data received by said recording module.\n36. The system of claim 30 wherein said client application interface includes a main dialog screen having controls that allow a user to store said recorded stream of market data in said storage.\n37. The system of claim 30 wherein said client application interface includes a main dialog screen having controls that allow a user to store a selected segment of a recorded stream of market data in said storage.\n38. The system of claim 36 wherein said main dialog screen includes controls that allow a user to replay said recorded stream of market data.\n39. The system of claim 36 wherein said main dialog screen includes controls that allow a user to replay a stored stream of altered market data.\n40. The system of claim 36 wherein said main dialog screen includes controls that allow a user to create an altered stream of market data directly from said recording module to said interface module to said client application interface, without storage, whereby a real-time stream of altered market data may be created and transmitted to a client application.",
    "status": "Active",
    "citations_own": [
        "US4012132A",
        "US4745559A",
        "US5045848A",
        "US5412416A",
        "US5617513A",
        "US5689651A",
        "US5761442A",
        "US5774880A",
        "US5774878A",
        "US5862325A",
        "US5864827A",
        "US5873069A",
        "US5893079A",
        "US5946667A",
        "US5987432A",
        "US6345288B1",
        "US20030154025A1",
        "US20030195822A1",
        "US6655112B1",
        "US20040243502A1",
        "US20040254876A1",
        "US6939137B1",
        "US20070156574A1",
        "US7742959B2",
        "US7865426B2",
        "US7904363B2",
        "US7908202B2"
    ],
    "citations_ftf": [
        "US5721832A",
        "US5737581A",
        "US5713793A",
        "US20020055899A1",
        "US7672895B2",
        "US20080027880A1",
        "AU2007309425A1",
        "US8175941B2",
        "WO2009066443A1",
        "US8346646B2"
    ],
    "citedby_own": [
        "US20080109351A1",
        "US20080243669A1",
        "US20080243670A1",
        "US20080243672A1",
        "US20080243671A1",
        "US20100138360A1",
        "US20120179809A1",
        "US20150025873A1",
        "US9459757B1",
        "CN106651585A",
        "CN110619580A",
        "US20220172232A1"
    ],
    "citedby_ftf": [
        "US8856331B2",
        "US8175941B2",
        "US20120204228A1",
        "US20140157238A1",
        "WO2014150399A1",
        "US10891272B2",
        "US10296192B2",
        "US10210246B2",
        "US10296983B2",
        "US10740316B2",
        "US10635984B2",
        "CN114330095B"
    ]
}