{
    "patent_id": "US-9350747-B2",
    "title": "Methods and systems for malware analysis ",
    "assignee": "Cyberpoint International Llc",
    "publication_date": "2016-05-24",
    "patent_link": "https://patents.google.com/patent/US9350747B2/en",
    "inventors": [
        "Mark McLarnon",
        "Mark V. Raugas",
        "Ryan Fisher",
        "Nate Rogers",
        "Mike Kolodny"
    ],
    "classifications": [
        "H04L63/145",
        "G06N20/00",
        "H04L63/14",
        "G06F16/955",
        "G06F21/56",
        "G06F3/0482",
        "H04L63/1433",
        "H04L63/1491",
        "H04L63/20"
    ],
    "abstract": "Methods, system, and media for analyzing a potential malware sample are disclosed. A sample for malware analysis may be received. The sample may be received through a web interface. The sample may be analyzed using a plurality of analyzers implemented on one or more computing devices. The analyzers may perform a sequence of configurable analytic steps to extract information about the sample. The extracted information may be displayed to a user through the web interface.",
    "claims": "\n1. A computer-implemented method executed by one or more processors, the method comprising:\ntraining a particular analyzer using machine learning to classify data samples as including malware or not including malware;\nproviding data for generating a graphical user interface at a user device, the graphical user interface being configured to receive, through user selectable options, configuration data that (i) defines a user-defined workflow to control one or more analyzers for analyzing malware having a particular malware attribute and (ii) specifies whether one or more virtual machines are to be supported by the user-defined workflow;\nreceiving, from the user device, the configuration data through the graphical user interface;\nstoring the configuration data in a workflow definition database, the workflow definition database including workflow definitions for a plurality of workflows respectively associated with a plurality of malware attributes;\nreceiving a sample including a potential malware;\ndetermining, by the one or more processors at a server, at least one malware attribute of the sample;\ndetermining that the at least one malware attribute of the sample includes the particular malware attribute;\nselecting, from the plurality of workflows, the user-defined workflow for analyzing the sample;\ncausing, by the one or more processors at the server, one or more analyzers to analyze the sample according to the user-defined workflow to obtain an analysis result, the one or more analyzers including the particular analyzer that is trained using machine learning; and\nproviding (I) the analysis result in a colloquial language format, and (II) data for generating a second graphical user interface at the user device, the second graphical user interface being configured to display, at the user device, the analysis result and an action control interface that receives a selection of one or more remedial actions based on the analysis result.\n2. The computer-implemented method of claim 1, wherein the user-defined workflow designates an order in which to run each of the one or more analyzers.\n3. The computer-implemented method of claim 2, wherein the order includes running at least two of the one or more analyzers concurrently.\n4. The computer-implemented method of claim 1, further comprising providing a summary including at least one user-readable description of the analysis result to be displayed using the second graphical user interface.\n5. The computer-implemented method of claim 4, wherein the summary includes a confidence level associated with the at least one user-readable description.\n6. The computer-implemented method of claim 4, wherein the summary includes at least one recommendation for remediating malware in the sample.\n7. The computer-implemented method of claim 1, further comprising:\ndetermining, by the one or more processors and based, at least in part, on the analysis result, a modified workflow for continued analysis of the sample by the one or more analyzers according to the modified workflow,\nwherein the modified workflow includes one or more of (i) designating one or more additional analyzers, (ii) altering an order in which to run each of the one or more analyzers, (iii) re-analyzing the analysis result by at least one of the one or more analyzers, and (iv) re-analyzing the analysis result by a particular analyzer that produced the analysis result.\n8. The computer-implemented method of claim 7, further comprising receiving an indication of a user input,\nwherein determining the modified workflow for continued analysis of the sample by the one or more analyzers according to the modified workflow is based on the indication of the user input.\n9. The computer-implemented method of claim 7, wherein the modified workflow is determined by applying at least one rule to the analysis result.\n10. The computer-implemented method of claim 1, wherein the one or more remedial actions include (i) a removal action to remove malware associated with the sample, (ii) an alert action to alert a designated entity of the analysis result, and (iii) an analytics action to execute an additional analysis of the sample.\n11. The computer-implemented method of claim 1, wherein the sample including the potential malware is received after storing the configuration data in the workflow definition database.\n12. The computer-implemented method of claim 1, wherein the configuration data includes a selection of the one or more analyzers from among a plurality of analyzers and a chronological order of applying the one or more analyzers.\n13. A system comprising:\none or more processors; and\na non-transitory computer-readable storage medium coupled to the one or more processors having instructions stored thereon which, when executed by the one or more processors, causes the one or more processors to perform operations comprising:\ntraining a particular analyzer using machine learning to classify data samples as including malware or not including malware;\nproviding data for generating a graphical user interface at a user device, the graphical user interface being configured to receive, through user selectable options, configuration data that (i) defines a user-defined workflow to control one or more analyzers for analyzing malware having a particular malware attribute and (ii) specifies whether one or more virtual machines are to be supported by the user-defined workflow;\nreceiving, from the user device, the configuration data through the graphical user interface;\nstoring the configuration data in a workflow definition database, the workflow definition database including workflow definitions for a plurality of workflows respectively associated with a plurality of malware attributes;\nreceiving a sample including a potential malware;\ndetermining, at a server, at least one malware attribute of the sample;\ndetermining that the at least one malware attribute of the sample includes the particular malware attribute;\nselecting, from the plurality of workflows, the user-defined workflow for analyzing the sample;\ncausing, at the server, one or more analyzers to analyze the sample according to the user-defined workflow to obtain an analysis result, the one or more analyzers including the particular analyzer that is trained using machine learning; and\nproviding (I) the analysis result in a colloquial language format and (II) data for generating a second graphical user interface at the user device, the second graphical user interface being configured to display, at the user device, the analysis result and an action control interface that receives a selection of one or more remedial actions based on the analysis result.\n14. The system of claim 13, wherein the user-defined workflow designates an order in which to run each of the one or more analyzers.\n15. The system of claim 14, wherein the order includes running at least two of the one or more analyzers concurrently.\n16. The system of claim 13, further comprising providing a summary including at least one user-readable description of the analysis result to be displayed using the second graphical user interface.\n17. The system of claim 16, wherein the summary includes a confidence level associated with the at least one user-readable description.\n18. The system of claim 16, wherein the summary includes at least one recommendation for remediating malware in the sample.\n19. The system of claim 13, wherein the one or more processors perform operations further comprising:\ndetermining, based, at least in part, on the analysis result, a modified workflow for continued analysis of the sample by the one or more analyzers according to the modified workflow,\nwherein the modified workflow includes one or more of (i) designating one or more additional analyzers, (ii) altering an order in which to run each of the one or more analyzers, (iii) re-analyzing the analysis result by at least one of the one or more analyzers, and (iv) re-analyzing the analysis result by a particular analyzer that produced the analysis result.\n20. The system of claim 19, wherein the one or more processors perform operations further comprising receiving an indication of a user input,\nwherein determining the modified workflow for continued analysis of the sample by the one or more analyzers according to the modified workflow is based on the indication of the user input.\n21. The system of claim 19, wherein the modified workflow is determined by applying at least one rule to the analysis result.\n22. The system of claim 13, wherein the one or more remedial actions include (i) a removal action to remove malware associated with the sample, (ii) an alert action to alert a designated entity of the analysis result, and (iii) an analytics action to execute an additional analysis of the sample.\n23. The system of claim 13, wherein the sample including the potential malware is received after storing the configuration data in the workflow definition database.\n24. The system of claim 13, wherein the configuration data includes a selection of the one or more analyzers from among a plurality of analyzers and a chronological order of applying the one or more analyzers.\n25. A non-transitory computer-readable storage medium encoded with a computer program comprising instructions that, when executed, operate to cause one or more processors to perform operations comprising:\ntraining a particular analyzer using machine learning to classify data samples as including malware or not including malware;\nproviding data for generating a graphical user interface at a user device, the graphical user interface being configured to receive, through user selectable options, configuration data that (i) defines a user-defined workflow to control one or more analyzers for analyzing malware having a particular malware attribute and (ii) specifies whether one or more virtual machines are to be supported by the user-defined workflow;\nreceiving, from the user device, the configuration data through the graphical user interface;\nstoring the configuration data in a workflow definition database, the workflow definition database including workflow definitions for a plurality of workflows respectively associated with a plurality of malware attributes;\nreceiving a sample including a potential malware;\ndetermining, at a server, at least one malware attribute of the sample;\ndetermining that the at least one malware attribute of the sample includes the particular malware attribute;\nselecting, from the plurality of workflows, the user-defined workflow for analyzing the sample;\ncausing, at the server, one or more analyzers to analyze the sample according to the user-defined workflow to obtain an analysis result, the one or more analyzers including the particular analyzer that is trained using machine learning; and\nproviding (I) the analysis result in a colloquial language format and (II) data for generating a second graphical user interface at the user device, the second graphical user interface being configured to display, at the user device, the analysis result and an action control interface that receives a selection of one or more remedial actions based on the analysis result.\n26. The non-transitory computer-readable storage medium of claim 25, wherein the user-defined workflow designates an order in which to run each of the one or more analyzers.\n27. The non-transitory computer-readable storage medium of claim 26, wherein the order includes running at least two of the one or more analyzers concurrently.\n28. The non-transitory computer-readable storage medium of claim 25, further comprising providing a summary including at least one user-readable description of the analysis result to be displayed using the second graphical user interface.\n29. The non-transitory computer-readable storage medium of claim 28, wherein the summary includes a confidence level associated with the at least one user-readable description.\n30. The non-transitory computer-readable storage medium of claim 28, wherein the summary includes at least one recommendation for remediating malware in the sample.\n31. The non-transitory computer-readable storage medium of claim 25, wherein the one or more processors perform operations further comprising:\ndetermining, based, at least in part, on the analysis result, a modified workflow for continued analysis of the sample by the one or more analyzers according to the modified workflow,\nwherein the modified workflow includes one or more of (i) designating one or more additional analyzers, (ii) altering an order in which to run each of the one or more analyzers, (iii) re-analyzing the analysis result by at least one of the one or more analyzers, and (iv) re-analyzing the analysis result by a particular analyzer that produced the analysis result.\n32. The non-transitory computer-readable storage medium of claim 31, wherein the one or more processors perform operations further comprising receiving an indication of a user input,\nwherein determining the modified workflow for continued analysis of the sample by the one or more analyzers according to the modified workflow is based on the indication of the user input.\n33. The non-transitory computer-readable storage medium of claim 31, wherein the modified workflow is determined by applying at least one rule to the analysis result.\n34. The non-transitory computer-readable storage medium of claim 25, wherein the one or more remedial actions include (i) a removal action to remove malware associated with the sample, (ii) an alert action to alert a designated entity of the analysis result, and (iii) an analytics action to execute an additional analysis of the sample.\n35. The non-transitory computer-readable storage medium of claim 25, wherein the sample including the potential malware is received after storing the configuration data in the workflow definition database.\n36. The non-transitory computer-readable storage medium of claim 25, wherein the configuration data includes a selection of the one or more analyzers from among a plurality of analyzers and a chronological order of applying the one or more analyzers."
}