{
    "patent_link": "https://patents.google.com/patent/US20040054572A1/en",
    "patent_id": "US20040054572A1",
    "title": "Collaborative filtering",
    "abstract": "A method of filtering data to predict an observation about an item for a particular case is provided in which: a set of data representing actual observations about a plurality of items for a plurality of different cases is modelled as a function of a plurality of case and item profiles, each profile being a set of parameters comprising at least one hidden metrical variable, the parameters defining characteristics of the respective case or item; a best fit of the function to the data is found in order to find the values of the item profiles; and the profiles found are used together with the function to predict an observation for a particular case about one or more items for which data is not available for that case.",
    "inventors": [
        "Alison Oldale",
        "John Oldale",
        "John Reenen",
        "Michael Campbell"
    ],
    "assignee": "POLYGNOSTICS Ltd",
    "classifications": [
        "G06F16/337",
        "G06F16/335",
        "G06F16/9535",
        "G06F2216/03"
    ],
    "claims": "\n1. A method of filtering data to predict an observation about an item for a particular case, in which: a set of data representing actual observations about a plurality of items for a plurality of different cases is modelled as a function of a plurality of case and item profiles, each profile being a set of parameters comprising at least one hidden metrical variable, the parameters defining characteristics of the respective case or item;\na best fit of the function to the data is approximated in order to find the values of the item profiles; and\nthe profiles found are used together with the function to predict an observation for a particular case about one or more items for which data is not available for that case.\n2. A method as claimed in claim 1, wherein the function which models the data set comprises a plurality of models, each model representing the observations about one item for the cases in the data set.\n3. A method as claimed in claim 1 or 2, wherein each model is derived by identifying a model type which approximates the closest fit to the data available for the item in question.\n4. A method as claimed in claim 1, 2 or 3, wherein in the function which models the data set, the observations about items for cases are independent, conditional on the case profiles.\n5. A method as claimed in any preceding claim, wherein the models which make up the function are learnt from past observations.\n6. A method as claimed in any preceding claim, wherein point estimates of the parameters of the case and item profiles are found for the dataset and these are used to predict an observation.\n7. A method of filtering data to predict an observation about an item for a particular case, in which a set of data is obtained representing actual observations for a plurality of cases, including the particular case, about a plurality of items, a function which models the data set is solved so that the data is decomposed into a plurality of case profiles and item profiles, and an observation for the particular case about an item is predicted using the case profiles and item profiles obtained.\n8. A method as claimed in claim 6 or 7, wherein the function is maximised so as to determine the case and item profiles.\n9. A method as claimed in claim 8, wherein the data set is modelled as a function of the likelihood of the data in the data set being present and the function is solved by choosing item profiles and case profiles which maximise the likelihood of the data in the data set being present.\n10. A method as claimed in claim 8 or 9, wherein the function is maximised iteratively such that one of the case and item profiles is held constant during each step of an iteration.\n11. A method as claimed in any of claims 1 to 5, wherein the function which models the dataset is a function of a prior distribution over possible case profiles and point estimates of the item profiles are then obtained.\n12. A method of filtering data to predict an observation about an item for a particular case, in which a set of data is obtained representing actual observations for a plurality of cases about a plurality of items, a function which models the data set as a function of a plurality of item profiles and a prior distribution over a plurality of possible case profiles is set up to provide point estimates of the item profiles that fit the function to the data, and an observation about an item for a particular case is predicted using the item profile point estimates obtained together with a set of data representing observations about a plurality of items for the said particular case.\n13. A method as claimed in any preceding claim, wherein the observation is predicted by updating a prior distribution over possible case profiles using Bayesian inference.\n14. A method of filtering data to predict an observation about an item for a particular case, in which a set of data representing actual observations for a plurality of cases about a plurality of items is modelled by a function, and the function is solved so as to decompose the data into a plurality of case profiles and a plurality of item profiles, and an observation for the particular case about an item is predicted by Bayesian inference using the case profiles and item profiles obtained together with a set of data representing observations about a plurality of items for the said particular case.\n15. A method as claimed in claim 14, wherein the case profiles obtained are used to obtain a prior probability distribution over possible case profiles for the said particular case and the prior probability distribution is then used in the Bayesian inference.\n16. A method as claimed in claim 15, wherein the prior probability distribution is generated by taking an average of the case profiles in the data set.\n17. A method as claimed in claim 16, wherein a posterior probability distribution over possible case profiles for the said particular case is generated from the prior probability distribution by Bayesian inference using the set of data relating to the said case and the function modelling the likelihood of the data set being present.\n18. A method as claimed in claim 17, wherein the posterior probability distribution is used to generate a probability distribution over possible observations about items for the particular case.\n19. A method as claimed in any of claims 13 to 18, wherein only the data relating to those items for which observations have been obtained for the case is used in updating the prior distribution over possible case profiles.\n20. A method as claimed in any of claims 13 to 19, wherein the item profiles are estimated as those parameters which maximise the fit between the function which models the data set and the data.\n21. A method as claimed in any of claims 13 to 20, wherein the number of components of each item profile is set to maximise the effectiveness of the function in making predictions.\n22. A method as claimed in claim 21, wherein the number of components is set using standard model selection techniques such as the Akaike information criterion.\n23. A method as claimed in claim 11 or 12, wherein the data set is modelled as a function of the expected likelihood of the data in the data set being present and the item profiles are chosen as the parameter values which maximise the likelihood of the data in the data set being present given the function and the assumed prior distribution of the case profiles.\n24. A method as claimed in claim 23, wherein the function is maximised iteratively and preferably, an EM algorithm is used to do this.\n25. A method as claimed in any of claims 13 to 24, wherein the prior distribution over each component of the plurality of possible case profiles is assumed to be a standard normal distribution and the components are assumed to be independent.\n26. A method as claimed in claim 25, wherein this distribution is also used in the Bayesian inference to estimate the observation about an item for the particular case.\n27. A method as claimed in any of claims 13 to 26, wherein a posterior probability distribution over possible case profiles for the said particular case is generated from the prior probability distribution by Bayesian inference using the set of data relating to the said particular case and the function modelling the likelihood of the data set being present.\n28. A method as claimed in claim 27, wherein the posterior probability distribution is used to generate a probability distribution over possible observations about items for the particular case.\n29. A method as claimed in any preceding claim, wherein each case is a different user of a prediction system such that observations by that user about various items are included in the dataset.\n30. A method as claimed in claim 29, wherein the function is made up of a plurality of models, each model representing the suitability of an item for a user.\n31. A method as claimed in claim 30, wherein each model of the suitability of an item for a user depends directly only on the case profile for that user and the profile for that item, and not directly on any of the data relating to the suitability for the user of any other item.\n32. A method of filtering data to predict an observation about an item for a particular case, in which a set of data is obtained representing actual observations for a plurality of cases about a plurality of items, a function which models the data set as a function of a set of case profiles and a set of items profiles comprising sets of parameters is set up, wherein the case and item profiles each comprise at least one hidden metrical variable, the parameters defining the characteristics of each said respective case and item, the method comprising the steps of:\na) estimating the values of the case profile parameters by solving a hidden variable model of the dataset;\nb) using the estimated values of the case profile metrical variables in the function to estimate the values of the item profile metrical variables; and\nc) predicting an observation about an item for a particular case using the item profile values obtained together with a set of data representing observations about a plurality of items for the said particular case.\n33. A method as claimed in claim 32, wherein the case profile values are estimated by solving a hidden variable model of the dataset to find approximate values of the item profile variables and the approximate item profile values are then used to estimate the case profile values.\n34. A method as claimed in claim 33, wherein the hidden variable model used is a linear model such as for example a standard linear factor model or principal component analysis.\n35. A method as claimed in any of claims 32 to 34, wherein the estimated case profile values are substituted into the function modelling the dataset which is then solved using maximum likelihood techniques to find the item profile values.\n36. A method as claimed in any of claims 32 to 35, wherein items in the dataset are considered as belonging to a plurality of different groups, each group having a different set of case profiles associated with it so that the case profile values for each group are estimated separately.\n37. A method as claimed in any of claims 32 to 36, wherein some items in the dataset are treated directly as observed components of the case profile, i.e. as values of one or more of the metrical variables.\n38. A method as claimed in any of claims 32 to 37, wherein the prediction of an observation about an item for the case is made by updating a prior distribution over possible profiles for the case by Bayesian inference and then using the updated case profile obtained together with the function modelling the dataset and the estimated item profile values to make predictions.\n39. A method as claimed in any of claims 32 to 37, wherein an observation about an item for the case is estimated by maximising the likelihood of the data relating to the case in question given the function modelling the dataset and the estimated item profile values to find the values of the case profile, and then using the case profile obtained together with a likelihood function and the estimated item profiles to predict observations about items for that case.\n40. A method as claimed in any preceding claim, wherein the method for estimating an observation about an item for the case is implemented using a software program that manipulates Bayesian networks.\n41. A method as claimed in any preceding claim, wherein the item profiles and the prior distribution over possible case profiles or the actual case profiles are calculated in an off-line non real-time filtering engine and are supplied to an on-line real-time engine for use in the calculation of predicted observations for a case when a set of data relating to the said case is supplied to the real-time engine.\n42. A method of filtering data to find items which are similar to an item specified by a user, in which a set of data representing observations about a plurality of items for a plurality of cases is obtained, a function which models the data set is used to estimate a plurality of item profiles each containing a set of parameters representing characteristics of the item and at least one hidden metrical variable, and wherein items which are similar to a specified item are found by comparing the item profile of the specified item to other item profiles.\n43. A method of filtering data, in which a set of data representing observations about a plurality of items for a plurality of cases is obtained, a function which models the data set is solved so that the data is used to estimate a plurality of item profiles each containing a set of parameters representing characteristics of the item, and at least one hidden metrical variable, and wherein cases and/or items are sorted into groups or clusters such that each group contains cases or items having similar case or item profiles.\n44. A method as claimed in any preceding claim, wherein statistical techniques are used to correct for bias in the case data prior to predicting an observation about an item for a particular case.\n45. A method as claimed in any preceding claim, further comprising the step of obtaining data relating to the assessment by a plurality of users of one or more exogenous standards so as to increase the amount and range of data available.\n46. A method of obtaining a data set from which the suitability of a specific object for a user can be estimated, in which data relating to the suitability for a plurality of users of a plurality of related objects is obtained together with data relating to the preferences of those users for at least one exogenous standard which is not directly related to the plurality of related objects.\n47. A method of obtaining a data set from which an observation for a case about a specific object can be predicted, in which data relating to the observations for a plurality of cases about a plurality of predefined items is obtained and in which further data relating to one or more attributes of one or more of the predefined items may also be provided for one or more of the cases.\n48. A method as claimed in any preceding claim, wherein a pre-filtering processing step is provided to carry out preliminary screening using objective criteria to reduce the number of items that must be assessed in the filtering step.\n49. A method as claimed in claim 48, wherein weighting factors may be applied to the data relating to the observations about items for the cases prior to the filtering step.\n50. A method as claimed in claim 49, wherein the weighting factors applied to the data reflect the time that has elapsed since the time at which the observation about the item was formed such that the weight of each piece of data for predictive purposes declines with time.\n51. A method of weighting data relating to observations about an item in which the weight of the data decreases with an increase in the time elapsed since the observation was made.\n52. A method as claimed in any of claims 48 to 51, wherein a post filtering processing step is provided in addition to or instead of the pre-filtering processing step.\n53. A method as claimed in claim 52, wherein the post-filtering processing step is a rules based processing step which excludes any items which do not fall within a defined set of criteria from the predictions output from the filtering step.\n54. A method as claimed in any preceding claim, wherein a different type of output giving an estimated prediction such as for example the generic mean of the output can be substituted for filtering predictions where, for whatever reason, there-is insufficient information concerning either one or more items within the item database or concerning one or more cases.\n55. A method as claimed in claim 54, wherein the estimated predictions are replaced gradually by predictions obtained from the filtering method of the invention as more data becomes available.\n56. A method as claimed in claim 53, wherein a manager of the dataset generates a fixed number of phantom cases such that the profile of an item for which insufficient data is available is specified by the manager as being a weighted average of some other items and the phantom cases are specified to rate that item with ratings which depend on the manually determined profile.\n57. A method as claimed in any preceding claim, wherein the method is used to provide a data filtering service in which a database of observations about a plurality of items for a plurality of users is obtained and analysed on an exclusive basis for a single client.\n58. A method as claimed in any of claims 1 to 56, wherein the method is used to provide a data filtering service in which a database of observations about a plurality of items for a plurality of cases is obtained and analysed to provide a database which may be pooled with other databases, the filtering service operating from the pooled databases via linkage preferably through a dedicated extranet. Under this arrangement a single history database (i.e. a data set representing the suitability of a plurality of objects for a plurality of users) may be established, developed and maintained for the class of clients being served as a whole.\n59. A method as claimed in claim 58, wherein the pooled database is configured such that, although the history database is held in common as described above, contributing websites retain either partial or complete exclusivity in relation to the inputs and outputs from the database in respect of those particular users that register through their sites.\n60. A method as claimed in claim 58, wherein database information concerning individual users may be held in a common pooled database but either partial or complete exclusivity may be maintained by individual clients in relation to inputs and outputs in relation to specific classes of item.\n61. A method as claimed in any preceding claim, wherein an indication of the level of personalisation of the predictions provided is given at the user interface.\n62. A method of providing an indication of the level of personalisation of recommendations generated by a collaborative filtering engine to a user at the user interface.\n63. A method as claimed in claim 61 or 62, wherein the indication of the level of personalisation is provided by a sliding scale representing a personalisation score.\n64. A method as claimed in any of claims 61 to 63, wherein the recommendations are generated by a filtering method according to any one of claims 1 to 41 and the personalisation score is obtained by determining the q average variance of the probability distribution over each characteristic for the case in question.\n65. A method as claimed in any of claims 61 to 64, wherein the recommendations provided to the user at the user interface are updated each time that the user enters a further piece of information into the database.\n66. A method as claimed in any of claims 61 to 65, wherein the user interface is a web site and the inputting of information is carried out on the same page on which the personalisation level indicator and the recommendations are displayed.\n67. A method as claimed in any preceding claim, wherein each item in the data set is plotted against a first component of the item profile and a second component of the item profile on the x and y axes respectively.\n68. A method as claimed in claim 67, wherein if the user considers that the position of an item is incorrect, he can move that item thus imposing a different profile on it.\n69. A method of filtering data in which a function is set up which models a set of data representing observations about a plurality of items for a plurality of cases, as a function of a plurality of item profiles and case profiles each containing a set of unknown parameters defining characteristics of the case or item, and a best fit of the function to the data is found in order to find the values of the unknown parameters, the unknown parameters for each item are compared to one another and, if desired, an operator alters one or more of the unknown parameters for one or more of the items before using the sets of unknown parameters to analyse the underlying trends in the data.\n70. A method as claimed in claim 69, wherein the parameters found together with the altered parameters are used together with the function to predict an observation about one or more items for a particular case for which data is not available.\n71. A computer program product for carrying out the method as claimed in any preceding claim when run on computer processing means.\n72. A computer program product containing instructions which when run on computer processing means will create a computer program for carrying out the method as claimed in any preceding claim.\n73. A method of filtering data to find items which are suitable for a user, in which a set of data representing observations about a plurality of items for a plurality of users is obtained, a function which models the data set is used to estimate a plurality of user profiles each comprising a set of parameters representing characteristics of the case, wherein items which were preferred by users with similar user profiles to the user are recommended to that user.\n74. Data processing means programmed to carry out the method as claimed in any preceding claim.",
    "status": "Abandoned",
    "citations_own": [
        "US5901246A",
        "US5960097A",
        "US6049777A",
        "US6081750A",
        "US6088718A",
        "US6400996B1",
        "US7136710B1",
        "US7242988B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20020178057A1",
        "US20030093329A1",
        "US20040030667A1",
        "US20040172267A1",
        "US20040225553A1",
        "US20040243604A1",
        "US20040243527A1",
        "US20040244029A1",
        "US20040249713A1",
        "US20040249700A1",
        "US20040260600A1",
        "US20040260688A1",
        "US20040267596A1",
        "US20050071218A1",
        "US20050165832A1",
        "US20050229233A1",
        "US20050278362A1",
        "US20050283398A1",
        "US20060143079A1",
        "US20060190422A1",
        "US20060253469A1",
        "US20060253309A1",
        "US20060282304A1",
        "US20060294084A1",
        "US20070112733A1",
        "US20070118546A1",
        "US20070124698A1",
        "US20070203783A1",
        "US20070239553A1",
        "US20080005163A1",
        "US7318005B1",
        "US20080027890A1",
        "US20080028067A1",
        "US20080071786A1",
        "US20080071630A1",
        "US20080077471A1",
        "US20080148179A1",
        "US20080147575A1",
        "US20080147702A1",
        "US20080215989A1",
        "US20080256088A1",
        "US20080275775A1",
        "US20080294617A1",
        "US20080295133A1",
        "US20080301166A1",
        "WO2008157693A1",
        "US20090006176A1",
        "US20090083126A1",
        "US20090094095A1",
        "US20090112989A1",
        "US20090112807A1",
        "US20090171763A1",
        "US20090248497A1",
        "US7606684B1",
        "US20090281923A1",
        "US20090281895A1",
        "US20090289760A1",
        "US7689432B2",
        "US20100082421A1",
        "US20100100416A1",
        "US20100138278A1",
        "US20100191663A1",
        "US7797642B1",
        "US7831917B1",
        "US20100325583A1",
        "US7870052B1",
        "US20110010366A1",
        "US20110066497A1",
        "US7917866B1",
        "US20110087679A1",
        "US20110131163A1",
        "US20110184807A1",
        "US20110238611A1",
        "US20110307323A1",
        "US20110313800A1",
        "US8103540B2",
        "US20120059825A1",
        "US8171424B1",
        "US8175989B1",
        "US8219447B1",
        "US20120203723A1",
        "US20120203660A1",
        "US20120246161A1",
        "US20120316986A1",
        "US20120330777A1",
        "US8370241B1",
        "US20130046613A1",
        "US8412726B2",
        "US20130097531A1",
        "US20130226918A1",
        "US20130262219A1",
        "US20130325548A1",
        "US20130332549A1",
        "US20140108162A1",
        "US8738467B2",
        "US8756501B1",
        "US20140207718A1",
        "US8805735B1",
        "US20140229234A1",
        "US20140278737A1",
        "US20140330966A1",
        "US20150356087A1",
        "US20160019625A1",
        "US9256829B2",
        "US20160241311A1",
        "WO2017003874A1",
        "WO2017075513A1",
        "US20170344665A1",
        "EP2377011A4",
        "US20180020255A1",
        "US9986277B2",
        "CN108629618A",
        "US10320913B2",
        "US10395283B2",
        "CN110490635A",
        "US10595094B2",
        "US10594870B2",
        "US10592957B2",
        "WO2020106586A1",
        "US10782864B1",
        "US20200334700A1",
        "US20220043823A1",
        "CN114416351A",
        "US20220138232A1",
        "US20220214679A1",
        "US20220253876A1",
        "US11625757B1",
        "US11657080B2",
        "US11825171B2"
    ],
    "citedby_ftf": [
        "US8195719B2",
        "GB2492587A",
        "CN104063481B",
        "CN109597899B",
        "CN109522279A"
    ]
}