{
    "patent_link": "https://patents.google.com/patent/US20070203783A1/en",
    "patent_id": "US20070203783A1",
    "title": "Market simulation model",
    "abstract": "Methods and computer program products for providing a market simulation model. A method includes receiving consumer data including one or more ratings of a product characteristic, the ratings reflecting a latent measure of the product characteristic. The ratings are represented as a probability distribution. The latent measure of the product characteristic is varied and an updated probability distribution is created in response to the varying. A sensitivity of market share to the product characteristic is analyzed based on the probability distribution and to the updated probability distribution.",
    "inventors": [
        "Mark Beltramo"
    ],
    "assignee": "GM Global Technology Operations LLC",
    "classifications": [
        "G06Q30/02",
        "G06Q30/0201",
        "G06Q30/0203"
    ],
    "claims": "\n1. A method for performing market simulation, the method comprising:\nreceiving consumer data including one or more ratings of a product characteristic, the ratings reflecting a latent measure of the product characteristic;\nrepresenting the ratings as a probability distribution;\nvarying the latent measure of the product characteristic;\ncreating an updated probability distribution in response to the varying; and\nanalyzing a sensitivity of market share to the product characteristic, the analyzing responsive to the probability distribution and to the updated probability distribution.\n2. The method of claim 1 wherein the product characteristic is a subjective performance attribute.\n3. The method of claim 1 wherein the ratings are on an ordinal scale.\n4. The method of claim 1 wherein the latent measure is on a continuous scale.\n5. The method of claim 1 wherein the probability distribution is a normal curve.\n6. The method of claim 1 wherein the probability distribution includes continuous values.\n7. The method of claim 1 wherein the probability distribution includes discrete values.\n8. The method of claim 1 wherein the latent measure is a latent perceived performance of the product characteristic.\n9. The method of claim 1 wherein the analyzing is performed using a latent variable based statistical model.\n10. The method of claim 1 further comprising comparing the sensitivity of market share to the product characteristics of two or more products.\n11. A method for performing market simulation, the method comprising:\nreceiving consumer data including one or more ratings of a product characteristic, the ratings reflecting a latent measure of the product characteristic;\nrepresenting the ratings as a probability distribution;\ncalculating a change to the latent measure of the product characteristic based on a specified change to a top-box proportion of the probability distribution or based on a specified change to a mean observed rating of the product characteristic;\ncalculating a low distribution of the data in response to the calculated change in the latent measure;\ncalculating a high distribution of the data in response to the calculated change in the latent measure; and\ncalculating change in product share caused by the change in the latent measure of the product characteristic in response to the low and high distributions of the data.\n12. The method of claim 11 wherein the product characteristic is a subjective performance attribute.\n13. The method of claim 11 wherein the ratings are on an ordinal scale.\n14. The method of claim 11 wherein the latent measure is on a continuous scale.\n15. The method of claim 11 wherein the probability distribution includes continuous values.\n16. The method of claim 11 wherein the latent measure is a latent perceived performance of the product characteristic.\n17. A computer program product for performing market simulation, the computer program product comprising:\na storage medium readable by a processing circuit and storing instructions for execution by the processing circuit for performing a method comprising:\nreceiving consumer data including one or more ratings of a product characteristic, the ratings reflecting a latent measure, of the product characteristic;\nrepresenting the ratings as a probability distribution;\nvarying the latent measure of the product characteristic;\ncreating an updated probability distribution in response to the varying; and\nanalyzing a sensitivity of market share to the product characteristic, the analyzing responsive to the probability distribution and to the updated probability distribution.\n18. The computer program product of claim 17 wherein the product characteristic is a subjective performance attribute.\n19. The computer program product of claim 17 wherein the ratings are on an ordinal scale.\n20. The computer program product of claim 17 wherein the latent measure is on a continuous scale.",
    "status": "Abandoned",
    "citations_own": [
        "US20030065555A1",
        "US20040054572A1",
        "US20050182659A1",
        "US20060095306A1",
        "US7191143B2",
        "US7318005B1",
        "US7406436B1",
        "US7577578B2",
        "US7698161B2",
        "US7707091B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20030200134A1",
        "US20090006176A1",
        "US20090319310A1",
        "US20100082521A1",
        "US20100106561A1",
        "US20100138360A1",
        "US20100205034A1",
        "US20100306028A1",
        "US20110071874A1",
        "US20130024170A1",
        "US8631040B2",
        "US20140019205A1",
        "US9037998B2",
        "US9047559B2",
        "US9147218B2",
        "US9208209B1",
        "US9244887B2",
        "US9311383B1",
        "WO2016077722A1",
        "US9418339B1",
        "US9785995B2",
        "US9799041B2",
        "US9892370B2",
        "US9934259B2",
        "US10169720B2",
        "US10255085B1",
        "US10331490B2",
        "US10338994B1",
        "US10354263B2",
        "US10983682B2",
        "US11657417B2"
    ],
    "citedby_ftf": []
}