{
    "patent_link": "https://patents.google.com/patent/US20020032670A1/en",
    "patent_id": "US20020032670A1",
    "title": "Neural network processing system using semiconductor memories",
    "abstract": "Herein disclosed is a data processing system having a memory packaged therein for realizing a large-scale and high-speed parallel distributed processing and, especially, a data processing system for the neural network processing. The neural network processing system according to the present invention comprises: a memory circuit for storing neuron output values, connection weights, the desired values of outputs, and data necessary for learning; an input/output circuit for writing or reading data in or out of said memory circuit; a processing circuit for performing a processing for determining the neuron outputs such as the product, sum and nonlinear conversion of the data stored in said memory circuit, a comparison of the output value and its desired value, and a processing necessary for learning; and a control circuit for controlling the operations of said memory circuit, said input/output circuit and said processing circuit. The processing circuit is constructed to include at least one of an adder, a multiplier, a nonlinear transfer function circuit and a comparator so that at least a portion of the processing necessary for determining the neutron output values such as the product or sum may be accomplished in parallel. Moreover, these circuits are shared among a plurality of neutrons and are operated in a time sharing manner to determine the plural neuron output values. Still moreover, the aforementioned comparator compares the neuron output value determined and the desired value of the output in parallel.",
    "inventors": [
        "Takao Watanabe",
        "Katsutaka Kimura",
        "Kiyoo Itoh",
        "Yoshiki Kawajiri"
    ],
    "assignee": "Renesas Electronics Corp",
    "classifications": [],
    "claims": "\n1. A data processing system comprising:\na memory (A, B, TG) for storing data;\nan input/output circuit (IO) for performing at least one of the operation of writing data in said memory and the operation of reading data from said memory;\nan arithmetic circuit (12, 12 a, 12 b) for arithmetics by using the data stored in said memory; and\na control circuit (CNT, 13, 13A, 13B) for controlling the operations of said memory, said input/output circuit and said arithmetic circuit,\nwherein said arithmetic circuit has: a function to calculate the updated value of the output value of a neuron, which is stored in said memory, by using said neuron output value and the connection weight between neurons; and a function to calculate the distance (or similarity) between the desired value of the neuron output value stored in said memory and the neuron output value obtained.\n2. A data processing system according to claim 1, wherein said memory is stored with a plurality of input data having different characteristics.\n3. A data processing system according to claim 2, wherein said memory is stored with a desired value of the output value of the neuron.\n4. A data processing system according to claim 2, wherein said memory is constructed of a plurality of blocks, of which: the first block (A) is stored with the neuron output value (Vis); and the second block (B) is stored with the connection weight (Tji) between the neurons.\n5. A data processing system according to claim 4, wherein said memory further has a third block (TG) stored with the desired value of the neuron output value.\n6. A data processing system according to claim 5, wherein said memory is stored with at least one of said neuron output value and said connection weight between the neurons by using a plurality of bits.\n7. A data processing system according to claim 6, wherein the plural bits expressing the neuron output value or the connection weight between the neurons are partially used to express the codes of said neuron 5 output value and said connection weight between the neurons.\n8. A data processing system according to claim 7, wherein said memory is constructed of memory cells each composed of one transistor and one capacitor.\n9. A data processing system comprising:\na memory (A, B, TG) for storing data;\nan input/output circuit (IO) for performing at least one of the operation of writing data in said memory and the operation of reading data from said memory;\nan arithmetic circuit (12, 12 a, 12 b) for arithmetics by using the data stored in said memory; and\na control circuit (CNT, 13, 13A, 13B) for controlling the operations of said memory, said input/ output circuit and said arithmetic circuit,\nwherein said memory includes a memory cell array having: a plurality of data lines; a plurality of word lines (WA) arranged to intersect with said data lines; and memory cells (MC) arranged at the desired ones of said intersections, so that the data stored in the different plural memory cells can be read out to the different plural data lines intersecting with said word lines by selecting at least one of said word lines,\nwherein said arithmetic circuit has a function to calculate the updated value of the neuron output value by using the data read out from said memory, and\nwherein said input/output circuit has a function to write said updated value in said memory.\n10. A data processing system according to claim 9,\nwherein said memory cell array is stored with the desired value of said neuron output values, and\nwherein said arithmetic circuit includes means for calculating the distance (or similarity) between said desired value and the obtained neuron output value.\n11. A data processing system according to claim 9, wherein said memory cell array is stored with the neuron output value and the connection weight between the neurons.\n12. A data processing system according to claim 9, wherein said memory cell array is stored with a plurality of input data having different characteristics.\n13. A data processing system according to claim 9, wherein said data processing system is formed over one chip.\n14. A data processing system according to claim 10, wherein said memory is constructed of a plurality of blocks, of which: the first block (A) is stored with the neuron output value; and the second block (B) is stored with the connection weight between the neurons.\n15. A data processing system according to claim 14, wherein said memory is stored with at least one of said neuron output value and said connection weight between the neurons by using a plurality of bits.\n16. A data processing system according to claim 15, wherein the plural bits expressing the neuron output value or the connection weight between the neurons are partially used to express the codes of said neuron output value and said connection weight between the neurons.\n17. A data processing system according to claim 16, wherein said memory is constructed of memory cells each composed of one transistor and one capacitor.\n18. A data processing system according to claim 14, wherein said memory further has a third block (TG) stored with the desired value of the neuron output value.\n19. A data processing system according to claim 18, wherein said data processing system is formed over one chip.\n20. A data processing system comprising:\na memory (A, B, TG) for storing data;\nan input/output circuit (IO) for performing at least one of the operation of writing data in said memory and the operation of reading data from said memory;\nan arithmetic circuit (12, 12 a, 12 b) for arithmetics by using the data stored in said memory; and\na control circuit (CNT, 13, 13A, 13B) for controlling the operations of said memory, said input/ output circuit and said arithmetic circuit,\nwherein said arithmetic circuit has: a function to calculate the updated value of the output value of a neuron, which is stored in said memory, by using said neuron output value and the connection weight between neurons; and a function to calculate the distance (or similarity) between the desired value of the neuron output value stored in said memory and the neuron output value obtained, and\nwherein said data processing system is formed over one chip.\n21. A data processing system according to claim 20, wherein said memory is stored with at least one of said neuron output value and said connection weight between the neurons by using a plurality of bits.\n22. A data processing system according to claim 21, wherein the plural bits expressing the neuron output value or the connection weight between the neurons are partially used to express the codes of said neuron output value and said connection weight between the neurons.\n23. A data processing system according to claim 22, wherein said memory is constructed of memory cells each composed of one transistor and one capacitor.\n24. A data processing system according to claim 23, wherein said arithmetic circuit is an analog circuit.",
    "status": "Expired - Fee Related",
    "citations_own": [],
    "citations_ftf": [
        "US4254474A",
        "US4471426A",
        "US4611299A",
        "KR860007588A",
        "US4847755A",
        "US4777858A",
        "JP2569010B2",
        "JPS6339191A",
        "US5010477A",
        "US4797858A",
        "US5179680A",
        "JP3016392B2",
        "GB8720387D0",
        "US4955024A",
        "US4975961A",
        "JPH01128296A",
        "US5023833A",
        "JPH01159890A",
        "FR2625347B1",
        "US4979126A",
        "US4873962A",
        "US5165010A",
        "US5107442A",
        "US4974169A",
        "US4988891A",
        "US5140670A",
        "US5163120A",
        "US5239654A",
        "US5142665A",
        "US5301340A",
        "US5713037A"
    ],
    "citedby_own": [
        "US20020169729A1",
        "US20070147568A1",
        "US7774286B1",
        "US8065249B1",
        "US8667230B1",
        "US20160078361A1",
        "US9390368B2",
        "KR101803409B1",
        "US20190294952A1",
        "US10431287B2",
        "TWI699762B",
        "CN111581141A",
        "US11604521B2"
    ],
    "citedby_ftf": [
        "WO1993000654A1",
        "GB9113553D0",
        "US5636327A",
        "US5278945A",
        "JPH07505733A",
        "EP0566015A3",
        "US5256911A",
        "US5581778A",
        "KR100327712B1",
        "US5579527A",
        "US5717947A",
        "US5479574A",
        "DE4316533C2",
        "JP3345478B2",
        "US5603046A",
        "US5548771A",
        "US6335878B1",
        "US6665639B2",
        "US6041322A",
        "EP1038260B1",
        "WO1999054614A1",
        "US6502083B1",
        "US6523018B1",
        "JP2001155486A",
        "US6424961B1",
        "JP2001188767A",
        "FI113714B",
        "US6999952B1",
        "US7293002B2",
        "US7027446B2",
        "US6836767B2",
        "US7062476B2",
        "US6738301B2",
        "WO2004068456A2",
        "US7493295B2",
        "GB2399899B",
        "US8443169B2",
        "US8081592B2",
        "JP5045797B2",
        "JP2013140541A",
        "US9159020B2",
        "US8990130B2",
        "US9542643B2",
        "US9852006B2",
        "US9489618B2",
        "US10242313B2",
        "KR102505695B1",
        "CN109478253B",
        "KR102459854B1",
        "US10090047B2",
        "CN108255514A",
        "US11222260B2",
        "US11611352B2",
        "JP2019021367A",
        "US10586598B2",
        "KR102408858B1",
        "US11501140B2",
        "TWI695386B",
        "CA3109735A1",
        "US11443185B2",
        "US10741568B2",
        "KR102164996B1",
        "US10832745B1",
        "US11556759B2",
        "US11054997B2",
        "US11169737B2",
        "US11055003B2",
        "US11152054B2",
        "US11681797B2",
        "US11694065B2",
        "US11270756B2",
        "WO2021053453A1",
        "WO2021161808A1",
        "US11417372B2",
        "US11144482B1",
        "US11372585B2",
        "US11348622B2",
        "TWI749552B",
        "JP6983952B1",
        "US11449269B2",
        "JP7126534B2",
        "JP2022076546A",
        "KR20230080483A",
        "US11144822B1",
        "TWI788128B",
        "JP2023128729A"
    ]
}