{
    "patent_link": "https://patents.google.com/patent/US20020078039A1/en",
    "patent_id": "US20020078039A1",
    "title": "Architecture for distributed relational data mining systems",
    "abstract": "A computer-implemented data mining system includes an Interface Tier, an Analysis Tier, and a Database Tier. The Interface Tier supports interaction with users, and includes an On-Line Analytic Processing (OLAP) Client that provides a user interface for generating SQL statements that retrieve data from a database, and an Analysis Client that displays results from a data mining algorithm. The Analysis Tier performs one or more data mining algorithms, and includes an OLAP Server that schedules and prioritizes the SQL statements received from the OLAP Client, an Analytic Server that schedules and invokes the data mining algorithm to analyze the data retrieved from the database, and a Learning Engine performs a Learning step of the data mining algorithm. The Database Tier stores and manages the databases, and includes an Inference Engine that performs an Inference step of the data mining algorithm, a relational database management system (RDBMS) that performs the SQL statements against a Data Mining View to retrieve the data from the database, and a Model Results Table that stores the results of the data mining algorithm.",
    "inventors": [
        "Paul Cereghini",
        "Scott Cunningham"
    ],
    "assignee": "Teradata US Inc",
    "classifications": [
        "G06F16/2465",
        "G06F2216/03",
        "Y10S707/954",
        "Y10S707/966",
        "Y10S707/99936"
    ],
    "claims": "\n1. A computer-implemented data mining system, comprising:\n(a) an Interface Tier for supporting interaction with users, wherein the Interface Tier includes an On-Line Analytic Processing (OLAP) Client that provides a user interface for generating SQL statements that retrieve data from a database, and an Analysis Client that displays results from a data mining algorithm;\n(b) an Analysis Tier for performing one or more data mining algorithms, wherein the Analysis Tier includes an OLAP Server that schedules and prioritizes the SQL statements received from the OLAP Client, an Analytic Server that schedules and invokes the data mining algorithm to analyze the data retrieved from the database, and a Learning Engine performs a Learning step of the data mining algorithm; and\n(c) a Database Tier for storing and managing the databases, wherein the Database Tier includes an Inference Engine that performs an Inference step of the data mining algorithm, a relational database management system (RDBMS) that performs the SQL statements against a Data Mining View to retrieve the data from the database, and a Model Results Table that stores the results of the data mining algorithm.\n2. The data mining system of claim 1, wherein the Interface Tier converts the user's interaction with a graphical user interface (GUI) into SQL statements for use in querying the databases.\n3. The data mining system of claim 2, wherein the Interface Tier optimizes the SQL statements.\n4. The data mining system of claim 2, wherein the Analysis Tier optimizes the SQL statements using metadata retrieved from the Database Tier.\n5. The data mining system of claim 1, wherein the data mining algorithm is comprised of Learning and Inference steps, the Learning step is performed by the Learning Engine to discover new patterns in the databases, and the Inference step is performed by the Inference Engine to apply learning against new data.\n6. The data mining system of claim 5, wherein the Learning Engine invokes one or more probabilistic models implemented therein.\n7. The data mining system of claim 5, wherein the Learning Engine invokes one or more graphical models implemented therein.\n8. The data mining system of claim 5, wherein output from the Learning Engine is stored in the Model Results Table.\n9. The data mining system of claim 8, wherein the Inference Engine accesses the output from the Learning Engine stored in the Model Results Table.\n10. The data mining system of claim 9, wherein output from the Inference Engine is stored in the Model Results Table.\n11. The data mining system of claim 1, wherein the Database Tier performs the queries against the Data Mining View, and the Data Mining View provides a customized view of the databases for data mining and analysis.\n12. The data mining system of claim 11, wherein the Data Mining View performs an optimal normalization of the databases.\n13. The data mining system of claim 11, wherein the Data Mining View ensures that the variables selected are conceptually valid.\n14. A computer-implemented method for data mining, comprising:\n(a) supporting interaction with users in an Interface Tier, wherein the Interface Tier includes an On-Line Analytic Processing (OLAP) Client that provides a user interface for generating SQL statements that retrieve data from a database, and an Analysis Client that displays results from a data mining algorithm;\n(b) performing one or more data mining algorithms in an Analysis Tier, wherein the Analysis Tier includes an OLAP Server that schedules and prioritizes the SQL statements received from the OLAP Client, an Analytic Server that schedules and invokes the data mining algorithm to analyze the data retrieved from the database, and a Learning Engine performs a Learning step of the data mining algorithm; and\n(c) storing and managing the databases in a Database Tier, wherein the Database Tier includes an Inference Engine that performs an Inference step of the data mining algorithm, a relational database management system (RDBMS) that performs the SQL statements against a Data Mining View to retrieve the data from the database, and a Model Results Table that stores the results of the data mining algorithm.\n15. The method of claim 14, wherein the supporting step (a) further comprises converting the user's interaction with a graphical user interface (GUI) into SQL statements for use in querying the databases.\n16. The method of claim 15, wherein the supporting step (a) further comprises optimizing the SQL statements.\n17. The method of claim 15, wherein the performing step (b) further comprises optimizing the SQL statements using metadata retrieved from the Database Tier.\n18. The method of claim 14, wherein the data mining algorithm is comprised of Learning and Inference steps, the Learning step is performed by the Learning Engine to discover new patterns in the databases, and the Inference step is performed by the Inference Engine to apply learning against new data.\n19. The method of claim 18, wherein the Learning Engine invokes one or more probabilistic models implemented therein.\n20. The method of claim 18, wherein the Learning Engine invokes one or more graphical models implemented therein.\n21. The method of claim 18, wherein output from the Learning Engine is stored in the Model Results Table.\n22. The method of claim 21, wherein the Inference Engine accesses the output from the Learning Engine stored in the Model Results Table.\n23. The method of claim 21, wherein output from the Inference Engine is stored in the Model Results Table.\n24. The method of claim 14, wherein the storing and managing step (c) further comprises performing the queries against the Data Mining View, and the Data Mining View provides a customized view of the databases for data mining and analysis.\n25. The method of claim 24, wherein the Data Mining View performs an optimal normalization of the databases.\n26. The method of claim 24, wherein the Data Mining View ensures that the variables selected are conceptually valid.\n27. An article of manufacture embodying logic for data mining in a computer-implemented system, the logic comprising:\n(a) supporting interaction with users in an Interface Tier, wherein the Interface Tier includes an On-Line Analytic Processing (OLAP) Client that provides a user interface for generating SQL statements that retrieve data from a database, and an Analysis Client that displays results from a data mining algorithm;\n(b) performing one or more data mining algorithms in an Analysis Tier, wherein the Analysis Tier includes an OLAP Server that schedules and prioritizes the SQL statements received from the OLAP Client, an Analytic Server that schedules and invokes the data mining algorithm to analyze the data retrieved from the database, and a Learning Engine performs a Learning step of the data mining algorithm; and\n(c) storing and managing the databases in a Database Tier, wherein the Database Tier includes an Inference Engine that performs an Inference step of the data mining algorithm, a relational database management system (RDBMS) that performs the SQL statements against a Data Mining View to retrieve the data from the database, and a Model Results Table that stores the results of the data mining algorithm.\n28. The article of manufacture of claim 27, wherein the supporting step (a) further comprises converting the user's interaction with a graphical user interface (GUI) into SQL statements for use in querying the databases.\n29. The article of manufacture of claim 28, wherein the supporting step (a) further comprises optimizing the SQL statements.\n30. The article of manufacture of claim 28, wherein the performing step (b) further comprises optimizing the SQL statements using metadata retrieved from the Database Tier.\n31. The article of manufacture of claim 27, wherein the data mining algorithm is comprised of Learning and Inference steps, the Learning step is performed by the Learning Engine to discover new patterns in the databases, and the Inference step is performed by the Inference Engine to apply learning against new data.\n32. The article of manufacture of claim 31, wherein the Learning Engine invokes one or more probabilistic models implemented therein.\n33. The article of manufacture of claim 31, wherein the Learning Engine invokes one or more graphical models implemented therein.\n34. The article of manufacture of claim 31, wherein output from the Learning Engine is stored in the Model Results Table.\n35. The article of manufacture of claim 34, wherein the Inference Engine accesses the output from the Learning Engine stored in the Model Results Table.\n36. The article of manufacture of claim 34, wherein output from the Inference Engine is stored in the Model Results Table.\n37. The article of manufacture of claim 27, wherein the storing and managing step (c) further comprises performing the queries against the Data Mining View, and the Data Mining View provides a customized view of the databases for data mining and analysis.\n38. The article of manufacture of claim 37, wherein the Data Mining View performs an optimal normalization of the databases.\n39. The article of manufacture of claim 37, wherein the Data Mining View ensures that the variables selected are conceptually valid.",
    "status": "Expired - Lifetime",
    "citations_own": [],
    "citations_ftf": [
        "US5566330A",
        "US5761656A",
        "US5970482A",
        "US5909681A",
        "US5787425A",
        "US6418450B2",
        "US6385604B1",
        "US6408292B1"
    ],
    "citedby_own": [
        "US20020188520A1",
        "US20040117355A1",
        "US6820089B2",
        "WO2004102434A1",
        "US20040249867A1",
        "US20040250255A1",
        "US20050278290A1",
        "US20070002051A1",
        "US7181450B2",
        "US20070118510A1",
        "US7360215B2",
        "US20080133582A1",
        "US20080294583A1",
        "US20090006788A1",
        "US20090006156A1",
        "US20090182592A1",
        "US20100053616A1",
        "US7716167B2",
        "US7895191B2",
        "US7953694B2",
        "US20110137924A1",
        "US8065189B1",
        "US8065202B1",
        "US8069096B1",
        "US8112317B1",
        "US8285573B1",
        "US8359245B1",
        "US8417715B1",
        "US20130290512A1",
        "US8694429B1",
        "US8719266B2",
        "US8756117B1",
        "US9245291B1",
        "US9262503B2",
        "CN109799976A",
        "CN110413620A",
        "US11212370B1",
        "CN116594987A"
    ],
    "citedby_ftf": [
        "US6636860B2",
        "US7069197B1",
        "US20030154181A1",
        "US7308436B2",
        "US7925246B2",
        "US20070127400A1",
        "US8195714B2",
        "US20050063524A1",
        "US7627555B2",
        "US20060101072A1",
        "US7509337B2",
        "US7516152B2",
        "US7512626B2",
        "US7995474B2",
        "US7853948B2",
        "US20070118839A1",
        "US7831971B2",
        "US20070118795A1",
        "US20070162472A1",
        "US7730024B2",
        "US7992175B2",
        "US8090658B2",
        "US7624118B2",
        "US8032566B2",
        "US8090747B2",
        "US7899776B2",
        "US9576268B2",
        "US8264702B2",
        "WO2016028252A1",
        "US11762989B2",
        "US20170163664A1",
        "US11163955B2",
        "US11003999B1",
        "US11409990B1",
        "US11416713B1",
        "US11687807B1",
        "US11042555B1",
        "US11269841B1",
        "US11526859B1",
        "US11532040B2",
        "US11704671B2",
        "US11449870B2",
        "US11694276B1",
        "US11544798B1"
    ]
}