{
    "patent_id": "US-2019311428-A1",
    "title": "Credit risk and default prediction by smart agents ",
    "assignee": "Brighterion, Inc.",
    "publication_date": "2019-10-10",
    "patent_link": "https://patents.google.com/patent/US20190311428A1/en",
    "inventors": [
        "Akli Adjaoute"
    ],
    "classifications": [
        "G06N3/006",
        "G06Q40/025",
        "G06F15/18",
        "G06F18/214",
        "G06K9/6256",
        "G06N20/00",
        "G06Q40/03",
        "G06N3/048",
        "G06N3/084",
        "G06N3/126",
        "G06N5/01",
        "G06N5/025",
        "G06N5/041",
        "G06N5/046",
        "G06N7/01"
    ],
    "abstract": "Provided are artificial-intelligence based, electronic computer implemented processes and systems of analyzing credit risk and/or predicting default to an institution by an entity having been issued a plurality of credentials by individuals of the entity. The processes and systems involve: providing a smart agent for each credential; updating each smart agent with data of its credential so that so that each smart agent models an individual behavior profile; computing timely fields for the entity on spent using the credentials, amounts paid to the institution, and amounts due to the institution, thereby providing an timely assessment of overall entity demographic and financial situation; using the assessment to assign to the entity a risk level of delinquency; and predicting a likelihood of upcoming delinquency or default by the entity to the institution based on the individual behavior profiles modeled by the smart agents and on the risk level.",
    "claims": "\n1. An artificial-intelligence based, electronic computer implemented process of analyzing credit risk and/or predicting default to an institution by an entity having been issued a plurality of credentials to or by individuals of the entity, comprising the steps of:\n(a) providing a smart agent for each credential;\n(b) updating each smart agent with transaction based data of its credential so that so that each smart agent models an individual behavior profile;\n(c) computing timely fields for the entity on spent using the credentials, amounts paid by the entity to the institution, and amounts due to the institution during predetermined time periods, thereby providing an timely assessment of overall entity demographic and financial situation;\n(d) using the assessment to assign to the entity a risk level of delinquency; and\n(e) predicting a likelihood of upcoming delinquency or default by the entity to the institution based on the individual behavior profiles modeled by the smart agents and on the risk level of delinquency.\n2. The process of claim 1, wherein the credential is a credit card.\n3. The process of claim 1, wherein the credential is a debit card.\n4. The process of claim 1, wherein the credential is associated with a loan or line of credit to the entity.\n5. The process of claim 1, wherein the entity is a non-human legal entity.\n6. The process of claim 1, wherein at least one of the individuals is human.\n7. The process of claim 1, wherein at least one individual has provided to the entity or to the institution sufficient information to generate an initial credit report or background check to provide initial training to the smart agent associated with the at least one individual.\n8. The process of claim 1, wherein, before step (b), the smart agent initially models a template individual behavior profile.\n9. The process of claim 8, wherein the template behavior profile is based on assumptions from aggregate historical.\n10. The process of claim 8, wherein the template individual behavior profile is based on actual behavior of a real human individual.\n11. The process of claim 1, wherein the risk level of delinquency is selected from no risk, low risk, medium risk, and high risk, such that\nno risk is associated with regular normal payments,\nlow risk is associated with occasional payment delay,\nmedium risk is associated with frequent payment delays, and\nhigh risk is associated with long payment delays.\n12. The process of claim 11, further comprising:\n(f) taking action to reduce of consequences default when the risk of delinquency is at least medium risk.\n13. The process of claim 12, wherein (f) involves taking action to reduce a likelihood of default when this risk of delinquency is high.\n14. The process of claim 12, wherein (f) comprises reducing a credit limit for the entity or at least one individual.\n15. The process of claim 12, wherein (f) comprises seeking more timely payment to the institution.\n16. The process of claim 11, further comprising:\n(f) increasing an interest rate for a balance owed to the institution or assessing a penalty when the risk level increases.\n17. The process of claim 11, further comprising:\n(f) decreasing an interest for a balance owed to the institution when the risk level decreases.\n18. The process of claim 11, wherein step (c) involves assessing whether the entity is delinquent according to one of first, second or third types, wherein\nthe first type is characterized as having no more than two delinquent periods in a observed time frame and each delinquent period is less than 14 days,\nthe third type is characterized as having a last delinquent period of a duration of at least 50 days without any payment, and\nthe second type is characterized as being delinquent in a manner different from the first and third types.\n19. An artificial-intelligence based, electronic system for analyzing credit risk and/or predicting default to an institution by an entity having been issued a plurality of credentials to or by individuals of the entity, comprising at least one computer that includes both hardware and software components, that together or individually form:\na smart agent means for providing a smart agent for each credential;\nan updating means for updating each smart agent with transaction based data of its credential so that so that each smart agent models an individual behavior profile;\nan accounting means for computing timely fields for the entity on spent using the credentials, amounts paid by the entity to the institution, and amounts due to the institution during predetermined time periods, thereby providing an timely assessment of overall entity demographic and financial situation;\na risk level assessment means that uses the assessment to assign to the entity a risk level of delinquency; and\na predicting means for predicting a likelihood of upcoming delinquency or default by the entity to the institution based on the individual behavior profiles modeled by the smart agents and on the risk level of delinquency.\n20. The system of claim 19, being a distributed system comprising a plurality of linked nodes."
}