{
    "patent_link": "https://patents.google.com/patent/US6098064A/en",
    "patent_id": "US6098064A",
    "title": "Prefetching and caching documents according to probability ranked need S list",
    "abstract": "A method is presented for determining whether to prefetch and cache documents on a computer. In one embodiment, documents are prefetched and cached on a client computer from servers located on the Internet in accordance with their computed need probability. Those document with a higher need probability are prefetched and cached before documents with lower need probabilities. The need probability for a document is computed using both a document context factor and a document history factor. The context factor of the need probability of a document is determined by computing the correlation between words in the document and a context Q of the operating environment. The history factor of the need probability of a document is determined by integrating both the recency of document use and the frequency of document use.",
    "inventors": [
        "Peter L. Pirolli",
        "James E. Pitkow"
    ],
    "assignee": "Cisco Technology Inc",
    "classifications": [
        "H04L67/53",
        "G06F16/9574",
        "H04L67/56",
        "H04L67/5681",
        "H04L67/5682",
        "H04L9/40",
        "H04L69/329",
        "Y10S707/99932",
        "Y10S707/99935"
    ],
    "claims": "\n1. A method for determining with a computer whether to prefetch and cache documents, comprising the steps of:\nrecording context data and history data of the documents in a needs list stored in a memory of the computer; said recording step being performed each time a document request is received by the computer;\ncomputing a need probability for the documents recorded in the needs list stored in the memory; said computing step computing the need probability for the documents as a function of the recorded context data and history data of the documents; and\nidentifying those documents in the needs list with the greatest computed need probability to be prefetched and cached in the memory of the computer.\n2. The method according to claim 1, wherein said step of recording history data further comprises the steps of:\nrecording in the needs list how recently each document is referenced; and\nrecording in the needs list how frequently each document is referenced.\n3. The method according to claim 2, wherein said step of recording context data further comprises the steps of:\nrecording keywords of each document referenced in the needs list; and\nrecording links of each document referenced in the needs list.\n4. The method according to claim 3, wherein said computing step further comprises the steps of:\nestimating a history factor for predicting how likely each document recorded in the needs list is to be needed; and\nestimating a context factor for predicting how relevant each document in the needs list is given a context Q of an operating environment.\n5. The method according to claim 4, wherein said computing step computes the need probability for each document in the needs list by summing the weighted logarithms of the estimated history factor and the estimated context factor.\n6. The method according to claim 4, wherein said estimating step estimates the history factor according to the following equation: ##EQU4## where, ##EQU5## sets forth a predicted needs odds for a document per day; Di sets forth how many days since a document was last accessed;\nFi sets forth how frequently a document is accessed over a period of days; and\nαβγ set forth parameters that are estimated from a population of documents.\n7. The method according to claim 4, further comprising the step specifying the context Q using a pre-identified set of documents.\n8. The method according to claim 7, further comprising the step of expanding the context Q using a set of documents defined by those documents which are within a specified link radius of all documents in the set of pre-identified documents.\n9. The method according to claim 4, further comprising the step of specifying the context Q for a sever by computing a union set of individual client contexts.\n10. The method according to claim 4, wherein said estimating step estimates the context factor by computing correlation between the context Q and the recorded keywords of a document.\n11. The method according to claim 1, further comprising the steps of:\nfetching from a server documents in the needs list, beginning with those documents having the highest computed need probability; and\nresponsive to said fetching step, storing the fetched document in the memory of the computer.\n12. The method according to claim 11, wherein said fetching step is performed before disconnecting the computer from a network.\n13. The method according to claim 1, wherein said recording step is performed by a client computer while retrieving documents stored on servers coupled to a network.\n14. The method according to claim 1, further comprising the steps of:\nidentifying documents stored in the memory of the computer that are no longer necessary; and\nrelegating those identified documents to a server on a network to increase memory available for storing documents on the computer.\n15. A method for determining with a computer whether to prefetch and cache documents, comprising the steps of:\nrecording frequency data and recency data of the documents in a needs list stored in a memory of the computer; said recording step recording in the needs list how recently the document is referenced and how frequently the document is referenced when a document request is received by the computer;\ncomputing a need probability for the documents recorded in the needs list; said computing step computing the need probability for the documents as a function of the recorded frequency data and recency data; and\nidentifying those documents in the needs list with the greatest computed need probability to be prefetched and cached in the memory of the computer.\n16. The method according to claim 15, further comprising the step of recording context data for predicting relevancy of each document in the needs list.\n17. The method according to claim 15, wherein said computing step computes the need probability for each document in the needs list using the following equation: ##EQU6## where, ##EQU7## sets forth a predicted needs odds for a document per day; Di sets forth how many days since a document was last accessed;\nFi sets forth how frequently a document is accessed over a period of days; and\nαβγ set forth parameters that are estimated from a population of documents.\n18. An apparatus for determining whether to prefetch and cache documents, comprising:\na memory for storing a needs list of documents;\nmeans for recording context data and history data of the documents in the needs list; said recording means recording the context data and the history data when a document request is received;\nmeans for computing a need probability for the documents recorded in the needs list; said computing means computing the need probability for the documents as a function of the recorded context data and history data of the documents; and\nmeans for identifying those documents in the needs list with the greatest computed need probability to be prefetched and cached in said memory.\n19. The apparatus according to claim 18, wherein said recording means further comprises:\nmeans for recording, in the needs list, how recently each document is referenced; and\nmeans for recording, in the needs list, how frequently each document is referenced.\n20. The apparatus according to claim 18, wherein said recording means further comprises:\nmeans for recording, in the needs list, keywords of each document referenced; and\nmeans for recording, in the needs list, links of each document referenced.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5442778A",
        "US5864340A",
        "US5991755A",
        "US6009452A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6185659B1",
        "WO2001040949A1",
        "US20010003194A1",
        "US6249804B1",
        "US6272507B1",
        "WO2001063420A1",
        "US6321235B1",
        "US20020004813A1",
        "WO2002027495A2",
        "WO2002037283A2",
        "US20020065841A1",
        "WO2002042863A2",
        "US20020073405A1",
        "US20020083185A1",
        "US20020080721A1",
        "US6415368B1",
        "US6415359B1",
        "WO2002052384A2",
        "US20020087624A1",
        "US6427172B1",
        "US20020107934A1",
        "US20020107935A1",
        "US20020112032A1",
        "US6449696B2",
        "US20020133382A1",
        "US6457103B1",
        "US20020143896A1",
        "US20020147608A1",
        "US20020169828A1",
        "US20020174255A1",
        "US20020186899A1",
        "US20020194434A1",
        "US20020193676A1",
        "US20020194019A1",
        "US20030018617A1",
        "US20030037104A1",
        "US6546388B1",
        "US20030069926A1",
        "US20030069925A1",
        "US6549896B1",
        "US20030074368A1",
        "US20030074369A1",
        "US20030088580A1",
        "US6564202B1",
        "US6574708B2",
        "US20030105837A1",
        "US20030105857A1",
        "FR2834104A1",
        "US20030125953A1",
        "US20030135824A1",
        "US20030135607A1",
        "US20030135591A1",
        "US20030145062A1",
        "US6622168B1",
        "US20030182510A1",
        "US20030182390A1",
        "US20030182397A1",
        "US20030195944A1",
        "US20030195940A1",
        "US20030217235A1",
        "US20030217097A1",
        "US20030217238A1",
        "US6654743B1",
        "US20030233245A1",
        "US6687739B2",
        "US20040030681A1",
        "US20040034855A1",
        "WO2004017229A1",
        "US20040044806A1",
        "US6721744B1",
        "US6725229B2",
        "US6745178B1",
        "US6757682B1",
        "US6766313B1",
        "US6766389B2",
        "FR2851389A1",
        "US6782388B2",
        "US20040243536A1",
        "US20040243627A1",
        "US20040243494A1",
        "US6829611B2",
        "US6834276B1",
        "US6834325B1",
        "US20040260636A1",
        "US20040258053A1",
        "US6848028B1",
        "FR2858078A1",
        "US20050044182A1",
        "US6883135B1",
        "US20050120133A1",
        "US20050138056A1",
        "US20050160422A1",
        "US20050165746A1",
        "US20050165743A1",
        "US20050210006A1",
        "US20050216478A1",
        "US6973457B1",
        "US20050273514A1",
        "US20060017950A1",
        "US20060041530A1",
        "US20060047532A1",
        "US20060047818A1",
        "US7024465B1",
        "US20060074903A1",
        "US20060080443A1",
        "US20060080401A1",
        "US7039766B1",
        "US20060101037A1",
        "US20060168095A1",
        "US20060173950A1",
        "US7089331B1",
        "US7103590B1",
        "US7113935B2",
        "US7130890B1",
        "US20060271564A1",
        "US20060277271A1",
        "US20060277308A1",
        "US20060282788A1",
        "US7167893B1",
        "US7171619B1",
        "US20070050666A1",
        "US7228551B2",
        "US20070130205A1",
        "US20070143166A1",
        "US20070203903A1",
        "US20070204102A1",
        "US20070239747A1",
        "US20070253437A1",
        "US20080005057A1",
        "US20080005163A1",
        "US20080005695A1",
        "AU2004233480B2",
        "US7363291B1",
        "US20080104061A1",
        "US7389284B1",
        "US20080154882A1",
        "US20080162821A1",
        "US20080168229A1",
        "US20080201288A1",
        "US20080201331A1",
        "US7430738B1",
        "US20080270379A1",
        "US20090037393A1",
        "US20090063230A1",
        "US20090125508A1",
        "US20090234682A1",
        "US7594230B2",
        "US7599917B2",
        "US7610351B1",
        "US20090281900A1",
        "US20090300009A1",
        "US20100005046A1",
        "US20100049678A1",
        "US7689902B1",
        "US20100086214A1",
        "US7711622B2",
        "US20100114879A1",
        "US7716198B2",
        "US7716332B1",
        "US20100121861A1",
        "US7725424B1",
        "US7739277B2",
        "US20100153143A1",
        "US7747749B1",
        "US7792833B2",
        "US7827181B2",
        "US7840569B2",
        "US7849208B2",
        "US20110029899A1",
        "US7912064B2",
        "US7934021B2",
        "US20110113032A1",
        "US7975025B1",
        "US20110191127A1",
        "US8073866B2",
        "US8078602B2",
        "US8086697B2",
        "US8116203B2",
        "US8126865B1",
        "US8135016B2",
        "US8180928B2",
        "US20120158740A1",
        "US8224964B1",
        "US8244795B2",
        "US8255413B2",
        "US8275661B1",
        "US8316003B2",
        "US8346784B1",
        "US8380721B2",
        "US8396864B1",
        "US8402142B2",
        "US8495171B1",
        "US8554640B1",
        "US8572069B2",
        "US20130304798A1",
        "US8595475B2",
        "US20140006335A1",
        "EP2705438A2",
        "US8676922B1",
        "US8689238B2",
        "US8713287B2",
        "US8738635B2",
        "US8750320B2",
        "US8793706B2",
        "US8798091B2",
        "US8812493B2",
        "US8812651B1",
        "US8843486B2",
        "US8849838B2",
        "US8918812B2",
        "US8918520B2",
        "US9015348B2",
        "US9026741B1",
        "US9058402B2",
        "US20150200994A1",
        "US9141722B2",
        "WO2015158835A1",
        "US20150324415A1",
        "US9348912B2",
        "US9436501B2",
        "US9443018B2",
        "US9443197B1",
        "US9483308B2",
        "US9495462B2",
        "US9495446B2",
        "US20160373544A1",
        "US9530099B1",
        "US9535884B1",
        "US9633356B2",
        "US9672285B2",
        "US20170180448A1",
        "US9769285B2",
        "US20170315876A1",
        "US9846842B2",
        "US9928223B1",
        "US9946792B2",
        "US10055088B1",
        "US10089579B1",
        "US20180337972A1",
        "US10171550B1",
        "CN109344092A",
        "US10270876B2",
        "US10311085B2",
        "US10732883B1",
        "US11095735B2",
        "US11146656B2",
        "US11210363B1",
        "US20220100768A1",
        "US20220318333A1"
    ],
    "citedby_ftf": []
}