{
    "patent_id": "US-11153229-B2",
    "title": "Autonomic resource partitions for adaptive networks ",
    "assignee": "Ciena Corporation",
    "publication_date": "2021-10-19",
    "patent_link": "https://patents.google.com/patent/US11153229B2/en",
    "inventors": [
        "Petar Djukic",
        "Todd Morris",
        "Emil Janulewicz",
        "David Jordan KRAUSS",
        "Kaniz Mahdi",
        "Paul Littlewood"
    ],
    "classifications": [
        "H04L47/788",
        "G06F9/5077",
        "G06N3/006",
        "G06N3/04",
        "G06N3/08",
        "G06N3/084",
        "H04L41/5003",
        "H04L41/5009",
        "H04L41/5025",
        "H04L47/76",
        "H04L47/781",
        "H04L47/805",
        "H04L47/822"
    ],
    "abstract": "System and methods for autonomous resource partitioning in a network include a resource controller configured to provision resources which are any of virtual resources and physical resources in one or more layers in the network and monitor availability of the resources in the network; a resource manager configured to determine the any of virtual resources and physical resources as required for Quality of Service (QoS) in the network; a resource broker configured to advertise and assign resource requests to corresponding resources; and a partition manager configured to track the utilization of the resources provided by the one or more layers and to adjust resource usage of the resources in negotiation with the resource broker to minimize a cost of implementation.",
    "claims": "\n1. A system for autonomic resource partitioning in a network, the system comprising:\none or more processors; and\nmemory storing instructions that, when executed cause the processor to implement building blocks of layered virtual functionality including:\na resource controller configured to provision a plurality of resources including any of virtual resources and physical resources in one or more layers in the network and monitor availability of the plurality of resources in the network;\na resource manager configured to determine which of the plurality of resources are required for Quality of Service (QoS) in the network and to satisfy the QoS required recursively using resources of the plurality of resources provided by a layer below the resource manager and resources of the plurality of resources provided at the layer of the resource manager requested by a partition manager;\na resource broker configured to advertise and assign resource requests to corresponding resources recursively to resource partitions in a layer above the resource broker; and\nthe partition manager configured to track the utilization of the resources provided by the one or more layers and to adjust resource usage of the resources in negotiation with the resource broker to minimize a cost of implementation, wherein one or more of the partition manager and the resource broker utilize a deep-Q network (DQN) in the negotiation that includes reinforcement learning and deep neural netwroks, wherein an operator specifies rewards and network costs to converge the plurality of resources in the network to a desired state.\n2. The system of claim 1, wherein the partition manager receives resource partition state information and provides resource adjustment information to the resource broker, and wherein the resource broker provides resource costs to the partition manager and commands for resource adjustments to the resource controller.\n3. The system of claim 1, wherein the resources are a combination of compute, storage, wired connectivity resources and wireless connectivity resources.\n4. The system of claim 1, wherein the virtual resources include dynamic compositions of chained Virtual Network Functions (VNFs), and wherein the physical resources include any of hard slices and soft slices of the network.\n5. The system of claim 1, wherein the resource broker utilizes pricing on resource usage to ensure the partition manager gives up corresponding resources when they are not needed in a partition managed by the partition manager.\n6. The system of claim 1, wherein the partition manager is configured to\nmonitor Quality of Service (QoS) in the network,\ndetermine required resources in the network to meet Service Layer Agreements (SLAs) and to maximize long-term rewards,\none or more of request and release corresponding resources in the network to maximize the long-term rewards, and\ndetermine costs of the resources and correlate the costs to the long-term rewards.\n7. The system of claim 6, wherein the long-term rewards are determined by calculating long-term network cost which includes a cost of resources plus a cost of not meeting Service Layer Agreements (SLAs).\n8. The system of claim 1, wherein the resource broker is configured to monitor resource usage in the network,\ndetermine prices of resources in the network based on the resource usage and to maximize long-term rewards,\nreceive a request for associated resources and grant the request if the resources are available and block the resources if unavailable, and\ndetermine costs of the resources and correlate the costs to the long-term rewards.\n9. The system of claim 8, wherein the long-term rewards are calculated as revenue minus cost, namely R(T)=Revenue(T) − Cost(T) where R(T) is the reward for each time slot T.\n10. A method for autonomous resource partitioning in a network, the method comprising:\nprovisioning a plurality of resources including any of virtual resources and physical resources in one or more layers in the network and monitoring availability of the plurality of resources in the network;\ndetermining which of the plurality of resources are required for Quality of Service (QoS) in the network and satisfying the QoS required recursively using resources of the plurality of resources provided by a layer below and resources of the plurality of resources provided at a layer thereof requested by a partition manager;\nadvertising and assigning resource requests to corresponding resources recursively to resource partitions in a layer above; and\ntracking the utilization of the resources provided by the one or more layers and adjusting resource usage of the resources based on a negotiation to minimize a cost of implementation wherein one or more of the partition manager and the resource broker utilize a deep-Q network (DQN) in the negotiation that includes reinforcement learning and deep neural netwroks, wherein an operator specifies rewards and network costs to converge the plurality of resources in the network to a desired state.\n11. The method of claim 10, wherein the provisioning and the monitoring is performed by a resource controller, the determining is performed by a resource manager, the advertising and the assigning is performed by the resource broker, and the tracking is performed by the partition manager.\n12. The method of claim 11, wherein the partition manager receives resource partition state information and provides resource adjustment information to the resource broker, and wherein the resource broker provides resource costs to the partition manager and commands for resource adjustments to the resource controller.\n13. The method of claim 10, wherein the resources are a combination of compute, storage, wired connectivity resources and wireless connectivity resources.\n14. The method of claim 10, wherein the virtual resources include dynamic compositions of Virtual Network Functions (VNFs), and wherein the physical resources include any of hard slices and soft slices of the network.\n15. The method of claim 10, further comprising\nmonitoring Quality of Service (QoS) in the network;\ndetermining required resources in the network to meet Service Layer Agreements (SLAs) and to maximize long-term rewards;\none or more of requesting and releasing corresponding resources in the network to maximize the long-term rewards; and\ndetermining costs of the resources and correlate the costs to the long-term rewards.\n16. The method of claim 10, further comprising\nmonitoring resource usage in the network;\ndetermining prices of resources in the network based on the resource usage and to maximize long-term rewards;\nreceiving a request for associated resources and granting the request if the resources are available and blocking the resources if unavailable; and\ndetermining costs of the resources and correlating the costs to the long-term rewards.\n17. A reinforcement learning system for autonomous resource partitioning in a network, the reinforcement learning system comprising:\none or more processors; and\nmemory storing instructions that, when executed cause the processor to implement building blocks of layered virtual functionality including:\na resource controller configured to provision a plurality of resources including any of virtual resources and physical resources in one or more layers in the network and monitor availability of the plurality of resources in the network;\na resource broker configured to advertise and assign resource requests to corresponding resources of the plurality of resources recursively to resource partitions in a layer above the resource broker; and\na partition manager configured to track the utilization of the resources provided by the one or more layers and to adjust resource usage of the resources in negotiation with the resource broker to minimize a cost of implementation,\nwherein one or more of the partition manager and the resource broker utilize a deep-Q network (DQN) in the negotiation that includes reinforcement learning in the negotiation that includes reinforcement learning and deep neural networks, wherein an operator specifies rewards and network costs to converge the plurality of resources in the network to a desired state, wherein the partition manager receives resource partition state information and provides resource adjustment information to the resource broker, and wherein the resource broker provides resource costs to the partition manager and commands for resource adjustments to the resource controller.\n18. The reinforcement learning system of claim 17, wherein the one or more of the partition manager and the resource broker utilize deep-Q network (DQN) reinforcement learning.\n19. The reinforcement learning system of claim 17, wherein the resources are a combination of compute, storage, wired connectivity resources and wireless connectivity resources.",
    "status": "Active",
    "citations_own": [
        "US20030037089A1",
        "US20030236745A1",
        "US20070067476A1",
        "US20130166750A1",
        "US20140086177A1",
        "US20160212623A1",
        "US20160330083A1",
        "US20160353268A1",
        "US20170054595A1",
        "US20170270450A1",
        "US9805345B1",
        "US9871582B2",
        "US20180041905A1",
        "US20180077023A1",
        "US9924392B2",
        "US20180176886A1",
        "US20180220358A1",
        "US20180220276A1",
        "US20180241843A1",
        "US20180248905A1",
        "US20180248771A1",
        "US20180247191A1",
        "US20180260692A1",
        "US20180270073A1",
        "US20180317133A1",
        "US20180351652A1",
        "US20180376338A1",
        "US20190021010A1",
        "US10217053B2",
        "US20190098039A1",
        "US20190109768A1",
        "US20190138948A1",
        "US20190147234A1",
        "US20190158676A1",
        "US20190273635A1",
        "US10417556B1",
        "US20190327182A1",
        "US10511724B2",
        "US20200007414A1",
        "US20200050494A1",
        "US20200195577A1",
        "US10779292B2",
        "US20210076234A1"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "CN110832810B",
        "KR102030128B1",
        "US10740168B2",
        "WO2019217323A1",
        "US11544782B2",
        "US11550299B2",
        "US11669914B2",
        "US11620528B2",
        "US11423254B2",
        "US11184234B2",
        "US11310148B2",
        "US11356320B2",
        "US20220271999A1",
        "US11540139B2",
        "CN113259145B",
        "US20230114359A1",
        "US11704539B2",
        "US11663039B2",
        "CN111541570B",
        "US11316752B2",
        "US11057278B1",
        "US20220226994A1",
        "US11277330B1",
        "CN112153702B",
        "CN112613230B",
        "JP7333839B2",
        "CN112838954B",
        "US11777811B2",
        "US20220263729A1",
        "US11777598B2",
        "US11595761B2",
        "US11477070B1",
        "US11683260B2",
        "CN114050961B"
    ]
}