{
    "patent_id": "US-8301764-B2",
    "title": "Method and system for personalized searching of information and product services by estimating an interest to a user ",
    "assignee": "Personalized User Model",
    "publication_date": "2012-10-30",
    "patent_link": "https://patents.google.com/patent/US8301764B2/en",
    "inventors": [
        "Yochai Konig",
        "Roy Twersky",
        "Michael R. Berthold"
    ],
    "classifications": [
        "G06N20/00",
        "G06F16/9535",
        "H04L67/306",
        "H04L67/53",
        "H04L67/55",
        "H04L67/75",
        "H04N21/44224"
    ],
    "abstract": "A method for providing automatic, personalized information services to a computer user includes the following steps: transparently monitoring user interactions with data during normal use of the computer; updating user-specific data files including a set of user-related documents; estimating parameters of a learning machine that define a User Model specific to the user, using the user-specific data files; analyzing a document to identify its properties; estimating the probability that the user is interested in the document by applying the document properties to the parameters of the User Model; and providing personalized services based on the estimated probability. Personalized services include personalized searches that return only documents of interest to the user, personalized crawling for maintaining an index of documents of interest to the user; personalized navigation that recommends interesting documents that are hyperlinked to documents currently being viewed; and personalized news, in which a third party server customized its interaction with the user. The User Model includes continually-updated measures of user interest in words or phrases, web sites, topics, products, and product features. The measures are updated based on both positive examples, such as documents the user bookmarks, and negative examples, such as search results that the user does not follow. Users are clustered into groups of similar users by calculating the distance between User Models.",
    "claims": "\n1. A computer-implemented method for providing personalized information services to a user, the method comprising:\nmonitoring user interactions with search results while the user is engaged in use of a browser program running on a computer;\nreceiving, at a server communicatively coupled to the computer via one or more networks, a search query from the user;\nretrieving a plurality of search results based on the search query;\nfor at least one retrieved search result of the plurality of retrieved search results: identifying properties of the at least one retrieved search result and, based thereon, estimating a probability that the at least one retrieved search result is of interest to the user; and\nusing the estimated probabilities for the at least one retrieved search result of the plurality of retrieved search results to present at least a portion of the plurality of the retrieved search results to the user.\n2. The method of claim 1, further comprising presenting to the user a list of the portion of the retrieved search results ranked according to respective estimated probabilities of the plurality of retrieved search results being of interest to the user.\n3. The method of claim 1, wherein estimating the probability that the retrieved search result is of interest to the user comprises estimating parameters of a user-specific learning machine based, at least in part, on previously retrieved search results not of interest to the user.\n4. The method of claim 1, wherein monitoring user interactions with search results comprises one or more of: monitoring whether the user viewed the search results, information about the user's interaction with the search results, context information, and time spent by the user viewing individual ones of the search results.\n5. The method of claim 1, wherein the plurality of retrieved search results correspond to a respective plurality of products.\n6. The method of claim 1, wherein for the at least one of the plurality of retrieved search results, the estimated probability that the retrieved search result is of interest to the user is determined according to information regarding the user.\n7. The method of claim 6, wherein the information regarding the user is maintained remotely from the computer running the browser program.\n8. A computer-implemented method, comprising:\nresponsive to a present search query submitted by a user via a client-based application; retrieving a plurality of candidate search results based on the search query;\nestimating a respective probability that the at least one of the plurality of retrieved search results is of interest to the user by using identified properties of at least one of the plurality of the retrieved search results; and\nreturning the at least one of the plurality of retrieved search results from a server-based application to the client-based application.\n9. The method of claim 8, wherein the plurality of personalized search results are ranked in order of estimated user interest.\n10. The method of claim 9, wherein the interest of the user is estimated by applying identified properties of respective one of the personalized search results to a user-specific learning machine to determine a probability of user interest for respective personalized search result.\n11. The method of claim 9, further comprising displaying, by the client-based application, the personalized search results in ranked order.\n12. The method of claim 11, wherein the personalized search results correspond to respective products.\n13. The method of claim 8, wherein the personalized search results comprise one or more of: text, images, and non-text media.\n14. The method of claim 8, wherein the information regarding the user's interests is determined, in part, based on monitored user interactions with prior search results from prior search queries.\n15. The method of claim 14, wherein the client-based application comprises a Web browser application.\n16. The method of claim 15, wherein the plurality of personalized search results are determined according to information regarding monitored user interactions with prior search results from prior search queries.\n17. The method of claim 15, wherein the plurality of personalized search results comprise a plurality of personalized advertising results.\n18. The method of claim 17, wherein the plurality of personalized advertising results are selected according to monitored user interactions with prior search results from prior search queries.\n19. The method of claim 17, wherein the plurality of personalized advertising results comprise advertising results estimated to be of likely interest to the user in the context of the present search query.\n20. The method of claim 17, wherein the plurality of personalized advertising results are ranked for presentation to the user.\n21. The method of claim 17, wherein the plurality of personalized advertising results are presented according to an estimated user interest therein.\n22. The method of claim 21, wherein the estimated user interest is based, at least in part, on the present search query.\n23. The method of claim 22, wherein the estimated user interest is further based, at least in part, on an assessment of potential advertisements in the context of the present search query.\n24. A computer-implemented method for providing personalized information services to a user, the method comprising:\nreceiving, at a server communicatively coupled to a computer via one or more networks, a search query from a user engaging in a client application running on the computer;\nresponsive to the search query, retrieving a plurality of candidate search results;\nidentifying properties of at least one of the plurality of candidate search results and, based thereon, estimating a probability that the at least one of the plurality of candidate search results is of interest to the user; and\nproviding the at least one of the plurality of candidate search results to the client application.\n25. The method of claim 24, wherein the least some of the search results are provided to the client application for presentation in a ranked order.\n26. The method of claim 25, wherein the ranked order is determined, at least in part, according to the estimated probabilities.\n27. The method of claim 25, wherein estimating the probability that the at least one of the plurality of candidate search results is of interest to the user comprises estimating parameters of a user-specific learning machine based at least in part on previously retrieved search results not of interest to the user.\n28. The method of claim 24, wherein prior to receiving the search query, monitoring one or more of: user interactions with previous search results, context information, and time spent by the user viewing individual ones of the previous search results.\n29. The method of claim 24, wherein said the plurality of search results comprise advertisements.\n30. A computer-implemented method, comprising:\nresponsive to a present search query submitted by a user via a client-based application, returning a plurality of personalized search results for the user from a server-based application to the client-based application, the personalized search results selected for returning to the client-based application by identifying properties of at least one of the plurality of personalized search results and, estimating a probability that the at least one of the plurality of personalized search results is of interest to the user in the context of a present document displayed in the client application.\n31. The method of claim 30, wherein the personalized search results are ranked in order of estimated user interest.\n32. The method of claim 31, wherein the interest of the user is estimated by applying identified properties of respective one of the personalized search results to a user-specific learning machine to determine a probability of user interest for respective personalized search result.\n33. The method of claim 31, further comprising displaying, by the client-based application, the personalized search results in ranked order.\n34. The method of claim 33, wherein the personalized search results correspond to respective products.\n35. The method of claim 30, wherein the personalized search results comprise one or more of: text, images, and non-text media.\n36. The method of claim 30, wherein the client-based application comprises a web browser.\n37. The method of claim 36, wherein the personalized search results comprise advertisements.\n38. The method of claim 37, wherein the personalized search results are ranked in order of estimated user interest.\n39. The method of claim 37, wherein the estimate of user interest is further based, at least in part, on the present search query.\n40. A computer-implemented method for providing personalized information services to a user, the method comprising:\nreceiving, at a server communicatively coupled to a computer via one or more networks, a search query;\nretrieving a plurality of candidate search results;\nidentifying properties of at least one candidate search result in the plurality of candidate search results;\nestimating a probability that the at least one candidate search result is of interest to the user; and\nreturning to the computer at least portions of some of the candidate search results.\n41. The method of claim 40, further comprising presenting to the user a list of the at least portions of some of the candidate search results ranked according to the estimated probabilities.\n42. The method of claim 41, wherein the candidate search results comprise advertisements.\n43. The method of claim 41, wherein the candidate search results comprise information regarding products.\n44. The method of claim 41, wherein prior to receiving the search query, monitoring user interactions with prior search results while the user is engaged in use of the computer.\n45. The method of claim 44, wherein monitoring user interactions comprises one or more of: monitoring whether the user viewed the prior search results, information about the user's interaction with the prior search results, context information, and time spent by the user viewing individual ones of the prior search results.\n46. The method of claim 41, wherein estimating a probability that the candidate search result is of interest to the user comprises estimating parameters of a user-specific learning machine based at least in part on previously retrieved search results not of interest to the user.\n47. The method of claim 41, wherein the candidate search results are further selected according to a context of the search query.\n48. The method of claim 41, wherein the interest of the user is estimated by applying identified properties of respective one of the candidate search results to a user-specific learning machine to determine a probability of user interest for respective candidate search result.\n49. The method of claim 41, wherein the search query is submitted by a user via a browser application running on the computer, and the candidate search results comprise personalized advertising results for the user.\n50. The method of claim 49, wherein the personalized advertising results are ranked for presentation to the user.\n51. The method of claim 50, wherein the personalized advertising results are presented according to the estimated user interest.\n52. A computer-implemented method, comprising:\nresponsive to a present search query submitted by a user via a browser application running on a computer, returning a plurality of personalized search results for the user from a server-based application to the browser, the plurality of personalized search results selected for returning to the browser application by identifying properties of at least one of the plurality of personalized search results and, based thereon, estimating a probability that the at least one of the plurality of personalized search results is of interest to the user in the context of the present search query and parameters of a user profile.\n53. The method of claim 52, wherein the plurality of personalized search results are ranked in order of estimated user interest.\n54. The method of claim 52, wherein the plurality of personalized search results comprise a plurality of personalized advertising results.\n55. The method of claim 54, wherein the plurality of personalized advertising results are ranked for presentation to the user.\n56. The method of claim 52, wherein the parameters of the user profile comprise information regarding the user's interests.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5704017A",
        "US5704317A",
        "US5754939A",
        "US5867799A",
        "US5918014A",
        "US5933827A",
        "US5964839A",
        "US5991735A",
        "US5999975A",
        "US6006218A",
        "US6029195A",
        "US6041311A",
        "US6182068B1",
        "US6182133B1",
        "US6230204B1",
        "US6564170B2",
        "US6567850B1",
        "US6567797B1",
        "US6606620B1",
        "US6647425B1",
        "US6687696B2",
        "US6697824B1",
        "US6732090B2",
        "US6828992B1",
        "US6915482B2",
        "US6981040B1",
        "US7353246B1",
        "US7631032B1"
    ],
    "citations_ftf": [
        "US6460036B1",
        "US6582475B2",
        "WO2001014952A2",
        "GB0003411D0",
        "US6874019B2",
        "US7149704B2",
        "JP2003085204A",
        "US20060235938A1"
    ],
    "citedby_own": [
        "US20110213679A1",
        "US20120151339A1",
        "US20120253799A1",
        "US20130086103A1",
        "US8595228B1",
        "US8825853B1",
        "US20140280063A1",
        "US20150161175A1",
        "US20150169772A1",
        "US20150220658A1",
        "US9412127B2",
        "US20160259774A1",
        "US9542440B2",
        "US9703828B2",
        "US9870432B2",
        "US20180060421A1",
        "US10061826B2",
        "US10169457B2",
        "US10255563B2",
        "US10394827B2",
        "US10558617B2",
        "US10740418B2",
        "US10757201B2",
        "US10885132B2",
        "US10915538B2",
        "US10915661B2",
        "US10929481B2",
        "WO2021074709A1",
        "US11100063B2",
        "US11238056B2",
        "US11386478B1",
        "US11475338B2",
        "US20220405342A1",
        "US11645289B2",
        "US11657060B2"
    ],
    "citedby_ftf": [
        "US7082426B2",
        "US20020002039A1",
        "US6614987B1",
        "US8352984B2",
        "US7233977B2",
        "US7536002B1",
        "US7353246B1",
        "US6760721B1",
        "KR100473670B1",
        "US8087051B2",
        "US7660737B1",
        "US7885820B1",
        "AUPQ915600A0",
        "FR2813416B1",
        "US7840691B1",
        "US8302127B2",
        "US8060816B1",
        "JP2002149874A",
        "US20020069223A1",
        "US8255791B2",
        "US7197708B1",
        "ATE321422T1",
        "US7099671B2",
        "US7389241B1",
        "US7158971B1",
        "US7386792B1",
        "US7194454B2",
        "US20040210541A1",
        "JP2004532488A",
        "US8818871B2",
        "US20020198962A1",
        "US8301503B2",
        "US7313617B2",
        "US7231419B1",
        "US7120647B2",
        "JPWO2003044693A1",
        "JP3997774B2",
        "US20030131070A1",
        "GB0203515D0",
        "US7546338B2",
        "JP2003258911A",
        "US20080189408A1",
        "US8095589B2",
        "US10296919B2",
        "US9129032B2",
        "US9092788B2",
        "US7043521B2",
        "USRE45952E1",
        "US9235849B2",
        "US9684676B1",
        "US7574427B2",
        "US7890451B2",
        "US7324987B2",
        "WO2004053757A2",
        "US7526545B2",
        "BR0318146A",
        "US7797203B2",
        "US7917483B2",
        "US8190989B1",
        "US20040254950A1",
        "JP4217957B2",
        "US7630916B2",
        "US7526414B2",
        "BRPI0414607A",
        "US20050071328A1",
        "US7617205B2",
        "US8024323B1",
        "US20050114382A1",
        "US7526459B2",
        "US7539652B2",
        "US7493294B2",
        "US20090018918A1",
        "US8600920B2",
        "US7606772B2",
        "US7526458B2",
        "US8566263B2",
        "USRE45770E1",
        "US7523096B2",
        "GB0328567D0",
        "US7860804B2",
        "US20050149619A1",
        "US7890526B1",
        "US7249126B1",
        "US8676837B2",
        "US8156444B1",
        "US20050149498A1",
        "US20050144084A1",
        "US8126865B1",
        "US8954420B1",
        "US7392278B2",
        "JP2005242904A",
        "KR101312190B1",
        "US7716223B2",
        "US7941439B1",
        "US7412708B1",
        "US8161053B1",
        "US8386728B1",
        "US7725508B2",
        "US8595214B1",
        "US8631076B1",
        "US7333976B1",
        "US20080059419A1",
        "US7680888B1",
        "US8275839B2",
        "US8099407B2",
        "US8346777B1",
        "US7581227B1",
        "US7827025B2",
        "US8028323B2",
        "US8666746B2",
        "US20070203589A1",
        "WO2005116852A2",
        "US7302406B2",
        "US7565445B2",
        "WO2006007194A1",
        "US9223868B2",
        "US8572233B2",
        "US7580921B2",
        "US7599914B2",
        "US7702618B1",
        "US7567959B2",
        "US7536408B2",
        "US7711679B2",
        "US7580929B2",
        "US7584175B2",
        "US7631336B2",
        "US9641902B2",
        "US11259059B2",
        "US9584868B2",
        "US7590997B2",
        "US7853606B1",
        "US8635216B1",
        "US20060074883A1",
        "US7865495B1",
        "US20080104039A1",
        "US20080133573A1",
        "WO2009021198A1",
        "US20060287937A1",
        "JP4653157B2",
        "US20060190225A1",
        "US9141589B2",
        "US7870147B2",
        "JP2008535073A",
        "US20070094157A1",
        "US9003441B1",
        "US20060259360A1",
        "US7661065B2",
        "US9065727B1",
        "JP2006339794A",
        "US8103659B1",
        "US20060288017A1",
        "US20070005646A1",
        "US9183752B2",
        "US20070022082A1",
        "US7548929B2",
        "US7739708B2",
        "JP4829563B2",
        "US20070038634A1",
        "US9105028B2",
        "US7711737B2",
        "US7831535B2",
        "US10324899B2",
        "US7668821B1",
        "US8341158B2",
        "US8799302B2",
        "US9262446B1",
        "US7925649B2",
        "US20080059395A1",
        "US7774294B2",
        "US8863221B2",
        "US8510453B2",
        "US8200688B2",
        "US8843467B2",
        "US8115869B2",
        "US8209724B2",
        "US8316394B2",
        "US8364467B1",
        "US7630917B2",
        "US20070255701A1",
        "US20070260597A1",
        "US8442973B2",
        "US20070260626A1",
        "US20070266025A1",
        "US20070265999A1",
        "US7890533B2",
        "WO2007135436A1",
        "US8463810B1",
        "US9443022B2",
        "US8209320B2",
        "US8001105B2",
        "US7831586B2",
        "US7624104B2",
        "US8468155B2",
        "US20080040218A1",
        "US9547648B2",
        "US20080040674A1",
        "US8135725B2",
        "US8117197B1",
        "US7739231B2",
        "US7895209B2",
        "WO2008032037A1",
        "JP5233220B2",
        "US20080091423A1",
        "US20080228675A1",
        "CN101589360A",
        "US20080097821A1",
        "WO2008055034A2",
        "US9519715B2",
        "US7814086B2",
        "US8131722B2",
        "US8935269B2",
        "CN100542140C",
        "US8554868B2",
        "CN101216826B",
        "US7844602B2",
        "WO2008091008A1",
        "US20080183681A1",
        "US8135718B1",
        "US8407226B1",
        "US8065254B1",
        "US20080221987A1",
        "US9686367B2",
        "US20080243826A1",
        "US7974888B2",
        "WO2008121737A1",
        "US8166021B1",
        "US7702614B1",
        "US20080243480A1",
        "US7693813B1",
        "US8166045B1",
        "US8086594B1",
        "US7881984B2",
        "US7925655B1",
        "US20080250323A1",
        "US8200663B2",
        "US9286385B2",
        "US7707127B2",
        "ATE429119T1",
        "US8838079B2",
        "US8880583B2",
        "US7739261B2",
        "US11570521B2",
        "US8260787B2",
        "US8751507B2",
        "US9596317B2",
        "US9392074B2",
        "US20090018904A1",
        "US8108409B2",
        "US7979321B2",
        "US20090037399A1",
        "EP2181428A4",
        "JP2009043156A",
        "US8635222B2",
        "US20090063168A1",
        "US8117223B2",
        "US8909635B2",
        "US8126826B2",
        "US20090144654A1",
        "US20090100032A1",
        "US8165985B2",
        "US8073682B2",
        "US8671104B2",
        "US8126867B2",
        "US8234262B2",
        "US20090112693A1",
        "US20090112849A1",
        "US8001108B2",
        "US20090112694A1",
        "US8112407B2",
        "US20090112696A1",
        "US20090113297A1",
        "US9582805B2",
        "US9513699B2",
        "US20090112695A1",
        "US20090112697A1",
        "US8176068B2",
        "US20090125934A1",
        "US7844555B2",
        "US9203912B2",
        "KR101060487B1",
        "US7925602B2",
        "US8271357B2",
        "US9391789B2",
        "US9015147B2",
        "US8117193B2",
        "US8316015B2",
        "US8032471B2",
        "US20090171755A1",
        "US20090171968A1",
        "US7984056B1",
        "US20090172021A1",
        "US8271878B2",
        "US20090171754A1",
        "US9117219B2",
        "US20090182622A1",
        "US20100070501A1",
        "US8239185B2",
        "US8782124B2",
        "US9009600B2",
        "US20100005424A1",
        "US8762364B2",
        "US9081853B2",
        "US8224712B2",
        "GB2459476A",
        "US8184116B2",
        "US8402387B1",
        "US8233005B2",
        "US8212809B2",
        "US8466931B2",
        "US8259100B2",
        "US8214364B2",
        "US8359237B2",
        "US20090313550A1",
        "US20090327859A1",
        "US8990705B2",
        "US8471843B2",
        "US8521731B2",
        "US8346532B2",
        "AU2013201484B2",
        "US8832098B2",
        "US7991757B2",
        "US7991650B2",
        "CN101661367A",
        "US8090794B1",
        "CN101661476A",
        "US20100057577A1",
        "US8010545B2",
        "US8209616B2",
        "US20100057536A1",
        "US8606651B2",
        "TWI410083B",
        "US8938465B2",
        "CN101355664B",
        "US20100082527A1",
        "US8347235B2",
        "US8521757B1",
        "WO2010036164A1",
        "US8904345B2",
        "US20100082684A1",
        "US8271875B2",
        "US20100114654A1",
        "US20100125597A1",
        "US8549016B2",
        "US20100125523A1",
        "US20100125577A1",
        "US8494899B2",
        "US8805861B2",
        "US9477672B2",
        "US8234274B2",
        "US20100169177A1",
        "US9195640B1",
        "US20100180200A1",
        "US20100177117A1",
        "US8620778B2",
        "US8239397B2",
        "US8452781B2",
        "US8356044B2",
        "US8539359B2",
        "US9600581B2",
        "US9477763B2",
        "US9391825B1",
        "US8195611B2",
        "US9245033B2",
        "US7657337B1",
        "US8806047B2",
        "US8290972B1",
        "US10303722B2",
        "US20100287152A1",
        "US9442621B2",
        "US20100287031A1",
        "US8583511B2",
        "JP2010272004A",
        "US20100301114A1",
        "CN101901235B",
        "US8374990B2",
        "EP2261819A1",
        "US8510308B1",
        "EP2271057A1",
        "US8510247B1",
        "US9213776B1",
        "US8856670B1",
        "KR20110031087A",
        "EP2312515A1",
        "US8122005B1",
        "US8972436B2",
        "US9886681B2",
        "US20110131536A1",
        "US8255380B2",
        "US10102278B2",
        "US9336377B2",
        "US9183202B2",
        "US9081632B2",
        "US9785987B2",
        "US8584034B2",
        "US20120089914A1",
        "US9031944B2",
        "US20110282861A1",
        "CN101877720A",
        "US20110295612A1",
        "JP5454357B2",
        "US8583674B2",
        "US9449282B2",
        "US9043296B2",
        "CN102377790B",
        "CN102411591A",
        "US9535884B1",
        "US9076146B2",
        "US20120109947A1",
        "US20120197881A1",
        "EP2463818A1",
        "CN102542474B",
        "CN103299651B",
        "US9158775B1",
        "US9003015B2",
        "US20120172025A1",
        "WO2012094564A1",
        "US9172762B2",
        "US8949239B2",
        "US9229900B2",
        "US8612419B2",
        "US20120203592A1",
        "US9015141B2",
        "US20120203733A1",
        "US10055766B1",
        "US8996495B2",
        "US20120226750A1",
        "US8600926B2",
        "US8694457B2",
        "US8843433B2",
        "US20120278268A1",
        "US8676937B2",
        "US9588632B1",
        "US8577876B2",
        "US8938391B2",
        "US9529915B2",
        "US9116979B2",
        "US20120330777A1",
        "CN102855248A",
        "US9459778B2",
        "CA2847187A1",
        "CN102956009B",
        "US8914496B1",
        "US8983947B2",
        "US10579712B1",
        "US20130089847A1",
        "US8195799B1",
        "US8868590B1",
        "US20130132851A1",
        "US8976955B2",
        "US20130159254A1",
        "US20130166379A1",
        "US9110998B2",
        "US20130166609A1",
        "US8943015B2",
        "CN102402766B",
        "US10055718B2",
        "US8954580B2",
        "US9900395B2",
        "US9734468B2",
        "US8972357B2",
        "US11734712B2",
        "US8977573B2",
        "US9311417B2",
        "US9536003B2",
        "CN104254851A",
        "JP5668007B2",
        "US20130275353A1",
        "US9348811B2",
        "US9053185B1",
        "US9628573B1",
        "US9465875B2",
        "US9665630B1",
        "US9043722B1",
        "US20140019443A1",
        "US9336302B1",
        "US9588784B2",
        "US9396179B2",
        "US10261938B1",
        "US10599981B2",
        "US9852215B1",
        "US10198776B2",
        "US9015088B2",
        "US9569785B2",
        "US9278255B2",
        "US10212986B2",
        "CN103020855B",
        "US10528907B2",
        "US9348886B2",
        "US9251203B2",
        "US9405746B2",
        "US9129227B1",
        "US10600011B2",
        "US9830612B2",
        "US9542669B1",
        "US9430572B2",
        "US9501506B1",
        "US9547698B2",
        "US9483568B1",
        "US20150019565A1",
        "US9244522B2",
        "US20150134302A1",
        "US20150142521A1",
        "US20150149261A1",
        "TW201523481A",
        "US9208153B1",
        "US10366439B2",
        "US20150193789A1",
        "US9628950B1",
        "WO2015131345A1",
        "US20160259765A1",
        "US9396354B1",
        "US9537811B2",
        "US20150356101A1",
        "US20150356174A1",
        "US9113301B1",
        "US20150370474A1",
        "JP6173586B2",
        "US9225897B1",
        "US10592539B1",
        "US10601749B1",
        "CN104199836B",
        "US9563912B2",
        "US10423983B2",
        "US10824654B2",
        "US11216869B2",
        "US20160092956A1",
        "US9720978B1",
        "US10284508B1",
        "CN104281696B",
        "US9015285B1",
        "US9160680B1",
        "US9262681B1",
        "US10210463B2",
        "US20160171382A1",
        "US9385983B1",
        "US10311916B2",
        "US9697466B2",
        "US9754355B2",
        "US11388226B1",
        "US10133705B1",
        "US9497498B2",
        "US9521515B2",
        "US10475043B2",
        "US10223397B1",
        "KR102371138B1",
        "US9692967B1",
        "US10452993B1",
        "US10083213B1",
        "US10755294B1",
        "US10134050B1",
        "WO2016178657A1",
        "US10135949B1",
        "US9881094B2",
        "US9769208B2",
        "US10447777B1",
        "US10993069B2",
        "US10147037B1",
        "US20170031966A1",
        "US10475044B1",
        "US10268956B2",
        "CN105095187A",
        "US10817898B2",
        "CN105208113A",
        "CN105262794B",
        "US11276006B2",
        "US10394804B1",
        "US10366440B2",
        "US10242093B2",
        "US9652896B1",
        "US10474321B2",
        "US9984499B1",
        "US20170169341A1",
        "US10354425B2",
        "KR20170082361A",
        "CN105678587B",
        "US10430451B2",
        "US10679389B2",
        "US10285001B2",
        "US11023514B2",
        "US10339365B2",
        "US10599699B1",
        "US20170300563A1",
        "CN105869058B",
        "US10430838B1",
        "US9681265B1",
        "US10733255B1",
        "US11477302B2",
        "US10083451B2",
        "CN111555954B",
        "US10855632B2",
        "US10162734B1",
        "US10467541B2",
        "US10460398B1",
        "US10404549B2",
        "CN106407316B",
        "US11574207B2",
        "US10445332B2",
        "US10572954B2",
        "US10733677B2",
        "WO2018085848A1",
        "US10552898B2",
        "US10405041B2",
        "US10552843B1",
        "US11205103B2",
        "US10203855B2",
        "US10650311B2",
        "US10109275B2",
        "US10979305B1",
        "US11616745B2",
        "US10748157B1",
        "US10915911B2",
        "US11250075B1",
        "US10319149B1",
        "US10074381B1",
        "US11301774B2",
        "US10565795B2",
        "US10523625B1",
        "CN107103036B",
        "US10581782B2",
        "US10582277B2",
        "US11170393B1",
        "US10387730B1",
        "US11451956B1",
        "US10212541B1",
        "US10467147B1",
        "US10447635B2",
        "US10803120B1",
        "US10762423B2",
        "CN107220386B",
        "US10922367B2",
        "US11721090B2",
        "RU2757546C2",
        "US11475254B1",
        "US11694092B2",
        "US10740974B1",
        "US11093951B1",
        "US10499191B1",
        "WO2019075430A1",
        "US11106682B2",
        "US10573043B2",
        "US11265273B1",
        "US10497004B2",
        "US11017173B1",
        "US20190197013A1",
        "CN110020176A",
        "CN108108465A",
        "US10678818B2",
        "US10489792B2",
        "US11023774B2",
        "US11436642B1",
        "US11803883B2",
        "US11403690B2",
        "US10210244B1",
        "US11507614B1",
        "US10885136B1",
        "US10979752B1",
        "US10327096B1",
        "KR20230129617A",
        "US11269665B1",
        "US11163941B1",
        "US10554701B1",
        "US20190311424A1",
        "US10219111B1",
        "US10169315B1",
        "US10747839B2",
        "US20210342920A1",
        "CN108846062B",
        "US10877957B2",
        "KR102150561B1",
        "US10679393B2",
        "US11216510B2",
        "US10997760B2",
        "US11232783B2",
        "US10698583B2",
        "US11282100B2",
        "US11074634B2",
        "EP3861518A4",
        "US10778623B1",
        "US10747957B2",
        "CN109598414B",
        "US11551004B2",
        "US10929914B2",
        "EP3660699A1",
        "US10939236B1",
        "US11199957B1",
        "US10939246B1",
        "US10867338B2",
        "US11294936B1",
        "US10735527B1",
        "CN109995847A",
        "US10838599B2",
        "US10964082B2",
        "US10852918B1",
        "US11249614B2",
        "US10810782B1",
        "CN109992245A",
        "US10489474B1",
        "US10565639B1",
        "US10582453B1",
        "US10560898B1",
        "US10893385B1",
        "US11307747B2",
        "US11232110B2",
        "US11010442B2",
        "US11425064B2",
        "US11218838B2",
        "KR102278814B1",
        "US10796355B1",
        "US11128715B1",
        "US11429618B2",
        "US11343323B2",
        "US11228551B1",
        "US11556814B2",
        "US11516167B2",
        "US11619501B2",
        "US10956743B1",
        "US11430091B2",
        "US11290851B2",
        "US11503432B2",
        "US11483267B2",
        "US11314776B2",
        "US11308327B2",
        "US20220107973A1",
        "US11790404B2",
        "US11606756B2",
        "US11645324B2",
        "US20230267526A1"
    ]
}