{
    "patent_link": "https://patents.google.com/patent/US6018516A/en",
    "patent_id": "US6018516A",
    "title": "Method for minimizing unneeded retransmission of packets in a packet communication environment supporting a plurality of data link rates",
    "abstract": "A method is provided for preventing gratuitous retransmission of data from being propagated through a network which includes holding data to be retransmitted for a minimum time period. If an acknowledgment occurs while the retransmitted data is still being held, then the retransmitted data is discarded rather than propagated through the network. The invention also provides for selectively holding retransmissions based upon ascertainable factors about the underlying connection activity, such as number of successful transmissions.",
    "inventors": [
        "Robert L. Packer"
    ],
    "assignee": "Gen Digital Inc",
    "classifications": [
        "H04L1/1887",
        "H04L1/188",
        "H04L1/1809"
    ],
    "claims": "\n1. A method for minimizing retransmission of data on a transmission link in a digital data packet communication environment having a plurality of digital packet transmission stations interconnectable in arbitrary and changeable data paths, wherein said data packet communication environment lacks explicit end-to-end data rate control, said method comprising the steps of:\ndetecting retransmission of data at a point intermediate of said endpoints; upon said detecting\nclamping said retransmission of data to a clamp time, said clamp time being measured from a prerecorded time of original transmission of said data;\nfor said transmission of data, determining an elapsed time since said transmission; and\npermitting said retransmission of data through said intermediate point whenever said elapsed time exceeds said clamp time without receipt of an acknowledgment.\n2. The method of claim 1 further comprising the step of:\ndiscarding said retransmission if said acknowledgment is received.\n3. The method of claim 1 further comprising the step of:\nremoving a clamp of said retransmission of data whenever a number of consecutive transmissions without a timeout has occurred.\n4. The method of claim 1 wherein said digital data packet communication environment is a Transmission Control Protocol (TCP) connection.\n5. The method of claim 1 wherein said digital data packet communication environment is a User Datagram Protocol (UDP) session.\n6. A method for preventing gratuitous retransmission of data from being propagated through a transmission link in a digital data packet communication environment having a plurality of digital packet transmission stations interconnectable in arbitrary and changeable data paths, wherein said data packet communication environment lacks explicit end-to-end data rate control, said method comprising the steps of;\ndetecting retransmission of data at a point intermediate of said endpoints; upon said detecting\nclamping data to be retransmitted for a minimum time period at a point intermediate of endpoints, said time period being measured from a prerecorded time of original transmission of said data;\nwaiting for an acknowledgment to occur while the retransmitted data is clamped;\ndiscarding the data to be retransmitted if the acknowledgment occurs;\npropagating the data to be retransmitted through the network via said intermediate point if the acknowledgment does not occur.\n7. The method of claim 6 further comprising the step of:\nselectively clamping the data to be retransmitted based upon ascertainable factors about the underlying connection activity.\n8. The method of claim 6 further comprising the step of:\ndetermining said minimum amount of time based upon ascertainable factors about the underlying connection activity.\n9. The method of claim 6 wherein said digital data packet communication environment is a Transmission Control Protocol (TCP) connection.\n10. The method of claim 6 wherein said digital data packet communication environment is a User Datagram Protocol (UDP) session.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4882765A",
        "US4896151A",
        "US5130978A",
        "US5224105A",
        "US5432798A",
        "US5440551A",
        "US5610595A",
        "US5745685A",
        "US5793768A",
        "US5802106A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6118765A",
        "US6202081B1",
        "US6260070B1",
        "US6298381B1",
        "EP1168704A2",
        "US20020032769A1",
        "US6446121B1",
        "US20020172153A1",
        "WO2003019876A1",
        "US20030043777A1",
        "US20030061263A1",
        "US20030065703A1",
        "US20030065762A1",
        "US20030067903A1",
        "US20030079027A1",
        "US20030081599A1",
        "US20030088692A1",
        "US20030103453A1",
        "US6587434B1",
        "EP1189396A3",
        "US20030174738A1",
        "US6629285B1",
        "US20030218976A1",
        "US6657972B1",
        "US20040013135A1",
        "US20040022194A1",
        "US20040054796A1",
        "US6724724B1",
        "EP1430619A1",
        "US20040128681A1",
        "US6781990B1",
        "US6785235B1",
        "US6795860B1",
        "US6816458B1",
        "US6826152B1",
        "US6826153B1",
        "US6847609B1",
        "EP1545040A1",
        "US20050190720A1",
        "US20050198334A1",
        "US20050232193A1",
        "US6959006B1",
        "US20060015574A1",
        "US20060020702A1",
        "US6992982B1",
        "US7010611B1",
        "US20060155840A1",
        "EP1708382A1",
        "US7152124B1",
        "US20070130355A1",
        "US7236459B1",
        "US20070208854A1",
        "US7298746B1",
        "US20070280191A1",
        "US7337209B1",
        "US7346008B1",
        "US20080151858A1",
        "US20080215735A1",
        "US20080215718A1",
        "US7447777B1",
        "US20080279222A1",
        "US20080298233A1",
        "US20090041589A1",
        "US7543052B1",
        "US7584262B1",
        "US20090323527A1",
        "US20100091699A1",
        "US7814204B1",
        "US20100332595A1",
        "US7869366B1",
        "US7937470B2",
        "US8543901B1",
        "US8549135B1",
        "US8559341B2",
        "US8670326B1",
        "US8724517B1",
        "US8745245B1",
        "US8774010B2",
        "US8830875B1",
        "US8930538B2",
        "US8982733B2",
        "US9092380B1",
        "US20160127083A1",
        "US9392332B2",
        "US9391921B1",
        "US9450846B1",
        "US10187353B2",
        "US10924573B2"
    ],
    "citedby_ftf": []
}