{
    "patent_link": "https://patents.google.com/patent/US6026397A/en",
    "patent_id": "US6026397A",
    "title": "Data analysis system and method",
    "abstract": "A system (10) for analyzing a data file containing a plurality of data records with each data record containing a plurality of parameters is provided. The system (10) includes an input (40) for receiving the data file and a data processor (32) having at least one of several data processing functions. These data processing functions include, for example, a segmentation function (34) for segmenting the data records into a plurality of segments based on the parameters. The data processing functions also include a clustering function (36) for clustering the data records into a plurality of clusters containing data records having similar parameters. A prediction function (38) for predicting expected future results from the parameters in the data records may also be provided with the data processor (32).",
    "inventors": [
        "Colin P. Sheppard"
    ],
    "assignee": "Hewlett Packard Enterprise Development LP",
    "classifications": [
        "G06F16/355",
        "Y10S707/99932",
        "Y10S707/99935"
    ],
    "claims": "\n1. A system for analyzing a data file containing a plurality of data records, each data record containing a plurality of parameters, the system comprising:\nan input for receiving the data file; and\na data processor comprising a clustering function for clustering the data records into a plurality of clusters containing data records having similar parameters wherein the clustering function is further operable to generate a cluster map including a graphical depiction of the clusters, wherein the cluster map comprises a plurality of graphical elements each having a graphical depiction indicative of a number of records in a cluster.\n2. The system of claim 1 wherein the input is further operable to convert the data records into a processing format for the data processor.\n3. The system of claim 2 further comprising an output operable to convert the data records in the processing format back to their original format.\n4. The system of claim 2 wherein the data records in the data file are in ASCII format and are processed in binary format in the data processor.\n5. The system of claim 1 further comprising a data manager for manipulating the data file.\n6. The system of claim 5 wherein the data manager further comprises a data append function for appending data files.\n7. The system of claim 5 wherein the data manager further comprises a data merge function for merging data files.\n8. The system of claim 5 wherein the data manager further comprises a data paring function for paring parameters from a data file.\n9. The system of claim 1 wherein the cluster map is color coded to depict the relative number of records in each cluster.\n10. The system of claim 1 wherein the clustering function is further operable to provide statistics for each parameter for the records in a cluster.\n11. The system of claim 1 wherein the clustering function is further operable to provide a parameter graph for each parameter in the records in a cluster.\n12. The system of claim 1 wherein the clustering function further comprises a neural clustering function.\n13. The system of claim 1 wherein the data processor further comprises a prediction function for predicting expected future results from the parameters in the data records.\n14. The system of claim 13 wherein the prediction function further comprises a neural prediction function.\n15. The system of claim 1 wherein the data processor further comprises a segmentation function for segmenting the data records into a plurality of segments based on the parameters.\n16. The system of claim 15 wherein the segmentation function is further operable to provide statistics on the data records.\n17. The system of claim 15 wherein the segmentation function is further operable to segment the data records into a plurality of segments using segmentation logic.\n18. The system of claim 15 wherein the segmentation function is further operable to segment an existing segment into additional segments.\n19. The system of claim 1 wherein the clustering function is further operable to identify characteristic profiles for each group.\n20. The system of claim 13 wherein the prediction function employs a multi-layer perception network in predicting the expected future results.\n21. The system of claim 1 wherein the data records further comprise customer data records containing a plurality of customer parameters in each customer record.\n22. The system of claim 15 wherein the data records further comprise customer data records containing a plurality of customer parameters in each customer record and wherein the segmentation function is further operable to segment the customer data records into logical groups of customers.\n23. The system of claim 21 wherein the clustering function is further operable to cluster customer data records into statistically significant groups of customers.\n24. The system of claim 13 wherein the data records further comprise customer data records containing a plurality of customer parameters in each customer record and wherein the prediction function is further operable to predict customer behavior from the customer data records.\n25. The system of claim 13 wherein the data records further comprise customer data records containing a plurality of customer parameters in each customer record and wherein the prediction function is further operable to predict customer behavior from current customer data records.\n26. The system of claim 15 wherein the segmentation function is further operable to identify statistics for each segment.\n27. The system of claim 15 wherein the segmentation function is further operable to identify statistical distributions for each segment.\n28. The system of claim 15 wherein the segmentation function is further operable to generate a histogram for each parameter in the data records.\n29. The system of claim 15 wherein the segmentation function is further operable to generate a histogram for a data segment.\n30. The system of claim 1 wherein the clustering function is further operable to generate a histogram for each cluster.\n31. A system for analyzing a data file containing a plurality of customer data records, each data record containing a plurality of customer parameters, the system comprising:\nan input for receiving the data file; and\na data processor for processing the data records, the data processor further comprising\na segmentation function for segmenting the customer data records into a plurality of segments based on the parameters,\na clustering function for clustering the customer data records into a plurality of customer groups having similar parameters, and\na prediction function for predicting customer behavior from the customer data records.\n32. The system of claim 31 further comprising a data manager for manipulating the data file.\n33. The system of claim 32 wherein the data manager further comprises a data append function for appending data files.\n34. The system of claim 32 wherein the data manager further comprises a data merge function for merging data files.\n35. The system of claim 32 wherein the data manager further comprises a data paring function for paring parameters from a data file.\n36. The system of claim 31 wherein the segmentation function is further operable to provide statistics on the data records.\n37. The system of claim 31 wherein the segmentation function is further operable to segment the data records into a plurality of segments using segmentation logic.\n38. The system of claim 31 wherein the segmentation function is further operable to segment an existing segment into additional segments.\n39. The system of claim 31 wherein the clustering function is further operable to identify characteristic profiles for each customer group.\n40. The system of claim 31 wherein the prediction function is further operable to predict prospective customer behavior from current customer data records.\n41. The system of claim 31 wherein the segmentation function is further operable to identify statistical distributions for each segment.\n42. The system of claim 31 wherein the segmentation function is further operable to generate a histogram for each parameter in the data records.\n43. The system of claim 31 wherein the segmentation function is further operable to generate a histogram for a segment.\n44. The system of claim 31 wherein the clustering function is operable to generate a histogram for each cluster.\n45. The system of claim 31 wherein the clustering function is further operable to generate a cluster map depicting the number of records in each cluster.\n46. The system of claim 45 wherein the cluster map is color coded to depict the relative number of records in each cluster.\n47. The system of claim 31 wherein the clustering function is further operable to provide statistics for each parameter for the records in a cluster.\n48. The system of claim 31 wherein the clustering function is further operable to provide a parameter graphs for each parameter in the records in a cluster.\n49. A method for analyzing a data file containing a plurality of data records, each data record containing a plurality of parameters, the method comprises the steps of:\ninputting the data file; and\nprocessing the data file by\nsegmenting the data records into a plurality of segments based on the parameters,\nclustering the data records into a plurality of clusters containing data records having similar parameters, and\npredicting expected future results from the parameters in the data records.\n50. The method of claim 49 wherein the inputting step further comprises converting the data records into a predetermined processing format.\n51. The method of claim 50 further comprising the step of converting the data records in the processing format back to their original format.\n52. The method of claim 49 further comprising the step of appending data files together.\n53. The method of claim 49 further comprising the step of merging data files together.\n54. The method of claim 49 further comprising the step of paring parameters from a data file.\n55. The method of claim 49 wherein the segmenting step further comprises providing statistics on the data records.\n56. The method of claim 49 wherein the segmenting step further comprises segmenting an existing segment into additional segments.\n57. The method of claim 49 wherein the clustering step further comprises clustering the data records into groups having similar parameters.\n58. The method of claim 57 wherein the clustering step further comprises identifying characteristic profiles for each group.\n59. The method of claim 49 wherein the data records further comprise customer data records containing a plurality of customer parameters in each customer record.\n60. The method of claim 59 wherein the segmenting step further comprises segmenting the customer data records into groups of customers.\n61. The method of claim 59 wherein the clustering step further comprises clustering customer data records into statistically significant groups of customers.\n62. The method of claim 59 wherein the predicting step further comprises predicting customer behavior from the customer data records.\n63. The method of claim 59 wherein the predicting step further comprises predicting prospective customer behavior from the customer data records.\n64. The method of claim 49 wherein the segmenting step further comprises generating a histogram for each parameter in the data records.\n65. The method of claim 49 wherein the segmenting step further comprises generating a histogram for a data segment.\n66. The method of claim 49 wherein the clustering step further comprises generating a histogram for each cluster.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4653021A",
        "US5033087A",
        "US5097428A",
        "US5168565A",
        "US5227874A",
        "US5287275A",
        "US5305219A",
        "US5319509A",
        "US5375244A",
        "US5397893A",
        "US5412152A",
        "US5418972A",
        "US5425035A",
        "US5442778A",
        "US5483650A",
        "US5537491A",
        "US5544248A",
        "US5557655A",
        "US5566069A",
        "US5574837A",
        "US5701400A",
        "US5704017A",
        "US5710915A",
        "US5742706A",
        "US5787420A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6112194A",
        "US6134555A",
        "US6167391A",
        "US6275819B1",
        "US20010034686A1",
        "US6330563B1",
        "US20020019826A1",
        "US20020029114A1",
        "US6369820B1",
        "US20020045991A1",
        "US20020046157A1",
        "US20020055903A1",
        "US20020069134A1",
        "US6405200B1",
        "US20020097721A1",
        "US6430539B1",
        "US6449612B1",
        "US20020128858A1",
        "US6453246B1",
        "US20020133721A1",
        "US20020143476A1",
        "US6473741B1",
        "US20020159642A1",
        "US20020161730A1",
        "US6477275B1",
        "US20020169652A1",
        "US20020184211A1",
        "US20020184080A1",
        "US20020194176A1",
        "US20030014191A1",
        "US20030023951A1",
        "US6519576B1",
        "US20030041077A1",
        "US6529895B2",
        "US6532467B1",
        "US20030055937A1",
        "US6542878B1",
        "US6542896B1",
        "US20030074301A1",
        "US20030078747A1",
        "US6571227B1",
        "US6574632B2",
        "WO2003046770A1",
        "US20030110074A1",
        "US6581037B1",
        "KR20030060521A",
        "US6597382B1",
        "US20030145000A1",
        "FR2835632A1",
        "US20030154181A1",
        "US20030158850A1",
        "US20030160818A1",
        "US20030176931A1",
        "US20030208689A1",
        "US6665644B1",
        "US20040002369A1",
        "US20040030667A1",
        "US6704721B1",
        "US20040059518A1",
        "US20040088276A1",
        "US20040093259A1",
        "US20040098229A1",
        "US6741983B1",
        "US20040103017A1",
        "US20040103051A1",
        "US20040107189A1",
        "US20040140019A1",
        "US6769010B1",
        "US6775819B1",
        "US20040158561A1",
        "US6778995B1",
        "US20040193503A1",
        "KR100451940B1",
        "US20040204982A1",
        "US20040215522A1",
        "US20040221295A1",
        "US20040236673A1",
        "US20040250112A1",
        "US20040254942A1",
        "US20040267775A1",
        "US20050005102A1",
        "US20050021729A1",
        "US20050022106A1",
        "US20050021286A1",
        "US20050021499A1",
        "US20050033723A1",
        "US20050065913A1",
        "US20050086216A1",
        "US20050114510A1",
        "US20050119922A1",
        "US20050119919A1",
        "US6904409B1",
        "US20050171948A1",
        "WO2005081138A1",
        "WO2005081139A1",
        "US20050198042A1",
        "US6947913B1",
        "US20050216844A1",
        "US20050234760A1",
        "US20050234753A1",
        "US20050234761A1",
        "US20050234762A1",
        "US20050234763A1",
        "US20050234688A1",
        "US20050234697A1",
        "US6970830B1",
        "US6973458B1",
        "US7006979B1",
        "US20060047571A1",
        "US7010495B1",
        "US20060053047A1",
        "US20060074824A1",
        "US20060080175A1",
        "US20060123340A1",
        "WO2006065779A2",
        "US7072845B1",
        "US20060149910A1",
        "US7117137B1",
        "US7124104B2",
        "US7139739B2",
        "US20060265088A1",
        "US20060265089A1",
        "US20060262919A1",
        "US20060265090A1",
        "US20060262920A1",
        "US20060277212A1",
        "US20060277585A1",
        "US20060274763A1",
        "US20060277198A1",
        "US20060277197A1",
        "US20070030282A1",
        "US20070033173A1",
        "US7188355B1",
        "US20070061369A1",
        "US20070061085A1",
        "US20070100992A1",
        "US20070112614A1",
        "US20070130299A1",
        "US20070149288A1",
        "US20070152058A1",
        "US7249328B1",
        "US20070174228A1",
        "US20070174234A1",
        "US20070226209A1",
        "US20070226039A1",
        "US7281218B1",
        "US20070236431A1",
        "US20070250211A1",
        "US20070279416A1",
        "US20080016540A1",
        "US20080065462A1",
        "US20080091508A1",
        "US7376618B1",
        "US20080133573A1",
        "US20080147591A1",
        "US20080154701A1",
        "US20080201102A1",
        "US20080201655A1",
        "US7421648B1",
        "US7424439B1",
        "US20080221978A1",
        "US20080240405A1",
        "US20080240376A1",
        "US20080240404A1",
        "US20080240374A1",
        "US20080256139A1",
        "US7441197B2",
        "US20080276162A1",
        "US20080288428A1",
        "US20080301108A1",
        "US20090019026A1",
        "US20090019022A1",
        "US20090043747A1",
        "US20090044003A1",
        "US20090103709A1",
        "US20090150318A1",
        "US20090171759A1",
        "US7565620B1",
        "US7593863B1",
        "US20090248496A1",
        "US7644375B1",
        "US20100042913A1",
        "US20100039431A1",
        "US20100042591A1",
        "US20100075291A1",
        "US20100075290A1",
        "US20100075292A1",
        "US20100159438A1",
        "US20100159437A1",
        "US20100159432A1",
        "US20100179858A1",
        "US20100251090A1",
        "US20100257576A1",
        "US20100306332A1",
        "US20100318926A1",
        "US20100333092A1",
        "US20110029530A1",
        "US20110029535A1",
        "US20110047156A1",
        "US7917647B2",
        "US20110107271A1",
        "US20110153419A1",
        "US20110178855A1",
        "US20110178843A1",
        "US20110178842A1",
        "US20110178845A1",
        "US20110178844A1",
        "US20110178849A1",
        "US20110178846A1",
        "US20110178841A1",
        "US20110178847A1",
        "US20110178848A1",
        "US7991732B2",
        "US20110221774A1",
        "US8023639B2",
        "US8095866B2",
        "US20120023046A1",
        "WO2012024256A1",
        "US8145628B2",
        "US8180787B2",
        "USRE43753E1",
        "US20120290662A1",
        "US8356019B1",
        "US8380718B2",
        "US8517269B2",
        "US8608053B2",
        "US8631325B1",
        "US20140025437A1",
        "CN103593769A",
        "US20140129512A1",
        "US8738609B2",
        "US8775919B2",
        "US8793236B2",
        "US20140372444A1",
        "US8965839B2",
        "US9083801B2",
        "US20150220945A1",
        "US9189669B2",
        "US9202178B2",
        "WO2015183127A1",
        "WO2016014678A1",
        "US9251276B1",
        "US9262383B2",
        "US9262384B2",
        "US9268748B2",
        "US9329897B2",
        "US9389909B1",
        "US9424337B2",
        "US20160364675A1",
        "US9589164B2",
        "US20170078315A1",
        "US9811513B2",
        "US9817871B2",
        "US20170357240A1",
        "US9942312B1",
        "US10037478B1",
        "US20180218425A1",
        "US20180308150A1",
        "US20190164011A1",
        "US10521866B2",
        "US10839318B2",
        "US10846623B2",
        "US10896421B2",
        "US10929777B2",
        "US10977655B2",
        "US10977361B2",
        "US10984423B2",
        "US10997599B2",
        "US11023894B2",
        "US11030527B2",
        "US11055327B2",
        "US11062317B2",
        "US11068546B2",
        "US11080793B2",
        "US11080709B2",
        "US11113042B2",
        "US11151480B1",
        "US20210326785A1",
        "US11348110B2",
        "US11366572B2",
        "US11496480B2",
        "US11528149B2",
        "CN116011403A",
        "US11694253B2",
        "US11775878B2"
    ],
    "citedby_ftf": []
}