{
    "patent_link": "https://patents.google.com/patent/US5727065A/en",
    "patent_id": "US5727065A",
    "title": "Deferred billing, broadcast, electronic document distribution system and method",
    "abstract": "An electronic document delivery system and method in which a broadcast center periodically sends a \"catalog\" of available documents to a receiving computer, thereby allowing a user to browse through the available documents without having to access the broadcast center. The documents are transmitted as packets, and the packets are decrypted as soon as they are received, eliminating the need to store both an encrypted and an decrypted version of the documents at the receiving computer. The receiving computer periodically receives information allowing it to decrypt received documents and to encrypt billing information for the receiving computer. The invention is not limited to text-only documents and can receive all types of documents, such as software, images, text, and full-motion video.",
    "inventors": [
        "Douglas M. Dillon"
    ],
    "assignee": "DirecTV Group Inc",
    "classifications": [
        "H04N7/17318",
        "G06F21/10",
        "G06Q20/085",
        "G06Q20/0855",
        "G06Q30/0633",
        "H04N21/2543",
        "H04N21/278",
        "H04N21/4345",
        "H04N21/6581",
        "H04N7/17327",
        "G06F2211/007",
        "G06F2221/2135"
    ],
    "claims": "\n1. A document delivery system, comprising:\na broadcast center that repeatedly sends a document as a plurality of encrypted packets;\na communication link connected to the broadcast center for carrying the packets;\na receiving computer, connected to the communication link, and including a memory and a broadcast receiver wherein the broadcast receiver decrypts each packet as it is received and stores only the decrypted packets that are not duplicates of previously received packets in the memory.\n2. The document delivery system of claim 1, where the sent document consists of two or more from the following group: software, images, text, and full-motion video.\n3. The document delivery system of claim 1, wherein the communication link includes a hybrid link, allowing fast broadcast communication from the broadcast center to the receiving computer and slower communication from the receiving computer to the broadcast center.\n4. The document delivery system of claim 1, wherein the communication link is an satellite broadcast link with a dial-up modem return link.\n5. The document delivery system of claim 1, wherein the system is a Local Area Network.\n6. The document delivery system of claim 1, wherein the broadcast center also sends an unencrypted packet containing a catalog, and the receiving computer further includes a file browser, and wherein the file browser receives the catalog, stores the catalog in the memory, displays the stored catalog, and receives user input indicating a requested document in the catalog.\n7. The document delivery system of claim 6, further comprising:\na security engine containing a number of keys;\nmeans in the receiving computer to send a load request to the security engine when the file browser receives input indicating the requested document in the catalog.\n8. The document delivery system of claim 7, further comprising:\nmeans in the security engine to send a key corresponding to the requested document to the broadcast receiver,\nwherein the broadcast receiver discards received data which does not correspond to the key.\n9. The document delivery system of claim 7,\nwherein the broadcast center includes means for sending an announcement message announcing that a specific document is about to be broadcast by the broadcast center; and\nwherein the means for sending a load request sends a load request if the document request received by the browser corresponds to the document announced by the announcement message.\n10. The document delivery system of claim 6, wherein a security engine sends billing information to the broadcast center on a predetermined periodic basis.\n11. The document delivery system of claim 6, wherein a security engine sends encrypted billing information to the broadcast center on a predetermined periodic basis.\n12. The document delivery system of claim 1, wherein the broadcast center includes means for sending an announcement message that a specific document is about to be broadcast by the broadcast center.\n13. A document delivery system, comprising:\na broadcast center that sends a document as a plurality of encrypted packets;\na communication link connected to the broadcast center for carrying the packets;\na receiving computer, connected to the communication link, and including a memory and a broadcast receiver, wherein the broadcast receiver decrypts each packet as it is received and stores only the decrypted packets in the memory; and\na security engine, wherein the broadcast center includes means for sending account information to the security engine and the security engine uses the account information to generate keys used by the broadcast receiver to decrypt the received packets and wherein the account information includes key seeds and the security engine uses a one-way hashing method based on an identification of the sent document and one of the key seeds.\n14. The document delivery system of claim 13 wherein the account information includes billing information.\n15. The document delivery system of claim 13, wherein the account information includes an engine private key for encrypting billing information sent to the broadcast center on a periodic basis.\n16. A receiving computer in a document delivery system having a broadcast center that sends a document as a plurality of encrypted packets and sends account information including key seeds to the receiving computer, the receiving computer comprising:\na memory;\na broadcast receiver that decrypts a packet as it is received and stores only the decrypted received packet in the memory; and\na security engine that generates keys used by the broadcast receiver to decrypt the received packets in accordance with a one-way hashing method based on a document ID of the sent document and one of the key seeds.\n17. The receiving computer of claim 16, further comprising:\na file browser for receiving a catalog, storing the catalog in the memory, displaying the stored catalog, and receiving user input indicating a document in the catalog.\n18. The receiving computer of claim 17, further comprising:\nmeans in the file browser to send a load request to the security engine when the file browser receives input indicating a document in the catalog.\n19. The receiving computer of claim 18, further comprising:\nmeans in the security engine to send a key corresponding to the requested document to the broadcast receiver,\nwherein the broadcast receiver discards received data which is not part of the document corresponding to the key.\n20. The receiving computer of claim 18, wherein the means for sending a load request sends a load request if the document request received by the file browser corresponds to a document announced by an announcement message received from the broadcast center.\n21. The receiving computer of claim 16, wherein the security engine sends billing information to the broadcast center on a predetermined periodic basis.\n22. The receiving computer of claim 16, wherein the security engine sends encrypted billing information to the broadcast center on a predetermined periodic basis.\n23. The receiving computer of claim 16, wherein communication between the broadcast center and the receiving computer occurs via a communication link that includes a hybrid link, allowing fast broadcast communication from the broadcast center to the receiving computer and slower communication from the receiving computer to the broadcast center.\n24. A method for document delivery in a network system, including the steps of:\nsending, by a broadcast center in the network, a document as a plurality of encrypted packets;\nconnecting a communication link to the broadcast center;\ndecrypting a received packet, in a receiving computer connected to the communication link, the receiving computer including a memory and a broadcast receiver, wherein the broadcast receiver performs the decrypting step on the packet as it is received and stores only the decrypted received packet in the memory;\nsending, by the broadcast center, account information including key seeds to a security engine in the receiving computer; and\ngenerating, by the security engine, keys used by the broadcast receiver to decrypt the received packets in accordance with a one-way hashing method based on a document number of the sent document and one of the key seeds.\n25. A document delivery system, comprising:\na broadcast center that sends a documents as a plurality of encrypted packets;\na communication link connected to the broadcast center for carrying the packets;\na receiving computer, connected to the communication link, and including a memory and a broadcast receiver, wherein the broadcast receiver decrypts each packet as it is received and stores only the decrypted packets in the memory; and\na tamper-resistant security engine, wherein the broadcast center includes means for sending account information to the security engine and the security engine uses the account information to generate keys used by the broadcast receiver to decrypt the received packets.\n26. A method for receiving documents by a receiving computer in a network system, including the steps of:\nconnecting a communication link to a broadcast center in the network;\nreceiving from the broadcast center, by a broadcast receiver, a document as a plurality of encrypted packets;\ndecrypting a received packet as it is received and storing only the decrypted received packet in a memory in the receiving computer;\nreceiving from the broadcast center, by a security engine in the receiving computer, account information including key seeds; and\ngenerating, by the security engine, keys used by the broadcast receiver to decrypt the received packets in accordance with a one-way hashing method based on a document identification of the sent document and one of the key seeds.\n27. A method for receiving documents by a receiving computer in a network system, including the steps of:\nconnecting a communication link to a broadcast center in the network;\nreceiving from the broadcast center, by a broadcast receiver, more than one copy of a document as a plurality of encrypted packets; and\ndecrypting a received packet as it is received and storing only the decrypted received packet in a memory in the receiving computer if the decrypted received packet is not a duplicate of a previously received packet.\n28. The method of claim 27, further including the steps of:\nreceiving, by a file browser, a catalog;\nstoring the catalog in the memory;\ndisplaying the stored catalog; and\nreceiving user input indicating a document in the catalog.\n29. The method of claim 28, further including the steps of:\nsending a load request from the file browser to a security engine when the file browser receives input indicating a document in the catalog;\nsending from the security engine to the broadcast receiver a key corresponding to a requested document, and discarding received data which is not part of the document corresponding to the key.\n30. The method of claim 27, further including the step of sending an announcement message from the broadcast center that a specific document is about to be broadcast by the broadcast center.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4225884A",
        "US4720873A",
        "US4751732A",
        "US4829569A",
        "USRE33189E",
        "US4916737A",
        "US5319712A",
        "US5319705A",
        "US5400401A",
        "US5404505A",
        "US5481609A",
        "US5497420A"
    ],
    "citations_ftf": [
        "US4358672A",
        "US4458109A",
        "US4613901A",
        "DE3474496D1",
        "WO1985000718A1",
        "US4599647A",
        "JPS62285529A",
        "US5050213A",
        "US4944006A",
        "US5247575A",
        "WO1990002382A1",
        "US5131010A",
        "US5339239A",
        "US5136643A",
        "US5237610A",
        "US5029207A",
        "US5182752A",
        "US5111504A",
        "EP0491068A1",
        "JP3145116B2",
        "JPH04291893A",
        "US5504814A",
        "US5337044A",
        "JP2718436B2",
        "US5319707A",
        "US5367571A",
        "US5341425A",
        "JP3433395B2",
        "JPH0779318B2",
        "US5404502A",
        "JPH0787080A",
        "US5416840A",
        "US5506904A",
        "US5400403A",
        "US5646992A",
        "IL107967A",
        "US5394469A",
        "US5420866A",
        "US5727065A",
        "US5671282A",
        "US5568554A",
        "US5517502A",
        "US5875444A"
    ],
    "citedby_own": [
        "US5887062A",
        "WO1999060778A1",
        "US6026389A",
        "US6041359A",
        "US6072874A",
        "US6081907A",
        "US6098096A",
        "US6108706A",
        "WO2001031489A2",
        "US20010001160A1",
        "US6240401B1",
        "US6289450B1",
        "WO2001074002A1",
        "US20010039180A1",
        "US6327579B1",
        "EP1172739A2",
        "US20020027992A1",
        "WO2002021283A1",
        "US20020040472A1",
        "US6377981B1",
        "US6381227B1",
        "US20020072374A1",
        "US20020073437A1",
        "US20020072332A1",
        "US20020081969A1",
        "US20020112249A1",
        "US20020118654A1",
        "US20020128045A1",
        "US20020132643A1",
        "US20040008846A1",
        "US20040078577A1",
        "US20040098600A1",
        "US20040117839A1",
        "US20040133923A1",
        "US6763370B1",
        "US6771617B1",
        "US20040250109A1",
        "US20050028195A1",
        "US20050038735A1",
        "US6889032B2",
        "US20050105466A1",
        "US20050176018A1",
        "US6952580B2",
        "US20050222953A1",
        "US6961714B1",
        "US6968394B1",
        "US6978376B2",
        "US20060041751A1",
        "US20060104273A1",
        "US7058607B1",
        "US7080051B1",
        "US7120926B1",
        "US20060272023A1",
        "US7167840B1",
        "US20070033614A1",
        "US20070101357A1",
        "US7236950B2",
        "US20080123857A1",
        "US20080170693A1",
        "US20080189361A1",
        "US7665109B2",
        "US7716349B1",
        "US7730169B1",
        "US7743330B1",
        "US20100180296A1",
        "US7835989B1",
        "US7849393B1",
        "US7861166B1",
        "US7865405B2",
        "US8051450B2",
        "US8073695B1",
        "US8095949B1",
        "US8099758B2",
        "US8140398B1",
        "US8396513B2",
        "US8578410B2",
        "US8621521B2",
        "US8855296B2",
        "US9053640B1",
        "US9185094B2",
        "US9286294B2",
        "US9559845B2",
        "US10749674B2",
        "US10853502B1",
        "US11473944B2",
        "US11488134B2"
    ],
    "citedby_ftf": [
        "US5727065A",
        "US6963859B2",
        "JPH08263438A",
        "US6233684B1",
        "EP0944982A1",
        "JP4228252B2",
        "US7213005B2",
        "FI20000761A0",
        "WO2001086527A1",
        "US8688474B2",
        "US7743259B2",
        "US7206941B2",
        "US8050944B2",
        "US7251610B2",
        "US7343324B2",
        "US20020055918A1",
        "US6983423B2",
        "US7275220B2",
        "US6912294B2",
        "US8069116B2",
        "US7028009B2",
        "US7774279B2",
        "US6754642B2",
        "US20040039704A1",
        "US7269736B2",
        "US20020138746A1",
        "US7725401B2",
        "US8275709B2",
        "US8099364B2",
        "US7222104B2",
        "US6895503B2",
        "US20030009424A1",
        "US8275716B2",
        "US8001053B2",
        "US6876984B2",
        "CN1539115A",
        "WO2002101490A2",
        "US7774280B2",
        "TW560155B",
        "US20030061073A1",
        "US20030154110A1",
        "US7974923B2",
        "WO2003044680A1",
        "US7840488B2",
        "US20030130872A1",
        "US7359884B2",
        "US7805371B2",
        "US20030229593A1",
        "JP4147796B2",
        "US20030216945A1",
        "US20030195860A1",
        "KR100755631B1",
        "US20030220816A1",
        "US20030220821A1",
        "US20030220817A1",
        "US20040010465A1",
        "US7979294B2",
        "IL154739A0",
        "US7191332B1",
        "US7685642B2",
        "US7610485B1",
        "IL157886A0",
        "IL157885A0",
        "IL158158A",
        "US8825502B2",
        "US20050097593A1",
        "US7464266B2",
        "US20050234741A1",
        "US8428968B2",
        "US20060004605A1",
        "US20050283387A1",
        "US20060047554A1",
        "US8725547B2",
        "US20060053034A1",
        "US20060085381A1",
        "US20060107326A1",
        "US8660961B2",
        "US20060106726A1",
        "US20060112015A1",
        "US20060117021A1",
        "US8140370B2",
        "US20060248573A1",
        "US20060271493A1",
        "US20070078777A1",
        "US7720767B2",
        "US8165303B1",
        "US8566615B2",
        "US20150142765A1"
    ]
}