{
    "patent_link": "https://patents.google.com/patent/US5937043A/en",
    "patent_id": "US5937043A",
    "title": "Mechanism for a system and method for detecting fraudulent use of collect calls",
    "abstract": "A method and system for detecting and preventing the fraudulent use of phone services in which the recipient of a telephone call is responsible for charges only after they agree to accept the telephone call is disclosed herein. The system and method includes a mechanism for detecting the initiation of a telephone call, wherein associated with the telephone call is a telephone number. The present invention searches a database for a prior occurrence of the telephone number. If the telephone number is found in the database, the information in the database associated with the telephone number is analyzed to determine if the telephone call is fraudulent. The system and method compares the information in the old record with a threshold to determine if the telephone call is fraudulent. The system and method completes the telephone call if the step of comparing determines the telephone call is not fraudulent in response to the step of comparing. The present invention updates the old record with the information for the telephone call if the step of searching finds an old record of a prior occurrence of the telephone number and the telephone call is rejected by the telephone call recipient. The present invention creates a record of the telephone call if the telephone number is not found in the database, and the telephone call is rejected by the recipient.",
    "inventors": [
        "Jingsha He"
    ],
    "assignee": "Verizon Patent and Licensing Inc",
    "classifications": [
        "H04M3/36",
        "H04M15/00",
        "H04M3/527"
    ],
    "claims": "\n1. A method for detecting and preventing the fraudulent use of phone services in which a recipient of a telephone call is responsible for charges only after the recipient agrees to accept the charges for the telephone call, commonly known as a collect call, the method comprising the steps of:\ndetecting an initiation of a collect call, wherein associated with said collect call is a telephone number;\nsearching a database of prior collect call information for an old record of a prior occurrence of said telephone number and, if said old record exists, comparing, before completion of said collect call, said prior collect call information in said old record with a predetermined threshold to determine if said collect call is fraudulent;\ncreating a new record of an occurrence of said telephone number in said database if the recipient does not accept the charges for said collect call and said step of searching does not find a record of a prior occurrence of said telephone number; and\ncompleting said collect call to the recipient if said old record does not exist or said step of comparing determines said collect call is not fraudulent.\n2. The method of claim 1, wherein said telephone number is the telephone number of the initiator of said collect call.\n3. The method of claim 1, wherein said telephone number is the telephone number of the recipient of said collect call.\n4. The method of claim 1, further comprising the step of updating said prior collect call information for said collect call in said old record, if said step of searching finds an old record of said prior occurrence of said telephone number, and said step of comparing does not determine the collect call to be fraudulent, and the charges for said collect call are not accepted by the recipient.\n5. A telephone system, comprising:\na telephone switching network for connecting two or more terminating elements in response to a telephone call, wherein a collect call is a telephone call where a recipient of said telephone call agrees to accept the charges associated with said telephone call;\na database that includes a plurality of records that each store information regarding one or more collect calls, wherein at least one record is created within said database when a given collect call is rejected by said recipient subsequent to said telephone switching network connecting said two or more terminating elements in response to said given collect call; and\na call center, coupled to said telephone switching network and said database, that determines whether a collect call is fraudulent, wherein all collect calls are first switched via said telephone switching network to said call center prior to connecting said two or more terminating elements.\n6. The telephone system of claim 5, wherein said collect call can be initiated between said two or more terminating elements by dialing a telephone number and recording a brief message.\n7. The telephone system of claim 5, wherein said call center determines whether said collect call is fraudulent by comparing the total number of collect calls to a called number with the total number of rejected collect calls by said called number.\n8. The telephone system of claim 5, wherein said plurality of records include a record for each called number and a record for each calling number.\n9. The telephone system of claim 8, wherein each of said plurality of records includes the number of rejected collect calls associated with said called number and the date and time of each of said rejected collect calls.\n10. The telephone system of claim 9, wherein each said record includes a voice message.\n11. The telephone system of claim 5, wherein said plurality of records contain a record for at least one of a called number, a calling number, or a combination or portion of both said called number and said calling numbers of a rejected collect call.\n12. The telephone system of claim 5, wherein if said call center determines that said collect call is fraudulent, said collect call is canceled.\n13. The telephone system of claim 5, wherein if said call center determines that said collect call is fraudulent, said collect call is transferred to an operator.\n14. The telephone system of claim 13, wherein said call center routes said collect call back to said telephone switching network for completion of said collect call if said call center determines that said collect call is not fraudulent.\n15. The telephone system of claim 14, wherein said call center updates said database if said collect call is rejected by said recipient.\n16. The telephone system of claim 5, wherein said call center updates said database if said collect call is rejected by said recipient.\n17. The telephone system of claim 5, wherein said call center routes said collect call back to said telephone switching network for completion of said collect call if said call center determines that said collect call is not fraudulent.\n18. The telephone system of claim 5, wherein said call center compares said information stored in at least one of said plurality of records to a threshold to determine whether said collect call is fraudulent.\n19. The telephone system of claim 5, wherein said call center compares said information stored in at least two of said plurality of records to a threshold to determine whether said collect call is fraudulent.\n20. The telephone system of claim 5, wherein said call center determines that said collect call is fraudulent when the number of rejected collect calls to a called number within a predetermined time period exceeds a threshold.\n21. The telephone system of claim 5, wherein said call center determines that said collect call is fraudulent when the number of rejected collect calls associated with a called number and a calling number exceeds a threshold.\n22. The telephone system of claim 5, wherein said call center creates at least one record within said database when said collect call is rejected by said recipient of said telephone call.\n23. The telephone system of claim 22, wherein said at least one record is identified by a telephone number of said recipient of said telephone call.\n24. The telephone system of claim 5, wherein said database only stores records within a predetermined date range.\n25. The telephone system of claim 5, wherein said call center is configured to reject collect calls to a selected set of telephone numbers.\n26. The telephone system of claim 5, wherein said call center rejects collect calls originating from a selected set of telephone numbers.\n27. The method of claim 1, further comprising canceling said collect call to the recipient if said prior collect call information in said old record exceeds said predetermined threshold.\n28. The method of claim 1, further comprising the step of creating at least one record within said database when said collect call is rejected by the recipient upon completion of said collect call.\n29. The method of claim 1, further comprising updating said database if said collect call is rejected by the recipient upon completion of said collect call.\n30. The method of claim 1, further comprising canceling said collect call to the recipient if said prior collect call information in said old record exceeds said predetermined threshold.\n31. The method of claim 1, wherein said step of detecting is performed by a telephone switching network, wherein said telephone switching network routes said collect call to a call center.\n32. The method of claim 1, further comprising deleting information from said database prior to a predetermined date.\n33. The method of claim 1, further comprising the steps of searching said database of prior collect information for a second old record of a prior occurrence of a calling number and canceling said collect call to the recipient if said prior collect information in said old record and said prior collect information in said second old record exceeds a threshold.\n34. The method of claim 1, further comprising the step of rejecting collect calls to a selected set of telephone numbers.\n35. The method of claim 1, further comprising the step of transferring said collect call to an operator if said prior collect call information in said old record exceeds said predetermined threshold.\n36. A system for detecting and preventing the fraudulent use of phone services in which a recipient of a telephone call is responsible for charges only after the recipient agrees to accept the charges for the telephone call, commonly known as a collect call, the method comprising the steps of:\nmeans for detecting an initiation of a collect call, wherein associated with said collect call is a telephone number;\nmeans for searching a database of prior collect call information for an old record of a prior occurrence of said telephone number and, if said old record exists, comparing said prior collect call information in said old record with a predetermined threshold to determine if said collect call is fraudulent;\nmeans for completing said collect call to the recipient if said old record does not exist or said step of comparing determines said collect call is not fraudulent;\nmeans for canceling said collect call to the recipient if said prior collect call information in said old record exceeds said predetermined threshold; and\nmeans for creating at least one record within said database when said collect call is rejected by the recipient upon completion of said collect call.\n37. A method for detecting and preventing the fraudulent use of phone services in which a recipient of a telephone call is responsible for charges only after the recipient agrees to accept the charges for the telephone call, commonly known as a collect call, the method comprising the steps of:\ndetecting an initiation of a collect call, wherein associated with said collect call is a telephone number;\nsearching a database of prior collect call information for an old record of a prior occurrence of said telephone number and, if said old record exists, comparing, before completion of said collect call, said prior collect call information in said old record with a predetermined threshold to determine if said collect call is fraudulent;\nupdating said prior collect call information for said collect call in said old record, if said step of searching finds an old record of said prior occurrence of said telephone number, and said step of comparing does not determine the collect call to be fraudulent, and the charges for said collect call are not accepted by the recipient; and\ncompleting said collect call to the recipient if said old record does not exist or said step of comparing determines said collect call is not fraudulent.\n38. The method of claim 37, further comprising canceling said collect call to the recipient if said prior collect call information in said old record exceeds said predetermined threshold.\n39. The method of claim 38, further comprising the step of creating a new record of an occurrence of said telephone number in said database if the recipient does not accept the charges for said collect call and said step of searching does not find a record of a prior occurrence of said telephone number.\n40. The method of claim 37, further comprising the steps of searching said database of prior collect information for a second old record of a prior occurrence of a calling number and canceling said collect call to the recipient if said prior collect information in said old record and said prior collect information in said second old record exceeds a threshold.\n41. The method of claim 37, wherein said telephone number is the telephone number of the recipient of said collect call.\n42. The method of claim 37, wherein said step of detecting is performed by a telephone switching network, wherein said telephone switching network routes said collect call to a call center.\n43. The method of claim 37, further comprising deleting information from said database prior to a predetermined date.\n44. The method of claim 37, further comprising the step of rejecting collect calls to a selected set of telephone numbers.\n45. The method of claim 37, further comprising the step of transferring said collect call to an operator if said prior collect call information in said old record exceeds said predetermined threshold.\n46. A method for detecting and preventing the fraudulent use of phone services in which a recipient of a telephone call is responsible for charges only after the recipient agrees to accept the charges for the telephone call, commonly known as a collect call, the method comprising the steps of:\ndetecting an initiation of a collect call, wherein associated with said collect call is a telephone number;\nsearching a database of prior collect call information for an old record of a prior occurrence of said telephone number and, if said old record exists, comparing, before completion of said collect call, said prior collect call information in said old record with a predetermined threshold to determine if said collect call is fraudulent;\ncompleting said collect call to the recipient if said old record does not exist or said step of comparing determines said collect call is not fraudulent; and\ncreating at least one record within said database when said collect call is rejected by the recipient upon completion of said collect call.\n47. The method of claim 46, further comprising canceling said collect call to the recipient if said prior collect call information in said old record exceeds said predetermined threshold.\n48. The method of claim 46, further comprising updating said database if said collect call is rejected by the recipient upon completion of said collect call.\n49. The method of claim 46, further comprising the steps of searching said database of prior collect information for a second old record of a prior occurrence of a calling number and canceling said collect call to the recipient if said prior collect information in said old record and said prior collect information in said second old record exceeds a threshold.\n50. The method of claim 46, wherein said telephone number is the telephone number of the recipient of said collect call.\n51. The method of claim 46, wherein said step of detecting is performed by a telephone switching network, wherein said telephone switching network routes said collect call to a call center.\n52. The method of claim 46, further comprising deleting information from said database prior to a predetermined date.\n53. The method of claim 46, further comprising the step of rejecting collect calls to a selected set of telephone numbers.\n54. The method of claim 46, further comprising the step of transferring said collect call to an operator if said prior collect call information in said old record exceeds said predetermined threshold.\n55. A method for detecting and preventing the fraudulent use of phone services in which a recipient of a telephone call is responsible for charges only after the recipient agrees to accept the charges for the telephone call, commonly known as a collect call, the method comprising the steps of:\ndetecting an initiation of a collect call, wherein associated with said collect call is a telephone number;\nsearching a database of prior collect call information for an old record of a prior occurrence of said telephone number and, if said old record exists, comparing, before completion of said collect call, said prior collect call information in said old record with a predetermined threshold to determine if said collect call is fraudulent; and\nsearching said database of prior collect information for a second old record of a prior occurrence of a calling number and canceling said collect call to the recipient if said prior collect information in said old record and said prior collect information in said second old record exceeds a threshold.\n56. The system of claim 36, wherein said telephone number is the telephone number of the recipient of said collect call.\n57. The system of claim 36, further comprising means for deleting information from said database prior to a predetermined date.\n58. The system of claim 36, further comprising means for rejecting collect calls to a selected set of telephone numbers.\n59. The system of claim 36, wherein said means for canceling includes means for transferring said collect call to an operator if said prior collect call information in said old record exceeds said predetermined threshold.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4756020A",
        "US4935956A",
        "EP0618713A2",
        "EP0653868A2",
        "US5463681A",
        "US5465293A",
        "WO1996008907A2",
        "US5524145A",
        "US5566234A",
        "US5596632A",
        "US5602906A",
        "US5615251A",
        "US5627886A",
        "US5627887A",
        "US5719927A",
        "US5754632A",
        "US5768354A",
        "US5787150A",
        "US5790645A",
        "US5805686A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "WO2001091429A1",
        "US6327352B1",
        "WO2002025923A1",
        "US6519332B1",
        "EP1393536A1",
        "US20040102180A1",
        "US20040203575A1",
        "EP1473919A1",
        "US20050185779A1",
        "US6947532B1",
        "US20060121881A1",
        "EP1473920B1",
        "US7327837B1",
        "US20090046841A1",
        "US20090304166A1",
        "US20130029645A1",
        "US9014355B2",
        "US9143610B2",
        "US9876900B2",
        "US10104710B1",
        "US10333870B2"
    ],
    "citedby_ftf": [
        "US6376246B1",
        "US6264336B1",
        "US6590711B1",
        "EP1107168A1"
    ]
}