{
    "patent_link": "https://patents.google.com/patent/US20020112249A1/en",
    "patent_id": "US20020112249A1",
    "title": "Method and apparatus for targeting of interactive virtual objects",
    "abstract": "A method and an apparatus are used to target interactive virtual objects to subscribers in a television delivery system. Programs are selected and virtual object locations are defined in the selected programs. The virtual objects available for targeting are categorized and the categories are correlated to subscriber information to determine the optimum targeting of the virtual objects. The virtual objects may be targeted based on individual subscriber information or on information related to groups of subscribers. When a frame of a program includes a virtual object location, a default or an alternate virtual object is displayed. The virtual object location may change over space or time. The virtual object maybe interactive, and maybe used to link a subscriber to a remote location, such as an Internet web site. An operations center or a cable headend may generate a group assignment plan that assigns the subscribers' television terminals to groups, based on factors such as area of dominant influence and household income. A retrieval plan is then generated that instructs the television terminals to select the desired virtual object for display. The television terminals record which virtual objects were displayed, and report this information to the cable headends and the operations center. The reported information is used to generate billing for commercial advertisers, and to analyze viewer watching habits. Interactive virtual objects are received by the television terminal with directions on actions to be taken upon selection of the interactive virtual object. Actions may result in the initiation of processes locally at the television terminal, or communication with a remote site for the initiation of processes to be performed remotely. The invention uses upstream data reception hardware, databases and processing hardware and software, and corresponding features in the televisions to accomplish these functions.",
    "inventors": [
        "John Hendricks",
        "Alfred Bonned",
        "John Mccoskey",
        "Michael Asmussen"
    ],
    "assignee": "Comcast IP Holdings I LLC",
    "classifications": [
        "H04H20/10",
        "H04H20/38",
        "H04H20/93",
        "H04H60/33",
        "H04H60/64",
        "H04N21/2221",
        "H04N21/234318",
        "H04N21/235",
        "H04N21/23608",
        "H04N21/2362",
        "H04N21/2381",
        "H04N21/2389",
        "H04N21/2543",
        "H04N21/258",
        "H04N21/25883",
        "H04N21/25891",
        "H04N21/262",
        "H04N21/26208",
        "H04N21/2668",
        "H04N21/42204",
        "H04N21/42653",
        "H04N21/42684",
        "H04N21/4312",
        "H04N21/4314",
        "H04N21/4316",
        "H04N21/4331",
        "H04N21/4344",
        "H04N21/4345",
        "H04N21/435",
        "H04N21/4383",
        "H04N21/4385",
        "H04N21/44224",
        "H04N21/443",
        "H04N21/4532",
        "H04N21/454",
        "H04N21/458",
        "H04N21/4622",
        "H04N21/47",
        "H04N21/472",
        "H04N21/47214",
        "H04N21/4725",
        "H04N21/4755",
        "H04N21/4786",
        "H04N21/4788",
        "H04N21/482",
        "H04N21/6405",
        "H04N21/64307",
        "H04N21/6543",
        "H04N21/6547",
        "H04N21/812",
        "H04N21/8146",
        "H04N21/8583",
        "H04N21/8586",
        "H04N5/44504",
        "H04N5/602",
        "H04N7/088",
        "H04N7/0884",
        "H04N7/0887",
        "H04N7/10",
        "H04N7/102",
        "H04N7/163",
        "H04N7/165",
        "H04N7/173",
        "H04N7/17318",
        "H04N7/17336",
        "H04N7/17354",
        "H04M1/57",
        "H04N21/426",
        "H04N21/478",
        "H04N5/445",
        "H04N5/45"
    ],
    "claims": "\n1. A method for targeting interactive virtual advertisements, comprising:\nassigning at least one interactive spot to a program;\nassigning one or more interactive virtual objects to the at least one virtual advertisement spot;\ngenerating a retrieval plan; and\nproviding the retrieval plan to a terminal, wherein the retrieval plan instructs the terminals to select one of the one or more virtual objects.\n2. The method of claim 1, wherein generating the retrieval plan comprises:\nassigning the terminal to one or more groups;\ndesignating a unique group mask for one or more of the groups; and\nassigning one or more of the groups to one of the interactive virtual objects, wherein the group mask indicates whether the terminal displays a particular interactive object.\n3. The method of claim 2, wherein the step of assigning the terminal to one or more groups comprises:\ngenerating group assignment rules;\ndelivering group assignment rules to the terminal;\nstoring the group assignment rules at the terminal; and\ndetermining one or more group assignments based on the group assignment rules and data related to the terminal.\n4. The method of claim 3, wherein the data related to the terminal includes one or more of Area of Dominant Influence (ADI), zip code+4, demographic data and programs watched data, virtual objects viewed, on-screen questionnaires and characteristics imported from marketing databases, the group assignments being updated to reflect changes in the ADI, zip code+4, demographic data, programs watched data, virtual objects viewed, on-screen questionnaires, and characteristics imported from marketing databases.\n5. The method of claim 1, wherein the retrieval plan is sent periodically to the terminal, and wherein the group assignment risks are periodically sent to terminal.\n6. A method of targeting interactive virtual objects, comprising:\nproviding a program containing one or more interactive virtual object locations;\nproviding interactive virtual objects for one or more of the interactive virtual object locations;\nproviding at least one alternate interactive virtual object for at least one of the one or more interactive virtual object locations; and\ngenerating a retrieval plan at a user's terminal, wherein the retrieval plan designates which of the one or more interactive object locations displays an alternate interactive virtual object.\n7. The method of claim 6, wherein the program is a television program.\n8. The method of claim 6, wherein the program is one of an advertisement, an electronic program guide, and an Internet web page.\n9. The method of claim 6, wherein at least one of the interactive virtual object locations is fixed in position across frames of the program.\n10. The method of claim 6, wherein at least one of the interactive virtual object locations moves spatially in the program with time.\n11. The method of claim 6, further comprising providing at least one non-interactive virtual object.\n12. The method of claim 6, wherein the program is broadcast to the terminal, further comprising:\ncreating categories of interactive virtual objects and content;\ndefining group categories;\nfor one or more defined group categories, defining at least one group;\nassigning one or more television terminals, for the one or more group, to the at least one group;\ncreating a group assignment matrix based on the categories of the interactive virtual objects, the group categories and the group assignment;\nstoring the group assignment matrix in the terminal; and\ncomparing the retrieval plan to the group assignment matrix to determine interactive virtual objects to display in the one or more interactive virtual object locations.\n13. The method of claim 12, wherein generating the retrieval plan, comprises:\nassigning the interactive virtual objects to the one or more interactive virtual object locations;\nassigning the alternate interactive virtual objects to at least one of the one or more interactive virtual object locations;\nassigning a group to one or more of the interactive virtual objects and the alternate interactive virtual objects;\ncreating a group mask assignment, wherein the group mask assignment is used by the terminal to compare the retrieval plan to the group assignment matrix.\n14. The method of claim 13, wherein assigning the group to each of the default interactive virtual objects and the alternate interactive virtual objects, comprises:\nranking one or more of programs based on categories of targeted interactive virtual objects and a first percentage of total viewers who view one or more of the programs;\nranking of targeted interactive virtual objects based on a second percentage of total viewers;\ndetermining, for the one or more ranked programs and the targeting categories, targeted interactive virtual objects with overall highest rankings, based on the first and the second percentages;\nassigning targeted interactive virtual objects with the overall highest rankings to be displayed as the interactive virtual objects; and\nassigning targeted virtual objects with lower overall rankings to be displayed as the alternate interactive virtual objects.\n15. The method of claim 13, wherein groups are defined based on characteristics of users.\n16. The method of claim 15, wherein the characteristics include user demographic information.\n17. The method of claim 15, wherein the characteristics include user entered information.\n18. The method of claim 15, wherein the characteristics include programs watched data.\n19. The method of claim 15, wherein the characteristics include interactive virtual objects watched data.\n20. The method of claim 15, wherein the characteristics include user activation of the interactive virtual objects.\n21. The method of claim 12, wherein the terminal is a television set top terminal.\n22. The method of claim 12, wherein the terminal is incorporated into one of a television, a personal computer and a PDA with video viewing capabilities.\n23. The method of claim 12, wherein the television terminal is coupled to a satellite television receiver.\n24. The method of claim 12, further comprising:\nat the terminal, recording in a memory an identification of a virtual object displayed in a virtual object location;\nproviding the identification to a remote site; and\ndeleting the identification from the memory.\n25. The method of claim 12, wherein the retrieval plan is provided with the transmission of the program and periodically to the terminal, the terminal storing the retrieval plan in a memory.\n26. A method of targeting interactive virtual objects to terminals, comprising:\ncreating a package of targeted interactive virtual objects;\nproviding the package to one or more of the terminals;\ngenerating a group assignment matrix, wherein the group assignment matrix assigns terminals to groups;\ngenerating a retrieval plan;\nstoring the retrieval plan at one or more of the terminals; and\nproviding a program to one or more of the terminals, the program including at least one interactive virtual object location, wherein the retrieval plan designates interactive virtual objects to be displayed during a display of the program.\n27. The method of claim 26, further comprising at one or more of the terminals receiving the program, retrieving one of the targeted virtual objects for display in the at least one virtual object location.\n28. The method of claim 27, wherein the retrieval step, comprises:\ncomparing the group assignment matrix to the retrieval plan; and\nselecting an interactive virtual object for display based on the comparison.\n29. The method of claim 26, wherein one or more of at least one virtual object location contains an interactive virtual object, further comprising:\nreceiving a selection of the interactive virtual object; and\nlinking a terminal selecting the interactive virtual object to an alternate program.\n30. The method of claim 29, wherein the alternative program comprises an Internet web site.\n31. The method of claim 26, wherein the step of generating the group assignment matrix, comprises:\ngenerating group assignment rules;\ndelivering group assignment rules to terminal; and\ndetermining one or more group assignments at one or more of the terminals based on the group assignment rules and individual terminal data and terminal group data.\n32. The method of claim 31, wherein the individual terminal data, comprises one or more of viewer demographic data, programs watched data, virtual objects viewed data, on-screen questionnaires, and characteristics imported from marketing databases, and wherein the terminal group data, comprises one or more ADI, zip code, and geographical data.\n33. The method of claim 31, wherein the group assignment rules are stored in one or more of the terminals.\n34. A terminal for targeting interactive virtual objects, comprising:\na connector that receives the interactive virtual objects and interactive virtual object locations and metadata;\nan interactive virtual objects extractor coupled to the connector that extracts the interactive virtual objects, the locations and the metadata;\na storage processor coupled to the extractor that determines which of the extracted interactive virtual objects are targeted to the terminal and saves the targeted interactive virtual objects in a memory; and\nan interactive virtual object selector processor coupled to the storage processor that determines an interactive virtual object placement for one or more stored interactive virtual objects.\n35. The terminal of claim 34, wherein the interactive virtual objects are received with programming content, and wherein the extractor extracts the interactive virtual objects from the programming content.\n36. The terminal of claim 34, wherein the interactive virtual objects are received independently of programming content.\n37. The terminal of claim 36, wherein the interactive virtual objects are received over the Internet.\n38. The terminal of claim 34, wherein the terminal is a terminal in a television program delivery system.\n39. The terminal of claim 38, wherein the terminal is a set top terminal.\n40. The terminal of claim 38, wherein the terminal is a television.\n41. The terminal of claim 34, wherein the terminal is one of a personal computer, a personal data assistant, and a wireless telephone.\n42. The terminal of claim 34, further comprising a placement log coupled to the selector processor that logs the placement of an interactive virtual object and further logs an interactive response to the interactive virtual object, wherein the placement and the response are stored in the memory, and wherein the selector processor uses the placement and the response in determining placements of future interactive virtual objects.\n43. A system for targeting interactive virtual objects, comprising:\nan interactive virtual object insertion center that defines interactive virtual object locations in program content for insertion of interactive virtual objects, the insertion center, comprising:\nan interactive virtual object location definer,\nan interactive virtual object selector coupled to the definer, and\nan interactive virtual object manager coupled to the definer and the selector; and\na terminal, coupled to the insertion center, that receives interactive virtual objects and the program content having interactive virtual object locations, wherein the terminal, comprises:\na location processor that detects interactive virtual object locations in the program content;\na selector processor that determines which of the received interactive virtual objects are to be placed in allowable content locations for the interactive virtual objects, and\nan interactive virtual object trigger processor that receives and processes an interactive selection.\n44. The system of claim 43, wherein the processed interactive selection is received at the insertion center, and wherein the received selection triggers a response that is sent to the terminal.\n45. The system of claim 43, wherein the processed interactive selections are retained at the terminal, wherein the received selection triggers a response that is generated at the terminal.\n46. The system of claim 43, wherein the interactive virtual objects are delivered to the terminal by one of a cable television system, a wireless broadcast system, a satellite broadcast system, a wired data network, a wireless PCS network, and a terrestrial television broadcast network.\n47. The system of claim 43, further comprising an interactive virtual object retrieval plan, wherein the interactive virtual objects and the retrieval plan are delivered from an interactive virtual object delivery system.\n48. The system of claim 43, further comprising an interactive virtual object retrieval plan, wherein the interactive virtual objects and the retrieval plan are delivered from the insertion center.\n49. The system of claim 48, further comprising replacement interactive virtual objects and a replacement interactive virtual object retrieval plan, wherein the replacement interactive virtual objects and the replacement retrieval plan are delivered from the local insertion center.\n50. The system of claim 43, wherein an interactive virtual object, comprises:\nan interactive virtual object identifier;\ninteractive virtual object placement rules, wherein the rules provide guidance to the terminal in managing insertion of interactive virtual objects into the program content;\nan interactive virtual object digital module, wherein the module comprises a digital file of the interactive virtual object; and\nan interactive virtual object trigger action that defines an action to be taken upon triggering of the virtual object at the terminal.\n51. The system of claim 50, wherein the interactive virtual object further comprises a virtual object applet that provides software capable of initiation by a source external to the terminal.\n52. The system of claim 50, wherein the interactive virtual object trigger action initiates an interactive request to a location external to the terminal.\n53. The system of claim 52, wherein the location external to the system further comprises:\nan interactive virtual object management center; and\nan interactive virtual object servicing center coupled to the interactive virtual object management center, wherein the management center provides interactive virtual object response management guidelines to the servicing center, and wherein the guidelines determine an appropriate response based on receipt of an interactive request from the terminal.\n54. The system of claim 43, wherein the terminal further comprises:\nan interactive virtual object extractor that extracts interactive virtual objects from data received at the terminal;\nan interactive virtual object location detector processor, coupled to the extractor, that determines the allowable content locations for the interactive virtual objects; and\nan interactive virtual object insertion processor, coupled to the selector processor, that inserts the selected interactive virtual objects into the allowable content locations.\n55. The system of claim 54, wherein the terminal further comprises a storage management processor coupled to the extractor, wherein the management processor uses an interactive virtual object retrieval plan to determine which received interactive virtual objects are to be stored at the terminal.\n56. The system of claim 43, wherein the interactive virtual objects are selectable by a user at the terminal.\n57. The system of claim 43, wherein the interactive selection is processed automatically by the terminal.\n58. The system of claim 43, wherein the terminal further comprises a virtual object placement log, wherein when a virtual object is placed in a virtual object location, the selector processor records the event in the virtual object placement log.\n59. A method of targeting interactive virtual objects to terminals, comprising:\ncreating a package of targeted interactive virtual objects;\nproviding the package to one or more of the terminals;\ngenerating a group assignment matrix, wherein the group assignment matrix assigns terminals to groups;\ngenerating a retrieval plan; and\nproviding a program to one or more of the terminals, the program including at least one interactive virtual object location, wherein the retrieval plan designates interactive virtual objects to be displayed during a display of the program.\n60. The method of claim 59, wherein one or more virtual objects include triggers that initiate a signal from the terminal, the method further comprising:\nreceiving a trigger;\nretrieving an interactive virtual object trigger action in response to receipt of the trigger; and\ndetermining if the interactive virtual object trigger action requires initiation of an interactive request.\n61. The method of claim 60, wherein the interactive virtual object trigger action requires initiation of the interactive request, the method further comprising:\nsending the interactive request;\nawaiting an interactive response; and\ninitiating an interactive action based on the interactive response.\n62. The method of claim 60, wherein the interactive virtual object trigger action does not require initiation of the interactive request, the method further comprising initiating processing required by the interactive virtual object trigger action.\n63. The method of claim 59, wherein one or more of at least one virtual object location contains an interactive virtual object, further comprising:\nreceiving a selection of the interactive virtual object; and\nlinking a terminal selecting the interactive virtual object to an alternate program.\n64. The method of claim 63, wherein the alternative program comprises an Internet web site.",
    "status": "Active",
    "citations_own": [
        "US4331974A",
        "US4641205A",
        "US4706121A",
        "US4896354A",
        "US4930160A",
        "US5003591A",
        "US5142690A",
        "US5155591A",
        "US5270809A",
        "US5283639A",
        "US5303361A",
        "US5317391A",
        "US5361091A",
        "US5374951A",
        "US5446490A",
        "US5467402A",
        "US5515098A",
        "US5550863A",
        "US5588104A",
        "US5588139A",
        "US5600364A",
        "US5621456A",
        "US5636346A",
        "US5635989A",
        "US5715315A",
        "US5721956A",
        "US5724521A",
        "US5727065A",
        "US5729471A",
        "US5737533A",
        "US5745710A",
        "US5754938A",
        "US5774122A",
        "US5818511A",
        "US5819301A",
        "US5844890A",
        "US5848396A",
        "US5917537A",
        "US5929849A",
        "US6119154A",
        "US6144944A",
        "US6177931B1",
        "US6201536B1",
        "US20010013123A1",
        "US6279112B1",
        "US6282713B1",
        "US6331877B1",
        "US20020056129A1",
        "US6446261B1",
        "US6463468B1",
        "US6493872B1",
        "US6530082B1",
        "US6698020B1",
        "US20040261127A1",
        "US6973436B1"
    ],
    "citations_ftf": [
        "US808695A",
        "US4319266A",
        "ATE56549T1",
        "JP2829958B2",
        "FR2661061B1",
        "US5233423A",
        "US5249039A",
        "DE69328640T2",
        "US6463585B1",
        "US7168084B1",
        "US5798785A",
        "US5389964A",
        "US5903317A",
        "US5441998A",
        "CA2121151A1",
        "US5627915A",
        "US5892554A",
        "US5953076A",
        "JPH09227193A",
        "IL122194A0",
        "US6006236A",
        "US20010011238A1",
        "GB9822022D0",
        "WO2001024083A2",
        "DE10010907A1",
        "AR027760A1"
    ],
    "citedby_own": [
        "US20040031062A1",
        "US20040030994A1",
        "EP1443768A1",
        "US20040194123A1",
        "US20040194127A1",
        "US20040194128A1",
        "US20040201617A1",
        "US20040243570A1",
        "US20040244029A1",
        "US20040243527A1",
        "US20040243604A1",
        "US20050114212A1",
        "US20050160469A1",
        "EP1570661A1",
        "US20050229227A1",
        "US20060015906A1",
        "US20060125962A1",
        "WO2006075301A1",
        "EP1763195A1",
        "US20070074265A1",
        "US20070104348A1",
        "US20070154190A1",
        "US20070214476A1",
        "US20070226761A1",
        "EP1865455A1",
        "US20080015932A1",
        "US20080027953A1",
        "US20080068507A1",
        "US20080074424A1",
        "US20080094417A1",
        "WO2008060140A1",
        "US7392312B1",
        "US20080226517A1",
        "WO2008110152A1",
        "US20080231751A1",
        "WO2007103883A3",
        "US20080319656A1",
        "US20090063569A1",
        "US20090094637A1",
        "US20090143881A1",
        "US20090165047A1",
        "US20090172763A1",
        "WO2009101623A2",
        "WO2009144464A1",
        "US20100050211A1",
        "US20100050064A1",
        "US20100058381A1",
        "US20100064248A1",
        "US20100122162A1",
        "US20100134692A1",
        "US20100138873A1",
        "EP2194707A1",
        "US7743330B1",
        "US20100162303A1",
        "US20100177122A1",
        "US20100211969A1",
        "WO2010141939A1",
        "US7895076B2",
        "US7908467B2",
        "US20110063415A1",
        "US7912961B2",
        "US7921136B1",
        "US20110106879A1",
        "US20110141359A1",
        "US20110170747A1",
        "US8006263B2",
        "US8010979B2",
        "US20110216179A1",
        "US20110249616A1",
        "US8171411B1",
        "US20120227065A1",
        "US8272011B2",
        "US8267783B2",
        "US20120266189A1",
        "US20120290987A1",
        "US20130014155A1",
        "CN103004226A",
        "US8416247B2",
        "US8453174B2",
        "US8468563B1",
        "US20130191745A1",
        "US8528032B2",
        "US20130278636A1",
        "US8615782B2",
        "US8626584B2",
        "US8645992B2",
        "US8676900B2",
        "US20140129342A1",
        "US8763157B2",
        "US8761584B2",
        "US8762492B2",
        "US8763090B2",
        "US8769558B2",
        "US8776125B2",
        "US8793738B2",
        "US8806533B1",
        "US8806536B2",
        "US8832742B2",
        "US8892495B2",
        "US8904441B2",
        "US8949871B2",
        "US8988609B2",
        "EP2483858A4",
        "US9071872B2",
        "US9075861B2",
        "US9113207B2",
        "US9113107B2",
        "US9118958B2",
        "US9125169B2",
        "US9166714B2",
        "US9177225B1",
        "US9191722B2",
        "US9197943B2",
        "US20160014478A1",
        "US9288521B2",
        "US9294799B2",
        "US9319735B2",
        "US9326025B2",
        "US9330723B2",
        "US9332302B2",
        "US20160205445A1",
        "US20160234568A1",
        "US9426539B2",
        "US9426509B2",
        "US9438947B2",
        "US9535563B2",
        "US20170062016A1",
        "US20170094323A1",
        "US9716918B1",
        "US9736524B2",
        "US9749693B2",
        "US9838742B2",
        "US9864998B2",
        "US9873052B2",
        "US9934819B2",
        "US10055768B2",
        "US10063934B2",
        "US20180302685A1",
        "WO2018200986A1",
        "US10226705B2",
        "US10279253B2",
        "US10343071B2",
        "US10410474B2",
        "US10419817B2",
        "US10455258B2",
        "US10455257B1",
        "US10546318B2",
        "US10555051B2",
        "US10556183B2",
        "US10653955B2",
        "US10657538B2",
        "US10657380B2",
        "US10721543B2",
        "US10741216B2",
        "US10828571B2",
        "US10846779B2",
        "US10860987B2",
        "US10931991B2",
        "US10933319B2",
        "US10943255B1",
        "US11004089B2",
        "US11074308B2",
        "US11082746B2",
        "US11148050B2",
        "US11227315B2",
        "US11308765B2",
        "US11336519B1",
        "US20220203240A1",
        "US11507977B2",
        "US11551529B2",
        "US11594197B2",
        "US11729252B2",
        "US11825168B2"
    ],
    "citedby_ftf": [
        "US7168084B1",
        "AU2002327677A1",
        "US8413205B2",
        "US8042132B2",
        "US11388451B2",
        "US8707354B1",
        "US7703116B1",
        "US7818764B2",
        "US8352983B1",
        "US11070890B2",
        "US8220018B2",
        "US8578411B1",
        "US10664138B2",
        "US11381875B2",
        "US8416952B1",
        "US8214256B2",
        "US8819734B2",
        "FR2864407B1",
        "US8346157B1",
        "US7774275B2",
        "US20060178218A1",
        "US20060190282A1",
        "US20060190284A1",
        "US20060229976A1",
        "US20090100354A1",
        "US7958047B2",
        "US20070136185A1",
        "US20060195376A1",
        "US20060178966A1",
        "US20090144132A1",
        "US20090132297A1",
        "US20090138355A1",
        "US20090037364A1",
        "US20070156509A1",
        "US20090099930A1",
        "US20090018910A1",
        "US20070073582A1",
        "US20070036328A1",
        "US20060195378A1",
        "US20070174183A1",
        "US20090043683A1",
        "US20070198305A1",
        "US20080215434A1",
        "US7720687B2",
        "US20080109338A1",
        "US20070118420A1",
        "US20070150986A1",
        "US20070035548A1",
        "US20070038559A1",
        "US20060178180A1",
        "US20070112660A1",
        "US20090144148A1",
        "US20090138333A1",
        "US20070203828A1",
        "US20090070180A1",
        "US20060224505A1",
        "US20070035549A1",
        "US20070268299A1",
        "US20070024613A1",
        "US20060195377A1",
        "US20070124239A1",
        "US20080270165A1",
        "US20060178967A1",
        "US20080228607A1",
        "US20080133392A1",
        "US20070013691A1",
        "US20070078737A1",
        "US7818667B2",
        "US8595760B1",
        "US20080249943A1",
        "US8892471B2",
        "US8091103B2",
        "WO2009137368A2",
        "US8752087B2",
        "US8122468B2",
        "US8564621B2",
        "US20120144417A1",
        "US9116607B2",
        "US9112623B2",
        "US8949857B2",
        "CN107274206A",
        "US10789631B2",
        "US9607330B2",
        "US11115722B2",
        "US9237367B2",
        "US9553927B2",
        "US10880609B2",
        "EP3044703A4",
        "WO2015048375A1",
        "EP3050017A4",
        "US11783382B2",
        "US10296940B2",
        "US20220255649A1"
    ]
}