{
    "patent_link": "https://patents.google.com/patent/US5860917A/en",
    "patent_id": "US5860917A",
    "title": "Method and apparatus for predicting therapeutic outcomes",
    "abstract": "Methods, software, and systems for evaluating the response of a patient afflicted with a disease to a therapeutic regimen for the disease are described. In one aspect, the present methods, systems, and software are provided for evaluating the utility of a treatment regimen for treating a patient afflicted with a disease. In one embodiment of this aspect, the value of at least one diagnostic variable relating to a statistical model describing the utility of the treatment regimen is determined. The statistical model is derived using a robustified similarity metric least squares (SMILES) analysis of the response to the treatment regimen which has been adapted to include discriminant and logistical analysis. The value of the diagnostic variable is then applied to the model to provide an estimated utility of the treatment regimen in treating the patient. Using the methods, software, and apparatus described herein, robust, statistically significant models of patient responsiveness that reduce the problems associated with present treatment response prediction methods that are brittle and oversimplify the complex interactions among treatment variables can assist patients and clinicians in determining therapies.",
    "inventors": [
        "Lorraine Comanor",
        "James M. Minor"
    ],
    "assignee": "Novartis Vaccines and Diagnostics Inc",
    "classifications": [
        "A61B5/4833",
        "G16H20/00",
        "G16H50/50",
        "G16Z99/00",
        "Y02A90/10",
        "Y10S128/923",
        "Y10S128/924"
    ],
    "claims": "\n1. A method for evaluating the utility of a treatment regimen for treating a disease for the application of such treatment to a patient having such disease, the method comprising the steps of:\na) determining at least one diagnostic variable relating to a statistical model describing the utility of said treatment regimen, said statistical model being derived by the steps of\ni) developing a discriminant function which is effective for classifying the response of individuals afflicted with said disease to said treatment regimen, said discriminant function being based at least in part on a data set including clinical profiles of individual patients who have been treated for said disease using said treatment regimen, said clinical profiles of individual patients including said diagnostic variable; and\nii) performing a logistic regression using said discriminant function to assign thereby a probability of treatment outcome for said individuals; and\nb) applying said diagnostic variable to said statistical model to obtain an estimate of the utility of said treatment regimen for the treatment of said disease in said patient.\n2. The method of claim 1, wherein said estimate comprises a projected likely treatment outcome score.\n3. The method of claim 2, further including the step of treating said patient for said disease in accordance with said determination of the utility of said treatment regimen.\n4. The method of claim 3, wherein said treatment outcome score comprises a value selected from a set of values that form a treatment outcome scale, said treatment outcome scale including a likely success region, a likely failure region, and an intermediate region.\n5. The method of claim 3, wherein said discriminant function comprises a polynomial function.\n6. The method of claim 3, wherein said discriminant function is developed using a similarity-metric least squares (SMILES) analysis of said data set.\n7. The method of claim 6, wherein said derivation of said statistical model includes the additional step of performing a prospective prediction using said data set.\n8. The method of claim 7, wherein said disease is selected from the group consisting of AIDS, HBV, and HCV.\n9. The method of claim 8, wherein said disease is HBV.\n10. A method for producing a statistical model of a likely response to a treatment regimen for treating a disease in a mammal, the method comprising the steps of:\na) obtaining at least one sample population of individuals representative of said disease, said sample population being treated for said disease using said treatment regimen for treating said disease;\nb) determining from said sample population a set of data for at least one variable relating to said population, said disease, or said regimen, said variable having a putative correlation with said regimen for treating said disease;\nc) deriving from said set of data said statistical model of said likely response to said regimen for treating said disease, wherein said step of deriving includes the sub-steps of:\ni) standardizing said data;\nii) developing a discriminant function which is effective for classifying the response of individuals afflicted with said disease to said treatment regimen, said discriminant function being based at least in part on clinical profiles of individual patients who have been treated for said disease using said treatment regimen, said clinical profiles of individual patients including said diagnostic variable; and\niii) performing a logistic regression using said discriminant function to assign thereby a probability of treatment outcome for said individuals.\n11. The method of claim 10, wherein said sub-step of standardizing said data includes the sub-steps of:\na) determining the mean and the standard deviation for said set of data;\nb) subtracting said mean from said data; and\nc) dividing the result of sub-step b) by said standard deviation to produce thereby a set of normalized data.\n12. The method of claim 11, further including the step of performing an outlier analysis of said set of normalized data.\n13. The method of claim 10, wherein said discriminant function includes a polynomial function.\n14. The method of claim 10, wherein said discriminant function is derived from a similarity-metric least squares (SMILES) analysis of said data set.\n15. The method of claim 14, wherein\na) said SMILES analysis includes the sub-steps of:\ni) defining a set of patient vectors which includes said data;\nii) defining a node from said set of patient vectors;\niii) determining a distance from each of said patient vectors to each of said nodes to derive thereby a set of distances;\niv) determining a set of similarity values using said set of distances;\nv) regressing on said set of similarity values to obtain thereby a set of predicted outcome values and a set of weighting coefficients; and\nvi) regressing on said set of predicted outcome values and set of weighting coefficients to provide thereby said robustified model; and\nb) said method further includes the steps of\ni) robustifying said statistical model; and\nii) performing a prospective prediction with said statistical model using said data set.\n16. The method of claim 15, wherein said step of robustifying includes performing a Ridge regression on said set of predicted outcome values and said set of weighting coefficients.\n17. The method of claim 15, wherein said set of similarity values are derived from a monotonic, decreasing function.\n18. The method of claim 17, wherein said monotonic, decreasing function has the mathematical form: ##EQU21## where Dij is the distance from the ith data point to the jth node and ε is a parameter.\n19. The method of claim 17, wherein said monotonic, decreasing function has the mathematical form:\nf(D.sub.ij)=βe.sup.-αD.sbsp.ij.spsp.2 +γ\nwhere Dij is the distance from the ith data point to the jth node and α, β, and γ are parameters.\n20. The method of claim 17, wherein said monotonic, decreasing function has the mathematical form: ##EQU22## where Dij is the distance from the ith data point to the jth node and α, β, and γ are parameters.\n21. The method of claim 20, wherein α is chosen such that the square of the standard deviation of said data is about 1.5n, where n is the number of variables in said statistical model.\n22. A method for optimizing testing schedules for determining the efficacy of a regimen for treating a disease in a mammal, the method comprising the steps of evaluating a statistical model describing said treatment regimen for at least two time periods, said statistical model being derived using the method of claim 10 to determine thereby said optimal testing schedule for determining the efficacy of said method.\n23. The method of claim 22, wherein said disease is selected independently from the group selected independently from the group consisting of AIDS, HBV, and HCV.\n24. The method of claim 23, wherein said disease is HBV.\n25. The method of claim 24, wherein said statistical model is derived using a SMILES analysis of said data set.\n26. A computer system for producing a statistical model of a regimen for treating a disease in a mammal using a set of data derived from at least one sample population of individuals representative of said disease, said sample population being treated for said disease using a treatment regimen for treating said disease, the system comprising:\na) a pre-processing mechanism for standardizing said set of data to produce a set of normalized data; and\nb) a processing mechanism for processing said standardized data, said processing mechanism configured to\ni) develop a discriminant function which is effective for classifying the response of individuals afflicted with said disease to said treatment regimen, said discriminant function being based at least in part on clinical profiles of individual patients who have been treated for said disease using said treatment regimen, said clinical profiles of individual patients including said diagnostic variable; and\nii) perform a logistic regression using said discriminant function to assign thereby a probability of treatment outcome for said individuals.\n27. The computer system of claim 26, wherein said pre-processing mechanism for standardizing said data is configured to:\na) determine the mean and the standard deviation for said set of data;\nb) subtract said mean from said data; and\nc) divide the result of sub-step b) by said standard deviation to produce thereby a set of normalized data.\n28. The computer system of claim 27, wherein said pre-processing mechanism is further configured to perform an outlier analysis of said set of normalized data.\n29. The computer system of claim 28, wherein said pre-processing mechanism is further configured to augment said set of normalized data with null data.\n30. The computer system of claim 26, wherein said pre-processing mechanism is further configured to augment said set of normalized data with null data.\n31. The computer system of claim 30, wherein said processing mechanism is configured to perform a similarity-metric least squares (SMILES) analysis including:\na) defining a node for each of said data;\nb) determining a distance from each point of said set of data to each of said nodes to derive thereby a set of distances;\nc) determining a set of similarity values using said set of distances;\nd) regressing on said set of similarity values to obtain thereby a set of predicted outcome values and a set of weighting coefficients; and\ne) regressing on said set of predicted outcome values and set of weighting coefficients to provide thereby said robustified model.\n32. The computer system of claim 31, wherein said processing mechanism is configured to perform a Ridge regression on said set of predicted outcome values and said set of weighting coefficients.\n33. The computer system of claim 32, wherein said set of similarity values are derived from a monotonic, decreasing function.\n34. The computer system of claim 33, wherein said monotonic, decreasing function has the mathematical form: ##EQU23## where Dij is the distance from the ith data point to the jth node and α, β, and γ are parameters.\n35. A computer system for evaluating the utility of a treatment regimen for treating a disease for the application of such treatment to a patient having such disease, said computer system comprising a processor configured to process at least one diagnostic variable obtained from said patient relating to a statistical model describing the utility of said treatment regimen, said statistical model being derived using the method of claim 10, to produce thereby an estimate of the utility of said treatment regimen for the treatment of said disease in said patient.\n36. The computer system of claim 35, wherein said estimate comprises a projected likely treatment outcome score.\n37. The computer system of claim 36, wherein said treatment outcome score comprises a value selected from a set of values that form a treatment outcome scale, said treatment outcome scale including a likely success region, a likely failure region, and an intermediate region.\n38. The computer system of claim 37, wherein said statistical model includes a discriminant function which includes a polynomial function.\n39. The computer system of claim 38, wherein said statistical model includes a discriminant function which is derived from a similarity-metric least squares (SMILES) of said data set.\n40. The computer system of claim 39, wherein said disease is selected from the group consisting of AIDS, HBV, and HCV.\n41. The computer system of claim 40, wherein said disease is HBV.\n42. A computer system for optimizing testing schedules for determining the efficacy of a regimen for treating a disease in a mammal, the computer system comprising a processor configured to evaluate a statistical model describing said treatment regimen for at least two time periods, said statistical model being derived using the method of claim 10, to provide thereby said optimized testing schedule for determining the efficacy of said method.\n43. The computer system of claim 42, wherein said disease is selected independently from the group selected independently from the group consisting of AIDS, HBV, and HCV.\n44. The computer system of claim 43, wherein said disease is HBV.\n45. A computer program product including a computer-readable medium having computer-readable program code devices embodied therein for producing a statistical model of a regimen for treating a disease in a mammal using data obtained from at least one sample population of individuals representative of said disease, said sample population being treated for said disease using said treatment regimen, said program code devices being configured to cause a computer to perform the steps of:\na) standardizing said data to produce standardized data;\nb) processing said standardized data to develop a discriminant function which is effective for classifying the response of said individuals to said treatment regimen, said discriminant function being based at least in part on clinical profiles of individual patients who have been treated for said disease using said treatment regimen, said clinical profiles of individual patients including said diagnostic variable; and\nc) performing a logistic regression using said discriminant function to assign thereby a probability of treatment outcome for said individuals.\n46. The computer program product of claim 45, wherein said program code devices are further configured to cause a computer to perform the sub-steps of:\na) determining the mean and the standard deviation for said set of data;\nb) subtracting said mean from said data; and\nc) dividing the result of sub-step b) by said standard deviation to produce thereby a set of normalized data.\n47. The computer program product of claim 46, wherein said program code devices are further configured to cause a computer to perform an outlier analysis of said set of normalized data.\n48. The computer program product of claim 47, wherein said program code devices are further configured to cause a computer to perform augmenting said set of normalized data with null data.\n49. The computer program product of claim 46, wherein said program code devices are further configured to cause a computer to perform augmenting said set of normalized data with null data.\n50. The computer program product of claim 49, wherein said program code devices are further configured to cause a computer to perform a similarity-metric least squares (SMILES) analysis of said standardized data, said SMILES analysis including the sub-steps of:\na) defining nodes from said data;\nb) determining a distance from each point of said set of data corresponding to an individual who has been treated using said treatment regimen to each of said nodes to derive thereby a set of distances;\nc) determining a set of similarity values using said set of distances;\nd) regressing on said set of similarity values to obtain thereby a set of predicted outcome values and a set of weighting coefficients; and\ne) regressing on said set of predicted outcome values and set of weighting coefficients to provide thereby said robustified model.\n51. The computer program product of claim 50, wherein said program code devices are further configured to cause a computer to perform a Ridge regression on said set of predicted outcome values and said set of weighting coefficients.\n52. The computer program product of claim 51, wherein said set of similarity values are derived from a monotonic, decreasing function.\n53. The computer program product of claim 52, wherein said monotonic, decreasing function has the mathematical form: ##EQU24## where Dij is the distance from the ith data point to the jth node and α, β, and γ are parameters.\n54. A computer program product including a computer-readable medium having computer-readable program code devices embodied therein for evaluating the utility of a treatment regimen for treating a disease for the application of such treatment to a patient having such disease, said program code devices being configured to cause a computer to process at least one diagnostic variable relating to a statistical model describing the utility of said treatment regimen, said statistical model being derived using the method of claim 10, to determine thereby the utilit of said treatemnt regimen for treating said patient.\n55. The computer program product of claim 54, wherein said program code devices are configured to cause said computer to determine a projected likely treatment outcome score.\n56. The computer program product of claim 55, wherein said statistical model includes a discriminant function derived from a similarity-metric least squares (SMILES) analysis of said data set.\n57. The computer program product of claim 56, wherein said disease is selected from the group consisting of AIDS, HBV, and HCV.\n58. The computer program product of claim 57, wherein said disease is HBV.\n59. A computer program product including a computer-readable medium having computer-readable program code devices embodied therein for optimizing testing schedules for determining the efficacy of a regimen for treating a disease in a mammal, said program code devices being configured to cause a computer to evaluate a statistical model describing said treatment regimen for at least two time periods, said statistical model being derived using the method of claim 10, to determine thereby said optimal testing schedule for determining the efficacy of said method.\n60. The computer program product of claim 59, wherein said disease is selected independently from the group selected independently from the group consisting of AIDS, HBV, and HCV.\n61. The computer program product of claim 60, wherein said disease is HBV.\n62. A method for treating a disease in a patient having such disease, the method comprising the steps of:\na) applying at least one diagnostic variable relating to a statistical model describing the likely response of a patient to said treatment regimen, said statistical model being derived using the method of claim 10, to obtain thereby a prediction of patient response to said treatment regimen;\nb) evaluating said estimate to determine a course of treatment for said patient; and\nc) treating said patient for said disease in accordance with said determination.\n63. The method of claim 62, wherein said estimate comprises a projected likely treatment outcome score.\n64. The method of claim 63, wherein said treatment outcome score comprises a value selected from a set of values that form a treatment outcome scale, said treatment outcome scale including a likely success region, a likely failure region, and an intermediate region.\n65. The method of claim 64, wherein said statistical model includes a discriminant function which includes a polynomial function.\n66. The method of claim 65, wherein said statistical model includes a discriminant function which is derived using a similarity-metric least squares (SMILES) analysis of said data set.\n67. The method of claim 66, wherein said disease is selected from the group consisting of AIDS, HBV, and HCV.\n68. The method of claim 67, wherein said disease is HBV.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4570225A",
        "US4731725A",
        "US4733354A",
        "US4839822A",
        "US5463548A",
        "US5517405A",
        "US5619990A",
        "US5642936A",
        "US5642731A",
        "US5687716A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "WO2000069331A1",
        "US20010032102A1",
        "WO2001013787A3",
        "US20020103676A1",
        "US20020107641A1",
        "US20020123906A1",
        "US20020128867A1",
        "US6450956B1",
        "US20020165852A1",
        "US20020188465A1",
        "WO2003008530A2",
        "US20030048932A1",
        "WO2003021478A2",
        "US20030088365A1",
        "WO2003040704A1",
        "US20030097185A1",
        "US20030101076A1",
        "US20030100821A1",
        "US20030125609A1",
        "US20030152515A1",
        "US20030187338A1",
        "US20030190603A1",
        "WO2003085493A2",
        "US6635016B2",
        "US6658396B1",
        "US20030229513A1",
        "US6763128B1",
        "US6789091B2",
        "US20040176315A1",
        "US20040186365A1",
        "US6807492B2",
        "WO2004093822A2",
        "US20040267570A1",
        "US20050003470A1",
        "US20050037363A1",
        "US20050065184A1",
        "US20050102160A1",
        "US20050143935A1",
        "US20050203773A1",
        "US20050234570A1",
        "US20050239156A1",
        "US20050273273A1",
        "US20050288954A1",
        "US20060028471A1",
        "US20060052945A1",
        "US7043415B1",
        "US7058616B1",
        "US7062397B1",
        "US20060149503A1",
        "US20060212262A1",
        "US20060218010A1",
        "US20060247508A1",
        "US20060281977A1",
        "US20070027636A1",
        "US20070031883A1",
        "US20070082338A1",
        "US20070178501A1",
        "US20070191700A1",
        "US20070207449A1",
        "US20070244724A1",
        "US20070270671A1",
        "US20080010232A1",
        "US20080015893A1",
        "US20080015894A1",
        "US20080021436A1",
        "US20080058625A1",
        "US20080091471A1",
        "US20080097784A1",
        "US20080102453A1",
        "US20080126131A1",
        "US20080126117A1",
        "US20080126130A1",
        "US20080194922A1",
        "US20080201325A1",
        "US20080228797A1",
        "WO2007127490A3",
        "US20080281840A1",
        "US20080278333A1",
        "US20090043795A1",
        "US20090054749A1",
        "US20090054908A1",
        "US20090054747A1",
        "US20090076847A1",
        "US20090137923A1",
        "US20090158211A1",
        "US20090299767A1",
        "US20090318792A1",
        "US20100045231A1",
        "US20100063843A1",
        "US20100063830A1",
        "US20100076288A1",
        "US20100076950A1",
        "US20100094111A1",
        "US20100100392A1",
        "WO2010062676A1",
        "US20100169313A1",
        "US20100169342A1",
        "US20100169340A1",
        "US20100169262A1",
        "US20100191472A1",
        "US7766829B2",
        "US20100262045A1",
        "US20100275108A1",
        "US20110033862A1",
        "US20110077494A1",
        "US7928850B2",
        "US20110092763A1",
        "US20110119291A1",
        "US20110119212A1",
        "US20110124976A1",
        "US20110153356A1",
        "US7970722B1",
        "US20110178719A1",
        "US8123686B2",
        "US8226891B2",
        "US8403847B2",
        "US8454506B2",
        "US8465425B2",
        "US8515679B2",
        "US8532930B2",
        "US8560281B2",
        "US8612159B2",
        "US8665091B2",
        "US8688188B2",
        "US8771183B2",
        "US8825412B2",
        "US8930203B2",
        "US8977347B2",
        "US8974386B2",
        "US8993331B2",
        "US9031870B2",
        "US9129054B2",
        "US9163282B2",
        "US9228234B2",
        "US9314195B2",
        "WO2016097935A1",
        "US9420967B2",
        "US9424392B2",
        "US9499870B2",
        "US9677118B2",
        "US9734302B2",
        "US9872087B2",
        "US9968306B2",
        "US9980669B2",
        "US10011870B2",
        "US10083273B2",
        "US10081839B2",
        "US10113196B2",
        "US10179937B2",
        "US10238292B2",
        "US10262755B2",
        "US10316362B2",
        "US10526658B2",
        "US10577655B2",
        "US10806404B2",
        "US10894976B2",
        "CN112466477A",
        "US11065056B2",
        "US11111543B2",
        "US11111544B2",
        "US11322224B2",
        "US11326208B2",
        "US11332785B2",
        "US11332793B2",
        "US11339429B2",
        "US11408031B2",
        "US11479812B2",
        "US11485996B2",
        "US11525159B2",
        "US11793936B2"
    ],
    "citedby_ftf": [
        "US6871171B1",
        "FI20002571A0",
        "US7912528B2",
        "JP2006202235A",
        "DE102007044919A1",
        "JP5280735B2",
        "EP2556460A1",
        "JP5771510B2",
        "CN109155158A",
        "KR102196635B1",
        "KR20200121985A",
        "KR102456892B1",
        "CN112802567B"
    ]
}