{
    "patent_id": "US-9239951-B2",
    "title": "Ergonomic man-machine interface incorporating adaptive pattern recognition based control system ",
    "assignee": "Blanding Hovenweep, Llc",
    "publication_date": "2016-01-19",
    "patent_link": "https://patents.google.com/patent/US9239951B2/en",
    "inventors": [
        "Steven Mark Hoffberg",
        "Linda Irene Hoffberg-Borghesani"
    ],
    "classifications": [
        "G06K9/00369",
        "G06V40/103",
        "G06F3/00",
        "G06F3/0482",
        "G06F9/4446",
        "G06F9/453",
        "G06Q30/0261",
        "G16H40/63",
        "G16H40/67",
        "H04N21/252",
        "H04N21/42201",
        "H04N21/44222",
        "H04N21/4532",
        "H04N21/454",
        "H04N21/466",
        "H04N21/482",
        "H04N7/163",
        "G06N20/00",
        "G06N99/00",
        "H04L67/306"
    ],
    "abstract": "An adaptive interface, predicting a desired user function, based on user history, as well as machine internal status and context. An input is predicted, and the predictive mechanism may be is updated based on this feedback. Also provided is a pattern recognition system for a multimedia device, wherein an input is matched to a media stream on a conceptual basis, allowing inferential programming of the device. The system analyzes a data stream for correspondence with a data pattern. The data stream is subjected to adaptive pattern recognition to extract features of interest. Applications of the interface and system include a VCR, medical device, vehicle control system, audio device, environmental control system, securities trading terminal, and smart house. The system optionally includes an actuator for effecting the environment of operation, allowing closed-loop feedback operation and automated learning.",
    "claims": "\n1. A mobile system, comprising:\nat least one receiver configured to receive an extraterrestrial radio frequency signal and to process the extraterrestrial radio frequency signal to provide at least location information;\na terrestrial radio frequency transceiver configured to communicate at least digital data as data packets with a centralized station through a cellular radio network;\na memory configured to store at least an itinerary; and\na controller configured:\nto selectively automatically interactively communicate data packets through the terrestrial transceiver with the centralized station based on at least the location information and the itinerary,\nto receive information dependent on both the location and the itinerary,\nto define a direct manipulation graphic user interface dependent on the received information; and\nto automatically negotiate for business with at least one traveler service selected from the group consisting of a food service, a fuel service, and a lodging service, in dependence on the location and the itinerary, and to renegotiate for business with the at least one traveler service selected from the group consisting of a food service, a fuel service, and a lodging service, in dependence on a deviation from the itinerary, by automatically communicating through the terrestrial radio frequency transceiver.\n2. The mobile system according to claim 1, further comprising a heads up display.\n3. The mobile system according to claim 1, wherein the controller is configured to provide caller-identification-database interaction for telephone calls received through the terrestrial radio frequency transceiver.\n4. The mobile system according to claim 1, wherein the extraterrestrial receiver comprises a global positioning system (GPS) receiver.\n5. The mobile system according to claim 1, wherein the terrestrial radio frequency transceiver comprises a cellular radio transceiver.\n6. The mobile system according to claim 1, wherein the controller is configured to determine a variance from the itinerary, and to communicate through the terrestrial radio frequency transceiver further in dependence on the variance from the itinerary.\n7. The mobile system according to claim 1, wherein the controller is configured to communicate through the terrestrial radio frequency transceiver further in dependence on a deviation from the itinerary.\n8. The mobile system according to claim 1, wherein the controller is configured to automatically communicate with at least one traveler service selected from the group consisting of a food service, a fuel service, and a lodging service, in dependence on the location and the itinerary.\n9. The mobile system according to claim 1, wherein the controller is further configured to automatically perform a speech recognition algorithm.\n10. The mobile system according to claim 1, further comprising an interactive user interface controlled by the controller.\n11. The mobile system according to claim 1, wherein the controller is configured to present at least one commercial message to a user, in dependence on at least one of the location and the itinerary.\n12. The mobile system according to claim 11, wherein the controller is further configured to present the at least one commercial message to the user in dependence on a user demographic.\n13. The mobile system according to claim 11, wherein the use of the mobile system is associated with a cost to the user, and wherein the cost is subsidized by the presentation of the at least one commercial message.\n14. The mobile system according to claim 13, wherein an extent of the subsidy is dependent an eventual consummation of a transaction.\n15. The mobile system according to claim 1, wherein the terrestrial radio frequency transceiver is selectively configured to automatically communicate emergency information to emergency services and/or police in the event of accident or distress.\n16. The mobile system according to claim 1, wherein the terrestrial radio frequency transceiver is selectively configured as an antitheft system.\n17. The mobile system according to claim 1, wherein the terrestrial radio frequency transceiver is configured to communicate at least vehicular maintenance and diagnostic information to a remote system.\n18. A mobile system, comprising:\na cellular terrestrial radio frequency transceiver configured to communicate at least digital data as data packets through a cellular network with a centralized station;\na controller configured to selectively and automatically transmit through the terrestrial transceiver in dependence on at least an automatically determined location of the mobile system; and\na user interface having a plurality of functional features,\nwherein the controller is further configured:\nto determine an implicitly defined context;\nto automatically determine a probable required subset of the functional features based on at least the determined implicitly defined context;\nto control the user interface to interact with the user through the user interface selectively employing the subset of the functional features;\nto control at least the cellular terrestrial radio frequency transceiver; and\nto present at least one unsolicited commercial message to a user, in dependence on the location, wherein the use of mobile system is associated with a cost to the user, and wherein the cost is subsidized by the presentation of the at least one commercial message.\n19. The mobile system according to claim 18, wherein the controller is further configured to perform a speech recognition algorithm.\n20. The mobile system according to claim 18, further comprising a memory configured to store at least an itinerary, the controller being further configured to selectively automatically transmit through the terrestrial transceiver in dependence on at least the location information and the itinerary.\n21. The mobile system according to claim 20, wherein the controller is further configured to determine a variance from the itinerary.\n22. The mobile system according to claim 20, wherein the controller is further configured to communicate through the terrestrial radio frequency transceiver in dependence on the variance from the itinerary.\n23. The mobile system according to claim 18, further comprising a movement sensing system, configured to provide movement information to the controller.\n24. The mobile system according to claim 18, wherein the controller is configured to provide a direct-manipulation type graphic user interface for interaction with a user.\n25. The mobile system according to claim 18, wherein the extraterrestrial receiver comprises a global positioning system (GPS) receiver.\n26. The mobile system according to claim 18, wherein the controller is further configured to retrieve a user profile and to automatically determine a probable required subset of the functional features based on at least the determined implicitly defined context and the user profile.\n27. The mobile system according to claim 18, wherein the controller is configured to automatically communicate with at least one service provider which provides a service for a user of the mobile system, in dependence on the location.\n28. The mobile system according to claim 18, wherein the controller is configured to automatically negotiate for business with at least one service provider, in dependence on the location and a determined itinerary by automatically communicating through the cellular terrestrial radio frequency transceiver.\n29. The mobile system according to claim 28, wherein the controller is further configured to renegotiate with the at least one service provider, in dependence on the location and a deviation from the determined itinerary by automatically communicating through the cellular radio frequency transceiver.\n30. The mobile system according to claim 18, wherein the controller is further configured to present the at least one commercial message to the user in dependence on a user demographic.\n31. The mobile system according to claim 28 wherein the at least one commercial message comprises a commercial message from the at least one service provider.\n32. The mobile system according to claim 18, wherein an extent of the subsidy is dependent an eventual consummation of a transaction.\n33. The mobile system according to claim 18, wherein the terrestrial radio frequency transceiver is selectively configured to automatically communicate emergency information.\n34. The mobile system according to claim 18, wherein the terrestrial radio frequency transceiver is selectively configured as an antitheft system.\n35. The mobile system according to claim 18, further comprising a system interface configured to interface with a vehicle system, wherein the terrestrial radio frequency transceiver is configured to communicate at least vehicular maintenance and diagnostic information from the vehicle system to a remote system.\n36. The mobile system according to claim 18, further comprising a context sensor.\n37. A mobile system, comprising:\na cellular radio frequency transceiver configured to communicate at least digital data comprising data packets;\nat least one sensor configured to be responsive to an acceleration, wherein the at least one sensor has a sensor output;\nan optical imaging device having an imaging output;\nat least one subsystem configured to determine a location of the cellular radio frequency transceiver, wherein the at least one subsystem has a location output;\na touchscreen graphic user interface device;\na speech recognition user interface; and\na controller configured to store an itinerary, to receive the sensor output, to receive the imaging output, to receive the location output, to generate a user interface through at least one of the touchscreen graphic user interface and the speech recognition user interface, employing a subset of a set of functional features within the generated user interface, to automatically negotiate and renegotiate for business with at least one service provider, in dependence on the determined location by automatically communicating through the cellular radio frequency transceiver, to control interactive communications of data packets through the cellular radio frequency transceiver with a centralized station, dependent on at least the location output and the stored itinerary, and to present at least one unsolicited commercial message to a user, in dependence on the determined location, wherein the use of mobile system is associated with a cost to the user, and wherein the cost is subsidized by the presentation of the at least one commercial message.\n38. The mobile system according to claim 37, wherein the controller comprises a plurality of processing cores.\n39. The mobile system according to claim 37, further comprising a graphic information coprocessor configured to selectively process graphical information.\n40. The mobile system according to claim 37, wherein the at least one sensor comprises a micromachined sensor.\n41. The mobile system according to claim 37, wherein the at least one sensor comprises an accelerometer.\n42. The mobile system according to claim 37, wherein the at least one sensor comprises an angular movement sensor.\n43. The mobile system according to claim 37, wherein the at least one sensor comprises a gyroscopic sensor.\n44. The mobile system according to claim 37, wherein the user interface comprises a graphic user interface.\n45. The mobile system according to claim 37, wherein the user interface comprises a speech interface.\n46. The mobile system according to claim 42, wherein the controller is configured to perform at least a portion of a speech recognition algorithm.\n47. The mobile system according to claim 37, wherein the optical imaging device is configured to capture a machine-readable optical code, and the controller is configured to decode the machine-readable optical code.\n48. The mobile system according to claim 37, further comprising a battery configured to functionally power the mobile system."
}