{
    "patent_link": "https://patents.google.com/patent/US20060095336A1/en",
    "patent_id": "US20060095336A1",
    "title": "Systems and methods for determining bid value for content items to be placed on a rendered page",
    "abstract": "Systems and methods for determining the value of bids placed by content providers for placement positions on a page, e.g., a web page, rendered according to a given context, for instance, the search results listing for a particular query initiated on a search engine web site, are provided. Additionally, systems and methods are provided for determining placement of content items, e.g., advertisements and/or images, on a rendered page relative to other content items on the page based upon bid value.",
    "inventors": [
        "David Heckerman",
        "David Chickering",
        "Christopher Meek",
        "Brian Burdick",
        "Li Li",
        "Murali Vajjiravel",
        "Ying Li",
        "Rajeev Prasad",
        "Raxit Kagalwala",
        "Tarek Najm",
        "Sachin Dhawan"
    ],
    "assignee": "Zhigu Holdings Ltd",
    "classifications": [
        "G06Q30/02",
        "G06Q30/0241",
        "G06Q30/0247",
        "G06Q30/0256",
        "G06Q30/0601",
        "G06Q30/08",
        "G06Q40/04"
    ],
    "claims": "\n1. A computer-implemented method for determining bid values for content items to be placed on a page rendered according to a given context, comprising:\nreceiving a plurality of bids each associated with a content item, at least one of the plurality of bids being based upon a pricing model that is different from a pricing model upon which at least one other of the plurality of bids is based; and\ndetermining a bid value for each of the plurality of bids.\n2. The computer-implemented method of claim 1, further comprising selecting at least one of the content items based upon the respective determined bid values.\n3. The computer-implemented method of claim 2, further comprising displaying the at least one selected content item.\n4. The computer-implemented method of claim 1, further comprising determining a ranking for the plurality of bids based upon the respective determined bid values.\n5. The computer-implemented method of claim 4, further comprising displaying the content items based upon the determined ranking.\n6. The computer-implemented method of claim 1, wherein receiving a plurality of bids comprises receiving the at least one of the plurality of bids through an auction.\n7. The computer-implemented method of claim 1, wherein the given context is determined based upon a search query.\n8. The computer-implemented method of claim 1, further comprising receiving information about a user, wherein the given context is determined, in part, based upon the user information received.\n9. The computer-implemented method of claim 1, wherein the content items include information relevant to the given context.\n10. The computer-implemented method of claim 1, wherein the plurality of bids are based upon a plurality of pricing models, the plurality of pricing models comprising at least a cost-per-impression pricing model, a cost-per-click pricing model, a cost-per-sale pricing model, and a revenue sharing pricing model.\n11. The computer-implemented method of claim 10, further comprising collecting user access data for at least one of the displayed content items.\n12. The computer-implemented method of claim 11, wherein at least one of pricing models upon which at least one of the plurality of bids is based is capable of changing over time based upon the user access data collected.\n13. The computer-implemented method of claim 12, wherein the pricing model upon which at least one of the plurality of bids is based is the cost-per-impression pricing model at a first instance in time and the cost-per-click pricing model at a second instance in time later than the first instance.\n14. The computer-implemented method of claim 12, wherein the pricing model upon which at least one of the plurality of bids is based is one of the cost-per-impression pricing model and the cost-per-click pricing model at a first instance in time and the cost-per-sale pricing model at a second instance in time later than the first instance.\n15. The computer-implemented method of claim 1, wherein the plurality of bids are based upon a plurality of pricing models, the plurality of pricing models comprising at least a cost-per-impression pricing model, a cost-per-click pricing model, a cost-per-sale pricing model, and a revenue sharing pricing model, and wherein the method further comprises adjusting at least one of the plurality of bids based upon risk.\n16. A computer programmed to perform the steps recited in claim 1.\n17. A computer-implemented method for determining bid values for content to be placed on a page rendered according to a given context, comprising:\nreceiving a first bid associated with a first content item, the first bid based upon a plurality of pricing models; and\ndetermining a first bid value for the first bid.\n18. The computer-implemented method of claim 17, further comprising:\nreceiving a second bid associated with a second content item, the second bid based upon at least one of the plurality of pricing models; and\ndetermining a second bid value for the second bid.\n19. The computer-implemented method of claim 18, further comprising selecting at least one of the first and second content items based upon the respective determined bid values.\n20. The computer-implemented method of claim 19, further comprising displaying the at least one selected content item.\n21. The computer-implemented method of claim 18, further comprising determining a ranking for the first and second content items based upon the respective determined bid values.\n22. The computer-implemented method of claim 21, further comprising displaying the first and second content items based upon the determined ranking.\n23. The computer-implemented method of claim 18, wherein receiving the first bid associated with the first content item and receiving the second bid associated with the second content item comprise receiving the first and second bids through an auction.\n24. The computer-implemented method of claim 17, wherein the given context is determined based upon a search query.\n25. The computer-implemented method of claim 17, further comprising receiving information about a user, and wherein the given context is determined, in part, based upon the user information received.\n26. The computer-implemented method of claim 18, wherein the first and second content items include information relevant to the given context.\n27. The computer-implemented method of claim 17, wherein the plurality of pricing models comprises at least a cost-per-impression pricing model, a cost-per-click pricing model, a cost-per-sale pricing model, and a revenue sharing pricing model.\n28. The computer-implemented method of claim 18, wherein the plurality of pricing models comprises at least a cost-per-click pricing model, a cost-per-sale pricing model, and a revenue sharing pricing model, and wherein the method further comprises adjusting at least one of the first bid and the second bid based upon risk.\n29. A computer programmed to perform the steps recited in claim 17.\n30. A computer-readable medium having computer-executable instructions embodied thereon for presenting a user interface on a display device, the user interface for determining bid values for content to be placed on a page rendered according to a given context, comprising:\ncode for receiving a plurality of bids each associated with a content item, at least one of the plurality of bids being based upon a pricing model that is different from a pricing model upon which at least one other of the plurality of bids is placed; and\ncode for determining a bid value for each of the plurality of bids received.\n31. The computer-readable medium of claim 30, wherein the code for receiving the plurality of bids comprises code for receiving the plurality of bids each being based upon at least one of a cost-per-impression pricing model, a cost-per-click pricing model, a cost-per-sale pricing model, and a revenue sharing pricing model.\n32. The computer-readable medium of claim 30, further comprising code for selecting at least one content item based upon the determined bid value of the bid associated therewith.\n33. The computer-readable medium of claim 32, further comprising code for displaying the at least one content item.\n34. The computer-readable medium of claim 33, further comprising code for collecting user access data for the at least one displayed content item.\n35. The computer-readable medium of claim 30, further comprising code for determining a ranking for each content item based upon the respective bid value of the bid associated therewith.\n36. The computer-readable medium of claim 35, further comprising code for displaying each content item based upon the determined ranking.\n37. The computer-readable medium of claim 36, further comprising code for collecting user access data for each displayed content item.\n38. The computer-readable medium of claim 30, further comprising code for receiving information about a user, wherein the given context is determined, in part, based upon the user information received.",
    "status": "Active",
    "citations_own": [
        "US20030014331A1",
        "US20030033292A1",
        "US20040186778A1",
        "US20050171844A1",
        "US20070174114A1"
    ],
    "citations_ftf": [
        "US6714960B1",
        "US6285987B1",
        "US5974398A",
        "US6324519B1",
        "US6907566B1",
        "US6269361B1",
        "US7231358B2",
        "AU1354901A",
        "US20010054001A1",
        "JP2002015217A",
        "JP2002216017A",
        "US6826572B2",
        "WO2003063041A2",
        "US7054857B2",
        "US7555485B2",
        "US20040122824A1",
        "US20040148222A1",
        "JP2005228231A",
        "US7689458B2",
        "CA2518012A1"
    ],
    "citedby_own": [
        "US20070027743A1",
        "US20070038614A1",
        "US20070256095A1",
        "WO2007147148A2",
        "US20080104026A1",
        "US20080147608A1",
        "US20080162329A1",
        "US20080167948A1",
        "US20080306819A1",
        "US20090210288A1",
        "US20090287537A1",
        "US20090313126A1",
        "US20100082421A1",
        "US20100161417A1",
        "US20100217756A1",
        "US20100223250A1",
        "US20100312710A1",
        "US20110173126A1",
        "US20110184802A1",
        "US20110191171A1",
        "US20110196747A1",
        "US8577963B2",
        "US8589385B2",
        "US8615431B1",
        "US8627195B1",
        "US8666810B1",
        "US8706860B2",
        "US8756210B1",
        "US8799412B2",
        "US8831987B2",
        "US20140257974A1",
        "US8839087B1",
        "US8849802B2",
        "US8914514B1",
        "US8943197B1",
        "US8972477B1",
        "US9009334B1",
        "US9037696B2",
        "US9037975B1",
        "US9087024B1",
        "US9092405B1",
        "US9117002B1",
        "US9137210B1",
        "US9152970B1",
        "US9178955B1",
        "US9183258B1",
        "US9195768B2",
        "US9208316B1",
        "US9307004B1",
        "US9313100B1",
        "US9330188B1",
        "US9336321B1",
        "US9374244B1",
        "US9383958B1",
        "US9460220B1",
        "US9509783B1",
        "US9578137B1",
        "US9621406B2",
        "US9635041B1",
        "US9641637B1",
        "US9772979B1",
        "US10062088B2",
        "US10089403B1",
        "US10104412B2",
        "US10152463B1",
        "US10296558B1",
        "US10664538B1",
        "US10693991B1",
        "US10726095B1",
        "US11120479B2",
        "US11232254B2",
        "US11288699B2",
        "US20220301004A1",
        "US20230109298A1"
    ],
    "citedby_ftf": [
        "US7587323B2",
        "US8677384B2",
        "US8640160B2",
        "US9967633B1",
        "US20110178877A1",
        "US7212979B1",
        "US7086075B2",
        "US8086491B1",
        "US8590013B2",
        "US7836391B2",
        "US7401072B2",
        "US9865017B2",
        "US10387920B2",
        "US9015263B2",
        "US7689458B2",
        "DE102004053794A1",
        "US20060122889A1",
        "US7979308B2",
        "US20060224445A1",
        "JP4740630B2",
        "US10740722B2",
        "US7630976B2",
        "US9065727B1",
        "US11210632B2",
        "US10510043B2",
        "US20060293951A1",
        "JP4878131B2",
        "US20070038508A1",
        "US20070038509A1",
        "US8302030B2",
        "US20110313853A1",
        "US20120173376A1",
        "US8156128B2",
        "US10911894B2",
        "US8989718B2",
        "US10592930B2",
        "US20120179564A1",
        "US8615719B2",
        "US7577665B2",
        "US20120173373A1",
        "US20120066057A1",
        "US20120010989A1",
        "US9201979B2",
        "US7676394B2",
        "US20120010985A1",
        "US9076175B2",
        "US20120179563A1",
        "US8229914B2",
        "US8195133B2",
        "US7752209B2",
        "US8209344B2",
        "US9471925B2",
        "US10038756B2",
        "US20070118533A1",
        "US8364540B2",
        "US20100076994A1",
        "US8311888B2",
        "US8290810B2",
        "US20110145076A1",
        "US20070060114A1",
        "US8805339B2",
        "US20120179567A1",
        "US9703892B2",
        "US9058406B2",
        "US8812526B2",
        "US8238888B2",
        "US8688671B2",
        "US7769764B2",
        "US8103545B2",
        "US8364521B2",
        "US7702318B2",
        "US8660891B2",
        "US7912458B2",
        "US8832100B2",
        "US8027879B2",
        "US20110153428A1",
        "US8433297B2",
        "US8819659B2",
        "US8666376B2",
        "US7860871B2",
        "US8503995B2",
        "US7660581B2",
        "US8131271B2",
        "US20070250501A1",
        "US20070214118A1",
        "US20070083611A1",
        "US8676781B1",
        "US20070244868A1",
        "US8175585B2",
        "US8571999B2",
        "US20070130005A1",
        "US8036937B2",
        "KR100688245B1",
        "EP2054789A4",
        "CN100540047C",
        "US7831586B2",
        "US8209320B2",
        "WO2007147080A1",
        "WO2007149888A2",
        "US20080004962A1",
        "CA2656935A1",
        "US20080066107A1",
        "US20100146380A1",
        "US10204316B2",
        "US7912831B2",
        "US9053492B1",
        "US20080103893A1",
        "EP2081141A4",
        "US8185826B2",
        "US8380706B2",
        "US20080147497A1",
        "US20080167943A1",
        "US20080183596A1",
        "US7809705B2",
        "US20080294524A1",
        "US20080276266A1",
        "US8667532B2",
        "US20080262917A1",
        "US8122016B1",
        "US20080275770A1",
        "US20080275863A1",
        "US7974994B2",
        "US8433611B2",
        "US20090018904A1",
        "US20090018907A1",
        "KR100901938B1",
        "US9064024B2",
        "US20090099920A1",
        "US9251279B2",
        "US20090144140A1",
        "WO2009076617A2",
        "US9824372B1",
        "US8281334B2",
        "US20090248513A1",
        "US20090254867A1",
        "US20090259534A1",
        "KR100963392B1",
        "US8117050B2",
        "US20090307618A1",
        "US8150734B2",
        "US20090327029A1",
        "US8615436B2",
        "US8335718B2",
        "US20110231254A1",
        "US20110251901A1",
        "WO2010085773A1",
        "US20100198695A1",
        "US20100241597A1",
        "US20100274663A1",
        "US20100312624A1",
        "US20100318531A1",
        "US20110035256A1",
        "US8380582B2",
        "US20110047026A1",
        "US20110066488A1",
        "US8266006B2",
        "US7890602B1",
        "US8370217B1",
        "US9152708B1",
        "US8909558B1",
        "US8515969B2",
        "US8706728B2",
        "US9058393B1",
        "US8442861B2",
        "US20130066740A1",
        "US20120022950A1",
        "US20120030012A1",
        "US20120036024A1",
        "US8478697B2",
        "US9002926B2",
        "US20120316957A1",
        "US8819425B2",
        "US20130067401A1",
        "US9129313B1",
        "US10282758B1",
        "US9053185B1",
        "US20130339127A1",
        "US9076140B2",
        "US20140058833A1",
        "US9275040B1",
        "US9330072B1",
        "US9442912B1",
        "US8938438B2",
        "US9164966B1",
        "US10650445B1",
        "JP2016500184A",
        "US20140164064A1",
        "US9158800B2",
        "US10192238B2",
        "CN103914468B",
        "US9898768B2",
        "US20150134464A1",
        "JP5638647B2",
        "US20140258024A1",
        "WO2014150399A1",
        "US20140297401A1",
        "WO2014186716A2",
        "US10949894B1",
        "US20220084057A1",
        "US20140379464A1",
        "US10387902B1",
        "US10984455B1",
        "US10373210B1",
        "US10423977B1",
        "WO2015012747A1",
        "US9904944B2",
        "US10395281B2",
        "US9684918B2",
        "US10325291B2",
        "US9715694B2",
        "US20150149275A1",
        "US10096040B2",
        "US10380624B2",
        "US10120557B2",
        "US9922335B2",
        "CN104090919B",
        "US10089656B1",
        "US9953105B1",
        "US9779125B2",
        "US9785663B2",
        "US10296506B2",
        "US9865011B2",
        "US10521831B2",
        "US10783550B2",
        "US9972041B2",
        "KR101725143B1",
        "US9965149B2",
        "US10129107B2",
        "JP6374855B2",
        "US20170169505A1",
        "CN105642914B",
        "US10776847B1",
        "US10755308B2",
        "US20180253759A1",
        "US10410261B2",
        "US11494686B1",
        "US10846735B2",
        "KR102015634B1",
        "WO2020012437A1",
        "US11449671B2"
    ]
}