{
    "patent_link": "https://patents.google.com/patent/US7409366B1/en",
    "patent_id": "US7409366B1",
    "title": "Apparatus and method for adding liquidity to an ECN and improving executions of orders for securities",
    "abstract": "The invention provides methods and systems for improved execution of orders for securities and for adding liquidity to markets. Embodiments include receiving from customers orders for quantities of securities to be bought or sold, the orders optionally identifying pre-selected markets. Embodiments include sending orders to a first default market where orders are partially filled. Embodiments typically include sending orders to a pre-selected market, where orders are partially filled, and booking orders in a second default market. Embodiments include discounting fees charged to customers for orders booked into a default market. Booking IOC orders into a second default market typically includes setting the order time-in-force to a value other than zero. In many embodiments, the default markets are sometimes the same market, and sometimes they are different markets. Embodiments include selecting, from among a multiplicity of markets, the default markets dependent upon default market selection criteria. In many embodiments, market selection criteria include such factors as transaction costs or access fee levels for execution of orders in markets, response speed of markets (latency), and liquidity. In many embodiments at least one of the default markets is connected through tight coupling to a broker-dealer system.",
    "inventors": [
        "Omar Amanat",
        "Michael Bundy"
    ],
    "assignee": "PTS FINANCIAL TECHNOLOGY LLC",
    "classifications": [
        "G06Q40/04",
        "G06Q20/10",
        "G06Q20/102",
        "G06Q30/0601",
        "G06Q40/00",
        "G06Q40/03"
    ],
    "claims": "\n1. A method of executing orders for securities in an automated broker-dealer system, the method comprising the steps of:\nreceiving from a customer an order for a quantity of securities to be bought or sold, the order having an MPID optionally identifying a pre-selected market;\nsending the order to a first default market, wherein the order is partially filled;\nafter sending the order to the first default market, sending the order to at least one pre-selected market, wherein the order is partially filled; and\nafter sending the order to at least one pre-selected market, booking the order in a second default market.\n2. The method of claim 1 wherein the order comprises:\na symbol identifying securities to be bought or sold,\na side indicating whether the securities are to be bought or sold,\na quantity of securities to be bought or sold according to the side,\nan MPID optionally set to a market identifier,\na time-in-force optionally set to a value greater than zero,\nand a price optionally set to a value greater than zero.\n3. The method of claim 1 wherein the first default market and the second default market are the same market.\n4. The method of claim 1 further comprising selecting, from among a multiplicity of markets, the default markets dependent upon default market selection criteria.\n5. The method of claim 1 wherein at least one of the default markets is connected through tight coupling to the broker-dealer system.\n6. The method of claim 5 wherein tight coupling comprises the capability of interprocess communications of orders and responses to orders through shared memory.\n7. The method of claim 5 wherein tight coupling comprises the capability of communications of orders and responses to orders as parameters in subroutine calls.\n8. The method of claim 5 wherein tight coupling comprises the capability of communications of orders and responses to orders as parameters in calls to class object interface member methods.\n9. The method of claim 5 wherein tight coupling comprises the capability of communications of orders and responses to orders through directly-connected, dedicated, synchronous, parallel, extremely high speed data communications ports and data communications lines.\n10. The method of claim 1 wherein the order comprises a time-in-force, the method further comprising setting the time-in-force to indicate an IOC order before sending the order to the at least one pre-selected market.\n11. The method of claim 1 wherein sending the order to at least one pre-selected market further comprises sending the order to a market identified in the MPID, wherein the market identified in the MPID is selected by the customer before the order is received in the broker-dealer system.\n12. The method of claim 1 wherein sending the order to at least one pre-selected market further comprises sending the order to a market selected by a smart executor.\n13. The method of claim 1 wherein sending the order to at least one pre-selected market further comprises sending the order to a market selected dependent upon a solution set from a solution server.\n14. The method of claim 1 wherein fees charged to customers for execution of orders are discounted for orders that are booked in the second default market.\n15. The method of claim 1 wherein at least one of the default markets is an ECN.\n16. The method of claim 1 wherein the default market is an ECN.\n17. A method of executing orders for securities in an automated broker-dealer system, the method comprising the steps of:\nreceiving from a customer an order for a quantity of securities to be bought or sold;\nsending the order as an IOC order to at least one pre-selected market; and\nbooking the order in a default market after said sending.\n18. The method of claim 17 further comprising selecting, from among a multiplicity of markets, the default market dependent upon default market selection criteria.\n19. The method of claim 17 wherein the default market is connected through tight coupling to the broker-dealer system.\n20. The method of claim 17 wherein the order comprises a time-in-force, the method further comprising setting the time-in-force to indicate an IOC order before sending the order to the at least one pre-selected market.\n21. The method of claim 17 wherein fees charged to customers for execution of orders are discounted for orders that are booked in the default market.\n22. A system for executing orders for securities, the system comprising:\na processor programmed to:\nreceive from a customer an order for a quantity of securities to be bought or sold, the order having an MPID optionally set to identify a pre-selected market;\nsend the order to a first default market, wherein the order is partially filled;\nafter sending the order to the first default market, send the order to at least one pre-selected market, wherein the order is partially filled; and\nafter sending the order to at least one pre-selected market, book the order in a second default market; and\na memory coupled to the processor, the processor further programmed to store in the memory the order and responses to the order.\n23. The system of claim 22 wherein the order comprises:\na symbol identifying securities to be bought or sold,\na side indicating whether the securities are to be bought or sold,\na quantity of securities to be bought or sold according to the side,\nan MPID optionally set to a market identifier,\na time-in-force optionally set to a value greater than zero, and\na price optionally set to a value greater than zero.\n24. The system of claim 22 wherein the first default market and the second default market are the same market.\n25. The system of claim 22 wherein the processor is further programmed to select, from among a multiplicity of markets, the default markets dependent upon default market selection criteria.\n26. The system of claim 22 wherein at least one of the default markets is connected through tight coupling to the broker-dealer system.\n27. The system of claim 26 wherein tight coupling comprises the capability of interprocess communications of orders and responses to orders through shared memory.\n28. The system of claim 26 wherein tight coupling comprises the capability of communications of orders and responses to orders as parameters in subroutine calls.\n29. The system of claim 26 wherein tight coupling comprises the capability of communications of orders and responses to orders as parameters in calls to class object interface member methods.\n30. The system of claim 26 wherein tight coupling comprises the capability of communications of orders and responses to orders through directly-connected, dedicated, synchronous, parallel, extremely high speed data communications ports and data communications lines.\n31. The system of claim 22 wherein the order comprises a time-in-force and the processor is further programmed to set the time-in-force to indicate an IOC order before sending the order to the at least one pre-selected market.\n32. The system of claim 22 wherein the processor programmed to send the order to at least one pre-selected market further comprises the processor programmed to send the order to a market identified in the MPID, wherein the market identified in the MPID is selected by the customer before the order is received in the broker-dealer system.\n33. The system of claim 22 wherein the processor programmed to send the order to at least one pre-selected market further comprises the processor programmed to send the order to a market selected by a smart executor.\n34. The system of claim 22 wherein the processor programmed to send the order to at least one pre-selected market further comprises the processor programmed to send the order to a market selected dependent upon a solution set from a solution server.\n35. The system of claim 22 wherein the processor is further programmed charge fees to customers for execution of orders and to discount fees for orders that are booked in the second default market.\n36. The system of claim 22 wherein at least one of the default markets is an ECN.\n37. A system for executing orders for securities, the system comprising:\na processor programmed to:\nreceive from a customer an order for a quantity of securities to be bought or sold;\nsend the order as an IOC order to at least one pre-selected market; and\nbook the order in a second default market after said sending; and\na memory coupled to the processor, the processor further programmed to store in the memory the order and responses to the order.\n38. The system of claim 37 wherein the processor is further programmed to select, from among a multiplicity of markets, the default market dependent upon default market selection criteria.\n39. The system of claim 37 wherein the default market is connected through tight coupling to the broker-dealer system.\n40. The system of claim 37 wherein the order comprises a time-in-force and the processor is further programmed to set the time-in-force to indicate an IOC order before sending the order to the at least one pre-selected market.\n41. The system of claim 37 wherein the processor is further programmed charge fees to customers for execution of orders and to discount fees for orders that are booked in the default market.\n42. The system of claim 37 wherein the default market is an ECN.\n43. A method of executing orders for securities, the method comprising:\nreceiving from a customer an order that specifies a security, a quantity to be bought or sold, a selected market, and a greater-than-zero time-in-force;\nsubmitting the order as an IOC order to a default market different from the selected market;\nreceiving an order response from the default market;\nafter receiving said order response from the default market, submitting any unfilled portion of the order as an IOC order to the selected market;\nreceiving an order response from the selected market; and\nafter receiving said order response from the selected market, submitting any still-unfilled portion of the order as an order with said greater-than-zero time-in-force to a second default market different from the selected market.",
    "status": "Active",
    "citations_own": [
        "US3573747A",
        "US3581072A",
        "US3976840A",
        "US4243844A",
        "US4412287A",
        "USRE31643E",
        "US4585130A",
        "US4588192A",
        "US4674044A",
        "US4677552A",
        "US4750135A",
        "US4751640A",
        "US4903201A",
        "US4949248A",
        "US5025372A",
        "US5038284A",
        "US5101353A",
        "US5136501A",
        "US5168446A",
        "US5267148A",
        "US5270922A",
        "US5297031A",
        "US5297032A",
        "US5339392A",
        "US5361199A",
        "US5375055A",
        "US5500889A",
        "US5508913A",
        "US5517406A",
        "US5557517A",
        "US5563783A",
        "US5640569A",
        "US5655088A",
        "US5689652A",
        "US5727165A",
        "US5752237A",
        "US5774880A",
        "US5788234A",
        "US5799287A",
        "US5806048A",
        "US5809483A",
        "US5819238A",
        "US5819237A",
        "US5845266A",
        "US5852808A",
        "US5875108A",
        "US5901246A",
        "US5905974A",
        "US5924083A",
        "US5940810A",
        "US5946667A",
        "US5950176A",
        "US6014643A",
        "US6247000B1",
        "US6278982B1",
        "US6377940B2",
        "US20020052827A1",
        "US20020069155A1",
        "US6408282B1",
        "US20020091611A1",
        "US6421653B1",
        "US6629082B1",
        "US20030200167A1",
        "US20030236738A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20050044022A1",
        "US20060111999A1",
        "US8244621B1",
        "US20140156488A1",
        "US8793179B1"
    ],
    "citedby_ftf": [
        "US7465312B2",
        "WO2007130465A2"
    ]
}