{
    "patent_id": "US-10793162-B2",
    "title": "Method and system for predicting driving path of neighboring vehicle ",
    "assignee": "Hyundai Motor Company",
    "publication_date": "2020-10-06",
    "patent_link": "https://patents.google.com/patent/US10793162B2/en",
    "inventors": [
        "Ji Hyun Yoon"
    ],
    "classifications": [
        "B60W40/10",
        "B60W30/0956",
        "G08G1/161",
        "B60W30/18154",
        "G06N5/04",
        "G06N5/041",
        "G06N7/005",
        "G06N7/01",
        "G08G1/163",
        "G08G1/166",
        "B60W2552/05",
        "B60W2554/00",
        "B60W2554/4041",
        "B60W2556/50"
    ],
    "abstract": "A method and system for predicting a driving path of a neighboring vehicle which may influence a subject vehicle is provided. The subject vehicle detects a segment adjacent to the neighboring vehicle which is currently driven and searches all segments connected to the segment. The method prevents a collision between the subject vehicle and the neighboring vehicle that occurs due to misrecognition of a position, a driving direction, or velocity of the neighboring vehicle, and more accurately predicts the driving path of the neighboring vehicle. The method includes receiving information of a neighboring road on which a subject vehicle is driven from a detailed map and detecting a segment showing the neighboring vehicle which is being currently driven from the information of the neighboring road. Segments are detected that are connected to the segment and the driving path of the neighboring vehicle is predicted.",
    "claims": "\n1. A method for predicting a driving path of a neighboring vehicle proximate to a subject vehicle, comprising:\nreceiving, by a controller, information regarding a neighboring road that is connected to a road on which the subject vehicle is being driven using a detailed map, the neighboring road including a plurality of connected segments, each segment corresponding to a minimum unit expressing a road;\ndetermining, by the controller, a segment that is closest to the neighboring vehicle by calculating a shortest distance between the segment and the neighboring vehicle using a grid map or quad tree;\ndetecting, by the controller, segments of one or more roads connected to the segment;\npredicting, by the controller, the driving path of the neighboring vehicle using the detected segments of one or more roads and a velocity, an acceleration, or a driving direction received from the neighboring vehicle using V2X communication with the neighboring vehicle; and\nadjusting, by the controller, a driving direction and a velocity of the subject vehicle based on the predicted the driving path of the neighboring vehicle.\n2. The method according to claim 1, wherein the driving path of the neighboring vehicle is predicted using any one of a most probable path (MPP), a probability estimation path (PEP), and a defensive estimation path (DEP).\n3. The method according to claim 1, wherein when there is no segment of a road which influences an advancing direction of the subject vehicle, the driving path of the neighboring vehicle is not predicted.\n4. The method according to claim 1, wherein when the neighboring vehicle is driven on a same lane as the subject vehicle, or is driven at a rear of the subject vehicle, the driving path of the neighboring vehicle is not predicted.\n5. A system for predicting a driving path of a neighboring vehicle proximate to a subject vehicle, comprising:\na memory configured to store program instructions; and\na processor configured to execute the program instructions, which when executed cause the processor to:\nreceive information regarding a neighboring road that is connected to a road on which the subject vehicle is being driven using a detailed map, the neighboring road including a plurality of connected segments, each segment corresponding to a minimum unit expressing a road;\ndetermine a segment that is closest to the neighboring vehicle by calculating a shortest distance between the segment and the neighboring vehicle using a grid map or quad tree;\ndetect segments of one or more roads connected to the segment;\npredict the driving path of the neighboring vehicle using the detected segments of one or more roads and a velocity, an acceleration, or a driving direction received from the neighboring vehicle using V2X communication with the neighboring vehicle; and\nadjust a driving direction and a velocity of the subject vehicle based on the predicted the driving path of the neighboring vehicle.\n6. The system according to claim 5, wherein the driving path of the neighboring vehicle is predicted using any one of a most probable path (MPP), a probability estimation path (PEP), and a defensive estimation path (DEP).\n7. The system according to claim 5, wherein when there is no segment of a road which influences an advancing direction of the subject vehicle, the driving path of the neighboring vehicle is not predicted.\n8. The system according to claim 5, wherein when the neighboring vehicle is driven on a same lane as the subject vehicle, or is driven at a rear of the subject vehicle, the driving path of the neighboring vehicle is not predicted.\n9. The method according to claim 1, further comprising displaying the predicted driving path of the neighboring vehicle.\n10. The method according to claim 9, further comprising displaying one or more collision risk zones in conjunction with the predicted driving path of the neighboring vehicle.\n11. The system according to claim 5, further comprising a display configured to display the predicted driving path of the neighboring vehicle.\n12. The system according to claim 11, wherein the display is further configured to display one or more collision risk zones in conjunction with the predicted driving path of the neighboring vehicle.",
    "status": "Active",
    "citations_own": [
        "JP2005115484A",
        "US20050179580A1",
        "CN1761980A",
        "US7085637B2",
        "US20080167821A1",
        "US20080303696A1",
        "JP2009003650A",
        "CN101395648A",
        "US20090228157A1",
        "CN101650891A",
        "US20100082251A1",
        "CN102307769A",
        "US20120209505A1",
        "JP2012164159A",
        "US20120323474A1",
        "CN102878999A",
        "CN102890869A",
        "CN103250196A",
        "CN103295408A",
        "US20130325306A1",
        "CN103454639A",
        "US20140088855A1",
        "CN103842230A",
        "JP2014130550A",
        "US20140195138A1",
        "CN104050237A",
        "CN104054119A",
        "WO2015008588A1",
        "CN104464344A",
        "CN104599529A",
        "US9031089B2",
        "US20150197248A1",
        "US20150202770A1",
        "KR20150096924A",
        "CN104915967A",
        "CN104925055A",
        "US20160054140A1",
        "US20160358477A1",
        "US20170057496A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US11198433B2"
    ],
    "citedby_ftf": [
        "US9830822B2",
        "US20180164109A1",
        "JP6515912B2",
        "JP6544348B2",
        "US11036233B2",
        "DE102017204601A1",
        "JP6673293B2",
        "US10953880B2",
        "US10782693B2",
        "US10953881B2",
        "US10782694B2",
        "KR102374078B1",
        "WO2019076444A1",
        "CN111373458B",
        "US20190337511A1",
        "CN110497906B",
        "CN114846826A",
        "CN114440908B"
    ]
}