{
    "patent_link": "https://patents.google.com/patent/US3753233A/en",
    "patent_id": "US3753233A",
    "title": "Method and apparatus for data entry",
    "abstract": "A data entry system employing input stations, each comprising a keyboard and a real time information display. An individual format guidance mask may be requested for display to facilitate a particular data entry. In the system disclosed, the display is a cathode ray tube. Each format guidance mask incorporates alternative fields or words for the most often required information in the data entry requested. Alternative words are displayed in groups on the same line and are normally arranged from left to right according to their descending frequency of use. A data entry is composed by erasing the words in each line that do not apply and tabbing over the word or words that do apply. To this end the display is provided with a cursor or place marker and the keyboard of the invention comprises a word erase key for erasing words one at a time, a tab key for tabbing over words one at a time, and a line erase key for erasing the remaining portion of a line. Thus, the most frequent keyed sequence is tabbing over the first and most frequently desired alternative word and line erasing the remainder of the line. The word erase key is only used if a less frequently chosen alternative is desired. A stock securities order data entry system is disclosed in detail.",
    "inventors": [
        "N Cardell",
        "R Manzo"
    ],
    "assignee": "Allied Corp",
    "classifications": [],
    "claims": "\n1. A method of entering data into a data processing system having at least one input station, said data being entered by filling in the information required in one or more fields of a form, there being alternative words which may be entered in at least one of said fields, comprising the steps of: indicating that data is to be entered into the system, and, where necessary, the form in which it is to be entered; displaying a guidance mask at said input station which mask contains format information for said form and also includes for said at least one field of the form a group of alternative words to be entered into the system; editing said mask by selectively identifying desired ones of said alternative words; displaying the results of said editing step; indicating, when the data for all required fields of the form has been entered, the editing of fields containing alternative words having been completed, that said edited mask is ready for processing by said system; and transmitting the edited mask to the system.\n2. A method of the type described in claim 1 wherein said editing step of identifying desired ones of said alternative words includes the step of erasing undesired ones of said alternative words.\n3. A method of the type described in claim 2 wherein said system includes a central processing unit (CPU); wherein said input station is remote from said CPU; and wherein said transmitting step includes the step of transmitting said edited mask to said CPU.\n4. A method of the type described in claim 1 including the step of indicating the format in which data is to be entered into the system, and thus the required mask.\n5. A method of the type described in claim 2 wherein said editing step includes the step of tabbing over desired ones of said alternative words.\n6. A method of the type described in claim 5 wherein said editing step includes the steps of erasing alternative words until a desired word is reached, tabbing over a desired word, and group erasing the remaining words of the group after the last desired word of the group has been tabbed over.\n7. A method of the type described in claim 6 wherein there are a plurality of said groups of alternate words, each of said groups appearing for a different field of said guidance mask; and wherein said editing steps are repeated for each of said groups.\n8. A method of the type described in claim 5 wherein each of said groups are confined to a single line of the display mask.\n9. A method of the type described in claim 6 wherein there is only a single desired word in each of said groups.\n10. A method of the type escribed in claim 6 wherein there is at said remote station a keyboard having a tab, a word erase, and a group erase key; and wherein said editing steps may be performed solely by the operation of said three keys.\n11. A method of the type described in claim 10 wherein each of said groups are confined to a single line of the display mask; and wherein said group erase key is a line erase key.\n12. A method of the type described in claim 6 wherein the words in each alternative group of words are arranged in sequence according to their descending frequency of use in completed data entries.\n13. A method of the type described in claim 1 wherein said editing step includes the step of inserting into said mask for a given field a desired alternative word which does not appear in said group of alternative words.\n14. A method of the type described in claim 13 wherein said desired word may be inserted at any selected point in said group.\n15. A method of the type described in claim 1 wherein said mask also includes variable field identifying information; and including the step of erasing the variable field identifying information when the first data for the variable field is entered into the system.\n16. A method of the type described in claim 3 wherein said system includes a remote processor; and including the step of retrieving the mask from said remote processor.\n17. A method of the type described in claim 3 including the step of retrieving said mask from the CPU.\n18. A method of the type described in claim 6 including the step of displaying a cursor with said mask, the cursor indicating the word on the display on which the next editing operation is to be performed.\n19. A method of the type described in claim 18 wherein there is a tab point at the beginning of each alternative word of said group; and wherein said tabbing step includes the step of advancing the cursor to the beginning of the next word.\n20. A method of the type described in claim 18 wherein said alternative word erasing step includes the steps of erasing the word containing the cursor and shifting all words of the group following the erased word one word position to the left, the position of the cursor remaining unchanged.\n21. A method of the type described in claim 18 wherein said group erasing step includes the steps of erasing the word containing the cursor and all succeeding words of the group, and advancing the cursor to the beginning of the first word of the mask following the end of the erased group.\n22. A method of the type described in claim 21 wherein said group is confined to a single line of the display mask; and wherein said cursor is advanced to the beginning of the next line during said group erase step.\n23. A method of the type described in claim 1 including the steps of error checking said edited mask at said CPU; and retransmitting the erroneously edited mask to the input station from which it was transmitted.\n24. A method of the type described in claim 23 wherein said mask comprises fields of data; and including the step of displaying said erroneously edited mask at the input station to which it is transmitted together with an indication of the one or more erroneous fields therein.\n25. A method of the type described in claim 1 wherein the data entered into said data processing system relates to a stock market transaction.\n26. A system for entering data which is to be presented in at least one predetermined multifield format into a data processing system comprising: an input station having a display device and a keyboard, said keyboard including a tab key and a word erase key; storage means; one or more format guidance masks stored in said storage means, each of said masks containing information in one of said predetermined formats to be entered into said data processing system, there being a group of alternative words for at least one field of each mask; means responsive to a first input from said keyboard indicating a format for retrieving a selected mask corresponding to the indicated format from said storage means and for displaying said mask on said display device; means responsive to second inputs from said keyboard for editing said mask by selectively identifying desired ones of said alternative words, said editing means including means for displaying a cursor with said mask, the cursor indicating the word at which the next editing operation is to begin, means responsive to the operation of the tab key for advancing the cursor to the next succeeding word on the display, and means responsive to the operation of the word erase key for erasing the word marked by the cursor and for shifting the cursor to the succeeding word of the group; and means for entering said edited mask into said data processing system.\n27. A system of the type described in claim 26 wherein said means for editing the mask by selectively identifying desired ones of said alternative words includes means for selectively erasing undesired ones of said alternative words.\n28. A system of the type described in claim 26 Wherein said cursor shifting means includes means for shifting all words of the group following the erased word to the left by one word position.\n29. A system of the type described in claim 26 wherein said keyboard includes a group erase key; and wherein said editing means includes means responsive to the operation of said group erase key for erasing the word containing the cursor and all words of the group following it and for advancing the cursor to the beginning of the first word following the group.\n30. A system of the type described in claim 29 wherein said group is confined to a single line of the display mask; and wherein said group erase key is a line erase key, the cursor being advanced to the beginning of the next line in response to the operation of the key.\n31. A system of the type described in claim 29 wherein said tab, word erase and group erase keys are located together on said keyboard for multifinger one-hand operation.\n32. A system of the type described in claim 29 wherein said keyboard includes an insert key and data entry keys; and wherein said editing means includes means responsive to the operation of said insert key for shifting the word containing the cursor, and all words of the group succeeding it, one or more character positions to the right, the position of the cursor remaining unchanged, and means responsive to subsequent operation of the data entry keys for displaying the entered data in the vacated spaces.\n33. A system of the type described in claim 32 wherein said tab, word erase, group erase and insert keys are located together on said keyboard for multifinger one-hand operation.\n34. A system of the type described in claim 26 wherein said editing means includes means for storing the mask while it is being displayed and edited.\n35. A system of the type described in claim 26 wherein said mask also includes variable field identifying information; wherein said keyboard includes data entry keys; and including means responsive to the operation of the first data entry key to enter data into a variable field for erasing the variable field identifying information.\n36. A system of the type described in claim 26 wherein said data processing system includes a CPU, a remote communications processor, and a plurality of said input stations communicating with said CPU through said communications processor; and wherein said mask storage means is located at said communica-tions processor.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3248705A",
        "US3364473A",
        "US3389404A",
        "US3500335A",
        "US3501746A",
        "US3596254A",
        "US3618032A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4005388A",
        "US4247906A",
        "EP0031495A1",
        "EP0056886A1",
        "US4383295A",
        "US4388689A",
        "USRE31790E",
        "EP0178499A2",
        "EP0271280A2",
        "EP0328831A2",
        "US4903201A",
        "US4977962A",
        "US5040113A",
        "US20040088242A1",
        "US20040103003A1",
        "US20040246840A1",
        "US20050144088A1",
        "US20100037158A1",
        "US8005743B2"
    ],
    "citedby_ftf": []
}