{
    "patent_link": "https://patents.google.com/patent/US4314356A/en",
    "patent_id": "US4314356A",
    "title": "High-speed term searcher",
    "abstract": "A method and apparatus for high-speed searching of a byte stream for predetermined words or terms. More particularly, the present invention is directed to a method and apparatus for use in combination with a data source supplying a stream of binary signals defining both the identities of alphanumeric characters occurring in an ordered sequence and the position of each such character within a character group for detecting the occurrence of a particularly ordered group of R characters. The apparatus preferably includes a search memory means comprised of multiple (N) sets of R storage locations each of which includes S bit stages, each bit stage being capable of storing a \"1\" or \"0\" state. R represents the number of characters within a character group and S represents the number of different characters that can be identified. Each of the R storage locations may store one or more \"0\" bits, the position of each \"0\" bit identifying a particular character. A first decoding means is provided responsive to the position within a character group of each character defined by the binary signals for addressing a corresponding one of the R locations. A second decoding means is provided responsive to the identity of each character defined by the binary signals for addressing a particular one of the S bit stages within the addressed location. The addressing of a stage storing a \"1\" generates a word mismatch signal.",
    "inventors": [
        "Alfred D. Scarbrough"
    ],
    "assignee": "Contel Federal Systems Inc",
    "classifications": [
        "G06F16/90344",
        "Y10S707/99936"
    ],
    "claims": "\n1. In combination with a data source supplying a stream of binary signals defining both the identities of alphanumeric characters occurring in an ordered sequence and the position of each such character within a character group, an apparatus for detecting the occurrence of a particularly ordered group of R characters, said apparatus comprising:\nsearch memory means comprised of a first group of R sets of S bit storage devices wherein R represents the number of entries in a character position field and S represents the number of entries in a character identification field, each of said bit storage devices defining a first or second state;\nfirst means responsive to the position within a character group of each character defined by said binary signals for addressing the corresponding one of said R sets;\nsecond means responsive to the identity of each character defined by said binary signals for addressing the corresponding one of said S bit storage devices within said addressed one of said R sets; and\nthird means responsive to said first and second means addressing a bit storage device defining a first state for generating a mismatch signal.\n2. The apparatus of claim 1 in which said search memory means comprises a plurality of groups of R sets of S bit storage devices wherein R represents the number of entries in a character position field and S represents the number of entries in a character identification field, each of said bit storage devices defining a first or second state;\nsaid first means responsive to the position within a character group of each character defined by said binary signals comprises means for addressing the corresponding one of said R sets in each of said plurality of groups of R sets; and\nsaid second means responsive to the identity of each character defined by said binary signals comprises means for addressing the corresponding one of said S bit storage devices within said addressed R set in each of said plurality of groups of R sets.\n3. The apparatus of claim 2 further comprising:\na word match register containing a plurality of bit storage stages each of which corresponds to one of said group of R sets;\nmeans for placing each of said word match register storage stages in a first stage at the beginning of each of said character groups; and\nmeans for interconnecting each of said word match register storage stages to its corresponding group of R sets of S bit storage devices whereby a mismatch signal from one of said corresponding bit storage devices will cause its corresponding word match register storage stage to change from said first state to a second state.\n4. The apparatus of claim 3 further comprising:\na document match register having a plurality of bit storage stages each of which corresponds to a storage stage in said word match register;\nmeans for placing each of said document match register storage stages in a first state at the beginning of said sequence; and\nmeans for transferring at the end of each of said character groups information contained in said word match register storage stages to their corresponding document match register storage stages whereby said second state in one of said word match register storage stages will cause the corresponding document match register storage stage to change from said first state to a second state.\n5. In combination with a data source supplying a stream of incoming binary signals representing a document formed of words formed of characters formed of a plurality of said binary signals, an apparatus for detecting the occurrence of a predetermined character pattern comprising;\nfirst means for identifying the order of occurrence of a predetermined number of incoming characters in an incoming word;\na second means for identifying each incoming character; and\na search memory means responsive to said first and second means for determining if each identified incoming character and its order of occurrence in an incoming word corresponds to a character and its order of occurrence in said predetermined character pattern, said search memory means comprising a first set of bit stages, each bit stage corresponding to a specific character and an order of occurrence with respect to an incoming word;\neach of said first set of bit stages defining a first stage if that bit stage does not correspond to a character and its order of occurrence within said predetermined character pattern;\nmeans for addressing each bit stage corresponding to each incoming character and its order of occurrence within an incoming word; and\nmeans for generating a mismatch signal whenever said addressed bit stage is identified with said first state.\n6. In combination with a data source supplying a stream of incoming binary signals representing a document formed of words formed of characters formed of a plurality of said binary signals, an apparatus for detecting the occurrence of a predetermined character pattern comprising;\nfirst means for identifying the order of occurrence of a predetermined number of incoming character in an incoming word;\nsecond means for identifying each incoming character; and\na search memory means responsive to said first and second means for determining if each identified incoming character and its order of occurrence in an incoming word corresponds to a character and its order of occurrence in said predetermined character pattern, said search memory means comprising N sets of bit stages, each bit stage in a set corresponding to a specific character and an order of occurrence with respect to an incoming word;\neach bit stage defining a first state if that stage does not correspond to a character and its order of occurrence within said predetermined character pattern;\nmeans for addressing each bit stage within each of N sets of bit stages corresponding to each incoming character and its order of occurrence within an incoming word; and\nmeans for generating a mismatch signal whenever said addressed bit stage is identified with said first state.\n7. The system of claim 6 further comprising:\na word match register having N bit storage stages, each of which corresponds to one of said N sets of bit stages;\nmeans for placing each of said word match register storage states in a first state at the beginning of each incoming word; and\nmeans for changing the state of each of said word match register storage stages to a second state whenever a mismatch signal is generated as a result of addressing a bit stage in its corresponding N set of bit stages.\n8. A method for detecting the occurrence of a particularly ordered group or R characters from a stream of binary signals defining both the identities of alphanumeric characters occurring in an ordered sequence and the position of each such character within a character group, the steps comprising:\ndefining a memory plane including R storage locations, each of said locations including S bit stages each capable of storing a first state or a second state where S represents the number of different characters that can be identified, said locations storing one or more first states each identifying a particular character;\naddressing one of said R locations corresponding to the position within a character group of each character defined by said binary signals;\naddressing one of said S bit stages within said addressed R location corresponding to the identity of each character defined by said binary signals; and\ngenerating a mismatch signal whenever a bit stage storing a second state is addressed.\n9. A method for detecting the occurrence of a particularly ordered group of R characters in an incoming stream of binary signals defining both the identities of alphanumeric characters occurring in an ordered sequence and the position of each such character within a character group, the steps comprising:\nstoring R sets of S bits each, where S represents the number of different characters capable of being identified;\nselectively identifying a particular character in each set by establishing a unique state in one bit of the S bits thereof;\ncomparing each character in said incoming stream with the character identified by the particular set of S bits corresponding to the position of said character within a character group; and\ngenerating a mismatch signal whenever said comparing step indicates that the character in said incoming stream differs from the character identified by the corresponding set of S bits.\n10. The method of claim 9 wherein said comparing step comprises examining the state of a particular bit within said particular set of S bits which particular bit is dependent upon the identity of the incoming stream character being compared.\n11. In combination with a data source supplying a stream of binary signals representing a stream of characters arranged in character groups wherein said character stream includes S different characters, an apparatus for detecting the occurrence of a character group containing a sequence of R particular characters, said apparatus comprising:\ncharacter register means;\nmeans for loading said character register means with successive characters in said character stream;\ncharacter counter means for counting characters in a character group successively loaded into said character register means;\na search memory means comprised of R sets of S bit storage devices, each device capable of selectively defining either a first or second state;\nfirst addressing means responsive to each different count defined by said character counter means for addressing a different set of storage devices;\nsecond addressing means responsive to each different character loaded into said character register means for addressing a different one of said S bit storage devices; and\nmeans responsive to said first and second addressing means addressing a bit storage device defining a first state for generating a mismatch signal.\n12. The combination of claim 11 further including a word match register capable of defining either a match or mismatch state;\nmeans for establishing a match state in said word match register prior to generating a mismatch signal attributable to addressing said search memory with respect to the first character in each character group; and\nmeans responsive to each generated mismatch signal for switching said word match register to a mismatch state.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3221308A",
        "US3243783A",
        "US3328769A",
        "US3435423A",
        "US3538503A",
        "US3909796A",
        "US3947825A",
        "US4003029A",
        "US4152762A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4780816A",
        "US4785413A",
        "US4812966A",
        "US5008818A",
        "US20030018630A1",
        "US20030177253A1",
        "US20060053295A1",
        "US20060294059A1",
        "US20070067108A1",
        "US20070118500A1",
        "US20070130140A1",
        "US20070260602A1",
        "US20070277036A1",
        "US20070294157A1",
        "US20080086274A1",
        "US20080114725A1",
        "US20090161568A1",
        "US7602785B2",
        "US20090287628A1",
        "US7660793B2",
        "US7716330B2",
        "US20100313139A1",
        "US7921046B2",
        "US7954114B2",
        "US7970722B1",
        "US8762249B2",
        "US9633097B2",
        "US9633093B2",
        "US9822634B2",
        "US9990393B2",
        "US10037568B2",
        "US10121196B2",
        "US10146845B2",
        "US10572824B2",
        "US10650452B2",
        "US10846624B2",
        "US10902013B2",
        "US10942943B2",
        "US11436672B2"
    ],
    "citedby_ftf": []
}