{
    "patent_id": "US-11403526-B2",
    "title": "Decision making for autonomous vehicle motion control ",
    "assignee": "Apple Inc.",
    "publication_date": "2022-08-02",
    "patent_link": "https://patents.google.com/patent/US11403526B2/en",
    "inventors": [
        "Joshua D. Redding",
        "Luke B. Johnson",
        "Martin Levihn",
        "Nicolas F. Meuleau",
        "Sebastian Brechtel"
    ],
    "classifications": [
        "G05D1/0088",
        "G06N3/08",
        "B60W30/00",
        "G05B13/027",
        "G06F16/9027",
        "G06N3/006",
        "G06N3/02",
        "G06N3/045",
        "G06N3/084",
        "G06N5/003",
        "G06N5/01",
        "G06N7/005",
        "G06N7/01",
        "G05D2201/0213"
    ],
    "abstract": "A behavior planner for a vehicle generates a plurality of conditional action sequences of the vehicle using a tree search algorithm and heuristics obtained from one or more machine learning models. Each sequence corresponds to a sequence of anticipated states of the vehicle. At least some of the action sequences are provided to a motion selector of the vehicle. The motion selector generates motion-control directives based on the received conditional action sequences and on data received from one or more sensors of the vehicle, and transmits the directives to control subsystems of the vehicle.",
    "claims": "\n1. A method, comprising:\nobtaining, at a first rate at a motion selector of a vehicle, one or more conditional action sequences generated with respect to the vehicle, wherein individual ones of the conditional action sequences correspond to a respective set of anticipated states of the vehicle;\nidentifying one or more motion-control directives at the motion selector, based at least in part on (a) the one or more conditional action sequences and (b) a set of sensor data obtained at a second rate that exceeds the first rate; and\ntransmitting, by the motion selector, the one or more motion-control directives to one or more motion control subsystems of the vehicle.\n2. The method as recited in claim 1, further comprising:\ngenerating at least one conditional action sequence of the one or more conditional action sequences using at least a Monte Carlo Tree Search algorithm.\n3. The method as recited in claim 1, further comprising:\ngenerating at least one conditional action sequence of the one or more conditional action sequences using at least one machine learning model.\n4. The method as recited in claim 1, further comprising:\ngenerating at least one conditional action sequence of the one or more conditional action sequences using at least an analysis of recorded driver behavior.\n5. The method as recited in claim 1, further comprising:\ngenerating at least one conditional action sequence of the one or more conditional action sequences based at least in part on an anticipated social interaction.\n6. The method as recited in claim 1, further comprising:\ngenerating at least one conditional action sequence of the one or more conditional action sequences based at least in part on statistical analysis of a set of actions taken under a particular set of driving conditions.\n7. The method as recited in claim 1, wherein identifying the one or more action control directives comprises identifying at least one action control directive based at least in part on an occupant comfort consideration.\n8. A system, comprising:\na motion selector of a vehicle implemented at one or more computing devices;\nwherein the motion selector is configured to:\nobtain, at a first rate, one or more conditional action sequences generated with respect to the vehicle, wherein individual ones of the conditional action sequences correspond to a respective set of anticipated states of the vehicle;\nidentify one or more motion-control directives, based at least in part on (a) the one or more conditional action sequences and (b) a set of sensor data obtained at a second rate that exceeds the first rate; and\ntransmit the one or more motion-control directives to one or more motion control subsystems of the vehicle.\n9. The system as recited in claim 8, wherein the motion selector is configured to transmit the one or more motion control directives to the one or more motion control subsystems at a rate which differs from the first rate.\n10. The system as recited in claim 8, wherein at least one motion-control directive of the one or more motion-control directives is identified based at least in part on an emergency response rule.\n11. The system as recited in claim 8, wherein the one or more motion control subsystems comprise one or more of: (a) a braking system, (b) an acceleration system or (c) a turn controller.\n12. The system as recited in claim 8, wherein the motion selector is further configured to:\nprior to identifying the one or more motion control directives,\ndetermine one or more non-drivable regions with respect to the vehicle; and\ngenerate a trajectory for the vehicle based at least in part on analysis of the one or more non-drivable regions.\n13. The system as recited in claim 8, wherein at least conditional action sequence of the one or more conditional action sequence is obtained at the motion selector from a data center.\n14. The system as recited in claim 8, wherein at least one sensor of the one or more sensors comprises one or more of: (a) an externally-oriented camera, (b) an occupant-oriented sensor, (c) a physiological signal detector, (d) a Global Positioning System (GPS) device, (e) a radar devices or (f) a LIDAR device.\n15. One or more non-transitory computer-accessible storage media storing program instructions that when executed on or across one or more processors implements a motion selector of a vehicle, wherein the motion selector is configured to:\nobtain, at a first rate, one or more conditional action sequences generated with respect to the vehicle, wherein individual ones of the conditional action sequences correspond to a respective set of anticipated states of the vehicle;\nidentify one or more motion-control directives, based at least in part on (a) the one or more conditional action sequences and (b) a set of sensor data obtained at a second rate that exceeds the first rate; and\ntransmit the one or more motion-control directives to one or more motion control subsystems of the vehicle.\n16. The one or more non-transitory computer-accessible storage media as recited in claim 15, wherein the motion selector is configured to transmit the one or more motion control directives to the one or more motion control subsystems at a rate which differs from the first rate.\n17. The one or more non-transitory computer-accessible storage media as recited in claim 15, wherein at least one motion-control directive of the one or more motion-control directives is identified based at least in part on an emergency response rule.\n18. The one or more non-transitory computer-accessible storage media as recited in claim 15, wherein the one or more motion control subsystems comprise one or more of: (a) a braking system, (b) an acceleration system or (c) a turn controller.\n19. The one or more non-transitory computer-accessible storage media as recited in claim 15, wherein the motion selector is further configured to:\ngenerate a modified version of a first trajectory based on one or more occupant comfort considerations, wherein the one or more motion-control directives are identified based at least in part on the modified version of the first trajectory.\n20. The one or more non-transitory computer-accessible storage media as recited in claim 15, wherein at least conditional action sequence of the one or more conditional action sequence is obtained at the motion selector from a data center.",
    "status": "Active",
    "citations_own": [
        "CN104484911A",
        "CN104858876A",
        "US20170174221A1"
    ],
    "citations_ftf": [
        "US6763282B2",
        "US20070055431A1",
        "JP5050912B2",
        "TWI526959B",
        "US9047423B2",
        "GB201305067D0",
        "CN104590259B",
        "CN104614187B",
        "US9630619B1",
        "CN105487537B"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "JP6431594B2",
        "JP6663822B2",
        "JP6583185B2",
        "JP2018060268A",
        "JP6728495B2",
        "US10449958B2",
        "US10353390B2",
        "US10518770B2",
        "WO2018170444A1",
        "US10678244B2",
        "US10571916B2",
        "EP3657464A4",
        "US10671349B2",
        "US11157441B2",
        "US11409692B2",
        "US11037063B2",
        "US11010672B1",
        "US10860019B2",
        "US11328214B2",
        "US10713570B1",
        "US10997491B2",
        "US20190113920A1",
        "US10755579B2",
        "US11676069B2",
        "US11669769B2",
        "US11640561B2",
        "US11092962B1",
        "US11727286B2",
        "US10933869B2",
        "US10860018B2",
        "JP6917878B2",
        "US20190185012A1",
        "US11273836B2",
        "US11130497B2",
        "US10831636B2",
        "US11561791B2",
        "US10955851B2",
        "US11107002B2",
        "US11243541B2",
        "US11561541B2",
        "US11625036B2",
        "US11385633B2",
        "US11169536B2",
        "US11467590B2",
        "US10809735B2",
        "US11454939B2",
        "US10740914B2",
        "US10990096B2",
        "US11511745B2",
        "DE102018206712B4",
        "JP7140849B2",
        "US10564643B2",
        "US10745011B2",
        "US10569773B2",
        "EP3802256A2",
        "US11436504B1",
        "CN108803609B",
        "US11215999B2",
        "CN108960432A",
        "US11454975B2",
        "US10884410B2",
        "US11385635B2",
        "US20210312725A1",
        "US10909866B2",
        "JP7199545B2",
        "US11636333B2",
        "JP7048455B2",
        "JP7048456B2",
        "US11562231B2",
        "US10839230B2",
        "US11474529B2",
        "US11631151B2",
        "EP3856596A4",
        "US11068724B2",
        "KR102521657B1",
        "KR20210061461A",
        "US11196678B2",
        "US11494669B2",
        "US11361232B2",
        "US11537811B2",
        "WO2020123999A1",
        "US11610117B2",
        "US10919543B2",
        "US10997461B2",
        "US20200255028A1",
        "US11567514B2",
        "EP3696744A1",
        "US10969470B2",
        "US10956755B2",
        "US11718300B2",
        "US10696222B1",
        "CN114207533A",
        "US20200363800A1",
        "US11763176B1",
        "JP7281720B2",
        "JP6885497B2",
        "JP6913716B2",
        "CA3147125A1",
        "US11634162B2",
        "JP7192738B2",
        "GB202001308D0",
        "WO2022133330A1",
        "CN112041811B",
        "US20210197378A1",
        "RU2751734C2",
        "KR20210087335A",
        "JP2023514905A",
        "US11685398B2",
        "DE102020203296A1",
        "EP3920103A1",
        "CN111645687A",
        "WO2022006418A1",
        "EP3951673A1",
        "CN112004197B",
        "US20220048535A1",
        "GB2615192A",
        "IL302166A",
        "CN112231964B",
        "JP7040589B1",
        "EP4260009A1",
        "EP4264181A1",
        "CN112721929B",
        "US11697429B2",
        "US11733369B2",
        "WO2022212944A1",
        "WO2022256249A1",
        "US20230020503A1",
        "WO2023014731A1",
        "US11608084B1",
        "CN114237303B",
        "US20230174084A1",
        "US20230192074A1",
        "US20230192130A1",
        "CN114399659B",
        "CN114004343B",
        "WO2023154568A1",
        "CN116215584B"
    ]
}