{
    "patent_link": "https://patents.google.com/patent/US5839112A/en",
    "patent_id": "US5839112A",
    "title": "Method and apparatus for displaying and selecting vehicle parts",
    "abstract": "The present invention is an insurance estimating system that presents a number of advances over the prior art. The invention enables an insurance estimator to quickly and accurately estimate damage to various parts of a vehicle. The invention allows the estimator to analyze damage to various \"layers\" of a vehicle. If damage to an outer layer of a vehicle is visible, the insurance estimator will quickly perform a damage estimate using the catastrophe or drill in and drill out features of the invention. Nevertheless, the estimator will be reminded to also look for damage in lower layers of the vehicle that are not readily visible. Conversely, an estimator may begin estimating damage to a vehicle by focusing on the interior of a vehicle which has significant interior damage. The invention then reminds the estimator not to overlook slight damage to outer layers of the vehicle. The catastrophe feature of the invention permits insurance estimators to quickly and accurately perform a large number of damage estimates when damage is primarily to outer layers of the vehicle, such as damage resulting from hail, sand, or flood. The invention allows an insurance estimator to select a desired vehicle part for repair, replacement, or other operations, in a number of quick and convenient ways, and gives the estimator a number of options. The invention also prevents \"double charging\" when there is a possibility that a vehicle part may be selected more than once.",
    "inventors": [
        "James Schreitmueller",
        "Gerhard Blendstrup",
        "Nasser Shariatpanahy"
    ],
    "assignee": "Goldman Sachs Bank USA",
    "classifications": [
        "G06Q30/06",
        "G06Q40/08",
        "G06T17/00",
        "Y02A10/40"
    ],
    "claims": "\n1. In a computer system, a method for estimating damage to a vehicle comprising the steps of:\ndisplaying a plurality of identifiers representing vehicle parts;\nselecting an identifier, said identifier representing a layer of said vehicle parts, said layer comprising an entire exterior sheet of said vehicle; and\nestimating damage to said vehicle using said layer of vehicle parts.\n2. An article of manufacture comprising:\na computer usable medium having computer readable program code embodied therein for estimation damage to a vehicle, the computer readable program code in said article of manufacture comprising:\ncomputer readable program code configured to cause a computer to display a plurality of identifiers representing vehicle parts;\ncomputer readable program code configured to cause said computer to allow selection of an identifier, said identifier representing a layer of said vehicle parts, said layer comprising an entire exterior sheet of said vehicle; and\ncomputer readable program code configured to cause said computer to estimate damage to said vehicle using said layer of vehicle parts.\n3. In a computer system, a method for displaying vehicle parts, said method comprising the steps of:\ndefining layers of vehicle parts, wherein each of said layers is comprised of a plurality of vehicle parts, each layer being located next to at least one other layer, whereby a vehicle is represented by a plurality of said layers;\ndisplaying a first layer of vehicle parts;\nselecting a second layer of vehicle parts adjacent to said first layer of vehicle parts; and\ndisplaying said second layer of vehicle parts.\n4. The method of claim 3 wherein said vehicle is an automobile.\n5. The method of claim 4 wherein an entire outer sheet metal of said automobile is an outermost layer of said plurality of layers.\n6. The method of claim 5 wherein said plurality of layers are arranged in order of distance from said outer sheet metal of said automobile.\n7. The method of claim 5 further comprising the step of selecting said entire entire exterior outer sheet metal of said automobile.\n8. The method of claim 6 wherein said second layer is farther in distance from said outer sheet metal than said first layer.\n9. The method of claim 6 wherein said second layer is closer in distance from said outer sheet metal than said first layer.\n10. The method of claim 3 further comprising the step of selecting a vehicle part from said second layer of vehicle parts.\n11. The method of claim 3 further comprising the step of selecting a vehicle part from said first layer of vehicle parts.\n12. An article of manufacture comprising:\na computer usable medium having computer readable program code embodied therein for displaying vehicle parts, the computer readable program code in said article of manufacture comprising:\ncomputer readable program code configured to cause a computer to define layers of vehicle parts, wherein each of said layers is comprised of a plurality of vehicle parts, each layer being located next to at least one other layer, whereby a vehicle is represented by a plurality of said layers;\ncomputer readable program code configured to cause a computer to display a first layer of vehicle parts;\ncomputer readable program code configured to cause a computer to allow selection of a second layer of vehicle parts adjacent to said first layer of vehicle parts; and\ncomputer readable program code configured to cause a computer to display said second layer of vehicle parts.\n13. The article of manufacture of claim 12 wherein said vehicle is an automobile.\n14. The article of manufacture of claim 13 wherein an entire outer sheet metal of said automobile is an outermost layer of said plurality of layers.\n15. The article of manufacture of claim 14 wherein said plurality of layers are arranged in order of distance from said outer sheet metal of said automobile.\n16. The article of manufacture of claim 14 further comprising computer readable program code configured to cause said computer to select said entire entire exterior outer sheet metal of said automobile.\n17. The article of manufacture of claim 15 wherein said second layer is farther in distance from said outer sheet metal than said first layer.\n18. The article of manufacture of claim 15 wherein said second layer is closer in distance from said outer sheet metal than said first layer.\n19. The article of manufacture of claim 12 further comprising computer readable program code configured to cause said computer to select a vehicle part from said second layer of vehicle parts.\n20. The article of manufacture of claim 12 further comprising computer readable program code configured to cause said computer to select a vehicle part from said first layer of vehicle parts.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4899292A",
        "US5146404A",
        "US5414626A",
        "US5432904A",
        "US5485560A",
        "US5504674A",
        "US5515269A",
        "US5655087A",
        "US5689435A"
    ],
    "citations_ftf": [
        "CA2025201C"
    ],
    "citedby_own": [
        "US5950169A",
        "US6170273B1",
        "US6182048B1",
        "US6229524B1",
        "US6287389B1",
        "US20010056488A1",
        "US20020004729A1",
        "KR20020010348A",
        "US20020035488A1",
        "US6397131B1",
        "US20020065687A1",
        "US20020073000A1",
        "US20020116254A1",
        "US20020128985A1",
        "US6470303B2",
        "US20020167545A1",
        "US20030001903A1",
        "US20030014329A1",
        "US20030050843A1",
        "US6609108B1",
        "US6654726B1",
        "US6728685B1",
        "US6754564B2",
        "US20040188986A1",
        "US20040199542A1",
        "US6810383B1",
        "US20040243423A1",
        "US20040262387A1",
        "US6885981B2",
        "US6895388B1",
        "US6901430B1",
        "US20050125193A1",
        "US20050149376A1",
        "US20050171867A1",
        "US20050216152A1",
        "US20050234912A1",
        "US20050246206A1",
        "US20050251302A1",
        "US6980963B1",
        "US7088378B1",
        "US20060190567A1",
        "US20060242089A1",
        "US20060243788A1",
        "US20070005568A1",
        "US20070027881A1",
        "US7181418B1",
        "EP1794684A1",
        "US20070179868A1",
        "US20070192362A1",
        "US20070203866A1",
        "US20070203799A1",
        "US20070214139A1",
        "US20070226085A1",
        "US20070239322A1",
        "US20070260471A1",
        "US20080082559A1",
        "US7359821B1",
        "US20080140460A1",
        "US20080243556A1",
        "US20080262947A1",
        "US20080270256A1",
        "US20080303691A1",
        "US20080316007A1",
        "US20090030747A1",
        "US20090150200A1",
        "US7571131B1",
        "US20090197228A1",
        "US7617240B2",
        "US20100023352A1",
        "US20100169053A1",
        "US7774210B1",
        "US20100305978A1",
        "US20100305941A1",
        "US20100305977A1",
        "US7899690B1",
        "US20110054944A1",
        "US7933786B2",
        "US7944345B2",
        "US7979382B2",
        "US20110202374A1",
        "US8108231B2",
        "US8126742B2",
        "US20120059676A1",
        "US8200707B2",
        "US8234134B2",
        "WO2012113084A1",
        "US8271309B2",
        "US20130041786A1",
        "US8400296B2",
        "US8443301B1",
        "US8478769B2",
        "US8515786B2",
        "US8543431B2",
        "US8600783B2",
        "US20140019291A1",
        "US8736419B2",
        "US8810385B2",
        "US20140277916A1",
        "US20140344077A1",
        "US8935286B1",
        "US20150032548A1",
        "US8972179B2",
        "US9053363B1",
        "US9230437B2",
        "US20160124586A1",
        "US9384111B2",
        "US9412282B2",
        "US9508200B1",
        "US9527515B2",
        "US9563869B2",
        "CN107194398A",
        "US9858462B2",
        "US9858622B1",
        "US9996885B1",
        "US10002473B1",
        "US10056008B1",
        "US20180315106A1",
        "US10185455B2",
        "US10289651B2",
        "US10304137B1",
        "USRE47442E1",
        "US20190196680A1",
        "US10366352B2",
        "US10380697B1",
        "US10417929B2",
        "US10431097B2",
        "US10431020B2",
        "USRE47686E1",
        "US10548356B2",
        "US10600096B2",
        "US10665040B2",
        "US10706647B2",
        "EP3767574A1",
        "US20220067668A1",
        "US11341853B2",
        "US11386401B2",
        "US11508115B2",
        "US20230113765A1"
    ],
    "citedby_ftf": [
        "US6952741B1",
        "US7340426B1",
        "US6961708B1",
        "US6970844B1",
        "US7693731B1",
        "US7546304B1",
        "US7526487B1",
        "US7356541B1",
        "US7571171B1",
        "US7693844B1",
        "US7363264B1",
        "US7353196B1",
        "US6925468B1",
        "US6826539B2",
        "US8103526B1",
        "US20020072935A1",
        "MXPA02000244A",
        "US7275038B1",
        "US20020049619A1",
        "US20070185743A1",
        "US20080177581A1",
        "JP2002358425A",
        "US20040073434A1",
        "JP2002370630A",
        "US7963899B2",
        "US20070250415A1",
        "US20030055812A1",
        "US7694887B2",
        "CA2470547C",
        "CA2471457C",
        "US7815124B2",
        "US7824029B2",
        "US7885829B2",
        "US20040054558A1",
        "US20040054557A1",
        "US20040054556A1",
        "US7702528B2",
        "US7672860B2",
        "US7676387B2",
        "US7689442B2",
        "US7451148B2",
        "US7804982B2",
        "US7818187B2",
        "US20040103005A1",
        "US7725334B2",
        "US7702529B2",
        "US20040102984A1",
        "US7809586B2",
        "US7792690B2",
        "US7805321B2",
        "US7895063B2",
        "US7660725B2",
        "US7225991B2",
        "JP4403219B2",
        "DE10330447A1",
        "US20050038682A1",
        "US7895064B2",
        "JP2005084801A",
        "US20050102172A1",
        "US20060111944A1",
        "US20050108063A1",
        "US20060059021A1",
        "US10282785B1",
        "US7774217B1",
        "US9875508B1",
        "US9189960B2",
        "US8230362B2",
        "US20080097798A1",
        "US20080281658A1",
        "US8000986B2",
        "US8010389B2",
        "US8010390B2",
        "US8010391B2",
        "US8244558B2",
        "US20100250289A1",
        "US20100198637A1",
        "DE102009018772B4",
        "US10055792B2",
        "US9721301B2",
        "US9442628B2",
        "US20120246082A1",
        "US10580075B1",
        "US8712893B1",
        "US8510196B1",
        "US10572944B1",
        "US10783585B1",
        "US11532048B2",
        "US10430885B1",
        "US11455691B2",
        "US10846627B2",
        "US20140365335A1",
        "US9239991B2",
        "US20160203561A1",
        "US9824453B1",
        "CN107748893A",
        "JP2019200463A",
        "CN109242006A"
    ]
}