{
    "patent_link": "https://patents.google.com/patent/US6115357A/en",
    "patent_id": "US6115357A",
    "title": "Method for pacing data flow in a packet-based network",
    "abstract": "A method for pacing data flows in packet switched networks by arranging data transmission over a period of time based upon a set of ascertainable factors about the underlying transmission link to derive an intersegment transmission interval. The intersegment transmission interval can be used to pace either data packets or acknowledgment packets. The method is especially useful for pacing the transmission of data in a digital data packet communication environment having a plurality of digital packet transmission stations inter-connectable in a data path and employing the Transmission Control Protocol (TCP) suite.",
    "inventors": [
        "Robert L. Packer",
        "Brett D. Galloway"
    ],
    "assignee": "Gen Digital Inc",
    "classifications": [
        "H04L47/22",
        "H04L47/10",
        "H04L47/193",
        "H04L47/263",
        "H04L47/27",
        "H04L47/283",
        "H04L47/323"
    ],
    "claims": "\n1. A method for pacing transmission of data in a packet communication environment having a plurality of transmission stations inter-connectable via a link through a wide area network cloud, said method comprising the steps of:\ndetermining a round trip time for a packet issued by a transmitter and acknowledged by a receiver;\ndetermining number of data segments in a flow control window;\ndetermining a window transmission time as the amount of time required to transmit the data segments of the flow control window;\ncomputing an intersegment transmission interval based on the round trip time, window transmission time and number of segments per flow control window; and during a communication connection\nsuccessively transmitting packets, each containing a data segment, with intersegment transmission intervals between selected packets.\n2. The method of claim 1 wherein the round trip time determining step comprises the steps of:\nsending a first packet to a remote transmission station;\nreceiving a second packet as an acknowledgment from the remote transmission station;\nmeasuring a time delay between the first packet and the second packet; and\ncomputing the round trip time from the time delay.\n3. The method of claim 1 wherein the intersegment transmission interval is randomly varied from its computed value during the transmitting step.\n4. The method of claim 1 wherein the round trip time determining step is effected only once in conjunction with a single connection.\n5. The method according to claim 1 wherein said intersegment transmission interval establishes a delay bound for scheduling of packets for transmission.\n6. The method of claim 1 including a further step of recomputing the intersegment transmission interval upon a change of any one of round trip time, window transmission time and number of segments per window.\n7. The method according to claim 1 wherein any one of said determining steps is effected prior to said first transmitting step.\n8. The method according to claim 1 wherein said round trip time (RTT) determining step includes computation based on an arbitrary rate (AR) according to the relation: (RTT)=(WB)/(AR), where (WB) is number of bits in a flow control window, in order to compute said intersegment transmission interval.\n9. The method according to claim 1 wherein said intersegment transmission interval computing step comprises a computation according to the relation:\nITI=(RTT-WTT)/(NSW-1)\nwhere\nRTT is round trip time,\nWTT is window transmission time,\nNSW is number of segments per window,\nRTT>WTT, and\nNSW>1.\n10. A method for pacing transmission of data in a packet communication environment having a plurality of transmission stations inter-connectable via a link through a wide area network cloud, said method comprising the steps of:\ndetermining a round trip time for a packet issued by a transmitter and acknowledged by a receiver;\ndetermining number of data segments in a flow control window;\ndetermining a window transmission time as the amount of time required to transmit the data segments of the flow control window;\ncomputing an intersegment transmission interval based on the round trip time, window transmission time and number of segments per flow control window; and during a communication connection,\nsuccessively transmitting packets, each containing an acknowledgment of receipt of data, with intersegment transmission intervals between selected packets.\n11. The method of claim 10 wherein the round trip time determining step comprises the steps of:\nsending a first packet to a remote transmission station;\nreceiving a second packet as an acknowledgment from the remote transmission station;\nmeasuring a time delay between the first packet and the second packet; and\ncomputing the round trip time from the time delay.\n12. The method of claim 10 wherein the intersegment transmission interval is randomly varied from its computed value during the transmitting step.\n13. The method of claim 10 wherein the round trip time determining step is effected only once in conjunction with a single connection.\n14. The method according to claim 10 wherein said intersegment transmission interval establishes a delay bound for scheduling of packets for transmission.\n15. The method of claim 10 including a further step of recomputing the intersegment transmission interval upon a change of any one of round trip time, window transmission time and number of segments per window.\n16. The method according to claim 10 wherein any one of said determining steps is effected prior to said first transmitting step.\n17. The method according to claim 10 wherein said round trip time (RTT) determining step includes computation based on an arbitrary rate (AR) according to the relation: (RTT)=(WB)/(AR), where (WB) is number of bits in a flow control window, in order to compute said intersegment transmission interval.\n18. The method according to claim 1 wherein said intersegment transmission internal computing step comprises a computation according to the relation:\nITI=(RTT-WTT)/(NSW-1)\nwhere\nRTT is round trip time,\nWTT is window transmission time,\nNSW is number of segments per window,\nRTT>WTT, and\nNSW>1.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "EP0415843A2",
        "US5063562A",
        "US5491691A",
        "US5748613A",
        "US5764625A",
        "US5787071A",
        "US5870398A",
        "US5918020A",
        "US5959973A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20020089930A1",
        "US20020105914A1",
        "US6438105B1",
        "US6452915B1",
        "US20020172153A1",
        "US20030055949A1",
        "US20030061263A1",
        "US6546009B1",
        "US20030081599A1",
        "US6590885B1",
        "US6594246B1",
        "US6601098B1",
        "US20030162541A1",
        "US6628629B1",
        "US20030189951A1",
        "US6640248B1",
        "US6680922B1",
        "US6687227B1",
        "US20040177153A1",
        "US6820129B1",
        "US6847609B1",
        "US20050018617A1",
        "US6850541B2",
        "US6862622B2",
        "US6959006B1",
        "US20060020702A1",
        "US20060083163A1",
        "US20060174020A1",
        "US20060227708A1",
        "US7236459B1",
        "US20070206623A1",
        "US20070255737A1",
        "US20080104452A1",
        "CN100387003C",
        "US20080148355A1",
        "US20080159156A1",
        "US20080313661A1",
        "US20090037707A1",
        "US20090086729A1",
        "US20090138892A1",
        "US7543052B1",
        "US20090307708A1",
        "US20100005189A1",
        "US20100002893A1",
        "US20100037035A1",
        "US20100091699A1",
        "US7822871B2",
        "US7860964B2",
        "US20100332678A1",
        "US7869366B1",
        "US7945693B2",
        "US7949779B2",
        "US7953888B2",
        "US7958274B2",
        "US7970875B1",
        "US8023950B2",
        "US20110238949A1",
        "US8032899B2",
        "US8081598B2",
        "US8150407B2",
        "US20120128000A1",
        "US8365186B2",
        "US8391249B2",
        "US8429211B1",
        "US8477592B2",
        "US20130179620A1",
        "US8526966B2",
        "US8543901B1",
        "US8548387B2",
        "US8549135B1",
        "US8565120B2",
        "US8576894B2",
        "US20130339407A1",
        "US8689228B2",
        "US8699452B2",
        "US8924466B2",
        "US8930538B2",
        "US9021112B2",
        "US9065839B2",
        "US9250948B2",
        "US9317637B2",
        "US9338227B2",
        "US9391921B1",
        "US20160285767A1",
        "US9621949B2",
        "US9762692B2",
        "US9773012B2",
        "US9804928B2",
        "US9811532B2",
        "US9954759B2",
        "US9998379B2",
        "US10009420B2",
        "US10924573B2",
        "US11005663B2",
        "WO2023195171A1",
        "US20230327998A1"
    ],
    "citedby_ftf": [
        "KR100408525B1",
        "US8964655B2",
        "FR2925249B1"
    ]
}