{
    "patent_id": "US-11709908-B2",
    "title": "Economic optimization for product search relevancy ",
    "assignee": "Paypal, Inc.",
    "publication_date": "2023-07-25",
    "patent_link": "https://patents.google.com/patent/US11709908B2/en",
    "inventors": [
        "Eric Noel Billingsley",
        "Raghav Gupta",
        "Randall Scott Shoup",
        "Neelakantan Sundaresan"
    ],
    "classifications": [
        "G06F16/958",
        "G06F16/9577",
        "G06N20/00",
        "G06N5/022",
        "G06Q10/06375",
        "G06Q30/02",
        "G06Q40/06"
    ],
    "abstract": "In one embodiment, a method is illustrated as including defining a set of perspective objects capable of being placed onto a modified web page, monitoring parameters of a web page, the parameters including a number of times a current object is executed on the web page, using an Artificial Intelligence (AI) algorithm to determine a perspective object with a preferred Return On Investment (ROI), and selecting the perspective object to be placed onto the modified web page.",
    "claims": "\n1. A system, comprising:\na processor; and\na memory storing executable instructions that, when executed by the processor, cause the processor to perform operations comprising:\nreceiving a set of parsed content;\nupdating a decision tree based on the received set of parsed content to incorporate a new set of search queries corresponding to the set of parsed content;\ngenerating an optimization analysis for each of a set of artificial intelligence (AI) algorithms contained within an AI library, each of the set of AI algorithms being used to optimize one of a first set of traffic optimizer modules;\nmodifying the updated decision tree by assigning each of the set of parsed content and a corresponding one of the first set of traffic optimizer modules as a node in the decision tree;\ntraversing the modified decision tree to select a second set of traffic optimizer modules; and\nproviding the second set of traffic optimizer modules for use to generate content for display as an optimized web page for a corresponding content request.\n2. The system of claim 1, wherein the parsed content is produced by parsing a set of content requests into constituent parts.\n3. The system of claim 1, wherein the decision tree is updated with tracking data relating to at least one of selections or search queries performed on a web page.\n4. The system of claim 1, wherein the operations further comprise storing the updated decision tree in a decision tree data store for subsequent use.\n5. The system of claim 1, wherein nodes of the decision tree are assigned based on the one or more AI algorithms by making procedure calls to the AI library to generate an optimization analysis for each of the one or more AI algorithms or for a combination of the one or more AI algorithms contained within the AI library.\n6. The system of claim 1, wherein the one or more AI algorithms optimize the parsed content for each of the traffic optimizer modules.\n7. The system of claim 6, wherein the parsed content associated with one of the traffic optimizer modules is represented as a particular node in the decision tree.\n8. The system of claim 7, wherein nodes of the decision tree are organized such that a shortest path to a highest return on investment (ROI) value is created.\n9. The system of claim 1, wherein at least one of the AI algorithms is one of a deterministic or stochastic algorithm.\n10. A non-transitory computer-readable medium storing computer-executable instructions that, when executed by one or more processors of a computer system, cause the computer system to perform operations comprising:\nreceiving a set of parsed content;\nupdating a decision tree based on the received set of parsed content to incorporate a new set of search queries corresponding to the set of parsed content;\ngenerating an optimization analysis for each of a set of artificial intelligence (AI) algorithms contained within an AI library, each of the set of AI algorithms being used to optimize one of a first set of traffic optimizer modules;\nmodifying the updated decision tree by assigning each of the set of parsed content and a corresponding one of the first set of traffic optimizer modules as a node in the decision tree;\ntraversing the modified decision tree to select a second set of traffic optimizer modules; and\nproviding the second set of traffic optimizer modules for use to generate content for display as an optimized web page for a corresponding content request.\n11. The non-transitory computer-readable medium of claim 10, wherein the parsed content is produced by parsing a set of content requests into constituent parts.\n12. The non-transitory computer-readable medium of claim 10, wherein the decision tree is updated with tracking data relating to at least one of selections or search queries performed on a web page.\n13. The non-transitory computer-readable medium of claim 10, wherein the operations further comprise storing the updated decision tree in a decision tree data store for subsequent use.\n14. The non-transitory computer-readable medium of claim 10, wherein optimal node organization for nodes in the decision tree is determined using the one or more AI algorithms by making procedure calls to an AI library to generate an optimization analysis for each of the one or more AI algorithms or for a combination of the one or more AI algorithms contained within the AI library.\n15. A method, comprising:\nreceiving, by a computer system, a set of parsed content;\nupdating, by the computer system, a decision tree based on the received set of parsed content to incorporate a new set of search queries corresponding to the set of parsed content;\ngenerating, by the computer system, an optimization analysis for each of a set of artificial intelligence (AI) algorithms contained within an AI library, each of the set of AI algorithms being used to optimize one of a first set of traffic optimizer modules;\nmodifying, by the computer system, the updated decision tree by assigning each of the set of parsed content and a corresponding one of the first set of traffic optimizer modules as a node in the decision tree;\ntraversing, by the computer system, the modified decision tree to select a second set of traffic optimizer modules; and\nproviding, by the computer system, the second set of traffic optimizer modules for use to generate content for display as an optimized web page for a corresponding content request.\n16. The method of claim 15, wherein the parsed content is produced by parsing a set of content requests into constituent parts.\n17. The method of claim 15, wherein the decision tree is updated with tracking data relating to at least one of selections or search queries performed on a web page.\n18. The method of claim 15, further comprising:\nstoring the updated decision tree in a decision tree data store for subsequent use.\n19. The method of claim 15, wherein nodes of the decision tree are assigned based on the one or more AI algorithms by making procedure calls to the AI library to generate an optimization analysis for each of the one or more AI algorithms or for a combination of the one or more AI algorithms contained within the AI library.",
    "status": "Active",
    "citations_own": [
        "US5535382A",
        "US5572643A",
        "US5778363A",
        "US5873001A",
        "US5963910A",
        "US5968125A",
        "US6185616B1",
        "US6185614B1",
        "US6205456B1",
        "US6304904B1",
        "GB2366033A",
        "US6393389B1",
        "US20020069190A1",
        "US6438579B1",
        "US6466970B1",
        "US6490577B1",
        "US20020186237A1",
        "US20020198882A1",
        "US20030014539A1",
        "US20030014428A1",
        "US20030014501A1",
        "GB2377773A",
        "US20030018514A1",
        "US20030028527A1",
        "US20030033299A1",
        "US20030040850A1",
        "US20030144868A1",
        "US20030195877A1",
        "US20030208578A1",
        "US20030216930A1",
        "US6662215B1",
        "US6714929B1",
        "US20040068495A1",
        "US20040098385A1",
        "US6785676B2",
        "US20040181604A1",
        "US20040190448A1",
        "US20050033771A1",
        "US20050039136A1",
        "US20050097204A1",
        "US6892238B2",
        "US6901399B1",
        "US6907566B1",
        "US20050137939A1",
        "US20050144065A1",
        "US20050144064A1",
        "US20050149390A1",
        "US20050160107A1",
        "US6925442B1",
        "US20050192992A1",
        "US20050288954A1",
        "US20060026067A1",
        "US20060031340A1",
        "US20060036400A1",
        "US20060074751A1",
        "US20060074864A1",
        "US7028001B1",
        "US20060095346A1",
        "US20060161534A1",
        "US20060242129A1",
        "US20060253345A1",
        "US20060259371A1",
        "US20060277097A1",
        "US20060277211A1",
        "US20060277198A1",
        "US20070005417A1",
        "US20070002377A1",
        "US20070038508A1",
        "US20070038516A1",
        "US20070050268A1",
        "US7194454B2",
        "US20070073585A1",
        "US20070088609A1",
        "US20070100992A1",
        "US20070100803A1",
        "US20070150353A1",
        "US20070233565A1",
        "US20070239542A1",
        "US20070265923A1",
        "US20070266923A1",
        "US20070271238A1",
        "US20070288433A1",
        "US20070288950A1",
        "US20070291739A1",
        "US20080010142A1",
        "US20080015877A1",
        "US20080015933A1",
        "US20080033801A1",
        "US20080033799A1",
        "US20080033804A1",
        "US20080033802A1",
        "US20080033803A1",
        "US20080033800A1",
        "US7340428B1",
        "US7346668B2",
        "US7349890B1",
        "US20080127249A1",
        "US7428504B2",
        "US20080242280A1",
        "US20080256056A1",
        "US20080270412A1",
        "US20080270510A1",
        "US20080275863A1",
        "US20080275980A1",
        "US20080275770A1",
        "US20080294621A1",
        "WO2009002549A1",
        "US20090002549A1",
        "US7475067B2",
        "US20090019019A1",
        "US20090171764A1",
        "US7594189B1",
        "US7660581B2",
        "US8631092B2",
        "US8782200B2",
        "US9432468B2"
    ],
    "citations_ftf": [
        "JPH1145598A",
        "KR100558765B1",
        "US20050039134A1"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US9819561B2",
        "US20060015390A1",
        "US8868448B2",
        "US9432468B2",
        "US8738732B2",
        "US7814112B2",
        "US20090006179A1",
        "US10295969B2",
        "US9130402B2",
        "US8805552B2",
        "US8890505B2",
        "US9177323B2",
        "US8806239B2",
        "US8965786B1",
        "US8762313B2",
        "US8260846B2",
        "US8805844B2",
        "US20130297537A1",
        "US10410117B2",
        "US8533041B2",
        "US20100205024A1",
        "US9892417B2",
        "US10198414B2",
        "US9846898B2",
        "EP2556449A1",
        "CN102279856B",
        "US8983935B2",
        "US9355109B2",
        "US8924314B2",
        "US8918465B2",
        "US9350598B2",
        "US9223890B2",
        "US9092167B2",
        "US8862279B2",
        "US9225173B2",
        "US8751036B2",
        "US8195799B1",
        "US20130163808A1",
        "CN104011756A",
        "CN103218719B",
        "US8943002B2",
        "US8805941B2",
        "US9092572B2",
        "US9563336B2",
        "US9672196B2",
        "US9207698B2",
        "US9461471B2",
        "US9465398B2",
        "US9563215B2",
        "US10475138B2",
        "US10861112B2",
        "US8983669B2",
        "US9513648B2",
        "US8849715B2",
        "US11386442B2",
        "US10116560B2",
        "AU2016270937B2",
        "WO2018034989A1",
        "US20190065932A1",
        "US11276071B2",
        "US11200577B2",
        "US10592077B1",
        "US20220335411A1",
        "US11314833B1"
    ]
}