{
    "patent_link": "https://patents.google.com/patent/US20030014331A1/en",
    "patent_id": "US20030014331A1",
    "title": "Affiliate marketing search facility for ranking merchants and recording referral commissions to affiliate sites based upon users' on-line activity",
    "abstract": "Providing a search facility to a consumer that may be accessed by the consumer through a participating affiliate marketing web site. The search facility conducts searches of databases that include both merchants that pay a cost-per-action commission to the search facility based upon actual sales to consumers introduced to the merchant by the search facility, and merchants that pay a cost-per-click commission based upon the number of accesses of the merchant's site from the search facility. The search facility ranks the merchants for display in search results based upon the commissions paid and possibly other factors. The search facility also tracks sales-based commissions and can pay other types of commissions based upon or in proportion to the sales based commissions.",
    "inventors": [
        "Erik Simons"
    ],
    "assignee": "EROSSA Ltd",
    "classifications": [
        "G06Q30/02",
        "G06Q30/0625",
        "G06Q30/0641"
    ],
    "claims": "\n1. A method for ranking and displaying search results, comprising:\nreceiving a search query;\nperforming a search, using the query, to identify merchants relating to the query;\nobtaining results of the search including the identified merchants;\nranking the results based upon activity relating to the identified merchants; and\ndisplaying the results based upon the ranking.\n2. The method of claim 1 wherein the receiving step includes receiving the query transmitted from an affiliate network site.\n3. The method of claim 2 wherein the receiving step includes receiving an identification of the affiliate network site with the query.\n4. The method of claim 3, further including storing an indication of the affiliate network site associated with information relating to the query.\n5. The method of claim 1 wherein the performing step includes searching one or more databases specifying identifications of selected merchants.\n6. The method of claim 5 wherein the performing step includes identifying merchants offering goods or services relating to the search query.\n7. The method of claim 1 wherein the ranking step includes determining for the merchants commissions paid based upon a cost-per-action ratio.\n8. The method of claim 7 wherein the displaying step includes displaying identifications of the merchants in decreasing order of the commissions paid.\n9. The method of claim 1 wherein the ranking step includes determining for the merchants commissions paid based upon a cost-per-click ratio.\n10. The method of claim 5 wherein the ranking step includes determining which one of the databases was a source for the identified merchants and ranking the merchants based upon the determined source databases.\n11. The method of claim 1 wherein the displaying step includes displaying an identification of the merchants linked with network addresses for the merchants.\n12. The method of claim 1, further including:\nreceiving from a user selection of an identified merchant within the displayed results; and\ntransferring the user's network connection to the selected merchant's network site.\n13. The method of claim 12, further including associating an identification of the selected merchant with the query and storing the identification and the associated query.\n14. The method of claim 12, further including recording an indication of the selected merchant.\n15. The method of claim 12, further including recording an indication of a purchase made through the selected merchant's network site.\n16. The method of claim 5, further including retrieving information from the databases for use in performing the ranking.\n17. The method of claim 2, further including recording an indication of a commission for the affiliate network site based upon a purchase made through the search.\n18. The method of claim 17 wherein the recording step includes recording as the commission a percentage of an amount for the purchase.\n19. The method of claim 18 wherein the recording step includes selecting a value of the percentage based upon the search query.\n20. The method of claim 2, further including recording an indication of a commission for the affiliate network site based upon merchants accessed through the search.\n21. The method of claim 20 wherein the recording step includes recording as the commission a percentage of revenue corresponding to the access and determining the percentage based upon another type of commission.\n22. The method of claim 2, further including recording an indication of a commission for the affiliate network site based upon the search query.\n23. The method of claim 2 wherein the receiving step includes receiving the query as entered into a search section on the affiliate network site, the search section having a particular content related to the affiliate network site.\n24. A method for presenting a search section for use in searching and ranking merchants for display, comprising:\ndisplaying on an affiliate network site a search section having content relating to the affiliate network site and a section for receiving a search query;\nreceiving from a user, via a network connection for the user, a submission of the search query entered into search section; and\ntransferring the user's network connection and search query to a system server that performs searches to identify merchants relating to the search query and displays results of the searches ranked based upon activity relating to the identified merchants.\n25. The method of claim 24 wherein the transferring step includes transmitting to the system server an identification of the affiliate network site.\n26. The method of claim 24 wherein the displaying step includes presenting within the search section text in a language relating to the affiliate network site.\n27. The method of claim 24 wherein the displaying step includes selecting for presentation a search section among a plurality of configured search sections based upon particular criteria.\n28. The method of claim 24 wherein the displaying step includes selecting a location for presentation of the search section within the affiliate network site based upon particular criteria.\n29. The method of claim 24, further including receiving an indication of a commission for the affiliate network site based upon on-line activity relating to purchases made by the user associated with transferring the user's connection.\n30. The method of claim 24, further including receiving an indication of a commission for the affiliate network site based upon on-line activity relating to merchants selected by the user associated with transferring the user's connection.\n31. An apparatus for ranking and displaying search results, comprising:\na receive module for receiving a search query;\na perform module for performing a search, using the query, to identify merchants relating to the query;\na results module for obtaining results of the search including the identified merchants;\na ranking module for ranking the results based upon activity relating to the identified merchants; and\na display module for displaying the results based upon the ranking.\n32. The apparatus of claim 31 wherein the receive module includes a module for receiving the query transmitted from an affiliate network site.\n33. The apparatus of claim 32 wherein the receive module includes a module for receiving an identification of the affiliate network site with the query.\n34. The apparatus of claim 33, further including a module for storing an indication of the affiliate network site associated with information relating to the query.\n35. The apparatus of claim 31 wherein the perform module includes a module for searching one or more databases specifying identifications of selected merchants.\n36. The apparatus of claim 35 wherein the perform module includes a module for identifying merchants offering goods or services relating to the search query.\n37. The apparatus of claim 31 wherein the ranking module includes a module for determining commissions paid based upon a cost-per-action ratio.\n38. The apparatus of claim 37 wherein the display module includes a module for displaying identifications of the merchants in decreasing order of the commissions paid.\n39. The apparatus of claim 31 wherein the ranking module includes a module for determining commissions paid based upon a cost-per-click ratio.\n40. The apparatus of claim 35 wherein the ranking module includes a module for determining which one of the databases was a source for the identified merchants and ranking the merchants based upon the determined source databases.\n41. The apparatus of claim 31 wherein the display module includes a module for displaying an identification of the merchants linked with network addresses for the merchants.\n42. The apparatus of claim 31, further including:\na module for receiving from a user selection of an identified merchant within the displayed results; and\na module for transferring the user's network connection to the selected merchant's network site.\n43. The apparatus of claim 42, further including a module for associating an identification of the selected merchant with the query and storing the identification and the associated query.\n44. The apparatus of claim 42, further including a module for recording an indication of the selected merchant.\n45. The apparatus of claim 42, further including a module for recording an indication of a purchase made through the selected merchant's network site.\n46. The apparatus of claim 45, further including a module for retrieving information from the databases for use in performing the ranking.\n47. The apparatus of claim 42, further including a module for recording an indication of a commission for the affiliate network site based upon a purchase made through the search.\n48. The apparatus of claim 47 wherein the recording module includes a module for recording as the commission a percentage of an amount for the purchase.\n49. The apparatus of claim 48 wherein the recording module includes a module for selecting a value of the percentage based upon the search query.\n50. The apparatus of claim 32, further including a module for recording an indication of a commission for the affiliate network site based upon merchants accessed through the search.\n51. The apparatus of claim 50 wherein the recording module includes a module for recording as the commission a percentage of revenue corresponding to the access and determining the percentage based upon another type of commission.\n52. The apparatus of claim 32, further including a module for recording an indication of a commission for the affiliate network site based upon the search query.\n53. The apparatus of claim 32 wherein the receive module includes a module for receiving the query as entered into a search section on the affiliate network site, the search section having a particular content related to the affiliate network site.\n54. An apparatus for presenting a search section for use in searching and ranking merchants for display, comprising:\na display module for displaying on an affiliate network site a search section having content relating to the affiliate network site and a section for receiving a search query;\na receive module for receiving from a user, via a network connection for the user, a submission of the search query entered into search section; and\na transfer module for transferring the user's network connection and search query to a system server that performs searches to identify merchants relating to the search query and displays results of the searches ranked based upon activity relating to the identified merchants.\n55. The apparatus of claim 54 wherein the transfer module includes a module for transmitting to the system server an identification of the affiliate network site.\n56. The apparatus of claim 54 wherein the display module includes a module for presenting within the search section text in a language relating to the affiliate network site.\n57. The apparatus of claim 54 wherein the display module includes a module for selecting for presentation a search section among a plurality of configured search sections based upon particular criteria.\n58. The apparatus of claim 54 wherein the display module includes a module for selecting a location for presentation of the search section within the affiliate network site based upon particular criteria.\n59. The apparatus of claim 54, further including a module for receiving an indication of a commission for the affiliate network site based upon on-line activity relating to purchases made by the user associated with transferring the user's connection.\n60. The apparatus of claim 54, further including a module for receiving an indication of a commission for the affiliate network site based upon on-line activity relating to merchants selected by the user associated with transferring the user's connection.\n61. A screen for use in electronically displaying a search section for use in receiving a search query and linking with a system server that performs searches, comprising:\na screen representing an affiliate network site for display on a display device; and\na search section in the screen having content relating to the affiliate network site and having a section for receiving a search query from a user via a network connection,\nwherein the search section includes an associated electronic link with a system server that performs searches to identify merchants relating to the search query and displays results of the searches ranked based upon activity relating to the identified merchants, and wherein electronic link is used to transfer the user's network connection and search query to the system server.\n62. The screen of claim 61 wherein the search section includes text in a language relating to the affiliate network site.\n63. The screen of claim 61 wherein the search section is presented within a location in the screen based upon particular criteria.\n64. The screen of claim 61 wherein the electronic link includes an embedded network address for the system server.",
    "status": "Abandoned",
    "citations_own": [
        "US6006197A",
        "US20030149938A1"
    ],
    "citations_ftf": [
        "US5895454A",
        "US6029141A",
        "EP1062602B8",
        "US6421675B1"
    ],
    "citedby_own": [
        "US20030033292A1",
        "US20030046161A1",
        "US20030216930A1",
        "US20030220918A1",
        "US20040158528A1",
        "US20040190448A1",
        "US20040193507A1",
        "US20050097107A1",
        "US20050114198A1",
        "US20050154718A1",
        "US20050171846A1",
        "US20050177844A1",
        "US20050209929A1",
        "US20050216547A1",
        "US20050234775A1",
        "EP1591920A1",
        "US20050256848A1",
        "US20060095336A1",
        "US20060100988A1",
        "US20060106665A1",
        "US20060106711A1",
        "US20060122889A1",
        "US20060190354A1",
        "US20060200377A1",
        "US20060206584A1",
        "US20060206517A1",
        "US20060206349A1",
        "DE102005025514A1",
        "US20070043879A1",
        "US20070050245A1",
        "WO2007030513A2",
        "US20070124280A1",
        "US20070179942A1",
        "US20070288312A1",
        "US20080021764A1",
        "US20080086384A1",
        "US20080154678A1",
        "US7444327B2",
        "US20080270551A1",
        "US20080270474A1",
        "US20080270473A1",
        "US20080270234A1",
        "US20080270476A1",
        "US20080270552A1",
        "US20080270416A1",
        "US20080294499A1",
        "US20090030772A1",
        "US20090132500A1",
        "US20090157523A1",
        "US20090164275A1",
        "US20090177527A1",
        "US20090216670A1",
        "US20090248493A1",
        "US20090276419A1",
        "US20090299820A1",
        "US7630987B1",
        "US20100010887A1",
        "US7668748B1",
        "US7698281B2",
        "US7730532B1",
        "US20100217667A1",
        "US7818207B1",
        "US20100287008A1",
        "US7844493B1",
        "US20100331075A1",
        "US20100331064A1",
        "US20110010367A1",
        "US20110082730A1",
        "US20110231287A1",
        "WO2011139491A2",
        "WO2012019228A1",
        "US20120066056A1",
        "AT509529B1",
        "US20120150598A1",
        "US20120185332A1",
        "US20120253904A1",
        "US8285737B1",
        "EP2585944A1",
        "US20130198650A1",
        "US20130304571A1",
        "US8595066B1",
        "US8819009B2",
        "US8914383B1",
        "US20150178771A1",
        "US20160012365A1",
        "US9477574B2",
        "US9697500B2",
        "US20170249609A1",
        "US10007917B2",
        "US10096022B2",
        "US20190147091A1",
        "US10318941B2",
        "US10438176B2",
        "US10500481B2",
        "US10726072B2",
        "US11216468B2",
        "US11315167B1",
        "US20220343315A1"
    ],
    "citedby_ftf": [
        "US7130819B2",
        "US7844589B2",
        "WO2007048249A2",
        "WO2008019711A1"
    ]
}