{
    "patent_link": "https://patents.google.com/patent/US20070280298A1/en",
    "patent_id": "US20070280298A1",
    "title": "Reducing channel change delays",
    "abstract": "Technology which facilitates a reduction in time of the presentation of video content after a viewer changes channels is described. Frames of a video stream associated with a channel are analyzed to identify locations of access points in the video stream prior to relaying the video stream to a presentation device. Information indicating the locations of access points is stored. The video stream is then time shifted on a continuous basis and is transmitted to the presentation device which made the request for as long as the presentation device remains tuned to the channel corresponding to the request. A first available frame on or before an access point of the time shifted video stream is selected based on the stored information, which is used to commence the transmission of the time shifted video to the presentation device, which facilitates a more immediate presentation of video content.",
    "inventors": [
        "John P. Hearn",
        "Kim N. Matthews",
        "Lesley Jen-Yuan Wu"
    ],
    "assignee": "Alcatel Lucent SAS",
    "classifications": [
        "H04N7/17318",
        "H04N21/23418",
        "H04N21/2625",
        "H04N21/4384",
        "H04N21/6581",
        "H04N5/50"
    ],
    "claims": "\n1. A method for reducing channel change delays, comprising:\nreceiving a channel change request;\ntransporting a video stream associated with the channel change request;\nidentifying at least one access point in the video stream;\ntime shifting the video stream resulting in a time shifted video stream;\ntransmitting the time shifted video stream to a presentation device on a continuous basis without returning to the video stream; and\nselecting a frame of the time shifted video stream on or before the access point to commence the transmission of the time shifted video stream.\n2. The method as recited in claim 1, wherein time shifting the video stream includes storing the video stream in random access memory prior to transmission.\n3. The method as recited in claim 1, wherein identifying at least one access point in the video stream includes analyzing frames of the video stream.\n4. The method as recited in claim 1, wherein identifying at least one access point in the video stream includes analyzing frames of the video stream and storing information associated with the identification of the at least one access point.\n5. The method as recited in claim 1, further comprising inserting information associated with the identification of at least one access point within the time shifted video stream.\n6. The method as recited in claim 1, further comprising inserting information associated with the identification of at least one access point within a media type packet of the time shifted video stream.\n7. The method as recited in claim 1, further comprising storing information associated with the identification of at least one access point in a message packet which is separate from the time shifted video stream.\n8. The method as recited in claim 1, wherein the channel change request is received from a presentation device.\n9. The method as recited in claim 1, further comprising discontinuing the transmitting of the time shifted video stream when no presentation devices remain tuned to a channel associated with the received channel change request.\n10. A computer-readable medium having computer-executable instructions that, when executed by a computer perform a method comprising: analyzing a video stream before the video stream is relayed to a presentation device; identifying where at least one access point in the video stream is located; and forwarding information indicating where the at least one access point is located based upon the identification.\n11. A medium as recited in claim 10, further comprising:\ntime shifting the video stream resulting in a time shifted video stream;\ntransmitting the time shifted video stream to a presentation device on a continuous basis without returning to the video stream; and\nselecting a frame of the time shifted video stream on or before the at least one access point, wherein the selection of the frame is based upon the information indicating where the at least one access point is located; and\ncommencing the transmission of the time shifted video stream to the presentation device with the selected frame.\n12. A medium as recited in claim 10, further comprising inserting the message into the video stream after the analysis.\n13. A medium as recited in claim 11, further comprising receiving a channel change request and transmitting a time shifted video stream associated with the channel change request.\n14. A medium as recited in claim 10, further comprising sending the message out of band from the video stream after the analysis.\n15. A system for reducing delay-associated with the initial presentation of video content after a channel change request, comprising:\nmeans for analyzing frames of a video stream associated with a channel to identify locations of access points in the video stream prior to relaying the video stream to a presentation device;\nmeans for storing information indicating the locations of the access points;\nmeans for time shifting the video stream;\nmeans for transmitting the time shifted video stream to a presentation device on a continuous basis for so long as the presentation device remains tuned to the channel corresponding to the channel change request; and\nmeans for selecting the first available frame on or before an access point to commence transmission of the time shifted video stream to the presentation device, wherein the selection is based on the stored information.\n16. The system as recited in claim 15, wherein the means for analyzing frames of a video stream includes at least one processor.\n17. The system as recited in claim 15, wherein the means for transmitting the time shifted video stream to a presentation device further includes one or multiple output ports configured to transmit multiple copies of the time shifted video stream to multiple presentation devices.\n18. The system as recited in claim 15, wherein the information is stored in-band with the time shifted video stream.\n19. The system as recited in claim 15, wherein the information is stored out-of-band from the time shifted video stream.\n20. The system as recited in claim 15, wherein the means for analyzing frames of a video stream and the means for transmitting the time shifted video are located remotely from each other in separate communication nodes of a video content distribution network.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US20050183120A1",
        "US20060117359A1",
        "US20070107026A1",
        "US20070204320A1",
        "US20070214490A1",
        "US20070277219A1",
        "US20080059724A1",
        "US7793329B2",
        "US20110162024A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20080310518A1",
        "US20090010273A1",
        "US20090052450A1",
        "US20090077581A1",
        "US20090074377A1",
        "US20090160933A1",
        "US20090198827A1",
        "US20100034201A1",
        "US20100046604A1",
        "US20100138886A1",
        "US20100319029A1",
        "US20120084826A1",
        "US20120124606A1",
        "US8249141B1",
        "US20120249887A1",
        "CN103152627A",
        "US8752092B2",
        "US9003436B2",
        "US9247312B2",
        "US9357244B2",
        "US9519728B2",
        "US9531760B2",
        "US9621522B2",
        "US9621939B2",
        "US9635421B2",
        "WO2017078443A1",
        "US9712890B2",
        "US9866878B2",
        "US9883223B2",
        "US9906838B2",
        "US9967305B2",
        "US10028025B2",
        "US10051304B2",
        "CN108604252A",
        "US10116676B2",
        "US10136172B2",
        "US10148623B2",
        "US10178435B1",
        "US10212486B2",
        "US10225299B2",
        "US10250932B2",
        "US10264255B2",
        "US10278008B2",
        "US10313755B2",
        "US10339281B2",
        "US10397292B2",
        "US10404758B2",
        "US10437896B2",
        "US10498795B2",
        "US10586023B2",
        "US10602231B2",
        "US20200099764A1",
        "US10652607B2",
        "US10687095B2",
        "US10863238B2",
        "US10878065B2",
        "US10958629B2",
        "US10958972B2",
        "US11032518B2",
        "US11076189B2",
        "USRE48761E1",
        "US11159851B2",
        "US11212593B2",
        "US11323768B2",
        "US11381549B2",
        "US20220224862A1",
        "US11457054B2",
        "US11552999B2",
        "US11792462B2"
    ],
    "citedby_ftf": [
        "US8813141B2",
        "GB2490659A",
        "TW201338528A"
    ]
}