{
    "patent_id": "US-7912801-B2",
    "title": "Method and apparatus to define a ruleflow ",
    "assignee": "Red Hat, Inc.",
    "publication_date": "2011-03-22",
    "patent_link": "https://patents.google.com/patent/US7912801B2/en",
    "inventors": [
        "Mark Proctor",
        "Kris Verlaenen"
    ],
    "classifications": [],
    "abstract": "Some embodiments of a method and an apparatus to define ruleflows for a rule engine have been presented. In one embodiment, a graphical user interface (GUI) is generated to allow a user to graphically specify an execution order of some rules. Then the rule engine is used to execute the rules according to the execution order. The rules may include one or more rule sets, where each rule set contains one or more rules.",
    "claims": "\n1. A computer-implemented method comprising:\ngenerating a graphical user interface (GUI) to allow a user to enter graphical information to specify an execution order of a plurality of rules; and\nexecuting the plurality of rules using a rule engine according to the execution order.\n2. The method of claim 1, wherein generating the GUI comprises:\ngenerating an editor having one or more user interface (UI) controls to allow the user to create a flowchart defining the execution order; and\ndisplaying the flowchart to the user via the editor.\n3. The method of claim 1, further comprising:\nsaving the graphical information in a ruleflow file, wherein the graphical information is associated with a flowchart created with the GUI;\ncreating a model containing the execution order corresponding to the ruleflow file; and\nproviding the model to the rule engine.\n4. The method of claim 1, further comprising:\nloading a model of the execution order to a rulebase of the rule engine;\nplacing an activated rule into a corresponding ruleflow-group of a plurality of ruleflow-groups;\nselecting one of the plurality of ruleflow-groups according to the model;\nplacing all activated rules in the selected one of the plurality of ruleflow-groups onto an agenda of the rule engine; and\nexecuting rules in the agenda.\n5. The method of claim 1, further comprising:\nallowing the user to specify at least two of the plurality of rules to be executed in parallel by the rule engine.\n6. The method of claim 1, further comprising:\nallowing the user to specify at least two of the plurality of rules to be executed sequentially by the rule engine.\n7. The method of claim 1, further comprising:\nallowing the user to specify at least one of the plurality of rules to be executed by the rule engine only if a predetermined condition occurs.\n8. An apparatus comprising:\na graphical user interface (GUI) module to generate a GUI to allow a user to enter graphical information to specify an execution order of a plurality of rules; and\na rule engine coupled to the GUI module to execute the plurality of rules according to the execution order.\n9. The apparatus of claim 8, wherein the GUI module comprises:\nan editor to allow the user to create a flowchart to define the execution order; and\na visualization module to present the flowchart to the user.\n10. The apparatus of claim 8, further comprising:\na storage device to store a ruleflow file containing the graphical information, wherein the graphical information is associated with a flowchart created with the GUI; and\na model creating module to create a model containing the execution order corresponding to the ruleflow file, wherein the model is accessible by the rule engine.\n11. The apparatus of claim 8, wherein the GUI comprises a user interface control to allow the user to specify at least two of the plurality of rules to be executed in parallel by the rule engine.\n12. The apparatus of claim 8, wherein the GUI comprises a user interface control to allow the user to specify at least two of the plurality of rules to be executed sequentially by the rule engine.\n13. The apparatus of claim 8, wherein the GUI comprises a user interface control to allow the user to specify at least one of the plurality of rules to be executed by the rule engine only if a predetermined condition occurs.\n14. A system comprising:\na server comprising\na graphical user interface (GUI) module to generate a GUI to allow a user to enter graphical information to specify an execution order of a plurality of rules; and\na rule engine coupled to the GUI module to execute the plurality of rules according to the execution order.\n15. The system of claim 14, further comprising:\na client communicatively coupled to the server to present the GUI to the user.\n16. The system of claim 14, further comprising:\na database coupled to the server to store a ruleflow file containing the graphical information, wherein the graphical information is associated with a flowchart created with the GUI.\n17. The system of claim 14, further comprising:\na database coupled to the server to store a model created based on the execution order.\n18. A non-transitory machine-readable storage medium that provides instructions that, if executed by a processor, will cause the processor to perform operations comprising:\ngenerating a graphical user interface (GUI) to allow a user to enter graphical information to specify an execution order of a plurality of rules; and\nexecuting the plurality of rules using a rule engine according to the execution order.\n19. The non-transitory machine-readable storage medium of claim 18, wherein generating the GUI comprises:\ngenerating an editor having one or more user interface (UI) controls to allow the user to create a flowchart defining the execution order; and\ndisplaying the flowchart to the user via the editor.\n20. The non-transitory machine-readable storage medium of claim 18, further comprising:\nsaving the graphical information in a ruleflow file, wherein the graphical information is associated with a flowchart created with the GUI;\ncreating a model containing the execution order corresponding to the ruleflow file; and\nproviding the model to the rule engine.\n21. The non-transitory machine-readable storage medium of claim 18, further comprising:\nloading a model of the execution order to a rulebase of the rule engine;\nplacing an activated rule into a corresponding ruleflow-group of a plurality of ruleflow-groups;\nselecting one of the plurality of ruleflow-groups according to the model;\nplacing all activated rules in the selected one of the plurality of ruleflow-groups onto an agenda of the rule engine; and\nexecuting rules in the agenda.\n22. The non-transitory machine-readable storage medium of claim 18, further comprising:\nallowing the user to specify at least two of the plurality of rules to be executed in parallel by the rule engine.\n23. The non-transitory machine-readable storage medium of claim 18, further comprising:\nallowing the user to specify at least two of the plurality of rules to be executed sequentially by the rule engine.\n24. The non-transitory machine-readable storage medium of claim 18, further comprising:\nallowing the user to specify at least one of the plurality of rules to be executed by the rule engine only if a predetermined condition occurs.",
    "status": "Active",
    "citations_own": [],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": []
}