{
    "patent_id": "US-11481652-B2",
    "title": "System and method for recommendations in ubiquituous computing environments ",
    "assignee": "Gregory Knox",
    "publication_date": "2022-10-25",
    "patent_link": "https://patents.google.com/patent/US11481652B2/en",
    "inventors": [
        "Gregory Knox"
    ],
    "classifications": [
        "H04L67/12",
        "G06F18/241",
        "G06F18/2413",
        "G06K9/6268",
        "G06N3/08",
        "G06N5/04",
        "G06V10/764",
        "G06V10/82",
        "G06V40/20",
        "H04L67/125",
        "H04L67/565",
        "G06F18/214",
        "G06K9/6256",
        "H04W4/38",
        "Y04S40/18"
    ],
    "abstract": "Systems and methods for creating an ad hoc pervasive computing environment comprised of an inference recommendation engine coupled to commodity devices and sensors that passively collect human activity and behavioral data. Methods include machine learning and deep learning applications that analyze data to generate preference based recommendations to assist, inform, and guide subjects interacting with a connected living space and their connected social network.",
    "claims": "\n1. A method of personalizing recommendations by calculating behavioral measurement data of at least one human from at least two ubicomp devices each positioned apart from each other for spatial diversity, the method comprising the steps of:\ngenerating independent behavioral measurement data from each of the at least two ubicomp devices;\ncollecting each of the independent behavioral measurement data into at least one responsive device;\nconglomerating each of the independent behavioral measurement data in the at least one responsive device;\nconverting the conglomerated independent behavioral measurement data into at least one standardized data format for the at least one responsive device;\nclassifying the converted conglomerated independent behavioral measurement data into interaction preferences associated with the at least one human in the at least one responsive device; and\ntransmitting personalized recommendations responsive to the interaction preferences associated with the at least one human by the at least one responsive device based on the classified converted conglomerated independent behavioral measurement data.\n2. The method of claim 1, further comprising pairing the at least two ubicomp devices.\n3. The method of claim 2, wherein the at least two ubicomp devices comprise at least one of a smart meter, a smart thermostat, a smart temperature sensor, a smart humidity sensor, a smart barometric sensor, a smart pressure sensor, a smart motion sensor, a smart frequency sensor, a smart radiation sensor, a smart light sensor, an IoT device, a smartphone, a smart watch, a smart microwave, a smart oven, a smart toaster, a smart coffee maker, a smart dishwasher, a smart refrigerator, a smart water faucet, a smart vacuum, a smart toy, a smart tracker, a smart door locks, a smart irrigation system, a smart energy monitoring, and a smart voice activated service.\n4. The method of claim 3, wherein the step of transmitting recommendations comprises:\nusing an inference recommendation engine system to generate interaction recommendations to the at least one human.\n5. The method of claim 4, wherein the generated tracking data comprise activity and behavioral data from the at least one human, and the method further comprises:\nanalyzing the activity and the behavioral data from the each of the generated tracking data.\n6. The method of claim 5, wherein the method further comprises:\ngenerating the interaction recommendations of the at least one human in response to analyzing the activity and the behavioral data.\n7. The method of claim 6, wherein the interaction recommendations comprises at least one of time, location, frequency, duration and sentiments.\n8. The method of claim 7, further comprising:\nupdating the interaction recommendations on at least one of a time frequency basis, a motion level basis, a temperature level basis, a humidity level basis, a barometric level basis, a light level basis, a frequency level basis and a radiation level basis.\n9. The method of claim 8, wherein the step of transmitting recommended interactions comprises:\ngenerating a feedback to the paired at least two ubicomp devices.\n10. The method of claim 9, further comprising the step of:\nstoring the generated tracking data in at least one cloud computing network.",
    "status": "Active",
    "citations_own": [
        "US20070124756A1",
        "US20070157247A1",
        "US20070271580A1",
        "US8769556B2"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20200050443A1"
    ],
    "citedby_ftf": [
        "WO2014210334A1",
        "US9928230B1",
        "US9848061B1",
        "US11232385B2",
        "US10594585B2",
        "US11153156B2",
        "US10616121B2",
        "US11510097B2",
        "US10630769B2",
        "US11238353B2",
        "US10775974B2",
        "US20200090207A1",
        "US11271741B2",
        "US11321652B1",
        "US20200394458A1",
        "US10958521B2",
        "US11113674B2",
        "KR20210085159A",
        "US11741557B2",
        "US11102622B1",
        "US20230086979A1",
        "US11656842B2",
        "US11070538B1",
        "US20210406150A1",
        "CN111901573A",
        "US11763919B1",
        "US20220413785A1",
        "US20220164457A1",
        "CN112288554B",
        "US20220176552A1",
        "US20220238115A1",
        "US11714997B2",
        "US20220318124A1",
        "US20220317635A1",
        "US11599242B2",
        "US20220398340A1",
        "US11755592B2",
        "US11521200B1",
        "US11615874B1",
        "US20230141419A1",
        "CN114581161B"
    ]
}