{
    "patent_link": "https://patents.google.com/patent/US20050278550A1/en",
    "patent_id": "US20050278550A1",
    "title": "Method and system for prioritizing cases for fraud detection",
    "abstract": "An approach provides detection of unauthorized use of data services. A fraud case is created for a data call that is determined to be potentially fraudulent based on a fraud alert. A fraud score is determined for the case according to the fraud alert. The fraud score is adjusted according to adjustment criteria including an intermediate network involved with the data call, and an originating country of the data call.",
    "inventors": [
        "Saralyn Mahone",
        "Matthew Gilbert",
        "Thomas Stepp",
        "Arthur Springer",
        "John Arkel"
    ],
    "assignee": "Verizon Patent and Licensing Inc",
    "classifications": [
        "H04M15/47",
        "H04M15/00",
        "H04M2215/0148"
    ],
    "claims": "\n1. A method for supporting fraud detection, the method comprising:\ncreating a case for a data call that is determined to be potentially fraudulent based on a fraud alert;\ndetermining a fraud score for the case according to the fraud alert; and\nadjusting the fraud score according to adjustment criteria including an intermediate network involved with the data call, and an originating country of the data call.\n2. A method according to claim 1, further comprising:\nretrieving a first score adjustment factor corresponding to the intermediate network;\nretrieving a second score adjustment factor corresponding to the originating country; and\noutputting a modified fraud score by applying the score adjustment factors to the fraud score.\n3. A method according to claim 1, wherein the adjustment criteria further includes number of users associated with a user identifier of the data call, the method further comprising:\nretrieving a score adjustment factor corresponding to the number of users associated with the user identifier; and\napplying the score adjustment factor to the fraud score.\n4. A method according to claim 1, wherein the adjustment criteria further includes a sharing variable specifying whether sharing of the user identifier is permissible, the method further comprising:\nretrieving a score adjustment factor if the sharing variable is set to not permit sharing; and\napplying the score adjustment factor to the fraud score.\n5. A method according to claim 1, wherein the adjustment criteria further includes whether a wireless connection is utilized to support the data call, the method further comprising:\nretrieving a score adjustment factor corresponding to the wireless connection criterion; and\napplying the score adjustment factor corresponding to the wireless connection criterion to the fraud score.\n6. A method according to claim 1, wherein the intermediate network is operated by an intermediate service provider partnered with a primary service provider operating a primary network that authorized the data call.\n7. A method according to claim 1, further comprising:\ngenerating a plurality of cases including the created case;\noutputting a plurality of adjusted fraud scores of the cases; and\nranking the cases according to the adjusted fraud scores.\n8. A method according to claim 1, further comprising:\ncomparing the adjusted fraud score with a predetermined threshold; and\nautomatically initiating action if the predetermined threshold is satisfied.\n9. A method according to claim 1, wherein the data call is a dial-up session.\n10. A fraud detection system comprising:\na processor configured to create a case for a data call that is determined to be potentially fraudulent based on a fraud alert, and to determine a fraud score for the case according to the fraud alert,\nwherein the fraud score is adjusted by the processor according to adjustment criteria including an intermediate network involved with the data call, and an originating country of the data call.\n11. A system according to claim 10, further comprising:\na memory configured store a first score adjustment factor corresponding to the intermediate network and a second score adjustment factor corresponding to the originating country,\nwherein the processor outputs a modified fraud score by applying the score adjustment factors to the fraud score.\n12. A system according to claim 10, wherein the adjustment criteria further includes number of users associated with a user identifier of the data call, the system further comprising:\na memory configured to store a score adjustment factor corresponding to the number of users associated with the user identifier,\nwherein the processor applies the score adjustment factor to the fraud score.\n13. A system according to claim 10, wherein the adjustment criteria further includes number of users associated with a user identifier of the data call, the system further comprising:\na memory configured to store a score adjustment factor corresponding a sharing variable specifying whether sharing of the user identifier is permissible,\nwherein the processor applies the score adjustment factor to the fraud score if the sharing variable is set to not permit sharing of the user identifier.\n14. A system according to claim 10, wherein the adjustment criteria further includes whether a wireless connection is utilized to support the data call, the system further comprising:\na memory configured to store a score adjustment factor corresponding to the wireless connection criterion, wherein the processor applies the score adjustment factor corresponding to the wireless connection criterion to the fraud score.\n15. A system according to claim 10, wherein the intermediate network is operated by an intermediate service provider partnered with a primary service provider operating a primary network that authorized the data call.\n16. A system according to claim 10, wherein a plurality of cases include the created case are generated, the processor outputting a plurality of adjusted fraud scores corresponding to the cases and ranking the cases according to the adjusted fraud scores.\n17. A system according to claim 10, wherein the adjusted fraud score is compared with a predetermined threshold for automatically initiating action if the predetermined threshold is satisfied.\n18. A system according to claim 10, wherein the data call is a dial-up session.\n19. A method for supporting fraud detection, the method comprising:\ncreating a plurality of fraud cases, each fraud case specifying a remote access connection for data services that generated a fraud alert;\nassigning each of the fraud cases an initial fraud score;\nadjusting each of the fraud score according to adjustment criteria including an intermediate network supporting the corresponding remote access connection, and an originating country of the corresponding remote access connection; and\nprioritizing the fraud cases based on the adjusted fraud scores.\n20. A method according to claim 19, wherein the initial fraud scores are assigned according to the corresponding fraud alerts.\n21. A method according to claim 19, wherein the adjustment criteria further includes determining whether the remote access connection involves a wireless connection, the method further comprising:\nretrieving a first score adjustment factor corresponding to the intermediate network;\nretrieving a second score adjustment factor corresponding to the originating country;\nretrieving a third score adjustment factor corresponding to the number of users associated with the user identifier; and\nretrieving a fourth score adjustment factor corresponding to the wireless connection criterion,\nwherein the score adjustment factors are used to adjust corresponding ones of the fraud scores.\n22. A method according to claim 19, wherein the intermediate network is operated by an intermediate service provider partnered with a primary service provider operating a primary network that initiated establishment of the remote access connection.\n23. A method according to claim 19, wherein the remote access connection is a dial-up session.\n24. A system for supporting fraud detection, the system comprising:\nmeans for creating a plurality of fraud cases, each fraud case specifying a remote access connection for data services that generated a fraud alert;\nmeans for assigning each of the fraud cases an initial fraud score;\nmeans for adjusting each of the fraud score according to adjustment criteria including an intermediate network supporting the corresponding remote access connection, and an originating country of the corresponding remote access connection; and\nmeans for prioritizing the fraud cases based on the adjusted fraud scores.\n25. A system according to claim 24, wherein the adjustment criteria further includes determining whether the remote access connection involves a wireless connection, the system further comprising:\na memory configured to store a plurality of score adjustment factors corresponding, respectively, to the intermediate network, the originating country, the number of users associated with the user identifier, and the wireless connection criterion,\nwherein the score adjustment factors are used to adjust corresponding ones of the fraud scores.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US5333185A",
        "US5504810A",
        "US5602906A",
        "US5627886A",
        "US5706338A",
        "US5768354A",
        "US5839063A",
        "US6163604A",
        "US6208720B1",
        "US6259778B1",
        "US20010050984A1",
        "US20020082886A1",
        "US20020103899A1",
        "US6437812B1",
        "US20020188712A1",
        "US20030005326A1",
        "US6570968B1",
        "US6571290B2",
        "US20030172294A1",
        "US20030185361A1",
        "US20040008717A1",
        "US20040015497A1",
        "US20040030657A1",
        "US6721284B1",
        "US20040153382A1",
        "US20040234056A1",
        "US20050160280A1",
        "US20060124732A1",
        "US7142651B2",
        "US7234156B2",
        "US7308714B2",
        "US20080267375A1"
    ],
    "citations_ftf": [
        "US6601048B1",
        "GB9910111D0",
        "GB0210241D0"
    ],
    "citedby_own": [
        "US20070143486A1",
        "US20080077515A1",
        "US20080154892A1",
        "US20090275341A1",
        "US20090275343A1",
        "US20090292954A1",
        "US20100278042A1",
        "WO2012003266A1",
        "US20120158541A1",
        "US20120226613A1",
        "US8392208B1",
        "US20130110692A1",
        "WO2013086113A2",
        "US20140012724A1",
        "US9369345B2",
        "US9456343B1",
        "US20170111515A1",
        "US9774726B1",
        "US9904967B1",
        "US20190020757A1",
        "US20190114649A1",
        "US10666771B2",
        "US10785214B2",
        "US10798126B2",
        "US10855666B2",
        "US10972472B2",
        "US11030298B2",
        "US11336646B2",
        "US11470194B2"
    ],
    "citedby_ftf": [
        "US8126124B2",
        "US20090254970A1",
        "US8200188B2",
        "US9274594B2",
        "US9292400B1",
        "US10430793B2",
        "US9967273B2",
        "US10341391B1",
        "US11283813B2"
    ]
}