{
    "patent_id": "US-8849735-B2",
    "title": "Solving the distal reward problem through linkage of STDP and dopamine signaling ",
    "assignee": "Neurosciences Research Foundation, Inc.",
    "publication_date": "2014-09-30",
    "patent_link": "https://patents.google.com/patent/US8849735B2/en",
    "inventors": [
        "Eugene M. Izhikevich"
    ],
    "classifications": [
        "G06N3/049",
        "G06N20/00",
        "G06N3/088",
        "G06N3/006",
        "G06N3/02",
        "G06N3/063",
        "G06N3/0635",
        "G06N3/065"
    ],
    "abstract": "In Pavlovian and instrumental conditioning, rewards typically come seconds after reward-triggering actions, creating an explanatory conundrum known as the distal reward problem or the credit assignment problem. How does the brain know what firing patterns of what neurons are responsible for the reward if (1) the firing patterns are no longer there when the reward arrives and (2) most neurons and synapses are active during the waiting period to the reward? A model network and computer simulation of cortical spiking neurons with spike-timing-dependent plasticity (STDP) modulated by dopamine (DA) is disclosed to answer this question. STDP is triggered by nearly-coincident firing patterns of a presynaptic neuron and a postsynaptic neuron on a millisecond time scale, with slow kinetics of subsequent synaptic plasticity being sensitive to changes in the extracellular dopamine DA concentration during the critical period of a few seconds after the nearly-coincident firing patterns.",
    "claims": "\n1. A simulated nervous system network method operating on one or more microprocessors, comprising:\na plurality of neurons;\na plurality of synapses interconnecting the plurality of neurons;\nwherein the neurons are configured to fire in a firing pattern that activates a synaptic pathway including one or more synapses of the plurality of synapses;\nwherein the plurality of synapses have spike-timing dependent plasticity (STDP);\nwherein the network is configured to provide extracellular dopamine to the synaptic pathway during a window of time between the firing of the neurons and a decay of an eligibility trace (c) to zero to thereby strengthen the one or more synapses along the synaptic pathway.\n2. The simulated nervous system network of claim 1, wherein the window is in the range of a few seconds.\n3. The simulated nervous system network of claim 1, wherein the network is configured to delivering to the synaptic pathway an increase of dopamine each time a post-synaptic firing of a post-neuron occurs within a certain time after a pre-synaptic firing of a pre-neuron to increase the strength of the synapse.\n4. The simulated nervous system network of claim 3, wherein the increase in dopamine is provided at a random delay of between 1-3 seconds after the firing of the pre-neuron and the post-neuron and each time the post-neuron firing occurs within about 10 ms after the pre-neuron firing to reinforce the firing of the first pre-neuron and the second post-neuron.\n5. The simulated nervous system network of claim 4, wherein the increase in dopamine is provided until the synaptic pathway is potentiated up to a maximum allowable value.\n6. The simulated nervous system network of claim 5, wherein the maximum allowable value is 4 mV.\n7. A simulated nervous system network method operating on one or more microprocessors, comprising:\na plurality of neurons; a plurality of synapses interconnecting the plurality of neurons;\nwherein the neurons are configured to fire in a firing pattern that activates a synaptic pathway including one or more synapses of the plurality of synapses;\nwherein the firing pattern fires a first pre-neuron and a second post-neuron within a substantially coincident time of one another to induce changes to the synaptic strength (s) according to a spike-timing-dependent-plasticity (STDP) rule;\nwherein the network is configured to detect an eligibility trace (c) over a time window commencing with the substantially coincident firings of the first pre-neuron and the second post-neuron, the eligibility trace (c) decaying towards zero over the time window;\nwherein the network is configured to provide extracellular global diffusive reinforcement signal to the synaptic pathway during the time window.\n8. The simulated nervous system network of claim 7, wherein the network is configured to provide an increase in the extracellular global diffusive reinforcement signal at about 1-3 seconds after the coincident firing and commencement of the time window.\n9. The simulated nervous system network of claim 7, wherein the network is configured to provide an increase in the extracellular global diffusive reinforcement signal after a random delay between 1 and 3 seconds from commencement of the time window.\n10. The simulated nervous system network of claim 7, wherein the increase in dopamine is provided until the synaptic pathway is potentiated up to a maximum allowable value.\n11. The simulated nervous system network of claim 10, wherein the maximum allowable value is 4 mV.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US20020042563A1",
        "US20030177450A1",
        "US20050261803A1",
        "US20060129506A1",
        "US8103602B2"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US10507580B2",
        "US10599976B2"
    ],
    "citedby_ftf": [
        "US8103602B2",
        "US7818273B2",
        "US8112372B2",
        "US9110771B2",
        "US8527438B2",
        "US9122994B2",
        "US9405975B2",
        "US8315305B2",
        "US9311593B2",
        "US9665822B2",
        "US9129220B2",
        "US8433665B2",
        "US8892485B2",
        "US8606732B2",
        "US9193075B1",
        "US9269042B2",
        "EP2631872A4",
        "US8892487B2",
        "US8848337B2",
        "US8712940B2",
        "US9070039B2",
        "US9147156B2",
        "US8990133B1",
        "US9566710B2",
        "US9047568B1",
        "KR101888468B1",
        "US9104973B2",
        "US8725662B2",
        "US9460387B2",
        "US8725658B2",
        "US8712941B2",
        "US8719199B2",
        "US9412064B2",
        "US8874498B2",
        "US8738554B2",
        "US9117176B2",
        "US9098811B2",
        "US10210452B2",
        "US9015092B2",
        "US8712939B2",
        "US9213937B2",
        "US9146546B2",
        "US9104186B2",
        "US9156165B2",
        "US8626684B2",
        "US8799199B2",
        "WO2013108299A1",
        "CN103460220A",
        "US9195935B2",
        "US9129221B2",
        "US9224090B2",
        "US9412041B1",
        "US9256215B2",
        "US9256823B2",
        "US9002760B2",
        "US9440352B2",
        "US9186793B1",
        "US9311594B1",
        "US9367798B2",
        "US9189730B1",
        "US8793205B1",
        "US9082079B1",
        "US9218563B2",
        "US9111226B2",
        "US9183493B2",
        "US9275326B2",
        "US9123127B2",
        "US9195934B1",
        "US9177245B2",
        "US9764468B2",
        "US8996177B2",
        "US9008840B1",
        "US9542643B2",
        "US9242372B2",
        "US9384443B2",
        "US9314924B1",
        "US9792546B2",
        "US9436909B2",
        "US9239985B2",
        "JP5659361B1",
        "US9552546B1",
        "US9330355B2",
        "US9542644B2",
        "US9296101B2",
        "US9579789B2",
        "US9489623B1",
        "US9463571B2",
        "US9597797B2",
        "US9248569B2",
        "US9358685B2",
        "US9342782B2",
        "US9533413B2",
        "US9987743B2",
        "US9364950B2",
        "US9613308B2",
        "US9630317B2",
        "US9346167B2",
        "US10194163B2",
        "US9713982B2",
        "US9939253B2",
        "US9848112B2",
        "US10057593B2",
        "US9860077B2",
        "US9821470B2",
        "US9579790B2",
        "US9849588B2",
        "US10032280B2",
        "US9630318B2",
        "US9881349B1",
        "US9426946B2",
        "US9717387B1",
        "US9840003B2",
        "US10197664B2",
        "US10295972B2",
        "CN111632275B",
        "CN110766086B",
        "US20210150348A1",
        "CN113110492B"
    ]
}