{
    "patent_link": "https://patents.google.com/patent/US5838685A/en",
    "patent_id": "US5838685A",
    "title": "Method and apparatus for the transmission of data files",
    "abstract": "A method and apparatus for the transmission of data files over a network has particular application in connection with store-and-forward systems. A message transmission is composed using a chosen data format, which may be chosen from graphics, facsimile, audio, video or text file formats. A unique identifier code, corresponding to the data format, is annexed to the message file, and the unified transmission is sent to a reception host facility through the network. The reception facility stores the message, advising the particular recipient of its reception and the nature of the data, obtained upon inspection of the identifier code. Because the code is exterior to the message, the data format may be determined without examination of the message contents, such that the integrity and privacy of the message is maintained. The host facility may maintain a listing of the data formats accessible by recipients associated with the facility to allow an acknowledgement of reception capability to be forwarded to the sender.",
    "inventors": [
        "Gary Hochman"
    ],
    "assignee": "Tumbleweed Holdings LLC",
    "classifications": [
        "H04Q11/04",
        "H04L51/00",
        "H04L51/08",
        "H04L51/10",
        "H04L51/56",
        "H04L9/40",
        "H04L51/066",
        "H04L51/224",
        "H04L69/06",
        "H04Q2213/13174",
        "H04Q2213/13204",
        "H04Q2213/13216",
        "H04Q2213/13336",
        "H04Q2213/13375",
        "H04Q2213/13377",
        "H04Q2213/13389"
    ],
    "claims": "\n1. A method for the integrated transmission of store-and-forward messages of varying data formats over a network, comprising the steps of:\ncomposing a message body of an identified data format for an intended recipient;\nannexing to said message body a unique identifier corresponding to the data format of the message body;\ntransmitting the identifier and message body through the network for reception by a host facility;\ninspecting the identifier at the host facility to identify the data format of the message body; and\nadvising the recipient of the receipt of the message and its data format.\n2. The method of claim 1, wherein said identifier comprises a portion of a header.\n3. The method of claim 1 further including the step of annexing to said message body a network address of the recipient.\n4. The method of claim 3, wherein said identifier and said network address comprise portions of a header.\n5. A method for the transmission of a store-and-forward message over a network comprising the steps of:\ncomposing a data message of a chosen data type at a data entry device;\nentering a network address for the intended recipient;\ntransmitting said message in the chosen data type and the identity of the recipient over a first communication channel to a network entry terminal;\nforming a network compatible message having a message body comprising said message contents in the chosen data type and recipient and data type information exterior to said message body;\ntransmitting said network compatible message through the network to a host reception facility associated with the network address of the recipient; and\nstoring said message and information relating to the data type for retrieval by the recipient.\n6. The method of claim 5, wherein said data entry device is a document scanner, a PBX/telephony device, or a computer running application software.\n7. A method for the integrated transmission of store-and-forward messages of varying data formats over a network from a sender to a recipient, comprising the steps of:\ncomposing a message body of an identified data format for the recipient having a network address;\nannexing to said message body a unique identifier corresponding to the data format of the message body;\nmaintaining on said network a listing of network addresses and the data reception capabilities thereof;\ntransmitting the identifier and message body through the network for reception by a host facility;\ninspecting the identifier at the host facility to identify the data format of the message body;\nconfirming through inspection of said listing the capability of the recipient to properly receive the data format of the message body and, if confirmed, advising the recipient of the receipt of the message and its data format; and\nreporting to the sender of the status of the transmission.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5173900A",
        "US5304992A",
        "US5333135A",
        "US5379296A",
        "US5627997A",
        "US5655079A",
        "US5675507A",
        "US5719562A",
        "US5726640A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5958005A",
        "WO2000013913A1",
        "WO2000036818A1",
        "US6138146A",
        "US6157945A",
        "US6182125B1",
        "US6212551B1",
        "US6266160B1",
        "US20010021649A1",
        "US6351316B2",
        "US6442603B1",
        "US6522418B2",
        "US20030073450A1",
        "US20030086124A1",
        "US20030115544A1",
        "US20030196200A1",
        "US20030228842A1",
        "US6694319B1",
        "US6738163B2",
        "US20040181517A1",
        "US20040252326A1",
        "US6847994B1",
        "US20050136837A1",
        "US6922255B1",
        "US6959328B1",
        "US6965904B2",
        "US6965443B2",
        "US20050275873A1",
        "US7019853B1",
        "US20060075075A1",
        "US20060274856A1",
        "US7151764B1",
        "US7327480B1",
        "US7340214B1",
        "US7423785B1",
        "US7457005B1",
        "US7589726B2",
        "US20100002260A1",
        "AU2010100501B4"
    ],
    "citedby_ftf": []
}