{
    "patent_link": "https://patents.google.com/patent/US6018748A/en",
    "patent_id": "US6018748A",
    "title": "Dynamic linkable labels in a network browser page",
    "abstract": "In a computer network where remote user stations retrieve information from other sites in the network, a method and apparatus for creating and displaying dynamic link labels in a browser program operating on a remote user station. The link labels are created in an application program which can be run within the browser, and the link labels are designed to operate, at a minimum, in a similar manner as HTML hyper links. The link labels can also dynamically change in response to user input into the browser. For instance, the URL (Uniform Resource Locator) address or the text or appearance of the link label can change. Also, parameters based on user input can be formed by the application and used to form or alter other link labels.",
    "inventors": [
        "Jody K. Smith"
    ],
    "assignee": "Oracle America Inc",
    "classifications": [
        "G06F16/9558",
        "G06F16/94"
    ],
    "claims": "\n1. A method for displaying dynamic links in a browser program operating on a remote user station in a computer network, said method comprising the computer implemented steps of:\ncreating an application program adapted to display a dynamically alterable link label capable of being selected by a user, said link label having a variable textual portion and a variable address portion, wherein selecting said link label activates the browser program to load a browser page specified by a current value of said variable address portion, said application program also adapted to display a plurality of user-selectable variables, wherein a unique address of a browser page is associated with each of said variables, said application program adapted to operate in the browser program;\ndownloading said application program from a location in the network to said remote user station;\nrunning said application program in the browser program operating in said remote user station;\ndisplaying said link label;\ndisplaying said plurality of user-selectable variables;\nreceiving user input to select one of said user-selectable variables;\nmodifying the variable textual portion of said link label in accordance with the user-selectable variable selected by the user;\ndisplaying the variable textual portion of said link label as modified;\nmodifying the variable address portion of said link label in accordance with the user-selectable variable selected by the user; and\nwhen the user activates the link label, loading into the browser program the unique address specified by the variable address portion of the link label as modified, so that the browser page specified by thereby is displayed to the user within the browser program.\n2. An apparatus for displaying dynamic links in a browser program operating on a remote user station in a computer network, said apparatus comprising:\nan application module for displaying a dynamically alterable link label capable of being selected by a user, said link label having a variable textual portion and a variable address portion, wherein selecting said link label activates the browser program to load a browser page specified by a current value of said variable address portion, said application module also adapted to display a plurality of user-selectable variables, wherein a unique address of a browser page is associated with each of said variables, said application module adapted to operate within said browser program;\nan input processing module for processing user input received in the browser during operation of the application module, said input processing module adapted to detect a relative location of an input device and the state of input buttons, said input processing module receiving user input to select one of said user-selectable variables; and\na link label modification module for modifying the link label in response to said user input at the remote user station, said modification module modifying the variable textual portion of said link label in accordance with the user-selectable variable selected by the user, and modifying the variable address portion of said link label in accordance with the user-selectable variable selected by the user; and if the user activates the link label, loading into the browser program the unique address specified by the variable address portion of the link label as modified, so that the browser pare specified by thereby is displayed to the user within the browser program.\n3. A method for displaying dynamic links in a browser program operating on a remote user station in a computer network, said method comprising the computer implemented steps of:\ncreating an application program adapted to display an alterable link label capable of being selected by a user, said link label being programmatically associated with a first network address, said link label having a variable textual portion and a variable address portion, wherein selecting said link label activates the browser program to load a browser page specified by a current value of said variable address portion, said application program also adapted to display a plurality of user-selectable variables, wherein a unique address of a browser page is associated with each of said variables, said application program adapted to operate in the browser program;\ndownloading said application program from a location in the network to said remote user station;\nrunning said application program in the browser program operating in said remote user station;\ndisplaying said link label;\ndisplaying said plurality of user-selectable variables;\nreceiving user input to select one of said user-selectable variables;\nmodifying the variable textual portion of said link label in accordance with the user-selectable variable selected by the user;\ndisplaying the variable textual portion of said link label as modified;\nmodifying the variable address portion of said link label in accordance with the user-selectable variable selected by the user; and\nwhen the user activates the link label, loading into the browser program the unique address specified by the variable address portion of the link label as modified, so that the browser page specified by thereby is displayed to the user within the browser program.\n4. The method of claim 3, wherein said receiving user input step further comprises receiving dynamic parameters passed into the application program.\n5. The method of claim 3, wherein said receiving user input step further comprises receiving dynamic parameters passed into the application program from the remote user station.\n6. The method of claim 3, wherein said receiving user input step further comprises receiving dynamic parameters passed into the application program from another user station across the computer network.\n7. The method of claim 3, wherein said receiving user input step further comprises receiving dynamic parameters passed into the application program as provided by user input into the user station.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5297249A",
        "US5572643A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6182125B1",
        "US6240455B1",
        "US6243088B1",
        "US6243722B1",
        "US20010007991A1",
        "US6272484B1",
        "US6272470B1",
        "US20010037314A1",
        "US20010051998A1",
        "US6331858B2",
        "US6363404B1",
        "US20020039913A1",
        "US6370497B1",
        "US20020105546A1",
        "US6442603B1",
        "US6452905B1",
        "US20020147724A1",
        "US20020161794A1",
        "US6477575B1",
        "US20020184256A1",
        "US20030022643A1",
        "US20030055915A1",
        "US6606525B1",
        "US6643658B1",
        "US20040064565A1",
        "US20040122731A1",
        "US6774908B2",
        "WO2004068307A2",
        "US6823339B2",
        "US20040260722A1",
        "US6850253B1",
        "US6868525B1",
        "US6915483B1",
        "US20050177401A1",
        "US20060026067A1",
        "US20060053292A1",
        "US7062506B2",
        "US7096417B1",
        "US7181438B1",
        "US7191400B1",
        "US20070073773A1",
        "US7213204B1",
        "US20070244745A1",
        "US20080046315A1",
        "US20080177603A1",
        "CN100407189C",
        "US20080215438A1",
        "US20090019361A1",
        "US20090043654A1",
        "US20090144124A1",
        "US20090259751A1",
        "US20090307076A1",
        "US7650304B1",
        "US20100124235A1",
        "US20130174000A1",
        "CN103593348A",
        "US20140068407A1",
        "US20140337695A1",
        "US20180081508A1",
        "US10046244B2",
        "US10326858B2",
        "US10332068B2",
        "US10445727B1",
        "US10482475B2",
        "US10853769B2",
        "US10867285B2",
        "US11080734B2",
        "US11080105B1",
        "US11190608B2",
        "US11501351B2",
        "US11514021B2",
        "US11803535B2"
    ],
    "citedby_ftf": [
        "SE511368C2",
        "JP2000010991A",
        "US6405192B1",
        "US6356908B1",
        "US6665838B1",
        "AU7624200A",
        "DE19952630B4",
        "US7712024B2",
        "US7716163B2",
        "US7788602B2",
        "US7451389B2",
        "US7770102B1",
        "JP4681721B2",
        "JP2001175764A",
        "GB0103753D0",
        "US7778816B2",
        "US7707496B1",
        "US7707024B2",
        "US7742048B1",
        "US7827546B1",
        "US7356537B2",
        "US7716676B2",
        "US7209915B1",
        "US7783614B2",
        "US7711550B1",
        "US8122014B2",
        "US7257585B2",
        "DE102004055363A1",
        "US7992085B2",
        "US7788590B2",
        "US7853558B2",
        "EP2213690B1",
        "CN103383687B"
    ]
}