{
    "patent_link": "https://patents.google.com/patent/US7177833B1/en",
    "patent_id": "US7177833B1",
    "title": "Automated trading system in an electronic trading exchange",
    "abstract": "An electronic exchange system network includes a trader site having an automated trading system capable of submitting orders and/or quotes to an exchange site. The automated trading system determines whether an order or quote should be submitted based on, for example, the current market price of an option and theoretical buy and sell prices. The theoretical buy and sell prices are derived from, among other things, the current market price of the security underlying the option. The theoretical buy and sell prices are calculated when underlying factors that contribute to the theoretical prices change. Computation times of the theoretical prices may be reduced by using precalculated values and/or using interpolation and extrapolation. Other techniques may be used in addition or in the alternative to speed automatic decision-making. In addition, a system of checks may be conducted to ensure accurate and safe automated trading. The automated trading system may be capable of automatically submitting orders in connection with the underlying security in order to hedge part of the delta risk associated with the automated option trades.",
    "inventors": [
        "John M. Marynowski",
        "Catalin D. Voinescu",
        "Stefan Puscasu",
        "Thomas M. O'Donnell"
    ],
    "assignee": "DCFB LLC",
    "classifications": [
        "G06Q40/04",
        "G06Q40/00",
        "G06Q40/03"
    ],
    "claims": "\n1. An automated trading system for use in an electronic exchange system network, comprising:\na receiver interface that receives market price information for a first traded item from an exchange;\na transaction value calculator that generates a transaction value for the first traded item based on price information for a second traded item related to the first traded item;\ndecision logic using at least a portion of the received market price information and the transaction value to generate a decision whether to submit a response to buy or sell the first traded item; and\nan output interface for outputting a request for market transaction for one of the first traded item and the second traded item for transmission to the exchange in response to said decision logic.\n2. The automated trading system according to claim 1, wherein the transaction value calculator receives current price information for the second traded item and uses the current price information to generate the transaction value.\n3. The automated trading system according to claim 2, wherein said transaction value calculator generates the transaction value using interpolation.\n4. The automated trading system according to claim 2, wherein said transaction value calculator generates the transaction value by extrapolation.\n5. The automated trading system according to claim 2, wherein the transaction value calculator generates the transaction value by using some precalculated terms.\n6. The automated trading system according to claim 2, wherein the second traded item is a security and the first traded item is an option on the security.\n7. The automated trading system according to claim 1, wherein the request for market transaction is an order for the first traded item.\n8. The automated trading system according to claim 1, wherein the request for market transaction is a quote for the first traded item.\n9. The automated trading system according to claim 1, said decision logic compares at least a portion of the received market price information to the transaction value when automated trading in the first item first becomes enabled.\n10. The automated trading system according to claim 1, further comprising safety check logic, responsive to said decision logic, to prevent transmission of a request for market transaction for the first traded item to the exchange if the request does not meet a predetermined criterion.\n11. The automated trading system according to claim 10, wherein the predetermined criterion is a maximum trade quantity for the first traded item.\n12. The automated trading system according to claim 10, wherein the predetermined criterion is a maximum resulting delta position in the second traded item.\n13. The automated trading system according to claim 10, wherein said predetermined criterion is a maximum number of market transaction attempts within a predetermined period of time and said decision logic compares at least a portion of the received market price information to the transaction value when the maximum number of attempts is increased.\n14. The automated trading system according to claim 1, where the receiver interface receives the market price information for the first traded item indirectly from the exchange via an exchange interface.\n15. The automated trading system according to claim 1, wherein the decision logic compares the transaction value to at least a portion of the received market price information.\n16. The automated trading system according to claim 15, wherein the transaction value is a minimum sell price for the first traded item, and the market price information includes a market bid price for the first traded item.\n17. The automated trading system according to claim 15, wherein the transaction value is a maximum buy price for the first traded item, and the market price information includes a market ask price for the first traded item.\n18. The automated trading system according to claim 15, wherein the transaction value is a theoretical value of the first traded item based on a mathematical model.\n19. The automated trading system according to claim 15, wherein the price information for the second traded item corresponds to a current market price for the second traded item and said decision logic generates a comparison when the current market price for the second traded item changes.\n20. The automated trading system according to claim 15, wherein said price information for the second traded item corresponds to a current market price for the second traded item and said decision logic generates a comparison when the price information for the first traded item changes.\n21. The automated trading system according to claim 1, wherein a backend computer includes said receiver interface, said transaction value calculator, said decision logic, and said output interface and further comprising a trader station separate from said backend computer, said trader station coupled to said backend computer through a communication link, said trader station including a graphic user interface to enable a trader to monitor the operation of said backend computer.\n22. The automated trading system according to claim 21, wherein said backend computer is located substantially closer than said trader station to the exchange that transmits the market price information for the first traded item.\n23. The automated trading system according to claim 1, wherein:\nsaid output interface outputs a request for market transaction for the first traded item; and\nsaid receiver interface further receives trade confirmation information for the first traded item in response to the request for market transaction for the first traded item,\nand said automated trading system further comprises:\nhedge logic for generating a request for market transaction for the second traded item in response to the trade confirmation information, wherein said request for market transaction for the second traded item hedges at least some of the risk of the market transaction for the first traded item.\n24. An automated trading method for use in an electronic exchange system network, comprising:\nreceiving market price information for a first traded item;\nautomatically calculating a transaction price for the first traded item based on price information for a second traded item related to the first traded item;\ncomparing the received market price information for the first traded item to the transaction price for the first traded item; and\nautomatically generating a request for market transaction for one of the first traded item and the second traded item based on the comparison of the received market price information to the transaction price.\n25. The automated trading method according to claim 24, wherein said first traded item corresponds to an option and the second traded item corresponds to a security underlying the option.\n26. The automated trading method according to claim 24, wherein said step of calculating a transaction price, comprises:\n(a) receiving current market price information for said second traded item;\n(b) generating said transaction price for said first traded item using said current market price information for said second traded item.\n27. The automated trading method according to claim 26, wherein said step of calculation uses interpolating the transaction price.\n28. The automated trading method according to claim 26, wherein said step of generating said transaction price comprises extrapolating the transaction price.\n29. An automated method of trading in an electronic exchange system network, comprising:\nreceiving a current market price for an option from an electronic exchange;\nautomatically comparing the current market price for the option with a transaction price for the option, where the transaction price for the option is calculated at least in part from current price information for an underlying security for the option; and\nbased on the result of the comparing step, automatically submitting an order or quote for the option to the electronic exchange within 96 microseconds of the step of receiving the current market price for the option.\n30. An automated method of trading in an electronic exchange system network, comprising the steps of:\nreceiving a current market price for a security from a market source;\nautomatically calculating a transaction price for an option of the security using the current market price for the security;\ncomparing the current market price for the option with a transaction price for the option; and\nbased on the step of comparing, automatically submitting an order or quote for the option to an electronic exchange within 154 microseconds of the step of receiving the current market price for the security.\n31. The automated trading method according to claim 30, wherein said step of submitting an order or quote is performed within 97 microseconds of the step of receiving the current market price for the security.\n32. The automated trading method according to claim 31, further comprising the step of performing safety checks before the submitting step.\n33. The automated trading method according to claim 32, wherein said step of calculating is performed within 80 microseconds.\n34. An automated trading method for use in an electronic exchange system network, comprising the steps of:\nreceiving market price information for a first traded item;\nautomatically calculating a transaction value for the first traded item based on at least one of (a) price information for a second traded item related to the first traded item and (b) received market information for the first traded item; and\nusing at least the calculated transaction value in automatically determining whether to submit an order for the first traded item.\n35. The automated trading method according to claim 34, wherein the calculated transaction value is an implied volatility value corresponding to the first traded item.\n36. The automated trading method according to claim 34, wherein the calculated transaction value is a maximum buy value for the first traded item.\n37. The automated trading method according to claim 34, wherein the calculated transaction value is a minimum sell value for the first traded item.\n38. The automated trading method according to claim 34, wherein the calculated transaction value is a theoretical value for the first traded item generated based on a mathematical model.\n39. The automated trading method according to claim 34, further comprising the steps of:\n(a) submitting an order for the first traded item;\n(b) receiving confirmation of a transaction from an exchange responsive to the order submitted; and\n(c) submitting an order for the second traded item to hedge a delta risk associated with the confirmed transaction.",
    "status": "Active",
    "citations_own": [
        "US2046381A",
        "US3082402A",
        "US3296597A",
        "US3573747A",
        "US3581072A",
        "US4412287A",
        "US4674044A",
        "US4903201A",
        "WO1990010910A1",
        "US5038284A",
        "US5063507A",
        "US5077665A",
        "US5101353A",
        "US5161103A",
        "US5258908A",
        "US5267148A",
        "US5270922A",
        "EP0573991A1",
        "US5297032A",
        "US5313560A",
        "US5315634A",
        "US5375055A",
        "US5497317A",
        "US5500793A",
        "WO1997037735A1",
        "US5809483A",
        "US5845266A",
        "US5870730A",
        "US5873071A",
        "US5884286A",
        "US5905974A",
        "US5963923A",
        "US6016483A",
        "US6058391A",
        "US6061662A",
        "US6173270B1",
        "US6236980B1",
        "US6263321B1",
        "US6304858B1",
        "US6317728B1",
        "US6415269B1",
        "US6546375B1",
        "US6594643B1",
        "US6839686B1"
    ],
    "citations_ftf": [
        "US4597046A",
        "US4677552A",
        "US4823265A",
        "US5151103A",
        "US5136501A",
        "US5339392A",
        "JP3253310B2",
        "US5732397A",
        "US5675746A",
        "JP3335407B2",
        "JP3328991B2",
        "WO1995006918A2",
        "CA2119921C",
        "EP0686926A3",
        "US5557517A",
        "US5940810A",
        "US5630126A",
        "ES2102264T3",
        "US6519574B1",
        "US5819238A",
        "US5950176A",
        "US5787402A",
        "US6247000B1",
        "US7236952B1",
        "US6049783A",
        "US6064985A",
        "AU3966099A",
        "US6418417B1",
        "US6618707B1",
        "US6377940B2",
        "US6405180B2",
        "WO2000051043A1",
        "US20020026321A1",
        "US7617144B2",
        "EP1259909A2",
        "US6993504B1",
        "US7212999B2",
        "AU778101B2",
        "US6418419B1",
        "US7155410B1",
        "US6832210B1",
        "US6990467B1",
        "US7251629B1",
        "US20020023039A1",
        "US20010005838A1",
        "JP3732699B2",
        "US7165043B2",
        "US7613647B1",
        "US7356499B1",
        "US7103569B1",
        "US7383220B1",
        "US7539638B1",
        "US8799138B2",
        "US7472087B2",
        "US7496533B1",
        "US7398244B1",
        "CA2406418C",
        "US7467110B2",
        "US20020019779A1",
        "WO2002001472A1",
        "WO2002006921A2",
        "US6532460B1",
        "US20020130868A1",
        "US20060020538A1",
        "US20030009411A1",
        "US8131626B2",
        "US7908570B2",
        "US20060080215A1",
        "WO2005124632A2",
        "US20060010066A1",
        "US7620586B2",
        "USD551675S1",
        "WO2006130650A2",
        "AU2010206571A1",
        "US10387953B2"
    ],
    "citedby_own": [
        "US20010034688A1",
        "US20010039530A1",
        "US20020010673A1",
        "US20030014351A1",
        "US20030078865A1",
        "US20030088499A1",
        "US20030097328A1",
        "US20030200167A1",
        "US20030225684A1",
        "US20030229568A1",
        "US20040034587A1",
        "US20040083158A1",
        "US20040128222A1",
        "US20040143535A1",
        "US20040153392A1",
        "US20050027634A1",
        "US20050027635A1",
        "US20050097026A1",
        "US20050102219A1",
        "US20050154668A1",
        "US20050239480A1",
        "US20050283427A1",
        "US20060010066A1",
        "US20060036535A1",
        "US20060036534A1",
        "US20060047596A1",
        "US20060100954A1",
        "US20060106707A1",
        "US20060155626A1",
        "US20060190416A1",
        "US20060242054A1",
        "US20060253373A1",
        "US20060259381A1",
        "US20060259407A1",
        "US20070005485A1",
        "US20070088658A1",
        "US20070100733A1",
        "US20070100722A1",
        "US20070100732A1",
        "US20070118454A1",
        "US20070118459A1",
        "US20070118455A1",
        "US20070136180A1",
        "US20070208659A1",
        "US20070218181A1",
        "US20070239576A1",
        "US20070294157A1",
        "US20080027855A1",
        "US20080033867A1",
        "US20080052223A1",
        "US20080059846A1",
        "US20080086408A1",
        "US20080109351A1",
        "US20080114724A1",
        "US20080133393A1",
        "US20080147569A1",
        "US20080162378A1",
        "US20080183639A1",
        "US20080208722A1",
        "US20080215477A1",
        "US20080215430A1",
        "US20080235146A1",
        "US20080243670A1",
        "US20080243669A1",
        "US20080243671A1",
        "US20080243672A1",
        "WO2008122001A3",
        "US20080288391A1",
        "US20080288419A1",
        "US20080313099A1",
        "US20090024512A1",
        "US20090055303A1",
        "US20090089222A1",
        "US20090125451A1",
        "US20090164336A1",
        "US7555456B2",
        "US20090177572A1",
        "US20090182686A1",
        "US20090258139A1",
        "US20090265267A1",
        "US20090271330A1",
        "US20090276367A1",
        "US20090276373A1",
        "US7617149B2",
        "US7620586B2",
        "US7624062B1",
        "US20100010937A1",
        "US7672898B1",
        "US20100076906A1",
        "US20100094777A1",
        "US20100114753A1",
        "US7734529B1",
        "US20100174633A1",
        "US7788167B1",
        "US20100223201A1",
        "US7792734B1",
        "US7801810B2",
        "US20100262901A1",
        "US20100268634A1",
        "US20100312718A1",
        "US7856394B2",
        "US20100325031A1",
        "US20100325061A1",
        "US20100332377A1",
        "US20110012357A1",
        "US20110016035A1",
        "US20110016037A1",
        "US20110022509A1",
        "US20110035308A1",
        "US20110040679A1",
        "US7899736B1",
        "US20110055067A1",
        "US7904370B2",
        "US20110066537A1",
        "US20110066568A1",
        "US20110066536A1",
        "US7921046B2",
        "US20110099124A1",
        "US20110112952A1",
        "US20110125672A1",
        "US20110153488A1",
        "US20110166953A1",
        "US20110167023A1",
        "US8069102B2",
        "US8165950B2",
        "US8229838B2",
        "US20120271748A1",
        "US8326819B2",
        "US8374986B2",
        "US8429059B2",
        "US20130138546A1",
        "US8533104B2",
        "US8595123B1",
        "US20140156496A1",
        "US8751452B2",
        "US8756146B2",
        "US8762249B2",
        "US8762252B2",
        "US20140229357A1",
        "US9509773B2",
        "US9633093B2",
        "US9633097B2",
        "US9727916B1",
        "US9772685B2",
        "US9811859B2",
        "US9830654B2",
        "US9881338B2",
        "US9928550B2",
        "US9990393B2",
        "US10037568B2",
        "US10121198B2",
        "US10121196B2",
        "US10146845B2",
        "US10147138B2",
        "US10210572B2",
        "US10229453B2",
        "US10331344B2",
        "US10346006B1",
        "US10354324B2",
        "US10379701B2",
        "US10460387B2",
        "US10467691B2",
        "US10572824B2",
        "US10650452B2",
        "US10846624B2",
        "US10902013B2",
        "US10915954B2",
        "US10942943B2",
        "US11068980B2",
        "US11436672B2",
        "US11823265B2"
    ],
    "citedby_ftf": [
        "US7251629B1",
        "US7321872B1",
        "US8255791B2",
        "US7464055B2",
        "US10304097B2",
        "US7835987B2",
        "US8738498B2",
        "US20050171887A1",
        "US7840477B2",
        "US8484122B2",
        "US8494951B2",
        "US20070078675A1",
        "US7979339B2",
        "WO2008051208A1",
        "WO2008083375A1",
        "US8175941B2",
        "US20110288982A1",
        "US20110208632A1",
        "US10263888B2",
        "US20130110741A1",
        "US20130185223A1",
        "US20130238478A1",
        "US20130262282A1",
        "US20130297531A1",
        "US8799142B1",
        "US20140258071A1",
        "US8799143B1",
        "US20150170272A1",
        "US9136938B1",
        "US20160197669A1",
        "US10229457B2",
        "RU2646342C1",
        "CN107038640A",
        "RU2730406C1"
    ]
}