{
    "patent_id": "US-11666817-B2",
    "title": "Mission-based, game-implemented cyber training system and method ",
    "assignee": "Circadence Corporation",
    "publication_date": "2023-06-06",
    "patent_link": "https://patents.google.com/patent/US11666817B2/en",
    "inventors": [
        "Gary D. Morton",
        "Mark Mihelic",
        "Michael Moniz",
        "Paul R. Thornton",
        "Ryan Pressley",
        "Laura Lee"
    ],
    "classifications": [
        "A63B71/0622",
        "A63F13/85",
        "A63F9/24",
        "G06N3/006",
        "G09B5/12",
        "G09B7/00",
        "G09B9/003",
        "A63F13/75",
        "A63F2300/8094",
        "G06N3/042"
    ],
    "abstract": "A mission-based cyber training platform allows both offensive and defensive oriented participants to test their skills in a game-based virtual environment against a live or virtual opponent. The system builds realistic virtual environments to perform the training in an isolated and controlled setting. Dynamic configuration supports unique missions using a combination of real and/or virtual machines, software resources, tools, and network components. Game engine behaves in a manner that will vary if participant attempts to replay a scenario based upon alternate options available to the engine. Scoring and leader boards are used to identify skill gaps/strengths and measure performance for each training participant. A detailed assessment of a player's performance is provided at the end of the mission and is stored in a user profile/training record.",
    "claims": "\n1. A system for providing mission-based cyber-threat training to a student against an opponent comprising:\na student station comprising a processor, a video display and a student input device;\na database of training missions stored in association with said at least one game server;\na mission resource database of mission resources including virtual tools, virtual network components and network components stored in association with said at least one game server;\na trainer station comprising a processor, a video display and a trainer input device;\na trainer interface presented at the trainer station, the trainer interface presenting a duplicate of at least a portion of information presented at the student station to provide to a trainer a real-time view of activity of a student on the student station;\nsaid a game server comprising a server processor and a server memory, said game server communicating with said student station, said game server communicating with the trainer station, said game server configured to receive input from the student station or from the trainer station of a selected one of the training missions stored in the database of training missions;\nnon-transitory machine-readable code stored in said server memory and executable by said server processor of said game server to implement:\na determination of the student's qualification for the selected mission;\nwhen said student qualified, a mission preparation phase comprising the presentation to said student via said student station of a video to prepare the student for the selected training mission, said video comprising information regarding the selected mission for use by said student in participating in said mission;\nafter said mission preparation phase, a mission execution phase in which the selected training mission is implemented, said selected training mission comprising a virtual mission environment comprising one or more virtual elements comprising one or more of a virtual network, a virtual system, a virtual device and a virtual tool for use by the game server in implementing said selected training mission, said game server configured to cause said at least one student station to display information regarding said selected training mission to said student and to receive inputs from said student; and\nan assessment phase configured to provide an assessment to the student via the student station of an outcome of the mission.\n2. The system of claim 1, wherein said video comprises information regarding one or more of: 1) a mission backstory; 2) a mission order including one or more objectives, tools, rules of engagement, and mission intelligence; 3) rules of engagement; 4) intelligence about threat actors that might be encountered during the mission; 5) team set-up for the mission; 6) skills required for the mission; 7) cyber games to play prior to the mission; 8) tools requested for the mission; and 9) quizzes to take to verify mission understanding and/or tool qualifications for the mission.\n3. The system of claim 2, wherein the mission order comprising at least one of: a) a situation including mission events, general network information for the mission, adversaries of interest for the mission, and cyber threats to expect during the mission, b) mission detail, c) mission execution, e) mission service and support including what the student is provided with and where the student enters the mission, and e) mission command and control including chain of command and means of communication for the mission.\n4. The system of claim 1, wherein said determination of the student's qualification for the selected mission comprises comparing a required competency level for said selected mission to a stored competency level for said student.\n5. The system of claim 1, wherein said determination of the student's qualification for the selected mission comprises presenting a test to said student.\n6. The system of claim 1, wherein said training mission includes parameters that are randomized to vary said selected mission.\n7. The system of claim 1, wherein the mission execution phase further comprises defining a mission scope of play, a mission environment, and a threat actor.\n8. The system of claim 7, wherein the scope of mission play is defined based on one or more of: student knowledge, student skills and abilities, mission tasks, mission conditions, mission standards, mission offense/defense tactics, and/or single or team mission training.\n9. The system of claim 1, wherein the assessment phase presents the user with an assessment scene via a user interface.\n10. The system of claim 9, wherein the assessment scene includes a depiction of the network used in the selected mission.\n11. The system of claim 1, wherein said assessment comprises a score.\n12. The system of claim 1, wherein said video is unique to said selected mission.\n13. The system of claim 1, wherein said video comprises one or more graphical representations of features of said selected mission.\n14. The system of claim 1, further comprising an artificial intelligence engine and wherein said opponent comprises a cyber-threat artificial intelligence opponent implemented by said artificial intelligence engine.\n15. The system of claim 1, further comprising non-transitory machine-readable code stored in said server memory and executable by said server processor of said game server to cause said game server to receive input from said trainer station of changes to one or more parameters of said selected mission to make said mission easier or harder.\n16. The system of claim 1, further comprising non-transitory machine-readable code stored in said server memory and executable by said server processor of said game server to generate a log of inputs by said student.\n17. The system of claim 16, further comprising one or more sensors which are configured to detect one or more of said inputs.\n18. The system of claim 1, wherein said game server is configured to receive one or more inputs from a trainer to the trainer station, said one or more inputs causing said game server to alter said selected mission.",
    "status": "Active",
    "citations_own": [
        "US20030046689A1",
        "US20050192870A1",
        "US20070066403A1",
        "US20080108021A1",
        "US7474429B2",
        "KR20090015421A",
        "US20090208910A1",
        "US20090254842A1",
        "US20090298038A1",
        "US20090320137A1",
        "US7837543B2",
        "US8005879B2",
        "US20110257961A1",
        "US8099272B2",
        "US20120058829A1",
        "US20120084242A1",
        "US20120124671A1",
        "US8266320B1",
        "US20130014264A1",
        "US8554536B2",
        "US20130288788A1",
        "JP2013236687A",
        "US20140120993A1",
        "US20140199663A1",
        "US20150040033A1",
        "US20150050623A1",
        "US20150143374A1",
        "KR101534194B1",
        "US20150229664A1",
        "US20150231502A1",
        "US20170032694A1",
        "US20170103783A1",
        "US20170140663A1",
        "US20170140660A1",
        "US9697355B1",
        "US20170244746A1",
        "US20170304707A1"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "US10238948B2",
        "US10672289B2",
        "CA2999487A1",
        "US10243993B2",
        "US10389607B1",
        "US10872533B1",
        "US11606263B2",
        "WO2019079621A1",
        "US10310959B2",
        "US10816693B2",
        "US10990432B1",
        "US20210042145A1",
        "US11403958B2",
        "US10805329B2",
        "US20190258953A1",
        "US11258795B2",
        "US10817604B1",
        "US10749890B1",
        "CN110633564B",
        "US11257393B2",
        "US11399021B2",
        "US11438360B2",
        "US11283832B2",
        "US11558409B2",
        "US10576380B1",
        "US11138312B2",
        "CN109525465A",
        "US11429713B1",
        "US11128654B1",
        "US11461458B2",
        "US11065549B2",
        "GB201906551D0",
        "US20200364492A1",
        "US11403405B1",
        "US20220150273A1",
        "US11444974B1",
        "US11503075B1",
        "US10904383B1",
        "US11501222B2",
        "CN111522726A",
        "US11458409B2",
        "CN111651241B",
        "US11494718B2",
        "US20220130274A1",
        "CN112827153A",
        "AU2022249383A1",
        "CN113680068A",
        "CN113792340B",
        "CN114023127A",
        "US20230252160A1",
        "US20230316942A1"
    ]
}