{
    "patent_link": "https://patents.google.com/patent/US20030139907A1/en",
    "patent_id": "US20030139907A1",
    "title": "System, Method, and Product for Nanoscale Modeling, Analysis, Simulation, and Synthesis (NMASS)",
    "abstract": "A computer-based system is described that provides users with the ability to develop high-fidelity digital quantitative representations of physical and chemical phenomena, and to employ an optimization-based approach to control associated physiochemical processes. The system includes a computational environment, intuitive user interface(s), integrated software libraries, analytical tools, and visualization/rendering engine that together provide an integrated framework for nanoscale modeling, analysis, simulation, and synthesis. Additionally, the system includes an optimal linear control synthesis methodology that incorporates a first order dynamic mathematical representation (of the conceptual molecular system) suitable for applying various pragmatic control system techniques including optimization of structured singular values, linear quadratic performance functions, Lyapunov criteria, or similar, for the purposes of nanoscale fabrication and molecular assembly.",
    "inventors": [
        "Robert McCarthy"
    ],
    "assignee": "Individual",
    "classifications": [
        "G05B17/02",
        "G16C20/90",
        "G16C20/30",
        "G16C20/80"
    ],
    "claims": "\n1. A computer-based system for nanoscale modeling, analysis, simulation, and synthesis, the system comprising: (a) One or more related computer programs, device drivers, and application programming interfaces to external computational resources and data storage utilities, that together implement a combination of executable procedures representing advanced mathematics from quantum theory, chemical physics, stochastic analysis, and optimal control; (b) A system architecture and implementation that accomplishes diverse industry applications by connecting to different databases, installing specialized templates, and integrating with various related sensor and synthesis hardware; (c) A storage utility for capturing, archiving, and querying data relevant to analytical simulation results and empirical experimentation; (d) A synthesis engine and interface to drive control commands to desired external resources for nanoscale fabrication and/or molecular assembly.\n2. The system of claim 1 further comprising a rendering utility capable of presenting visual presentation of various data-driven representations of physical form, structure, and dynamic phenomena.\n3. The system of claim 1 further comprising an analytical toolset that enables mathematical, behavioral, and functional modeling and characterization of physical and chemical phenomena by integrating object-oriented code blocks representing periodic table element templates, combinatorial processes, subatomic structures, material attributes, and various synthesis schema.\n4. The system of claim 1 further comprising organic and inorganic abstraction libraries from which static and/or dynamic models of biological, cellular, synthetic, and/or hybrid structures are developed for the purposes of design, analysis, simulation, and physical embodiment of products and processes for molecular assembly and/or nanoscale device manufacture.\n5. The system of claim 1 further comprising a customizable driver interface for capturing empirical measurement data, including specific drivers for commercially available nanoscale instrumentation, e.g., scanning tunneling, scanning probe, and atomic force microscopy and sensor devices/approaches of similar resolution.\n6. The system of claim 1 further comprising a visualization/rendering engine compatible with commercially available graphic tools and methods, e.g., VRML, OpenGL, Flash, etc. The visualization tools can be used to create customized displays of nanoscale phenomena for graphical presentation.\n7. The system of claim 1 further comprising a real-time synthesis/fabrication closed-loop control procedural block that can be readily integrated with the external sensor driver interfaces for certain suitable applications, e.g., nanoscale fabrication and molecular assembly. This code block can be generated using stored schema templates, internal control code development tools, externally implemented control theory computing software, or custom script or compiled software code.\n8. The system of claim 1 further comprising an optional module for auto-generation of standardized documentation (e.g., engineering drawings, technical specifications, etc.) relating to particular industry applications.\n9. The system of claim 1 further comprising stored data from the libraries contains mathematical models of particle dynamics and other related physiochemical and material attributes (e.g., stochastic/thermodynamic representative behavior of silicon, polymers, and/or other material and substrates).\n10. The system of claim 1 further comprising characterizations generated from stored data focused on atomic (and subatomic when applicable) descriptions, but can be extended to bottom-up descriptions of bulk material processing (e.g., how materials respond to microfabrication techniques like etching, lithographic processes, etc.).\n11. The system of claim 1 further comprising a differential equation solver for developing and integrating dynamic models for stochastic representation of particle spatial relationships and higher order states, i.e., velocity, acceleration, jerk, or partial derivative states with respect to variables other than time.\n12. The system of claim 1 further comprising a Monte Carlo analysis procedure that can be performed using simulated results and compared to empirical data.\n13. The system of claim 1 further comprising an optimal stochastic linear control synthesis methodology that incorporates a first order dynamic mathematical representation (of the conceptual molecular system) suitable for applying various pragmatic control system techniques including optimization of structured singular values, linear quadratic performance functions, Lyapunov criteria, or similar, for the purposes of nanoscale fabrication and molecular assembly.\n14. 14 A method for determining the physiochemical characteristics of at least one type of material using nanoscale mathematical modeling, the method comprising: (a) One or more related computer programs, device drivers, and application programming interfaces to external computational resources and data storage utilities, that together implement a combination of executable procedures representing advanced mathematics from quantum theory, chemical physics, stochastic analysis, and optimal control; (b) A system architecture and implementation that accomplishes diverse industry applications by simply connecting to different databases, installing specialized templates, and integrating with various related sensor and synthesis hardware; (c) A storage utility for capturing, archiving, and querying data relevant to analytical simulation results and empirical experimentation (d) A synthesis engine and interface to drive control commands to desired external resources for nanoscale fabrication and/or molecular assembly.\n15. The method of claim 14 wherein the model is a dynamic mathematical representation based on differential equations representing the quantum state of the at least one material, including reagents, solutions, or substrates, if applicable, and wherein the model can be integrated relative to time to simulate dynamic properties of the material under at least one morphological condition.\n16. The method of claim 15 wherein the differential equations are a first order approximation about an equilibrium point such that they are suitable for a gain-scheduled optimal linear control methodology including optimization of structured singular values, linear quadratic performance functions, Lyapunov criteria, or similar, for the purposes of nanoscale fabrication and molecular assembly.\n17. The method of claim 14 further comprising the step of transmitting the characteristics of the at least one material type over an internet for additional processing, storage, or display.\n18. 18 A system for monitoring the molecular manufacturing of nano-electronic devices such as semiconductors, programmable gate arrays, computational machines, and memory blocks, the system comprising: (a) One or more related computer programs, device drivers, and application programming interfaces to external computational resources and data storage utilities, that together implement a combination of executable procedures representing advanced mathematics from quantum theory, chemical physics, stochastic analysis, and optimal control, as related to nano-electronics;(b) A storage utility for capturing, archiving, and querying data relevant to analytical simulation results and empirical experimentation;(c) A synthesis engine and interface to drive control commands to desired external resources for nanoscale fabrication and/or molecular assembly, as related to nano-electronics.\n19. The method of claim 18 further comprising at least one control methodology for active computer-implemented control of the molecular manufacturing process.",
    "status": "Abandoned",
    "citations_own": [
        "US4988446A",
        "US5422988A",
        "US5446870A",
        "US5488601A",
        "US5528146A",
        "US5553004A",
        "US5590051A",
        "US5864488A",
        "US6014449A",
        "US6029114A",
        "US6060293A",
        "US6125332A",
        "US6150179A",
        "US6215327B1",
        "US6219440B1",
        "US6231744B1",
        "US6270946B1",
        "US6304481B1",
        "US20010041344A1",
        "US6411944B1",
        "US6415272B1",
        "US6420169B1",
        "US6421612B1",
        "US6430511B1",
        "US6438204B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "WO2004057302A2",
        "US20040236758A1",
        "US20050218398A1",
        "US20050218397A1",
        "US20050229328A1",
        "US20050231855A1",
        "US20050230822A1",
        "US20060131271A1",
        "US20060198209A1",
        "US20070150861A1",
        "US20070174026A1",
        "US20070179759A1",
        "US20070219764A1",
        "US20080027968A1",
        "US7393699B2",
        "US20080238918A1",
        "US20090200210A1",
        "US20100042266A1",
        "US20100126906A1",
        "US20100133150A1",
        "US20100243535A1",
        "US20100282277A1",
        "US7856342B1",
        "US20110024128A1",
        "US8591724B2",
        "US8597504B2",
        "US8949038B2",
        "US9222929B2",
        "US9283499B2",
        "US20180144076A1",
        "US10204181B1",
        "CN109375526A",
        "EP3511784A1",
        "EP3511783A1",
        "EP3511782A1",
        "US10637583B2",
        "US10635577B2",
        "CN111198774A",
        "CN112596474A"
    ],
    "citedby_ftf": []
}