{
    "patent_id": "US-10783991-B1",
    "title": "System, medical item including RFID chip, data collection engine, server and method for capturing medical data ",
    "assignee": "Brain Trust Innovations I, Llc",
    "publication_date": "2020-09-22",
    "patent_link": "https://patents.google.com/patent/US10783991B1/en",
    "inventors": [
        "David Laborde"
    ],
    "classifications": [
        "G16H50/30",
        "G16H10/65",
        "A61B5/165",
        "G06K19/0723",
        "G06K19/07762",
        "G06K7/10366",
        "G06N3/04",
        "G06N3/048",
        "G06N3/08",
        "G06N3/088",
        "G06Q10/0633",
        "G06Q10/08",
        "G06Q50/22",
        "G16H40/20",
        "G16H40/63",
        "G16H50/70",
        "A61B2562/08",
        "G06N20/10",
        "G06N3/006",
        "G06N3/0409",
        "G06N3/044",
        "G06N3/084",
        "G06N3/086",
        "G06N5/01",
        "G06N5/041",
        "G06N5/046",
        "G06N5/048",
        "G06N7/01"
    ],
    "abstract": "A system includes a plurality of RFID chips affixed to a catheter, a data collection engine device, and a server device. The data collection engine wirelessly transmits power to a first one of the RFID chips and receives first medical data from the first RFID chip while the first RFID chip is activated by the power receiver. The data collection engine generates a first message indicative of the first medical data to be sent to the server device. The server device can determine aspects of the catheter such as position and risk states based upon the first medical data.",
    "claims": "\n1. A server device comprising:\na transceiver configured to receive a message from an item via a network connection, the message including identification information associated with an RFID chip associated with the item and a plurality of measured values;\na controller operatively coupled to the transceiver; and\none or more memory sources operatively coupled to the controller, the one or more memory sources storing instructions for configuring the controller to determine a parameter of the item based upon the plurality of measured values,\nwherein the RFID chip received power wirelessly from a reader device,\nwherein the one or more memory sources further store a trained model for generating an output value associated with the parameter based upon the plurality of measured values,\nwherein the trained model is a trained neural network model (NNM), and\nwherein the output value is one of a prediction value associated with a discontinuance risk or occurrence of infection.\n2. The server device of claim 1, wherein the controller is further configured to determine an air-body interface of the item based upon the measured values.\n3. The server device of claim 1, wherein the controller is further configured to determine an insertion time at which the item was inserted in a human body cavity and a discontinuance time at which the item became removed from the human body cavity based upon the identification information and the measured values.\n4. The server device of claim 1, wherein:\nthe controller is further configured to:\nperform pre-processing on the plurality of measured values to generate an input data set; and\ngenerate the output value from the trained model based upon the input data set.\n5. A reader device comprising:\nan RFID antenna;\na power transmission subsystem including a power source and an antenna arranged to wirelessly transmit power from the power source to an RFID tag associated with an item;\na transceiver configured to receive first data from the RFID tag, the first data including identification information;\na controller operatively coupled to the transceiver; and\none or more memory sources operatively coupled to the controller, the one or more memory sources including instructions for configuring the controller to generate one or more messages indicative of the identification information to be sent by the transceiver to a server device via a network connection, wherein:\nthe transceiver is further configured to receive second data from the RFID tag, the second data including a plurality of measured values;\nthe controller is further configured to generate one or more messages indicative of the plurality of measured values to be sent by the transceiver to the server device to be input into a trained model to generate an output value associated with the item,\nthe trained model is a trained neural network model (NNM), and\nthe output value is one of a prediction value associated with a discontinuance risk or occurrence of infection.\n6. The reader device of claim 5, wherein the transceiver is configured to communicate with RAIN ISO 18000-6C, EPC Class 1 Gen2 compliant RFID tags.\n7. The reader device of claim 5, wherein the transceiver is configured to operate in 902 MHz-928 MHz, 920 MHz-925 MHz and 860 MHz-868 MHz frequency ranges.\n8. The server device of claim 1, wherein the transceiver configured to receive the message from a reader device via the network connection, the reader device comprising a power transmission subsystem including a power source arranged to wirelessly transmit power to the RFID chip associated with the item via an antenna.\n9. The server device of claim 8, wherein the reader device is configured to communicate with RAIN ISO 18000-6C, EPC Class 1 Gen2 compliant RFID chips.\n10. The server device of claim 8, wherein the reader device is configured to operate in 902MHz-928MHz, 920 MHz-925MHz and 860 MHz-868MHz frequency ranges.\n11. A server device comprising:\na transceiver configured to receive a message from an item via a network connection, the message including identification information associated with an RFID chip associated with the item and a plurality of measured values;\na controller operatively coupled to the transceiver; and\none or more memory sources operatively coupled to the controller, the one or more memory sources storing instructions for configuring the controller to determine a parameter of the item based upon the plurality of measured values, wherein:\nthe RFID chip received power wirelessly from a reader device;\nthe one or more memory sources further store a trained model for generating an output value associated with the parameter based upon the plurality of measured values:\nthe one or more memory sources further store a plurality of past risk state events, each of the plurality of past risk state events including a plurality of item attributes and a quantifiable outcome; and\nthe controller is further configured to:\ntrain a neural network model (NNM) to generate the trained model, wherein the training of the NNM includes:\nperforming pre-processing on the plurality of item attributes for each of the plurality of past risk state events to generate a plurality of input data sets;\ndividing the plurality of past risk state events into a first set of training data and a second set of validation data;\niteratively performing a machine learning algorithm (MLA) to update synaptic weights of the NNM based upon the training data; and\nvalidating the NNM based upon the second set of validation data.\n12. The server device of claim 11, wherein:\nthe NNM includes an input layer, output layer, and a plurality of hidden layers with a plurality of hidden neurons; and\neach of the plurality of hidden neurons includes an activation function, the activation function is one of:\n\nthe sigmoid function ƒ(x)=1/(1+e −x);  (1)\n\nthe hyperbolic tangent function ƒ(x)=(e 2x−1)/(e 2x+1) and  (2)\n\na linear function ƒ(x)=x,  (3)\n13. The server device of claim 11, wherein the NNM is one or more of a feed forward structure Neural Network; ADALINE Neural Network, Adaptive Resonance Theory 1 (ART1), Bidirectional Associative Memory (BAM), Boltzmann Machine, Counterpropagation Neural Network (CPN), Elman Recurrent Neural Network, Hopfield Neural Network, Jordan Recurrent Neural Network, Neuroevolution of Augmenting Topologies (NEAT), and Radial Basis Function Network.\n14. The server device of claim 11, wherein the plurality of past risk state events includes catheter discontinuance from insertion in human cavity and catheter related infection occurrence, the plurality of item attributes includes the measured values, location along a catheter where said measured values were obtained, and time values associated with catheter insertion and removal.",
    "status": "Active",
    "citations_own": [
        "US6712276B1",
        "US6720866B1",
        "US20040143403A1",
        "US20050142664A1",
        "US7158030B2",
        "US7388506B2",
        "US7479887B2",
        "US7586417B2",
        "US20090256701A1",
        "US20100190436A1",
        "US7772981B1",
        "US7774143B2",
        "US7852221B2",
        "US7850893B2",
        "US7875227B2",
        "US7922961B2",
        "US7973664B1",
        "US20110291809A1",
        "US8097199B2",
        "US8098162B2",
        "US8120484B2",
        "US8181875B2",
        "US8212226B2",
        "US8296247B2",
        "US20130002034A1",
        "US8478535B2",
        "US20130246207A1",
        "US20140105359A1",
        "US20140343955A1",
        "US20150317589A1",
        "US20160187347A1",
        "US20170370734A1",
        "US20180032690A1"
    ],
    "citations_ftf": [
        "WO2015050929A1"
    ],
    "citedby_own": [
        "US11234787B1",
        "DE102021120340A1",
        "US11786647B1"
    ],
    "citedby_ftf": [
        "US9774604B2",
        "US10319476B1",
        "US10380348B2",
        "US20180293682A1",
        "WO2018201083A1",
        "US11070568B2",
        "US11593606B1",
        "US11082296B2",
        "CN112640381A",
        "US11451571B2",
        "US11689573B2",
        "CN109918649B",
        "US20200279641A1",
        "CN110059887B",
        "US20210045696A1",
        "CN111461892B",
        "US11651855B2",
        "US11115799B1",
        "CN112101094B",
        "US11363024B2",
        "CN112631415B",
        "WO2023059743A1",
        "US11552975B1",
        "US11770307B2"
    ]
}