{
    "patent_id": "US-10963333-B1",
    "title": "Telematics-based network device troubleshooting and repair ",
    "assignee": "Cox Communications, Inc.",
    "publication_date": "2021-03-30",
    "patent_link": "https://patents.google.com/patent/US10963333B1/en",
    "inventors": [
        "Yousef Wasef Nijim",
        "James Alan Strothmann"
    ],
    "classifications": [
        "G06F11/0709",
        "G06F11/0757",
        "G06F11/0787",
        "G06F11/079",
        "G06F11/0793",
        "G06F11/3006",
        "G06F11/3058",
        "G06F11/3065",
        "G06N20/00",
        "G06F11/3089",
        "G06N5/041"
    ],
    "abstract": "Telematics-based device troubleshooting, self-repair, and optimization are provided. A system, method, and computer readable storage device collect telemetry data associated with the health of networked CPE devices, service provider data, and service and repair data associated with CPE devices, analyze the collected information, and detect and predict issues that can affect the functioning and operation of CPE devices. Analysis of collected data can be based on self-check rules. In some implementations, troubleshooting steps or rules can be executed by a server device or communicated to a CPE device for enabling self-troubleshooting and self-correction of an issue. Self-check and troubleshooting rules can be configured according to insights derived from machine learning techniques applied to collected data (e.g., telemetry data, service provider data, and service and repair data (troubleshooting and repair feedback data collected in association with customer calls, field technician visits, and self-healing checks and actions performed on/by CPE devices)).",
    "claims": "\n1. A system for providing telematics-based device troubleshooting, self-repair, and optimization, the system comprising:\nat least one processor; and\na memory storage including instructions that, when executed by the at least one processor, cause the system to:\nreceive telemetry data from a plurality of network-connected customer premises equipment (CPE) devices;\nevaluate the telemetry data for identifying an issue associated with at least one CPE device of the plurality of CPE devices;\ngenerate a troubleshooting plan comprising a plurality of troubleshooting steps for diagnosing and resolving the issue, wherein generation of the troubleshooting plan is based on machine-learned insights;\ntransmit one or more of the plurality of troubleshooting steps to the at least one CPE device to cause the at least one CPE device to execute the one or more troubleshooting steps to diagnose and resolve the issue;\nreceive troubleshooting and repair feedback from the at least one CPE device, the feedback includes information associated with whether the one or more troubleshooting steps resolved the issue;\nstore data, including the telemetry data and the troubleshooting and repair feedback, in a database system;\nanalyze the data stored in the database system; and\nbased on the analysis:\npredict an occurrence of the issue in association with one or more other CPE devices of the plurality of CPE devices prior to the issue occurring; and\nproactively generate and transmit a modified troubleshooting plan based on the analysis to the one or more other CPE devices for execution to prevent the issue from occurring.\n2. The system of claim 1, wherein in generating the troubleshooting plan, the instructions further cause the system to customize the troubleshooting plan based at least in part on the particular at least one CPE device and the issue.\n3. The system of claim 1, wherein the data stored in the database system further includes service provider data from a service provider system and associated metadata, and in analyzing the data stored in the database system, the instructions further cause the system to:\nuse machine-learning techniques to analyze the data for identifying a data pattern associated with attributes of the issue;\nconfigure one or more self-check rules based on the identified data pattern; and\nstore the one or more self-check rules for use in identifying the issue.\n4. The system of claim 3, wherein the service provider data includes one or a combination of:\ninformation about signal levels of transmissions from a headend of the server provider system;\nbandwidth levels;\nsoftware update-related information;\navailable services;\ncustomer subscription information; and\nbusiness rules.\n5. The system of claim 3, wherein the identified data pattern is associated with at least one of:\nparticular telemetry data values;\na type of CPE device;\na particular service;\na particular network;\na location;\na node;\na particular software version;\na particular hardware component;\nan application; and\na particular device configuration.\n6. The system of claim 3, wherein the instructions further cause the system to:\nuse the machine-learning techniques to analyze the troubleshooting and repair feedback for deriving insights;\nadjust one or more troubleshooting steps based on the derived insights; and\nmodify the troubleshooting plan for diagnosing and resolving the issue based on the derived insights to generate the modified troubleshooting plan.\n7. The system of claim 6, wherein the troubleshooting and repair feedback includes information associated with troubleshooting or correcting the issue and includes one or a combination of:\ninformation associated with the attributes of the issue;\ninformation about the at least one CPE device;\ntroubleshooting steps performed;\nactions taken to correct the issue; and\nresults of the troubleshooting steps.\n8. The system of claim 3, wherein in predicting the occurrence of the issue in association with the one or more other CPE devices, the instructions further cause the system to predict the occurrence based on an identification of corresponding attributes of the issue and the one or more other CPE devices.\n9. The system of claim 3, wherein the instructions further cause the system to:\nstore the one or more self-check rules for access by the at least one CPE device; and\nreceive an alert indicating the issue and the telemetry data from the at least one CPE device responsive to a local identification of the issue by the at least one CPE device based on an evaluation of the one or more self-check rules.\n10. The system of claim 1, wherein the instructions further cause the system to execute one or more of the plurality of troubleshooting steps of the troubleshooting plan to diagnose and resolve the issue.\n11. A customer premises equipment (CPE) device comprising:\nat least one processor; and\na memory storage including instructions that, when executed by the at least one processor, cause the CPE device to:\ncollect telemetry data associated with the CPE device;\napply one or more self-check rules to the collected telemetry data for identifying an issue associated with the CPE device, wherein one of the one or more self-check rules includes determining a status of one or more other CPE devices communicatively coupled to the CPE device, the status indicating whether the issue has been identified in association with the one or more other CPE devices;\nresponsive to identifying the issue associated with the CPE device, generate and transmit an alert to a telematics device repair (TDR) server, wherein the alert includes information about the issue and about the CPE device;\nreceive, from the TDR server, a troubleshooting plan comprising one or more troubleshooting steps for diagnosing and resolving the issue, wherein generation of the troubleshooting plan is based on machine-learned insights;\nexecute the one or more troubleshooting steps to diagnose and resolve the issue; and\nprovide, to the TDR server, troubleshooting and repair feedback, the feedback including information associated with whether the one or more troubleshooting steps resolved the issue.\n12. The CPE device of claim 11, wherein the telemetry data associated with the CPE device includes information about the CPE device's connectivity to a network, signal levels, information about the functioning of hardware components, information about the functioning of software components, and application signaling information.\n13. The CPE device of claim 12, wherein in determining the status of the one or more other CPE devices communicatively coupled to the CPE device, the instructions cause the CPE device to:\nrequest the status of the one or more other CPE devices association with the issue;\nreceive an acknowledgement response from the one or more other CPE devices indicating whether the one or more other CPE devices are experiencing the same issue; and\nbased on the acknowledgement response, determine whether the issue is confined to the CPE device or if the CPE device and the one or more other CPE devices are experiencing the same issue.\n14. The CPE device of claim 13, wherein the one or more other CPE devices are located at a same premises as the CPE device or on a same node as the CPE device.\n15. The CPE device of claim 11, wherein the one or more self-check rules are configured based on machine-learned insights learned from an analysis of telemetry data collected from a plurality of CPE devices, service provider data, troubleshooting and repair feedback, and associated metadata.\n16. The CPE device of claim 11, wherein the one or more troubleshooting steps for troubleshooting the issue are configured based on machine-learned insights learned from an analysis of troubleshooting and repair feedback received from a combination of:\nother CPE devices;\nservice technicians; and\nthe TDR server.\n17. The CPE device of claim 11, wherein the instructions further cause the CPE device to:\ndetermine whether to transmit at least one of the one or more troubleshooting steps of the troubleshooting plan to another device for presentation to a user, wherein the determination is based at least in part on whether the at least one of the one or more troubleshooting step can be communicated to a display device associated with the CPE device; and\nbased on the determination, transmit the at least one of the one or more troubleshooting steps of the troubleshooting plan to the other device for presentation to the user.\n18. A method for providing telematics-based device troubleshooting, self-repair, and optimization, the method comprising:\nreceiving and storing telemetry data from a plurality of network-connected customer premises equipment (CPE) devices;\nreceiving and storing server provider data from a server provider system;\nreceiving and storing troubleshooting and repair feedback from a plurality of troubleshooting and repair feedback data sources;\nanalyzing the collected telemetry data, server provider data, and troubleshooting and repair feedback using machine-learning techniques for identifying a data pattern associated with attributes of an issue experienced by one or more of the plurality of CPE devices;\nconfiguring one or more self-check rules based on the identified data pattern;\nstoring the one or more self-check rules in association with the issue;\nanalyzing troubleshooting and repair feedback using machine-learning techniques for determining troubleshooting steps for troubleshooting and correcting the issue;\nstoring the troubleshooting steps in association with the issue;\nevaluating telemetry data collected from a CPE device from the plurality of CPE devices based on the one or more self-check rules;\nbased on the evaluation, identifying the issue;\ngenerating a troubleshooting plan comprising one or more of the troubleshooting steps for diagnosing and resolving the issue, wherein generation of the troubleshooting plan is based on machine-learned insights;\ndetermining whether at least one troubleshooting step of the one or more troubleshooting steps includes involvement of a user of the CPE device;\nin response to a determination that none of the troubleshooting steps include the user's involvement, transmitting the one or more troubleshooting steps of the troubleshooting plan to the CPE device to cause the CPE device to automatically execute the one or more troubleshooting steps to diagnose and resolve the issue without the user's involvement;\nin response to a determination that the at least one troubleshooting step includes the user's involvement:\ndetermining whether the at least one troubleshooting step can be communicated to the user via the CPE device; and\nif the at least one troubleshooting step cannot be communicated to the user via the CPE device, transmitting the at least one troubleshooting step to another device through which the at least one troubleshooting step can be communicated to the user;\nelse transmitting the one or more troubleshooting steps to the CPE device;\nreceiving troubleshooting and repair feedback from the CPE device, the feedback including information associated with whether the one or more troubleshooting steps resolved the issue; and\nstoring the received troubleshooting and repair feedback in a database system where the troubleshooting and repair feedback is analyzed for deriving machine-learned insights that adjust the one or more troubleshooting steps and modify the troubleshooting plan.\n19. The method of claim 18, wherein determining whether the at least one troubleshooting step can be communicated to the user via the CPE device further comprises\ndetermining whether the at least one troubleshooting step can be communicated to and displayed on a display device associated with the CPE device.\n20. The method of claim 18, wherein if the at least one troubleshooting step cannot be communicated to the user via the CPE device, the other device to which the at least one troubleshooting step is transmitted is another CPE device of the plurality of CPE devices.",
    "status": "Active",
    "citations_own": [
        "US4937825A",
        "US20050278575A1",
        "US20090063387A1",
        "US7620848B1",
        "US20120221125A1",
        "US8327408B2",
        "US8340923B2",
        "US8356207B2",
        "US8365019B2",
        "US20140019092A1",
        "US8738973B1",
        "US8826314B2",
        "US20140336791A1",
        "US20150007173A1",
        "US8938749B2",
        "US9092802B1",
        "US20150348051A1",
        "WO2015188490A1",
        "US20160255342A1",
        "US9449278B2",
        "US9459976B1",
        "US9647906B2",
        "US9720758B2",
        "US20170250855A1",
        "US20180307759A1",
        "US20190339688A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20210176614A1",
        "US20220174012A1",
        "US20220232285A1",
        "US11398960B1",
        "US11416327B2",
        "US20220291728A1",
        "US11456912B2",
        "US11483202B2",
        "US11625292B2",
        "WO2023056831A1",
        "CN115981857A",
        "US11650887B2",
        "US11757708B2",
        "US11809270B1"
    ],
    "citedby_ftf": []
}