{
    "patent_link": "https://patents.google.com/patent/US20070118432A1/en",
    "patent_id": "US20070118432A1",
    "title": "Systems and methods for optimizing revenue in search engine auctions",
    "abstract": "Systems and methods are disclosed for improving the allocation of an on-line query to a bidder. One method comprises determining a tradeoff value corresponding to the bidder and rating the bidder in relation to other bidders according to the tradeoff value. Another method comprises receiving a query, assigning a bid value to the bidder, determining a tradeoff value corresponding to the bidder, calculating a tradeoff product of the bid value and the tradeoff value, and allocating the query to the bidder if the tradeoff product is greater than tradeoff products corresponding to other bidders.",
    "inventors": [
        "Vijay Vazirani",
        "Umesh Vazirani",
        "Amin Saberi",
        "Aranvak Mehta"
    ],
    "assignee": "Individual",
    "classifications": [
        "G06Q30/00",
        "G06Q30/0601"
    ],
    "claims": "\n1. A method for improving the allocation of an online activity to a bidder, the method comprising determining a tradeoff value corresponding to the bidder and rating the bidder in relation to other bidders according to the tradeoff value, wherein the tradeoff value is at least partially determined according to a fraction of spent budget corresponding to the bidder.\n2. The method of claim 1, wherein the tradeoff value is determined according to equation Ψ(f)=1−e−(1−f), wherein f corresponds to the fraction of spent budget.\n3. The method of claim 1, wherein the tradeoff value is determined according to a monotonically decreasing function.\n4. The method of claim 1, wherein the online activity corresponds to a search query.\n5. The method of claim 1, wherein the online activity corresponds to an auction.\n6. The method of claim 1, wherein the online activity corresponds to a purchase transaction.\n7. A method for improving the allocation of an online activity to a bidder, the method comprising determining a tradeoff value corresponding to the bidder and rating the bidder in relation to other bidders according to the tradeoff value, wherein the tradeoff value is at least partially determined according to a fraction of unspent budget corresponding to the bidder.\n8. The method of claim 7, wherein the tradeoff value is determined according to equation Ψ(f)=1−e−(1−f) wherein f corresponds to the fraction of unspent budget.\n9. The method of claim 7, wherein the tradeoff value is determined according to a monotonically decreasing function.\n10. The method of claim 7, wherein the online activity corresponds to a search query.\n11. The method of claim 7, wherein the online activity corresponds to an auction.\n12. The method of claim 7, wherein the online activity corresponds to a purchase transaction.\n13. A method for improving the allocation of an online activity to a bidder, the method comprising determining a tradeoff value corresponding to the bidder and rating the bidder in relation to other bidders according to the tradeoff value, wherein the tradeoff value is at least partially determined according to a rank of the bidder in a random permutation of total bidders.\n14. The method of claim 13, wherein the tradeoff value is determined according to equation\n15. The method of claim 13, wherein the tradeoff value is determined according to a monotonically decreasing function.\n16. The method of claim 13, wherein the online activity corresponds to a search query.\n17. The method of claim 13, wherein the online activity corresponds to an auction.\n18. The method of claim 13, wherein the online activity corresponds to a purchase transaction.\n19. A method of allocating an online activity to a bidder, the method comprising:\nreceiving the online activity;\nassigning a bid value to the bidder;\ndetermining a tradeoff value corresponding to the bidder;\ncalculating a tradeoff product of the bid value and the tradeoff value; and\nallocating the online activity to the bidder if the tradeoff product is greater than tradeoff products corresponding to other bidders.\n20. The method of claim 19, further comprising determining the tradeoff value at least partially according to a fraction of spent budget corresponding to the bidder.\n21. The method of claim 19, further comprising determining the tradeoff value according to equation Ψ(f)=1−e−(1−f), wherein f corresponds to a fraction of spent budget corresponding to the bidder.\n22. The method of claim 19, further comprising determining the tradeoff value according to equation Ψ(f)=1−e−(1−f), wherein f corresponds to a fraction of unspent budget corresponding to the bidder.\n23. The method of claim 19, further comprising determining the tradeoff value according to a monotonically decreasing function.\n24. The method of claim 19 further comprising determining the tradeoff value according to equation\n25. The method of claim 19, wherein the online activity corresponds to a search query.\n26. The method of claim 19, wherein the online activity corresponds to an auction.\n27. The method of claim 19, wherein the online activity corresponds to a purchase transaction.\n28. The method of claim 19, further comprising associating results from the online activity with at least one advertisement corresponding to the bidder.\n29. The method of claim 19, further comprising the bidder paying the bid value only if a user performs a specified action.\n30. The method of claim 19, further comprising the bidder paying the bid value corresponding to a bidder having a next lower tradeoff product.\n31. The method of claim 19, further comprising ordering multiple bidders according to the tradeoff product corresponding to each of the multiple bidders.\n32. The method of claim 31, further comprising assigning the online activity to at least two of the multiple bidders.\n33. The method of claim 31, further comprising associating at least one advertisement corresponding to at least one of the multiple bidders with results from the online activity.\n34. The method of claim 31, further comprising each of the multiple bidders paying a bid value corresponding to a next bidder that is next lower in the ordering of the multiple bidders upon a user performing a specified action.\n35. The method of claim 31, wherein each of the multiple bidders has a corresponding budget and at least two of the corresponding budgets are different.\n36. The method of claim 31, further comprising allocating the multiple online activities wherein each of the multiple bidders retains at least a fraction of a budget corresponding to that one of the multiple bidders.\n37. The method of claim 31, further comprising adding at least one bidder to the multiple bidders at a time separate from at least one other bidder.\n38. The method of claim 31, further comprising removing at least one bidder from the multiple bidders at a time separate from at least one other bidder.\n39. A system for allocating an on-line activity to a bidder, the system comprising:\nmeans for receiving the online activity;\nmeans for assigning a bid value to the bidder;\nmeans for determining a tradeoff value corresponding to the bidder;\nmeans for calculating a tradeoff product of the bid value and the tradeoff value; and\nmeans for allocating the online activity to the bidder if the tradeoff product is greater than tradeoff products corresponding to other bidders.\n40. The system of claim 39, further comprising that the tradeoff value is at least partially determined according to a fraction of spent budget corresponding to the bidder.\n41. The system of claim 39, further comprising that the tradeoff value is determined according to equation Ψ(f)=1−e−(1−f), wherein f corresponds to a fraction of spent budget corresponding to the bidder.\n42. The system of claim 39, further comprising that the tradeoff value is determined according to equation Ψ(f)=1−e−f), wherein f corresponds to a fraction of unspent budget corresponding to the bidder.\n43. The system of claim 39, further comprising that the tradeoff value is determined according to a monotonically decreasing function.\n44. The system of claim 39, further comprising that the tradeoff value is determined according to equation\n45. The system of claim 39, wherein the online activity corresponds to a search query.\n46. The system of claim 39, wherein the online activity corresponds to an auction.\n47. The system of claim 39, wherein the online activity corresponds to a purchase transaction.\n48. The system of claim 39, further comprising that at least one advertisement corresponding to the bidder is associated with results from the online activity.\n49. The system of claim 39, further comprising that the bidder pays the bid value only upon a user specified action.\n50. The system of claim 39, further comprising that the bidder pays the bid value of a bidder having a next lower tradeoff product.\n51. The system of claim 39, further comprising multiple bidders, the multiple bidders being ordered according to the tradeoff product corresponding to each of the multiple bidders.\n52. The system of claim 51, further comprising an online activity assigned to at least two of the multiple bidders.\n53. The system of claim 51, further comprising that at least one advertisement corresponding to at least one of the multiple bidders are associated with results from the online activity.\n54. The system of claim 51, further comprising that each of the multiple bidders pays a bid value corresponding to a next bidder that is next lower in the ordering of the multiple bidders upon a user specified action.\n55. The system of claim 51, wherein each of the multiple bidders has a corresponding budget and at least two of the corresponding budgets are different.\n56. The system of claim 51, further comprising multiple online activities wherein each of the multiple bidders retains at least a fraction of a budget corresponding to that one of the multiple bidders after allocation of the multiple online activities.\n57. The system of claim 51, further comprising adding at least one bidder to the multiple bidders at a time separate from at least one other bidder.\n58. The system of claim 51, further comprising removing at least one bidder from the multiple bidders at a time separate from at least one other bidder.\n59. A method of allocating an online activity to a bidder where there are multiple bidders, the method comprising:\nreceiving the online activity;\nassigning a weighted value to each of the multiple bidders;\ndetermining an effective bid value corresponding to each of the multiple bidders where the effective bid value is the product of the bid value for each of the multiple bidders and the weighted value corresponding to that respective multiple bidder; and\nallocating the online activity to the bidder according to an ordering of the effective bid values.\n60. The method of claim 59, wherein assigning the weighted value further comprises:\nassigning all bidder weighted values to an initial value;\nsetting a window of time;\nadjusting the weighted values after each window of time by increasing the weighted value if the corresponding bidder spends less than a first specified value during the window of time, and decreasing the weighted value if the corresponding bidder spends more than a second specified value during the window of time.\n61. The system of claim 59, wherein the online activity corresponds to a search query.\n62. The system of claim 59, wherein the online activity corresponds to an auction.\n63. The system of claim 59, wherein the online activity corresponds to a purchase transaction.",
    "status": "Abandoned",
    "citations_own": [
        "US6269361B1",
        "US20010042039A1",
        "US20010044751A1",
        "US20020026429A1",
        "US20020032621A1",
        "US20020082961A1",
        "US20020188527A1",
        "US20030055729A1",
        "US20030105677A1",
        "US20030182230A1",
        "US20030216930A1",
        "US20040054551A1",
        "US20040088241A1",
        "US20040107137A1",
        "US20050033706A1",
        "US7107227B1",
        "US20070038509A1",
        "US20070061229A1",
        "US20070136176A1",
        "US20070179849A1",
        "US7266522B2",
        "US20080052219A1",
        "US20080071672A1",
        "US20080147582A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20050209929A1",
        "US20060101060A1",
        "US20080104026A1",
        "US20080167948A1",
        "US20100070509A1",
        "US20100082421A1",
        "US20100115326A1",
        "US20100324993A1",
        "US7857699B2",
        "US20110040619A1",
        "US7905777B2",
        "US20110238490A1",
        "US8216065B2",
        "US8631044B2",
        "US8825566B2",
        "US8922559B2",
        "US9009318B2",
        "US9082082B2"
    ],
    "citedby_ftf": []
}