{
    "patent_link": "https://patents.google.com/patent/US5389773A/en",
    "patent_id": "US5389773A",
    "title": "Self-service system having transaction predictive capability and method of using",
    "abstract": "A self-service system, such as an automated teller machine (ATM) system, uses predictive technology. When a user begins a transaction by inserting an identification card into a card reader of an ATM, the predictive technology predicts which service or services provided by the system the user is likely to request. This prediction is based upon a stored record in the system, representing previous transactions by that user. The prediction is made in advance of completion of an authorization process for the transaction, to increase the speed of operation of the ATM in carrying out the transaction. For example, to reduce overall transaction time, the ATM can count out a predicted amount of cash in advance of an anticipated withdrawal request. Also, the prediction is used to generate a special display for a particular user, the display being designed to simplify the decisions and selections required to be made by the user.",
    "inventors": [
        "Michael G. Coutts",
        "Alan F. Newell",
        "Ian W. Ricketts"
    ],
    "assignee": "NCR Voyix Corp",
    "classifications": [
        "G06Q30/02",
        "G06Q20/1085",
        "G07F19/20",
        "G07F19/201",
        "G07F19/207"
    ],
    "claims": "\n1. A self-service system having the capability of predicting a type of transaction to be initiated by a customer, comprising:\na customer interface unit for initiating a selected type of self-service transaction;\ncontroller means for controlling the operation of said system in response to the type of transaction initiated by said customer;\nstorage means for storing data relating to previous transactions of the system initiated by various customers;\ninput means for inputting transaction type data into said storage means;\nprediction means coupled to said storage means for predicting the type of transaction to be initiated by a given customer; and\nconditioning means controlled by said prediction means for conditioning said controller means to prepare said system for performing a certain type of transaction.\n2. The self-service system of claim 1, also including currency dispensing means for dispensing currency as part of one type of transaction which can be initiated by a customer.\n3. The self-service system of claim 2, in which said currency dispensing means can be pre-conditioned under control of the conditioning means for the dispensing of currency in accordance with a predicted type of transaction.\n4. The self-service system of claim 1, also including deposit receiving means for receiving currency deposits as part of one type of transaction which can be initiated by a customer.\n5. The self-service system of claim 1, also including statement issuing means for issuing a statement which is descriptive of a transaction which is initiated by a customer.\n6. The self-service system of claim 5, in which said statement issuing means can be pre-conditioned under control of the conditioning means to issue a statement in accordance with a predicted type of transaction.\n7. The self-service system of claim 1, in which the customer interface unit includes a menu display for leading a customer through various stages of a transaction, and in which said controller means can cause certain data to appear on said display in response to conditioning of said controller means by said conditioning means.\n8. The self-service system of claim 7, in which the customer interface unit can be pre-conditioned under control of the conditioning means to provide a predetermined menu display in accordance with a predicted type of transaction.\n9. The self-service system of claim 1, also including a card-reading means for reading a customer account card to ascertain the identity of a customer initiating a transaction of the system.\n10. The self-service system of claim 9, in which the customer identity ascertained from reading the customer account card is used to access the storage means to obtain data relating to previous transactions initiated by the customer whose card is read.\n11. A self-service system, comprising:\na user interface unit including user identification means for identifying users and input means for initiating a selected self-service transaction by a user;\ncontroller means for controlling operation of said system;\nstorage means for storing data relating to previous transactions initiated by various users of said system;\nprediction means coupled to said storage means, to said identification means, and to said controller means for predicting the type of transaction to be initiated by a given user, the mode of operation of said system when performing a transaction for a particular user being dependent upon a prediction made by said prediction means following identification of said user; and\nauthorization means for authorizing a transaction in respect to the entry by a user of a personal identification number on said input means, said prediction means being arranged to commence the process for making said prediction prior to the completion of an authorization process for authorizing said transaction.\n12. The self-service system of claim 11, in which said user interface unit is included in an automated teller machine.\n13. The self-service system of claim 12, in which said automated teller machine includes cash dispensing means for dispensing cash, said cash dispensing means being arranged to commence counting a predetermined amount of cash determined by said prediction means prior to the completion of said authorization process.\n14. The self-service system of claim 12, also including host computer means coupled to said prediction means and arranged to hold account information relating to said various users, a process for accessing and transmitting account information concerning a particular user to said automated teller machine being arranged to be commenced prior to the completion of said authorization process.\n15. The self-service system of claim 12, which includes a plurality of automated teller machines each including a user interface unit and prediction means, said storage means being located separate from said automated teller machines and being arranged to store data relating to previous transactions carried out by any of said automated teller machines.\n16. The self-service system of claim 11, in which said user identification means comprises a card reader for reading from a card information relating to a user.\n17. The self-service system of claim 11, also including user instruction means associated with said input means for providing to a user information concerning the action to be taken by the user to cause a desired transaction to be carried out by said system, the information provided by said instruction means being dependent upon the prediction made by said prediction means.\n18. The self-service system of claim 11, in which the information contained in said storage means is arranged to be updated each time a transaction is initiated by one of the various users of said system.\n19. The self-service system of claim 11, also including environmental data source means coupled to said prediction means for providing environmental data relating to a particular transaction, the prediction made by said prediction means being dependent upon said environmental data.\n20. A method for operating a self-service system employing predictive technology, comprising the following steps:\n(a) ascertaining the identity of a customer who is using the self-service system;\n(b) accessing a file containing records of previous transactions of that customer;\n(c) using the records of said file to generate a prediction as to at least one type of transaction which said customer is likely to initiate;\n(d) conditioning the system to be ready to perform a predicted type of transaction;\n(e) initiating a transaction by the customer;\n(f) comparing the type of transaction initiated by the customer with the type of transaction predicted;\n(g) utilizing the conditioned state of the system if the predicted and actual types of transaction are the same;\n(h) changing the state of the system to reflect the type of transaction selected by the customer if the types of transaction are not the same; and\n(i) adding information concerning the most recent transaction to said file to update said file.\n21. The method of claim 20, in which the conditioning step (d) includes counting out a predicted amount of currency in advance if the predicted type of transaction is a withdrawal request.\n22. The method of claim 20, in which the generation of a prediction in step (c) includes generating a prioritized list of predicted types of transactions.\n23. The method of claim 20, in which the ascertaining of identity of step (a) comprises sensing of a customer identification card.\n24. The method of claim 20, in which the conditioning step (d) includes causing certain data to appear on a customer lead-through display of the self-service system.\n25. The method of claim 20, in which the conditioning step (d) includes printing a statement describing the transaction.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4025905A",
        "US4577763A",
        "US4580040A",
        "US4617457A",
        "US4636947A",
        "US4788418A",
        "US4792018A",
        "US4912308A",
        "US5010238A",
        "JPH03168892A",
        "US5064999A",
        "US5120945A",
        "US5148365A",
        "US5276617A"
    ],
    "citations_ftf": [
        "FR2471000B1"
    ],
    "citedby_own": [
        "US5699522A",
        "US5719383A",
        "US5758087A",
        "WO1998059308A1",
        "US5859416A",
        "US5897625A",
        "US5915246A",
        "EP0793196A3",
        "US5949045A",
        "US5987439A",
        "US6012048A",
        "US6061433A",
        "US6149055A",
        "EP1085477A2",
        "GB2354609A",
        "WO2001006338A3",
        "US6273622B1",
        "GB2368442A",
        "GB2371397A",
        "US20020099658A1",
        "US6430539B1",
        "US20030066876A1",
        "US20030209599A1",
        "US20050035193A1",
        "US20050038747A1",
        "US20050119974A1",
        "US6970846B1",
        "US7025255B1",
        "US7080036B1",
        "US7266526B1",
        "US20070239494A1",
        "US20080045241A1",
        "US20090162184A1",
        "EP2166481A1",
        "US20100106623A1",
        "US8121914B1",
        "US8234134B2",
        "US8342396B2",
        "US8378856B2",
        "US8403205B1",
        "US8413890B1",
        "US8606851B2",
        "US20140164937A1",
        "US20180074847A1",
        "US20180225905A1",
        "US10482400B2",
        "US10825307B1"
    ],
    "citedby_ftf": [
        "NO306132B1",
        "DE10026250C2",
        "FR2848001A1",
        "WO2022072208A1"
    ]
}