{
    "patent_id": "US-2022229400-A1",
    "title": "Industrial device and method for building and/or processing a knowledge graph ",
    "assignee": "Siemens Aktiengesellschaft",
    "publication_date": "2022-07-21",
    "patent_link": "https://patents.google.com/patent/US20220229400A1/en",
    "inventors": [
        "Josep SOLER GARRIDO",
        "Dominik Dold"
    ],
    "classifications": [
        "G06N3/049",
        "G05B13/029",
        "G05B13/0265",
        "G06F16/254",
        "G06N3/042",
        "G06N3/047",
        "G06N3/065",
        "G06N3/08",
        "G06N3/084",
        "G06N3/088",
        "G06N5/01",
        "G06N5/022",
        "G06N5/04",
        "G05B2219/25428",
        "G06N3/045",
        "G06N3/048",
        "G06N7/01"
    ],
    "abstract": "Provided is an industrial device for building and/or processing a knowledge graph, with at least one sensor and/or at least one data source configured for providing raw data, with an ETL component, configured for converting the raw data into triple statements, using mapping rules, with a triple store, storing the triple statements as a dynamically changing knowledge graph (with a learning component, configured for processing the triple statements in a learning mode, and for performing an inference in an inference mode, and with a control component, configured for switching between different modes of operation of the learning component.",
    "claims": "\n1. An industrial device for building and/or processing a knowledge graph comprising:\nat least one sensor and/or at least one data source configured for providing raw data;\nan ETL component, configured for converting the raw data into triple statements, using mapping rules;\na triple store, storing the triple statements as a dynamically changing knowledge graph;\na learning component, configured for processing the triple statements in a learning mode, and for performing an inference in an inference mode; and\na control component, configured for switching between different modes of operation of the learning component.\n2. The industrial device according to claim 1, wherein the learning component and/or the control component implement a RESCAL algorithm, a TransE algorithm, a DistMult algorithm, or a Graph convolutional neural network.\n3. The industrial device according to claim 1, wherein the industrial device is a field device, an edge device, a sensor device, an industrial controller, a PLC controller, an industrial PC implementing a SCADA system, a network hub, a network switch, an industrial ethernet switch, or an industrial gateway connecting an automation system to cloud computing resources.\n4. The industrial device according to claim 1, wherein the control component is autonomous or processing external signals.\n5. The industrial device according to claim 1, wherein the learning component is configured for calculating a likelihood of a triple statement during inference mode.\n6. The industrial device according to claim 1, wherein the triple store also stores a pre-loaded static sub-graph.\n7. The industrial device according to claim 1, further comprising a statement handler, configured for triggering an automated action based on the inference of the learning component.\n8. The industrial device) according to claim 1,\nwherein the knowledge graph is an industrial knowledge graph describing parts of an industrial system;\nwith nodes of the knowledge graph representing physical objects, sensors, industrial controllers, robots, drives, manufactured objects, tools and/or elements of a bill of materials; and\nwith nodes of the knowledge graph representing abstract entities, attributes, configurations or skills of the physical objects, production schedules and plans, and/or sensor measurements.\n9. The industrial device according to claim 1, wherein the learning component and/or the control component are implemented as neuromorphic hardware as an application specific integrated circuit, a field-programmable gate array, a wafer-scale integration, a hardware with mixed-mode VLSI neurons, or a neuromorphic processor, a neural processing unit or a mixed-signal neuromorphic processor.\n10. The industrial device according to claim 1, wherein the learning component includes:\nan input layer containing node embedding populations of neurons, with each node embedding populations representing an entity contained in the triple statements; and\nan output layer, containing output neurons configured for representing a likelihood for each possible triple statement;\n11. The industrial device according to claim 10, wherein the control component is configured to alternatingly:\npresent inputs to the learning component by selectively activating subject and object populations among the node embedding populations;\nset hyperparameters of the learning component, in particular a factor (η) that modulates learning updates of the learning component;\nread output of the learning component; and\nuse output of the learning component as feedback to the learning component.\n12. The industrial device according to claim 10, wherein the output layer has one output neuron for each possible relation type of the knowledge graph.\n13. The industrial device according to claim 12, wherein the output neurons are stochastic dendritic output neurons, storing embeddings of relations that are given between a subject and an object in the triple statements in their dendrites, summing all dendritic branches into a final score, which is transformed into a probability using an activation function.\n14. The industrial device according to claim 13, wherein depending on the mode of the learning component, an output of the activation function is a prediction of the likelihood of a triple statement or a transition probability.\n15. The industrial device according to claim 13, wherein learning updates for relation embeddings are computed directly in dendritic trees of the stochastic, dendritic output neurons.\n16. The industrial device according to claim 10, wherein learning updates for entity embeddings are computed using static feedback connections from each output neuron to neurons of the node embedding populations.\n17. The industrial device according to claim 10, wherein in the sampling mode, by sampling from the activation function, a binary output signals to the control component whether a triple statement is accepted.\n18. The industrial device according to claim 10, wherein the learning component includes first neurons forming a first node embedding population, representing a first entity contained in the triple statements by first spike times of the first neurons during a recurring time interval;\nwherein the learning component includes second neurons forming a second node embedding population, representing a second entity contained in the triple statements by second spike times of the second neurons during the recurring time interval; and\nwherein a relation between the first entity and the second entity is represented as the differences between the first spike times and the second spike times.\n19. The industrial device according to claim 18, wherein the differences between the first spike times and the second spike times consider an order of the first spike times in relation to the second spike times, or\nwherein the differences are absolute values.\n20. The industrial device according to claim 18, wherein the relation is stored in one of the output neurons; and\nwherein the relation is given by vector components that are stored in dendrites of the output neuron.\n21. The industrial device according to claim 18, wherein the first neurons are connected to a monitoring neuron;\nwherein each first neuron is connected to a corresponding parrot neuron;\nwherein the parrot neurons are connected to the output neurons; and\nwherein the parrot neurons are connected to an inhibiting neuron.\n22. The industrial device according to claim 18, wherein the first neurons and the second neurons are spiking neurons, non-leaky integrate-and-fire neurons or current-based leaky integrate-and-fire neurons.\n23. The industrial device according to claim 18, wherein each of the first neurons and second neurons only spikes once during the recurring time interval, or\nwherein only a first spike during the recurring time interval is counted.\n24. The industrial device according to claim 10, wherein each node embedding population is connected to an inhibiting neuron, and therefore selectable by inhibition of the inhibiting neuron.\n25. A method for building and/or processing a knowledge graph by an industrial device, the method comprising:\nproviding, by at least one sensor and/or at least one data source raw data;\nconverting, by an ETL component, the raw data into triple statements, using mapping rules;\nstoring, by a triple store, the triple statements as a dynamically changing knowledge graph;\nprocessing, by a learning component, the triple statements in a learning mode;\nswitching, by a control component, operation of the learning component from the learning mode to an inference mode; and\nperforming, by the control component, an inference in the inference mode.",
    "status": "Pending",
    "citations_own": [],
    "citations_ftf": [
        "EP3173983A1",
        "EP3647965A1"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "CN115329613B",
        "CN115658021A"
    ]
}