{
    "patent_link": "https://patents.google.com/patent/US5754248A/en",
    "patent_id": "US5754248A",
    "title": "Universal video disc record and playback employing motion signals for high quality playback of non-film sources",
    "abstract": "A \"universal\" system records or transmits both 24 fps (or 25 fps) motion picture film sources and non-film interlaced or progressively-scanned video sources, employing any one of several international television standards (e.g., NTSC, PAL, HDTV/ATV, etc.) as progressively-scanned video at a nominal frame rate of 24 or 25 frames per second (i.e., 24 Hz or 25 Hz). When the source is interlaced video, a real-time motion signal, independent of motionless vertical transitions between the temporally displaced fields in the interlaced television signal, is recorded or transmitted along with the progressively-scanned video data. Use of a real-time motion signal in reproducing video derived from an interlaced television signal source results in a reproduced interlaced television signal (whether a conventional NTSC or PAL reproduction or an enhanced reproduction) substantially free of interlace errors, despite the conversion to and from progressive scanning, or, alternatively, a reproduced frame-multiplied progressively-scanned television signal substantially free of motion artifacts, despite the conversion to progressive scanning and the subsequent multiplication of frame rate.",
    "inventors": [
        "Yves C. Faroudja"
    ],
    "assignee": "Hanger Solutions LLC",
    "classifications": [
        "H04N7/014",
        "H04N19/46",
        "H04N7/0112",
        "H04N9/8042"
    ],
    "claims": "\n1. A method of encoding television signals comprising\nencoding n frame/per/second motion picture film as one or more coded bit streams representing a progressively scanned television signal having an n Hz frame rate, and\nencoding a 2-1 interlaced television signal having a field rate of m Hz as one or more coded bit streams representing a progressively scanned television signal having an n Hz frame rate, where m is greater than n, and a motion signal representing true picture motion independent of motionless vertical transitions between the temporally displaced fields in the interlaced television signal.\n2. A method of decoding television signals comprising\nreceiving one or more coded bit streams representing a progressively scanned television signal having an n Hz frame rate and, when the progressively scanned television signal is derived from a 2-1 interlaced television signal having a field rate of m Hz, where m is greater than n, a motion signal representing true picture motion independent of motionless vertical transitions between the temporally displaced fields in the interlaced television signal, and\nconverting the received one or more coded bit streams to one or more coded bit streams representing a 2-1 interlaced television signal having a field rate of p Hz, where p is equal to or greater than n, said converting including deriving one or more coded bit streams representing new television fields and frames from said one or more coded bit streams representing said progressively scanned television signal and said motion signal, whereby the interlaced television signal represented by said one or more coded bit streams resulting from the conversion has smooth motion substantially without artifacts.\n3. A method of decoding television signals comprising\nreceiving one or more coded bit streams representing a progressively scanned television signal having an n Hz frame rate and, when the progressively scanned television signal is derived from a 2-1 interlaced television signal having a field rate of m Hz, where m is greater than n, a motion signal representing true picture motion independent of motionless vertical transitions between the temporally displaced fields in the interlaced television signal, and\nconverting the received one or more coded bit streams to one or more coded bit streams representing a q Hz progressively scanned television signal, where q is greater than n, said converting including deriving one or more coded bit streams representing new television frames from said one or more coded bit streams said progressively scanned television signal and said motion signal, whereby the progressively scanned television signal represented by said one or more coded bit streams resulting from the conversion has smooth motion substantially without artifacts.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4876976A",
        "WO1993002526A1",
        "US5191416A",
        "US5200821A",
        "US5291280A",
        "US5329309A",
        "GB2277006A",
        "WO1994030006A1",
        "US5400077A",
        "EP0650297A2",
        "WO1995012283A1",
        "WO1995012275A1",
        "US5430489A",
        "US5430490A",
        "US5457499A",
        "US5488422A",
        "US5508746A",
        "WO1996027981A2",
        "US5627592A",
        "US5633687A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5999220A",
        "US6072531A",
        "US6151075A",
        "US6222589B1",
        "US20010032221A1",
        "WO2001080560A1",
        "US6327306B1",
        "US20020034377A1",
        "US6370198B1",
        "US6380978B1",
        "US6407775B1",
        "US6437828B1",
        "EP1235426A2",
        "US20020122495A1",
        "US20020149703A1",
        "US20020163595A1",
        "US20020171758A1",
        "WO2003007226A1",
        "US20030035645A1",
        "US6542199B1",
        "USRE38079E1",
        "US20030137601A1",
        "US6606596B1",
        "US20040022519A1",
        "US20040071211A1",
        "US20040135924A1",
        "EP1439707A2",
        "EP1443776A1",
        "US6778221B1",
        "US20040184790A1",
        "US20040218094A1",
        "US20050024534A1",
        "US6873368B1",
        "US20050078942A1",
        "US20050105468A1",
        "US6900845B1",
        "WO2005050978A1",
        "US20050206785A1",
        "US20060114334A1",
        "US20060282875A1",
        "US20070133679A1",
        "US20080030614A1",
        "US20080036906A1",
        "USRE40074E1",
        "US7453519B2",
        "US20090087120A1",
        "US20090096876A1",
        "US20090110377A1",
        "US20090147133A1",
        "US20090167778A1",
        "US20110001873A1",
        "US8666222B2",
        "US8811802B2",
        "US8964117B2",
        "US20160189747A1",
        "US20170118442A1",
        "US9826193B2",
        "US20180176635A1"
    ],
    "citedby_ftf": [
        "US6014182A",
        "BE1012172A5",
        "WO2005002223A1",
        "EP1549066A3",
        "EP1549065A1"
    ]
}