{
    "patent_id": "US-11295350-B1",
    "title": "Targeting items to a user of a social networking system based on a predicted event for the user ",
    "assignee": "Meta Platforms, Inc.",
    "publication_date": "2022-04-05",
    "patent_link": "https://patents.google.com/patent/US11295350B1/en",
    "inventors": [
        "Paul Adams"
    ],
    "classifications": [
        "G06Q30/0277",
        "G06N20/00",
        "G06N7/005",
        "G06N7/01",
        "G06Q30/0269",
        "G06Q30/0631",
        "G06Q50/01",
        "H04L51/32",
        "H04L51/52",
        "H04L67/22",
        "H04L67/535"
    ],
    "abstract": "A social networking system predicts a life event (e.g., birthday, change in marital status, relationship status, etc.) for a target user based on information associated with the user. The social networking system identifies gift suggestions to provide to one or more friends of the user based on the predicted event. A gift suggestion may include an invitation to purchase or send an item, voucher, or other gift to the target user, wherein the gift may be determined based on information about the target user's interests obtained by the social networking system. The social networking system sends a gift suggestion to one or more friends of the target user, where the gift suggestion identifies the predicted life event and provides the gift suggestion to the target user's friend. The advertisement may require action by multiple of the target user's friends before the gift is sent to the target user.",
    "claims": "\n1. A computer-implemented method comprising:\ncomputing, by a processor in a social networking system and using a machine learning model, a probability score representing whether a target user will undergo a life event, wherein the machine learning model was trained using historical data in a data log describing communications over a computer network involving a plurality of users of the social networking system and confirmations about the life event for one or more of the plurality of users;\ndetermining, by the processor, that the computed probability score is greater than a threshold score; and\nsending, by the processor and via the social networking system, an advertisement along with a notification about the life event to a viewing user who is connected to the target user in the social networking system.\n2. The method of claim 1, wherein the life event comprises a change in marital status, a change in relationship status, a birthday, a change in employment status, a graduation, a change in health status, an addition of a new child, or death of a person associated with the user outside the social networking system.\n3. The method of claim 1, wherein the advertisement is selected based on at least one of: an item in the target user's wish list, an item placed in a shopping cart by the target user, and a bookmark for a webpage provided by the user and stored within the social networking system.\n4. The method of claim 1, wherein the advertisement includes a link to a merchant site to purchase an item.\n5. The method of claim 1, wherein the advertisement includes multiple links, each link associated with a web page to buy an item for the target user.\n6. The method of claim 1, wherein the advertisement comprises a discount offer for an item associated with the advertisement.\n7. The method of claim 1, wherein the advertisement comprises a user interface permitting a viewing user to share the advertisement with other users of the social networking system with whom the target user has established a connection in the social networking system.\n8. The method of claim 1, wherein the advertisement comprises a voucher enabling a viewing user to send the voucher to the target user, the voucher for an item associated with the advertisement.\n9. The method of claim 1, wherein the advertisement and the notification about the life event are sent to a plurality of users with whom the target user has established a connection in the social networking system.\n10. The method of claim 1, wherein the advertisement provides an interface for purchasing a portion of a gift for the target user, wherein the gift is associated with the advertisement.\n11. A computer program product comprising a non-transitory computer-readable storage medium containing computer program code for:\ncomputing, by a processor in a social networking system and using a machine learning model, a probability score representing whether a target user will undergo a life event, wherein the machine learning model was trained using historical data in a data log describing communications over a computer network involving a plurality of users of the social networking system and confirmations about the life event for one or more of the plurality of users;\ndetermining, by the processor, that the computed probability score is greater than a threshold score; and\nsending, by the processor and via the social networking system, an advertisement along with a notification about the life event to a viewing user who is connected to the target user in the social networking system.\n12. The computer program product of claim 11, wherein the life event comprises a change in marital status, a change in relationship status, a birthday, a change in employment status, a graduation, a change in health status, an addition of a new child, or death of a person associated with the user outside the social networking system.\n13. The computer program product of claim 11, wherein the advertisement is selected based on at least one of: an item in the target user's wish list, an item placed in a shopping cart by eth target user, and a bookmark for a webpage provided by the user and stored within the social networking system.\n14. The computer program product of claim 11, wherein the advertisement includes a link to a merchant site to purchase an item.\n15. The computer program product of claim 11, wherein the advertisement includes multiple links, each link associated with a web page to buy an item for the target user.\n16. The computer program product of claim 11, wherein the advertisement comprises a discount offer for an item associated with the advertisement.\n17. The computer program product of claim 11, wherein the advertisement comprises a user interface permitting a viewing user to share the advertisement with other users of the social networking system with whom the target user has established a connection in the social networking system.\n18. The computer program product of claim 11, wherein the advertisement comprises a voucher enabling a viewing user to send the voucher to the target user, the voucher for an item associated with the advertisement.\n19. The computer program product of claim 11, wherein the advertisement and the notification about the life event are sent to a plurality of users with whom the target user has established a connection in the social networking system.\n20. A computer program product comprising a non-transitory computer-readable storage medium containing computer program code that comprises:\na first module configured to compute, using a machine learning model, a probability score representing whether a target user will undergo a life event, wherein the machine learning model was trained using historical data in a data log describing communications over a computer network involving a plurality of users of a social networking system and confirmations about the life event for one or more of the plurality of users;\na second module configured to determine that the computed probability score is greater than a threshold score; and\na third module configured to send, via the social networking system, an advertisement along with a notification about the life event to a viewing user who is connected to the target user in the social networking system.",
    "status": "Active",
    "citations_own": [
        "US20040024719A1",
        "US20070004385A1",
        "US20070121843A1",
        "US20070162458A1",
        "US7356490B1",
        "US20080189169A1",
        "US20080243531A1",
        "US20100153324A1",
        "US20100324941A1",
        "US20120016817A1",
        "US20120041822A1",
        "US20120150743A1",
        "US20130124644A1",
        "US20130159115A1",
        "US20130218728A1"
    ],
    "citations_ftf": [
        "US7603292B1",
        "US8346709B2",
        "US20100228590A1",
        "US8812419B1",
        "US8495143B2",
        "US20120150772A1",
        "US8352406B2",
        "US8700543B2",
        "US8818932B2",
        "US20130018882A1"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US8966590B2",
        "US20130332308A1",
        "US8666836B2",
        "US9070147B2",
        "US20130275223A1",
        "US8793255B1",
        "US20150278857A1",
        "US10311085B2",
        "US20140089086A1",
        "US10333820B1",
        "US9246866B1",
        "US9390456B2",
        "US9306896B2",
        "US20140229321A1",
        "US20140236731A1",
        "US9600598B2",
        "US20140316853A1",
        "US9537815B2",
        "US9501660B2",
        "US20150058123A1",
        "US9984076B2",
        "US9811778B2",
        "US20170032001A1",
        "US20160148200A1",
        "US11005738B1",
        "US9854025B2",
        "WO2015190856A1",
        "KR101761999B1",
        "US10672030B2",
        "US10291493B1",
        "US10264096B2",
        "US10187260B1",
        "US10319047B2",
        "US11170104B1",
        "US10127551B2",
        "US10013714B2",
        "US20170076379A1",
        "US10249002B2",
        "US10200252B1",
        "CA2944165C",
        "US10721297B2",
        "US10108714B2",
        "US20170177583A1",
        "EP3410381A1",
        "US10893122B2",
        "US10546059B2",
        "US11108881B2",
        "US11132413B2",
        "US10134070B2",
        "US10025933B2",
        "US10097552B2",
        "US10223426B2",
        "US10437610B2",
        "US10230601B1",
        "US10438296B2",
        "US10129367B2",
        "US10560419B2",
        "US20180276543A1",
        "US10755180B2",
        "US11494440B1",
        "US20180302345A1",
        "US11025566B2",
        "US10846615B2",
        "US11341173B2",
        "US20190043065A1",
        "US11341523B1",
        "US11494782B1",
        "US11488195B1",
        "US11461802B2",
        "US10810040B2",
        "US10831548B2",
        "US10963173B2",
        "US10635506B1",
        "US10937038B2",
        "USD916832S1",
        "USD916825S1",
        "USD916827S1",
        "USD916828S1",
        "USD916829S1",
        "USD916830S1",
        "USD916826S1",
        "USD916831S1",
        "US11074234B1",
        "US10992796B1",
        "US11768945B2",
        "US20220391846A1"
    ]
}