{
    "patent_link": "https://patents.google.com/patent/US5333185A/en",
    "patent_id": "US5333185A",
    "title": "System for processing calling party information for international communications services",
    "abstract": "A system for delivering originating country information for international toll-free calls to a subscriber includes three separate processes. The country code is extracted from billing and routing data forwarded by the caller's national telephone network to the communication switching system of the destination country of the call, the originating country code is then inserted in either the calling party number or the destination number depending on subscriber's terminating arrangement and finally, the originating country code is delivered to the international toll-free subscriber before the call is completed. Once received by the subscriber, the originating country information can be used to tailor customized services for the foreign caller such as directing calls to attendants fluent in caller's language, or mapping the originating country code to the country name for display to attendants.",
    "inventors": [
        "Karen B. Burke",
        "Luis E. Nieto",
        "I. Grace Tseng"
    ],
    "assignee": "AT&T Corp",
    "classifications": [
        "H04M3/51",
        "H04M3/60",
        "H04Q3/0045",
        "H04Q2213/1313",
        "H04Q2213/13512",
        "H04Q2213/13533",
        "H04Q2213/13541"
    ],
    "claims": "\n1. A method of delivering originating country code information associated with an international call initiated by a caller in an originating country and destined for a called party in a destination country wherein said method comprises the steps of:\nreceiving routing information associated with the call;\nextracting from said routing information an originating country code;\nformatting said originating country code in a field reserved for automatic number identification data; and\nforwarding said originating country code to said called party.\n2. The method of claim 1 further including the step of:\ntranslating said originating country code to an equivalent country name for display to said called party.\n3. The method of claim 1, wherein said call is completed to a communication switching system which distributes the call to a selected one of a plurality of stations as a function of the value of said originating country code.\n4. The method of claim 1, wherein said call is connected to a processor that generates a plurality of alphabetical and numerical symbols wherein selection of a set of said alphabetical and numerical symbols is a function of the value of said originating country code.\n5. The method of claim 1, wherein said originating country code is forwarded to a database system storing a plurality of data on a plurality of countries wherein said data for one of said countries is selected for retrieval as a function of the value of said originating country code.\n6. The method of claim 1 wherein a counter is accumulated for each call in which said originating country code is delivered to said called party for the purpose of billing said called party for the delivery of the originating country code.\n7. A system for delivering originating country code information associated with an international call initiated by a caller in an originating country and destined for a called party in a destination country wherein said system comprises\nmeans for receiving routing information associated with the call;\nmeans for extracting from said routing information an originating country code;\nmeans for formatting said originating country code in a field reserved for automatic number identification data; and\nmeans for forwarding said originating country code to said called party.\n8. The system of claim 7 further including means for translating said originating country code to an equivalent country name for display to said called party.\n9. The system of claim 7 wherein said call is completed to a communication switching system which distributes said call to a selected station as a function of the value of said originating country code.\n10. The system of claim 7 wherein said call is connected to a processor that generates a plurality of alphabetical and numerical symbols wherein selection of a set of said alphabetical and numerical symbols is a function of the value of said originating country code.\n11. The system of claim 7, wherein said said originating country code is forwarded to a database system storing a plurality of data on a plurality of countries and wherein said data for one of said countries is selected for retrieval as a function of the value of said originating country code.\n12. The system of claim 7 further comprising means for accumulating a counter for each call in which said country of origin code is delivered to said called party for the purpose of billing said called party for the delivery of the originating country code.\n13. Apparatus comprising:\nmeans for receiving billing and routing data associated with an international call;\nmeans for deriving from said data a code identifying the country of origination of said call;\nmeans for replacing some of the digits in a field ordinarily used for automatic number identification (ANI) with digits of said originating country code; and\nmeans for delivering contents of said field to said called party.\n14. The means of claim 13 wherein said information can be gathered from billing and routing data, satellite uplink and downlink identification number, trunk subgroup number, international gateway switch port number and call prompting devices.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4191860A",
        "US4555594A",
        "US4611094A",
        "US4757267A",
        "US5136633A",
        "US5136636A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "EP0676905A2",
        "US5465293A",
        "US5475749A",
        "GB2292285A",
        "DE4430991A1",
        "US5506894A",
        "DE4446520A1",
        "US5550909A",
        "US5550912A",
        "US5553129A",
        "US5553119A",
        "US5590184A",
        "DE19535378A1",
        "US5617448A",
        "US5640446A",
        "WO1997025849A1",
        "US5684863A",
        "US5689555A",
        "US5696816A",
        "US5764749A",
        "US5771283A",
        "US5787156A",
        "US5793846A",
        "US5793857A",
        "US5796813A",
        "US5805675A",
        "US5828734A",
        "DE19726175A1",
        "US5883950A",
        "US5887056A",
        "US5892822A",
        "US5903638A",
        "WO1999030461A2",
        "US5917893A",
        "US5978464A",
        "US5999603A",
        "US6002756A",
        "US6009160A",
        "US6016344A",
        "US6023504A",
        "US6044135A",
        "US6097948A",
        "US20010046226A1",
        "US6449346B1",
        "US20020168055A1",
        "US6539089B1",
        "US6546084B1",
        "US20030079028A1",
        "US6556669B2",
        "US6570967B2",
        "US20030123435A1",
        "US6678360B1",
        "US20040022379A1",
        "US20040032937A1",
        "US20040032942A1",
        "US6738621B1",
        "US20040151294A1",
        "US6778656B1",
        "US20040203650A1",
        "WO2004104780A3",
        "US20050041794A1",
        "US20050058270A1",
        "US6891940B1",
        "US20050243984A1",
        "US20050249341A1",
        "US20050278550A1",
        "EP1622397A1",
        "US20060126607A1",
        "US7155001B2",
        "US7280530B2",
        "US20080089503A1",
        "US20080103529A1",
        "US20080226057A1",
        "US7502457B2",
        "US20100002856A1",
        "US8472592B1",
        "US20140064268A1",
        "US8718243B1",
        "US9769317B2",
        "US9942410B2",
        "US10271205B1"
    ],
    "citedby_ftf": []
}