{
    "patent_id": "US-11596479-B2",
    "title": "Computer-assisted arthroplasty system ",
    "assignee": "Smith & Nephew, Inc., Smith & Nephew Orthopaedics Ag, Smith & Nephew Asia Pacific Pte. Limited",
    "publication_date": "2023-03-07",
    "patent_link": "https://patents.google.com/patent/US11596479B2/en",
    "inventors": [
        "Shawn P. MCGUAN",
        "Elizabeth DUXBURY"
    ],
    "classifications": [
        "A61B34/10",
        "A61B34/30",
        "A61B34/25",
        "A61B5/004",
        "A61B5/0077",
        "A61B5/064",
        "A61B5/1072",
        "A61B5/1118",
        "A61B5/4585",
        "A61B90/361",
        "A61B90/37",
        "A61B90/39",
        "A61F2/461",
        "G02B27/0172",
        "G06N20/00",
        "G06N3/08",
        "G06N5/01",
        "G06N5/046",
        "G09B19/003",
        "G09B19/24",
        "G09B5/02",
        "G16H10/60",
        "G16H15/00",
        "G16H20/40",
        "G16H30/40",
        "G16H40/63",
        "G16H50/00",
        "G16H50/50",
        "G16H50/70",
        "A61B17/15",
        "A61B17/154",
        "A61B17/17",
        "A61B17/1764",
        "A61B2017/00199",
        "A61B2017/00207",
        "A61B2017/00221",
        "A61B2017/00526",
        "A61B2034/102",
        "A61B2034/104",
        "A61B2034/105",
        "A61B2034/107",
        "A61B2034/108",
        "A61B2034/2048",
        "A61B2034/2051",
        "A61B2034/2055",
        "A61B2034/2057",
        "A61B2034/2063",
        "A61B2034/2065",
        "A61B2034/2068",
        "A61B2034/2072",
        "A61B2034/2074",
        "A61B2034/252",
        "A61B2034/254",
        "A61B2034/256",
        "A61B2034/258",
        "A61B2090/363",
        "A61B2090/365",
        "A61B2090/371",
        "A61B2090/372",
        "A61B2090/376",
        "A61B2090/378",
        "A61B2090/3916",
        "A61B2090/3983",
        "A61B2090/502",
        "A61B2505/05",
        "A61B34/20",
        "A61B90/96",
        "A61F2002/30952",
        "A61F2002/4633",
        "G02B2027/0138",
        "G06N20/10",
        "G06N3/044",
        "Y02A90/10"
    ],
    "abstract": "A computer-implemented method for creating an activity-optimized cutting guides for surgical procedures includes receiving one or more pre-operative images depicting one or more anatomical joints of a patient, and creating a three-dimensional anatomical model of the one or more anatomical joints based on the one or more pre-operative images. One or more patient-specific anatomical measurements are determined based on the three-dimensional anatomical model. A statistical model of joint performance is applied to the patient-specific anatomical measurements to identify one or more cut angles for performing a surgical procedure. A patient-specific cutting guide is created that comprises one or more apertures positioned based on the one or more cut angles.",
    "claims": "\n1. A system for creating an activity-optimized cutting guide for a surgical procedure, the system comprising:\none or more processors; and\na non-transitory, computer-readable medium storing instructions that, when executed, cause the one or more processors to:\ndetermine, based on pre-operative image data, one or more patient-specific anatomical measurements associated with an anatomical joint of a patient,\napply a statistical model of joint performance to the one or more patient-specific anatomical measurements, wherein the statistical model uses one or more transfer functions,\nidentify one or more cut angles for performing a surgical procedure based on the applied statistical model,\ngenerate a model of a patient-specific cutting guide based on the one or more cut angles, and\noutput the model to a computer-readable storage device.\n2. The system of claim 1, wherein the one or more patient-specific anatomical measurements comprise a distal condyle radius and an anterior condyle radius.\n3. The system of claim 1, wherein the instructions that cause the one or more processors to identify one or more cut angles comprise instructions that, when executed, cause the one or more processors to select a set of cut angles that substantially balance condylar gaps of the anatomical joint throughout a range of motion associated with one or more physical activities.\n4. The system of claim 1, where the instructions that cause the one or more processors to determine one or more patient-specific anatomical measurements comprise instructions that, when executed, cause the one or more processors to:\nreceive one or more pre-operative images depicting the anatomical joint;\ncreate a three-dimensional anatomical model of the anatomical joint based on the one or more pre-operative images; and\ndetermine the one or more patient-specific anatomical measurements based on the three-dimensional anatomical model.\n5. The system of claim 1, wherein the instructions that cause the one or more processors to apply a statistical model of joint performance comprise instructions that, when executed, cause the one or more processors to apply a Monte Carlo method to iteratively evaluate a plurality of possible cut angles.\n6. The system of claim 5, wherein each iteration of the Monte Carlo method comprises applying the one or more transfer functions with a distinct set of parameters.\n7. The system of claim 1, wherein the statistical model of joint performance is a machine learning model.\n8. The system of claim 1, wherein the instructions that cause the one or more processors to generate a model of a patient-specific cutting guide comprise instructions that, when executed, cause the one or more processors to modify a model of a cutting guide blank to include the one or more apertures based on the one or more cut angles.\n9. The system of claim 1, wherein the computer-readable storage device is in operable communication with a manufacturing device configured to manufacture the patient-specific cutting guide.\n10. A system for creating an activity-optimized cutting guide for a surgical procedure, the system comprising:\none or more processors; and\na non-transitory, computer-readable medium storing instructions that, when executed, cause the one or more processors to:\ndetermine, based on pre-operative image data, one or more patient-specific anatomical measurements associated with an anatomical joint of a patient,\napply a statistical model of joint performance to the one or more patient-specific anatomical measurements, wherein the statistical model is based on simulation data for a plurality of joint geometries associated with a plurality of implants,\nidentify one or more cut angles for performing a surgical procedure based on the applied statistical model,\ngenerate a model of a patient-specific cutting guide based on the one or more cut angles, and\noutput the model to a computer-readable storage device.\n11. The system of claim 10, wherein the one or more patient-specific anatomical measurements comprise a distal condyle radius and an anterior condyle radius.\n12. The system of claim 10, wherein the instructions that cause the one or more processors to identify one or more cut angles comprise instructions that, when executed, cause the one or more processors to select a set of cut angles that substantially balance condylar gaps of the anatomical joint throughout a range of motion associated with one or more physical activities.\n13. The system of claim 10, where the instructions that cause the one or more processors to determine one or more patient-specific anatomical measurements comprise instructions that, when executed, cause the one or more processors to:\nreceive one or more pre-operative images depicting the anatomical joint;\ncreate a three-dimensional anatomical model of the anatomical joint based on the one or more pre-operative images; and\ndetermine the one or more patient-specific anatomical measurements based on the three-dimensional anatomical model.\n14. The system of claim 10, wherein the instructions that cause the one or more processors to apply a statistical model of joint performance comprise instructions that, when executed, cause the one or more processors to apply a Monte Carlo method to iteratively evaluate a plurality of possible cut angles.\n15. The system of claim 14, wherein each iteration of the Monte Carlo method comprises applying one or more transfer functions with a distinct set of parameters.\n16. The system of claim 10, wherein the statistical model of joint performance is a machine learning model.\n17. The system of claim 10, wherein the instructions that cause the one or more processors to generate a model of a patient-specific cutting guide comprise instructions that, when executed, cause the one or more processors to modify a model of a cutting guide blank to include the one or more apertures based on the one or more cut angles.\n18. The system of claim 10, wherein the computer-readable storage device is in operable communication with a manufacturing device configured to manufacture the patient-specific cutting guide.\n19. The system of claim 10, wherein each implant of the plurality of implants is defined by a distinct set of implantation features comprising one or more of an implant position, an implant orientation, and an implant type.\n20. The system of claim 10, wherein the instructions, when executed, further cause the one or more processors to generate the statistical model by:\nselecting the plurality of implants;\npopulating a database with the simulation data by simulating a motion of the plurality of joint geometries while performing one or more physical activities and an expected stress on the plurality of implants resulting from the motion; and\ngenerating the statistical model of joint performance based on the simulation data.",
    "status": "Active",
    "citations_own": [
        "US5995738A",
        "US20040034283A1",
        "US20100076563A1",
        "US20100106475A1",
        "US20110087465A1",
        "US20110282473A1",
        "US20120116562A1",
        "US20120189996A1",
        "US8412669B2",
        "US20130203031A1",
        "US20130211531A1",
        "US20140018813A1",
        "US20140081659A1",
        "US20140135985A1",
        "US8794977B2",
        "US20140244220A1",
        "US20160225192A1",
        "US20160228204A1",
        "US20160278754A1",
        "US20160377595A1",
        "US20170061375A1",
        "US9737367B2",
        "US20170245940A1",
        "US20170258526A1",
        "US9827106B2",
        "US20170367766A1",
        "US20180055644A1",
        "US20180055577A1",
        "US20180071049A1",
        "US20180071050A1",
        "US20180168740A1",
        "US20180233222A1",
        "US20190000372A1",
        "US10342636B2",
        "US10426571B2",
        "US10595943B2",
        "US20200205900A1"
    ],
    "citations_ftf": [
        "US5086401A",
        "US7630750B2",
        "AU2003224997A1",
        "AU2003232063A1",
        "AU2005209197A1",
        "DE102005056997A1",
        "GB0803514D0",
        "WO2012060901A1",
        "WO2013106385A2",
        "US20190104919A1",
        "CN102781072B",
        "US20150297362A1",
        "CN103280144B",
        "US20150106024A1",
        "EP3653158A1",
        "WO2016001046A1",
        "DK178899B1",
        "US9737254B2",
        "US10194990B2",
        "EP3456103B1",
        "EP3600130B1",
        "CN106887044A",
        "US11135015B2",
        "US10878966B2",
        "US20190156690A1",
        "US20190201102A1",
        "EP3543402A1",
        "CN112930149A",
        "CN113015480A",
        "US20210322148A1",
        "US11766300B2",
        "WO2020132439A1",
        "US20200211720A1",
        "WO2020163318A1"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US11020189B2",
        "US9839315B2",
        "WO2017114834A1",
        "WO2018097831A1",
        "US11203134B2",
        "US11615285B2",
        "WO2018144872A1",
        "US11663478B2",
        "WO2020163318A1",
        "US11569978B2",
        "US11652603B2",
        "US11786308B2",
        "US20220338886A1",
        "JP7271362B2",
        "TWI708591B",
        "US11797827B2",
        "US11580401B2",
        "US11651210B2",
        "WO2021118995A1",
        "JP7127659B2",
        "CA3170280A1",
        "US11166765B1",
        "AU2021280403A1",
        "US20210391058A1",
        "WO2022014246A1",
        "US20230285080A1",
        "US11571225B2",
        "EP4218025A1",
        "EP3975193A1",
        "CN112155729B",
        "EP3992978A1",
        "CN112386332B",
        "US20220142709A1",
        "EP4247286A1",
        "TWI749921B",
        "US20220175455A1",
        "US11766299B2",
        "CN112754616B",
        "EP4271301A1",
        "US11295460B1",
        "WO2022147591A1",
        "US20220215578A1",
        "WO2022150478A1",
        "US11562661B2",
        "AU2022217138A1",
        "US11478327B2",
        "AU2022228435A1",
        "US20220327775A1",
        "WO2022234566A1",
        "WO2022245833A2",
        "WO2022243967A1",
        "WO2022243957A1",
        "WO2022243955A1",
        "WO2022243963A1",
        "WO2022243960A1",
        "WO2022243961A1",
        "EP4150608A1",
        "WO2022243958A1",
        "DE102021120380A1",
        "CN113744214B",
        "WO2023034147A1",
        "GB2614025A",
        "US20230080515A1",
        "US11759216B2",
        "WO2023055855A1",
        "US20230109848A1",
        "WO2023052949A1",
        "US11600053B1",
        "US20230111376A1",
        "EP4169468A1",
        "WO2023072559A1",
        "EP4173580A1",
        "CN114058691B",
        "WO2023117340A1",
        "WO2023148427A1",
        "CN114642502B",
        "TWI807999B",
        "CN116350349B"
    ]
}