{
    "patent_id": "US-10657385-B2",
    "title": "System and method for adaptive, rapidly deployable, human-intelligent sensor feeds ",
    "assignee": "CARNEGIE MELLON UNIVERSITY, a Pennsylvania Non-Pro fit Corporation, University Of Rochester",
    "publication_date": "2020-05-19",
    "patent_link": "https://patents.google.com/patent/US10657385B2/en",
    "inventors": [
        "Gierad Laput",
        "Christopher Harrison",
        "Jeffrey P. Bigham",
        "Walter S. Lasecki",
        "Bo Robert Xiao",
        "Jason Wiese"
    ],
    "classifications": [
        "G06K9/00771",
        "G06F17/18",
        "G06F18/2155",
        "G06F18/217",
        "G06F3/01",
        "G06K9/00993",
        "G06K9/036",
        "G06K9/6259",
        "G06K9/6262",
        "G06N20/00",
        "G06N20/10",
        "G06N5/041",
        "G06Q50/01",
        "G06V10/7753",
        "G06V10/776",
        "G06V10/96",
        "G06V10/993",
        "G06V20/52",
        "G06F40/40",
        "G06K9/6212"
    ],
    "abstract": "The disclosure describes a sensor system that provides end users with intelligent sensing capabilities, and embodies both crowd sourcing and machine learning together. Further, a sporadic crowd assessment is used to ensure continued sensor accuracy when the system is relying on machine learning analysis. This sensor approach requires minimal and non-permanent sensor installation by utilizing any device with a camera as a sensor host, and provides human-centered and actionable sensor output.",
    "claims": "\n1. An adaptive sensor system comprising:\na sensor, wherein the sensor provides a sensor feed of an environment;\na user interface,\nwherein a user can enter a question to be answered by the sensor system using the user interface,\nwherein the question relates to a condition of the environment;\na dispatcher, wherein the dispatcher directs the sensor feed and question to at least one of a crowd module and a machine learning module,\nwherein at least one of the crowd module and the machine learning module generates a labeled sensor feed derived from the sensor feed,\nwherein the labeled sensor feed comprises an answer to the question; and\na periodic comparator that evaluates a relative accuracy of the labeled sensor feed generated by the machine learning module as compared to the labeled sensor feed generated by the crowd module.\n2. The adaptive sensor system of claim 1, wherein the dispatcher directs the sensor feed to the crowd module upon initiation of the sensor system and prior to the machine learning module reaching a threshold level of accuracy.\n3. The adaptive sensor system of claim 2,\nwherein the labeled sensor feeds generated by the crowd module are sent to the machine learning module,\nwherein the machine learning module uses the labeled sensor feeds to train a classifier.\n4. The adaptive sensor system of claim 3, wherein the dispatcher directs the sensor feed to the machine learning module when the machine learning module is operating above a threshold level of accuracy.\n5. The adaptive sensor system of claim 1, wherein the crowd module sends the sensor feed and question to crowd workers to generate the labeled sensor feed.\n6. The adaptive sensor system of claim 1, wherein the user interface provides a visualization of the labeled sensor feed.\n7. The adaptive sensor system of claim 1, wherein the sensor comprises an electronic device having a camera.\n8. The adaptive sensor system of claim 1, wherein the sensor feed comprises an image.\n9. The adaptive sensor system of claim 1, wherein the question has a data type selected from the group consisting of: yes/no, number, scale, and multiple choice.\n10. The adaptive sensor system of claim 1, further comprising :\nan image similarity detector that receives the sensor feed, wherein the image similarity detector maintains a current sensor value if there is no change in the condition of the environment over a period of time.\n11. A method of creating an adaptive sensor system, comprising:\nproviding a sensor that provides a sensor feed;\nreceiving from a user interface a question, wherein the question is capable of being\nanswered by observation of the sensor feed;\nsending the sensor feed to a crowd,\nwherein the crowd generates a labeled sensor feed based on the sensor feed;\nusing the crowd labeled sensor feed to train a machine learning module;\nsending a subsequent sensor feed to the machine learning module to generate the labeled sensor feed when the machine learning module exceeds a threshold level of accuracy; and\nsending the labeled sensor feed to a user via the user interface wherein the labeled sensor feed comprises an answer to the question.\n12. The method of claim 11, further comprising:\nperiodically testing the labeled sensor feed generated by the machine learning module against the labeled sensor feed generated by the crowd to determine the relative accuracy of the machine learning module.\n13. The method of claim 12, wherein the sensor feed is sent to the crowd if the machine learning module falls below the threshold level of accuracy.\n14. The method of claim 11, further comprising:\nchoosing a region of interest in the sensor feed prior to sending the sensor feed to the crowd.\n15. The method of claim 11, further comprising:\nobfuscating the sensor feed.\n16. The method of claim 11, further comprising:\nrejecting a second sensor feed received subsequent to a first sensor feed if there is no difference between the first sensor feed and the second sensor feed.\n17. The method of claim 16, wherein the second sensor feed is rejected if a pixel difference threshold does not exceed 10%.\n18. The method of claim 16, wherein the second sensor feed is rejected if an image area percentage threshold does not exceed 1%.\n19. The method of claim 11, wherein sending the sensor feed to a crowd to generate a labeled sensor feed further comprises:\nsending an example sensor feed to the crowd."
}