{
    "patent_id": "US-11640449-B2",
    "title": "System and method for effectuating user access control ",
    "assignee": "Cambrian Designs, Inc.",
    "publication_date": "2023-05-02",
    "patent_link": "https://patents.google.com/patent/US11640449B2/en",
    "inventors": [
        "Olaf Jonny Groth",
        "Mark Jay Nitzberg",
        "Manu Kalia",
        "Tobias Christopher Straube",
        "Daniel Zehr"
    ],
    "classifications": [
        "G06Q50/18",
        "G06F21/31",
        "G06F21/16",
        "G06F21/577",
        "G06F21/604",
        "G06F21/6209",
        "G06F21/6245",
        "G06F21/6254",
        "G06F21/6263",
        "G06N20/00",
        "G06N20/10",
        "G06N20/20",
        "G06Q30/0206",
        "G06F2221/034",
        "G06F2221/0737",
        "G06F2221/2123",
        "G06F2221/2141",
        "G06N3/044",
        "G06N3/045",
        "G06N5/01"
    ],
    "abstract": "A configurable, customizable privacy protecting software agent operates on behalf of a user to control the dissemination and use of the user's personal data. The software agent is guided by a personal/corporate privacy charter specified by the user (or an enterprise manager), which charter is adapted dynamically based on user and site conditions. The agent engages with digital service provider (DSP) sites/apps on users' behalf, and notifies them of privacy incompatibilities, issues, etc. associated with the DSPs, along with recommended alternatives if available or possible. The agent can also tag user data and monitor unauthorized uses to report on DSP compliance with user specified policies.",
    "claims": "\n1. A method of implementing privacy protection for a user with an automated security agent controlling online interactions through a user computing device with a digital services provider comprising:\na. processing a first digital service provider (DSP) data policy to determine a set of DSP privacy related parameters associated with accessing DSP content;\nb. processing a privacy charter (PC) for the user to determine a set of user privacy related parameters to be effectuated by the automated security agent for selected user privacy data when accessing said DSP content;\nc. generating a compatibility assessment based on a comparison between said set of DSP privacy related parameters and said set of user privacy related parameters;\nd. controlling a data session between the user and the DSP with the automated security agent based on said compatibility assessment and said user privacy related parameters, including by:\ni. providing a user notification option in the PC that when enabled causes the automated security agent to notify the user of any incompatibilities between said set of DSP privacy related parameters and said set of user privacy related parameters;\nii. providing a user blocking option in the PC that when enabled causes the automated security agent to automatically block access by the DSP to said selected user privacy data based on said compatibility assessment;\ne. monitoring the user's actions during said data session to observe differences in said actions and said PC;\nf. adapting said PC with user customized modifications based on said observed differences.\n2. The method of claim 1 wherein the automated security agent implements said PPC uniformly across multiple devices used by the user to control data sessions on said devices with DSPs.\n3. The method of claim 1 wherein the automated security agent is configured to generate a coded message in an interface of the user computing device.\n4. The method of claim 3 wherein said coded message includes color indicators to denote congruencies and inconsistencies with different DSP data policies while browsing a DSP site.\n5. The method of claim 1 wherein the privacy charter (PC) is implemented on behalf of an individual as a personal privacy charter (PPC) or on behalf of a corporation as a corporate privacy charter (CPC).\n6. A method of implementing privacy protection for a user with an automated security agent controlling online interactions with a digital services provider comprising:\na. processing a first digital service provider (DSP) data policy to determine a set of DSP privacy related parameters associated with accessing DSP content;\nb. processing a privacy charter (PC) to determine a set of user privacy related parameters to be effectuated by the automated security agent for selected user privacy data when accessing said DSP content; wherein the privacy charter (PC) is implemented for a computing device on behalf of an individual as a personal privacy charter (PPC) or on behalf of a corporation as a corporate privacy charter (CPC); c. generating a compatibility assessment based on a comparison between said set of DSP privacy related parameters and said set of user privacy related parameters;\nd. controlling a data session between the computing device and the DSP with the automated security agent based on said compatibility assessment and said user privacy related parameters, including by:\ni. providing a user tracking option in the CPC/PPC, that when enabled causes the automated security agent to tag said selected user privacy data communicated to said DSP with a tracking code prior to or during said data session; and\nii. providing a user notification option in the CPC/PPC that when enabled causes the automated security agent to notify both the user and the DSP of any incompatibilities between said set of DSP privacy related parameters and said set of user privacy related parameters;\niii. providing a user blocking option in the PPC that when enabled causes the automated security agent to automatically block access by the DSP to said selected user privacy data based on said compatibility assessment;\niv. providing a user negotiation option in the CPC/PPC that when enabled causes the automated security agent to automatically negotiate between the user and the DSP for access to said selected user privacy data in accordance with a user data license;\ne. monitoring said DSP and generating a compliance assessment by said DSP with said user data license;\nf. generating recommendations with an automated recommendation engine to the user including at least:\ni. a first list of items identifying alternative DSPs having a higher compatibility assessment and/or compliance assessment; and\nii. a second list of items identifying proposed modifications to said CPC/PPC and/or control options for the automated security agent; wherein said second list of items can be implemented automatically for the user when enabled by a user recommendation option;\ng. monitoring the user's actions during data sessions and adapting said CPC/PPC with user customized modifications based on observed differences in said actions and said set of user privacy related parameters for said CPC/PPC.\n7. The method of claim 6 wherein said PPC includes both a set of different categories and an associated privacy rating.\n8. The method of claim 6 wherein said PPC is implemented and enforced across multiple devices used by the user.\n9. The method of claim 6 wherein said user customized modifications to said CPC/PPC based on observed differences in said actions and said CPC/PPC are implemented automatically without further input from the user.\n10. The method of claim 6 wherein said automated security agent is configured to present proposed adjustments to said PPC to the user along with accompanying explanations for such adjustments and modify the same based on an express acknowledgement by the user.\n11. The method of claim 6 further including a step: conditioning access rights to said selected user privacy data on an agreement by said DSP to embed said tracking code in any of such privacy data.\n12. The method of claim 6 further including a step: calculating a value of said selected user privacy data and negotiating a price for such data with the DSP prior to providing the same to such DSP.\n13. The method of claim 1 further including a step: generating multiple intentionally altered false items of selected user privacy data, and providing the same along with correct user privacy data to said DSP.\n14. A system for implementing privacy protection with an automated security agent controlling online interactions with a digital services provider comprising:\na computing system including one or more processors, one or more memories, and one or more executable software routines adapted to:\n15. The system of claim 14 wherein said PC includes both a set of different categories and an associated privacy rating.\n16. The system of claim 14 wherein said user customized modifications to said PC based on observed differences in said actions and said CPC/PPC are implemented automatically without further input from the user.\n17. The system of claim 14 wherein said automated security agent is configured to present proposed adjustments to said PPC to the user along with accompanying explanations for such adjustments and modify the same based on an express acknowledgement by the user.\n18. The method of claim 6 further including a step: conditioning access rights to said selected user privacy data on an agreement by said DSP to embed said tracking code in any of such privacy data.\n19. The method of claim 6 further including a step: calculating a value of said selected user privacy data and negotiating a price for such data with the DSP prior to providing the same to such DSP.\n20. The method of claim 1 further including a step: generating multiple intentionally altered false items of selected user privacy data, and providing the same along with correct user privacy data to said DSP.",
    "status": "Active",
    "citations_own": [
        "US5987440A",
        "US6092197A",
        "US20010037316A1",
        "US20020133500A1",
        "US20020152134A1",
        "US20020188627A1",
        "US20030028427A1",
        "US20030084300A1",
        "US20040054919A1",
        "US20040083243A1",
        "US20050091101A1",
        "US6904417B2",
        "US20050193093A1",
        "US6959320B2",
        "US20060095956A1",
        "US20060253581A1",
        "US7496191B1",
        "US20090320091A1",
        "US7797726B2",
        "US20100279713A1",
        "US20110213688A1",
        "US8073461B2",
        "US20120042390A1",
        "US8166557B1",
        "US20130291123A1",
        "US20140143886A1",
        "US20140162684A1",
        "US8799981B2",
        "US8839454B2",
        "US8966575B2",
        "US20150181016A1",
        "US9124632B2",
        "US9191352B2",
        "US20160057572A1",
        "US9411967B2",
        "US9426776B2",
        "US9460308B2",
        "US20170099291A1",
        "US9691090B1",
        "US9704203B2",
        "US9817997B2",
        "US9825945B2",
        "US20180020001A1",
        "US9961090B2",
        "US9977911B2",
        "US10069703B2",
        "US10102533B2",
        "US10169790B2",
        "US10176878B2",
        "US10218761B2",
        "US10231084B2",
        "US10349207B2",
        "US20190286828A1",
        "US20190294824A1",
        "US10467551B2",
        "US20190347428A1",
        "US20200067922A1",
        "US20200159955A1",
        "US20200202037A1",
        "US20200320207A1",
        "US10904261B2",
        "US20210081567A1",
        "US20210312086A1"
    ],
    "citations_ftf": [
        "JP4474079B2",
        "US8646095B2",
        "US9130915B2",
        "US8856869B1",
        "US9356961B1",
        "US9135452B2",
        "US9965649B2",
        "US20200389495A1",
        "US20170187749A1",
        "US11222139B2",
        "US10956586B2",
        "US11074280B2"
    ],
    "citedby_own": [
        "US11782982B1"
    ],
    "citedby_ftf": [
        "HK1258418A2",
        "WO2021030283A1",
        "US11734340B1",
        "US11436290B1",
        "US11363002B2",
        "US11431688B2",
        "US11748488B2",
        "US11429602B2",
        "US20220012365A1",
        "US11438370B2",
        "US20220035939A1",
        "JP2022038201A",
        "US11556670B2",
        "WO2022109215A1",
        "US11099709B1",
        "US11210844B1",
        "USD991271S1",
        "US11227010B1",
        "US11170582B1",
        "US11533467B2",
        "US11748189B1",
        "US11657180B1",
        "US11625758B1",
        "CN113473361B",
        "CN113779623B",
        "US20230153719A1",
        "US11470093B1",
        "US11625377B1",
        "US11593685B1",
        "CN114520721A",
        "US11706226B1",
        "CN115329390B",
        "CN115758471B"
    ]
}