{
    "patent_link": "https://patents.google.com/patent/US5329619A/en",
    "patent_id": "US5329619A",
    "title": "Cooperative processing interface and communication broker for heterogeneous computing environments",
    "abstract": "An object interface is disclosed that supports three modes of inter-object communication--message processing (store and forward), conversational communication, and remote procedure call. A service broker manages service requests from, and responsive services provided by, a plurality of clients and servers, respectively, which may reside on different hardware platforms and operating systems and may be connected to computer networks having different network architectures and associated communications protocols. The broker manages the service offerings from servers and service requests from clients, and clients and servers communicate and exchange information with one another via the broker. The service broker includes different application programming interfaces for allowing participants to access the functionality of the service broker.",
    "inventors": [
        "Peter Page",
        "Ruediger Warns",
        "Terence G. Kennedy",
        "Omid Ejtemai-Jandaghi"
    ],
    "assignee": "Software AG",
    "classifications": [
        "G06F9/546",
        "G06F9/547",
        "H04L9/40",
        "H04L67/01",
        "H04L67/133",
        "H04L69/08",
        "H04L69/24",
        "Y10S707/99945",
        "Y10S707/99948"
    ],
    "claims": "\n1. A communication system for managing communication of messages among a plurality of participants in a computing environment, the participants including a server residing on a first computer, and a client residing on a second computer, the first and second computers being heterogeneous, the client and server sending messages to each other, the messages including a request from the client for a service, and the server providing a service, the participants being connected by a physical network with a network protocol, said system comprising:\na protocol independent communications transport layer, said transport layer having a low level application programming interface (LAPI) and accepting messages from the participants via the LAPI and said transport layer communicating with the physical network via the network protocol; and\na service broker, said service broker receiving the service request from the client and determining if the service provided by the server matches the service request, and, if so, communicating the service request to the server.\n2. The system of claim 1 wherein said service broker includes means for storing and forwarding the messages to provide asynchronous communication between the client and the server.\n3. The system of claim 2 wherein said store and forward means includes a message queue maintained by said service broker, said message queue storing the messages and associating with each message the identity of the participant to which the message is to be communicated by said broker.\n4. The system of claim 1 wherein said service broker includes means for conducting a conversational communication session between the client and the server, said conversational communication session comprising a plurality of messages from the client to the server, including the service request, and a corresponding plurality of responsive messages from the server to the client.\n5. The system of claim 4 wherein said conversational communication means includes means for enabling the server to conduct concurrently a plurality of asynchronous conversational communication sessions with the client.\n6. The system of claim 4 wherein said service broker includes means for monitoring a conversational communication session and terminating the session upon the passage of a predetermined time without message activity by the participants.\n7. The system of claim 4 wherein the computing environment further includes a second client and wherein said conversational communication means includes means for enabling the server to conduct concurrently a plurality of conversational communication sessions with the client and the second client.\n8. The system of claim 4 wherein the computing environment further includes a second server and wherein said conversational communication session means includes means for enabling the client to conduct concurrently a plurality of conversational communication sessions with the server and the second server.\n9. The system of claim 8 wherein said concurrent session means comprises means for uniquely identifying each communication session with a session identification, and a message queue for storing messages to be communicated between the participants, each message in said message queue having associated therewith the session identification of the communication session to which it pertains.\n10. The system of claim 1 wherein said service broker includes means for, establishing a reliable communication session that can be recovered without loss of any messages upon interruption caused by termination of the client or server of said service broker.\n11. The system of claim 10 wherein said reliable communication means comprises means for uniquely identifying each communication session with a session identification, and a message queue for storing messages to be communicated between the participants, each message in said message queue having associated therewith the session identification of the communication session to which it pertains, each message in said message queue being stored on a reliable medium until communicated by said service broker to the participant to which the message is addressed.\n12. The system of claim 1 wherein the service request is in a higher-level format than the LAPI and further including means for converting the higher-level format service request to the LAPI.\n13. The system of claim 12 wherein said higher-level format is a parameter string format.\n14. The system of claim 1 further comprising a communication data structure including a participant control block (PCB) for the client and a PCB for the server, each of said client PCB and said server PCB including information identifying the respective participant, and a service control block (SCB) for the service offered by the server, said SCB including information identifying the offered service and being linked to said server PCB, wherein the service request identifies the service requested and said service broker determines whether the service request matches the service offered by the server by determining if the service identified in the service request is the same as that identified in said SCB.\n15. The system of claim 14 further comprising a set of user functions, said user functions including a REGISTER function, said REGISTER function including the identity of the server and the identity of the offered service, said service broker creating said SCB in response to receiving a message including said REGISTER function from the server.\n16. The system of claim 14 wherein said service broker establishes a communication session between the client and the server in response to the service request and associates therewith a unique session identification, and wherein said communication data structure further includes a communication control block (CCB) linked to said client PCB, said server PCB, said SCB, and said CCB including said session identification.\n17. The system of claim 1 further comprising a set of user functions, said user functions including a SEND function, the client making the service request by sending a message to said service broker including said SEND function.\n18. The system of claim 17 wherein said SEND function has a WAIT parameter and a communication identification (CONVID) parameter.\n19. The system of claim 18 wherein said service broker initiates a conversational communication session when the client sends a message to said service broker including said SEND function and setting said CONVID parameter to a first value, said service broker assigning a unique communication session identification to said conversational communication session.\n20. The system of claim 19 wherein said service broker conveys said communication session identification to the client and the client identifies a further message relating to said communication session by including in said further message said SEND function with said CONVID parameter set to equal said communication session identification.\n21. The system of claim 18 wherein said service broker initiates a non-conversational communication session when the client sends a message to said service broker including said SEND function and setting said CONVID parameter to a second value and sets said WAIT parameter to a first value.\n22. The system of claim 18 wherein said service broker conveys a message from the client to the server without establishing a communication session when the client sends said message to said service broker including said SEND function and setting said CONVID parameter to a second value and sets said WAIT parameter to a second value.\n23. The system of claim 17 further comprising a communication data structure including a message queue to store the service request and other messages for communication to the participants.\n24. The system of claim 23 wherein said set of user functions further includes a REGISTER function, said REGISTER function including the identity of the server and the identity of the offered service, said communication data structure further including a participant control block (PCB) for the client and a PCB for the server, each of said client PCB and said server PCB including information identifying the respective participant, and a service control block (SCB) for the service offered by the server, said SCB including information identifying the offered service and being linked to said server PCB, said service broker creating said SCB in response to receiving a message including said REGISTER function from the server, wherein the service request identifies the service requested and said service broker determines whether the service request matches the service offered by the server by determining if the service identified in the service request is the same as that identified in said SCB.\n25. A method for managing communication among participants in a computing environment, the participants including a server residing on a first computer and a client residing on a second computer, the first and second computers being heterogeneous, the client and server sending messages to each other, the messages including a request from the client for a service, and the server providing a service, the participants being connected by a physical network with a network protocol, said method comprising the steps of:\ndisposing between the participants and the physical network a protocol independent communications transport layer having a lower level application interface (LAPI) and communicating with the physical network via the network protocol;\nplacing a service broker in communication with the participants by said transport layer;\ncommunicating the service request from the client to said service broker;\nsaid service broker determining whether the requested service is provided by the server and, if so;\nsaid service broker communicating the service request from said service broker to the server.\n26. The method of claim 25 further comprising the step of creating a communication data structure, said data structure including a participant control block (PCB) for the client and a PCB for the server, said client PCB and said server PCB including information identifying the respective participants, and a service control block (SCB) for the service offered by the server, said SCB including information identifying the offered service and being linked to said server PCB, wherein the service request identifies the service requested, said determining step comprising said service broker determining if the service identified in the service request is the same as that identified in said SCB.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4604686A",
        "US4975914A",
        "WO1991005417A1",
        "US5109515A",
        "US5224098A",
        "US5249293A",
        "US5265250A",
        "US5280610A"
    ],
    "citations_ftf": [
        "US4777595A",
        "US4556974A",
        "US4725834A",
        "US4689786A",
        "US4649535A",
        "US4745598A",
        "US4682326A",
        "US4789982A",
        "NL8601712A",
        "US4797881A",
        "DE3876617T2",
        "EP0331190B1",
        "US5341477A",
        "ATE151183T1",
        "US5257369A",
        "US5557798A",
        "US5218697A",
        "EP0456249B1",
        "AU630567B2",
        "AU631749B2",
        "US5249290A",
        "EP0648354B1",
        "US5497463A",
        "US5329619A"
    ],
    "citedby_own": [
        "WO1994028486A1",
        "AU663015B2",
        "US5455953A",
        "US5511197A",
        "US5528503A",
        "WO1996023317A1",
        "US5561769A",
        "US5566302A",
        "US5572724A",
        "US5581765A",
        "US5590334A",
        "US5596744A",
        "US5604896A",
        "US5613148A",
        "US5617570A",
        "US5630061A",
        "US5640513A",
        "US5640556A",
        "WO1997022055A1",
        "US5644719A",
        "WO1997028502A1",
        "US5659788A",
        "US5664106A",
        "US5664195A",
        "US5671414A",
        "WO1997035258A1",
        "US5678007A",
        "US5680551A",
        "US5680549A",
        "WO1997039548A2",
        "US5696899A",
        "WO1997046943A1",
        "US5699518A",
        "US5699523A",
        "US5706429A",
        "US5706434A",
        "EP0817017A2",
        "US5708834A",
        "US5717715A",
        "US5734903A",
        "US5740460A",
        "US5748930A",
        "US5748897A",
        "US5748892A",
        "US5748894A",
        "WO1998019417A2",
        "DE19645006A1",
        "US5752003A",
        "US5754856A",
        "US5758186A",
        "US5758074A",
        "US5764890A",
        "US5765155A",
        "US5764985A",
        "US5764887A",
        "US5768508A",
        "US5768561A",
        "US5774668A",
        "US5774854A",
        "US5781703A",
        "US5781739A",
        "US5787300A",
        "US5787245A",
        "US5790800A",
        "US5796393A",
        "US5799318A",
        "US5802293A",
        "US5805777A",
        "US5805914A",
        "US5809270A",
        "US5813006A",
        "US5812794A",
        "US5812768A",
        "US5828893A",
        "US5832219A",
        "US5832509A",
        "US5832211A",
        "US5835740A",
        "US5838909A",
        "US5838903A",
        "US5842033A",
        "US5845282A",
        "US5848234A",
        "US5850517A",
        "US5854927A",
        "US5862328A",
        "US5862323A",
        "US5878429A",
        "US5905862A",
        "US5907675A",
        "US5907692A",
        "US5909542A",
        "WO1999028827A1",
        "US5915112A",
        "US5923890A",
        "US5926636A",
        "US5930476A",
        "US5931917A",
        "US5933599A",
        "US5931911A",
        "US5937184A",
        "US5937404A",
        "US5941949A",
        "US5941947A",
        "US5948054A",
        "US5951647A",
        "US5956489A",
        "US5956509A",
        "US5961586A",
        "US5978577A",
        "US5978840A",
        "US6005864A",
        "US6006251A",
        "US6012063A",
        "US6012083A",
        "US6018776A",
        "US6021496A",
        "US6023268A",
        "US6023729A",
        "US6023721A",
        "US6026404A",
        "US6038599A",
        "US6044465A",
        "US6047310A",
        "WO2000023879A1",
        "US6065046A",
        "US6067417A",
        "US6079009A",
        "US6098128A",
        "US6098096A",
        "US6098067A",
        "US6112017A",
        "US6112243A",
        "US6110229A",
        "US6115737A",
        "US6119151A",
        "DE19910345A1",
        "US6125383A",
        "US6128611A",
        "US6128657A",
        "US6128622A",
        "US6134549A",
        "US6138169A",
        "US6141697A",
        "US6148323A",
        "US6157941A",
        "US6158045A",
        "US6157944A",
        "US6163796A",
        "US6170003B1",
        "US6178511B1",
        "US6182154B1",
        "US6182151B1",
        "US6188691B1",
        "US6192418B1",
        "US6195660B1",
        "US6201792B1",
        "US6205482B1",
        "US6212548B1",
        "US6223149B1",
        "US6230117B1",
        "US6243816B1",
        "US6247039B1",
        "US6249822B1",
        "US6269076B1",
        "US6275944B1",
        "US6289017B1",
        "US6289391B1",
        "US6289390B1",
        "WO2001069456A1",
        "US20010027484A1",
        "US20010032262A1",
        "US6311197B2",
        "US6314465B1",
        "US6321249B1",
        "US6330665B1",
        "US20010051976A1",
        "US6334114B1",
        "US6336135B1",
        "US6336147B1",
        "US20020007334A1",
        "US20020007406A1",
        "US20020010781A1",
        "WO2002006970A1",
        "US20020013759A1",
        "WO2002010917A1",
        "US6347342B1",
        "US6356268B1",
        "US6356938B1",
        "US6356957B2",
        "US20020038340A1",
        "US6370552B1",
        "US6370570B1",
        "US20020052931A1",
        "US20020054069A1",
        "WO2002039486A2",
        "US20020064267A1",
        "US20020069245A1",
        "US6405262B1",
        "US6405254B1",
        "US20020083214A1",
        "US20020083159A1",
        "US20020095656A1",
        "US6430571B1",
        "US20020111820A1",
        "US6437803B1",
        "US6438528B1",
        "US6446108B1",
        "US6453348B1",
        "US6463459B1",
        "US6470022B1",
        "US20020160790A1",
        "US6480891B1",
        "US20020169830A1",
        "WO2001090827A3",
        "US6487171B1",
        "EP1262897A2",
        "US6493004B1",
        "US6496868B2",
        "US20020194336A1",
        "US20020196279A1",
        "US20030007621A1",
        "US20030014569A1",
        "US20030018832A1",
        "US20030033520A1",
        "US20030037102A1",
        "US6526426B1",
        "US6532237B1",
        "US20030051047A1",
        "US6539019B1",
        "US6539435B2",
        "US20030063119A1",
        "US20030069922A1",
        "AU759968B2",
        "US20030101291A1",
        "US6574232B1",
        "US6580693B1",
        "US20030144822A1",
        "US20030145294A1",
        "US20030147383A1",
        "US6614792B1",
        "US6618764B1",
        "US6623529B1",
        "US20030182392A1",
        "US6628287B1",
        "US20030191845A1",
        "US6633899B1",
        "US6647421B1",
        "US6651109B1",
        "US6678700B1",
        "US20040010620A1",
        "US6681327B1",
        "US20040015977A1",
        "US6684259B1",
        "US6697836B1",
        "US20040043753A1",
        "US6710786B1",
        "US6718399B1",
        "US6724747B1",
        "US6728758B2",
        "US6728267B1",
        "US6742022B1",
        "US6751669B1",
        "US20040148347A1",
        "US6785713B1",
        "US6785726B1",
        "US6789112B1",
        "US20040205344A1",
        "US6845505B1",
        "US20050021660A1",
        "US20050027795A1",
        "US20050028105A1",
        "US6901425B1",
        "US20050131921A1",
        "US6912588B1",
        "US20050149682A1",
        "US6922724B1",
        "US6925490B1",
        "US20050177587A1",
        "US20050177837A1",
        "US20050188086A1",
        "US20050193189A1",
        "US20050193017A1",
        "US6941374B1",
        "US6957438B1",
        "US6971106B1",
        "US20050267947A1",
        "US20050264581A1",
        "US20050273847A1",
        "US20050273497A1",
        "US20050273518A1",
        "US20050273516A1",
        "US20050270970A1",
        "US20050273520A1",
        "US20050273521A1",
        "US20050273517A1",
        "US20050278374A1",
        "US6986040B1",
        "US20060007918A1",
        "US20060021014A1",
        "US20060026214A1",
        "US20060031353A1",
        "US20060031355A1",
        "US20060031432A1",
        "US20060031930A1",
        "US20060031433A1",
        "US20060031354A1",
        "US20060031431A1",
        "US20060031481A1",
        "US20060045130A1",
        "US20060069791A1",
        "US20060069788A1",
        "US20060067356A1",
        "US20060069884A1",
        "US7032002B1",
        "US20060095526A1",
        "US7054626B2",
        "US7054433B1",
        "US7058892B1",
        "US20060123417A1",
        "US20060155805A1",
        "US20060164001A1",
        "US20060173758A1",
        "US20060190948A1",
        "US20060200766A1",
        "US20060200705A1",
        "US20060212593A1",
        "US20060211524A1",
        "US20060248176A1",
        "US20070011199A1",
        "US20070008988A1",
        "US20070016639A1",
        "US20070033597A1",
        "US20070039043A1",
        "US20070061815A1",
        "US20070094495A1",
        "US20070094673A1",
        "US20070106787A1",
        "US7228353B1",
        "US20070143597A1",
        "US20070199006A1",
        "US20080005750A1",
        "US7350149B1",
        "US20080091801A1",
        "US7404145B1",
        "US20080244599A1",
        "US20080244507A1",
        "US20080288304A1",
        "US7457880B1",
        "US20080310392A1",
        "US20090006167A1",
        "US20090037991A1",
        "US20090157758A1",
        "US7634509B2",
        "US7685298B2",
        "US20100094996A1",
        "US20100100536A1",
        "US20100120425A1",
        "US20100251262A1",
        "US7818435B1",
        "US20100306669A1",
        "US7849257B1",
        "US7849269B2",
        "US20100332615A1",
        "US7870492B2",
        "US7870146B2",
        "US7873734B1",
        "US7895334B1",
        "US7921184B2",
        "US7940706B2",
        "US20110161202A1",
        "US20110196991A1",
        "US8027339B2",
        "US20110238646A1",
        "US20110239283A1",
        "US20110247008A1",
        "US8073954B1",
        "US8078708B1",
        "US8141164B2",
        "US8146097B2",
        "US8149431B2",
        "US8156074B1",
        "US8181111B1",
        "US8190708B1",
        "US8255006B1",
        "US8255950B1",
        "US8255456B2",
        "US8261057B2",
        "US8266269B2",
        "US20120259956A1",
        "US8291119B2",
        "US8301839B2",
        "US8351333B2",
        "US8359335B2",
        "US8369967B2",
        "US20130044746A1",
        "US8442943B2",
        "US8452849B2",
        "US8495305B2",
        "US8527615B2",
        "US8549149B2",
        "US8559449B2",
        "US8577972B1",
        "US20130311622A1",
        "US8606900B1",
        "US8613053B2",
        "US8611873B2",
        "US8615566B1",
        "US8620286B2",
        "US8645471B2",
        "US8700695B2",
        "US8701014B1",
        "US8706877B2",
        "US8738703B2",
        "US8739274B2",
        "US20140233584A1",
        "US8856777B2",
        "US8874672B2",
        "US8943428B2",
        "US8954595B2",
        "US8965964B1",
        "US20150169373A1",
        "US9143622B2",
        "US9185234B2",
        "US9185538B2",
        "US9203879B2",
        "US9203647B2",
        "US9203794B2",
        "US9229794B1",
        "US9246975B2",
        "US9319356B2",
        "US9350875B2",
        "US20160182433A1",
        "US9497292B2",
        "US9542076B1",
        "US9667585B2",
        "US9680919B2",
        "US9819588B1",
        "US20180014144A1",
        "US9904899B2",
        "US20180088999A1",
        "US10043170B2",
        "US10187334B2",
        "US10361802B1",
        "US10541973B2",
        "US10754815B2",
        "CN111953716A",
        "US10878031B2",
        "US10884880B2",
        "US11803656B2"
    ],
    "citedby_ftf": [
        "JP3361663B2",
        "US5889957A",
        "WO1997024664A1",
        "US5761507A",
        "US6625641B1",
        "JPH09325939A",
        "FI972718A0",
        "US6282580B1",
        "DE19638071A1",
        "US6687762B1",
        "US5892941A",
        "JP3663842B2",
        "US6205473B1",
        "US6516354B2",
        "US6510460B1",
        "EP0926908A1",
        "GB2336449A",
        "US6453356B1",
        "US7953788B2",
        "US6195688B1",
        "US6084874A",
        "US6175619B1",
        "US7010618B1",
        "US6195682B1",
        "US6385653B1",
        "JP3663950B2",
        "US6434596B1",
        "EP1043671A3",
        "US6684401B1",
        "WO2000062158A2",
        "US6792605B1",
        "US6629127B1",
        "US6874028B1",
        "DK1228635T3",
        "AU1471101A",
        "CA2290167C",
        "EP1117220A1",
        "EP1117049A1",
        "EP1117035A1",
        "US6877023B1",
        "US6970942B1",
        "WO2001086441A2",
        "WO2001088829A1",
        "US6721779B1",
        "US6895539B1",
        "US6772228B1",
        "US7089294B1",
        "US7779089B2",
        "US6938251B1",
        "US7830399B2",
        "DE10049619A1",
        "US7054946B2",
        "US7249170B2",
        "US6978301B2",
        "US8219662B2",
        "AU2002228973A8",
        "CA2436118A1",
        "EP1233590A1",
        "US7150037B2",
        "US6918107B2",
        "US6754884B1",
        "US7356803B2",
        "US7437710B2",
        "JP3880337B2",
        "US8296400B2",
        "US7263701B2",
        "US6757684B2",
        "CA2411806A1",
        "DE10157251A1",
        "US7065562B2",
        "US6859810B2",
        "US7383556B1",
        "AU2002322356B2",
        "US20030182425A1",
        "US20030208537A1",
        "US7464145B2",
        "US20040030771A1",
        "US7366893B2",
        "US7461158B2",
        "US7558847B2",
        "US7340508B1",
        "DE10243783A1",
        "US7480915B2",
        "US20040078457A1",
        "US20040230681A1",
        "US20040230965A1",
        "FR2854520A1",
        "EP1649352A4",
        "US8782282B1",
        "US7904895B1",
        "US8526940B1",
        "KR100679865B1",
        "US20070118509A1",
        "US7822746B2",
        "US7730192B2",
        "US8209676B2",
        "EP2047420A4",
        "US7895275B1",
        "CN101291174B",
        "JP5032219B2",
        "US8582141B2",
        "US8606768B2",
        "US8255451B2",
        "ATE528713T1",
        "US8296411B2",
        "US9009683B2",
        "TWI556612B",
        "US10116543B2",
        "US9652971B1",
        "CN111026564A"
    ]
}