{
    "patent_link": "https://patents.google.com/patent/US5717914A/en",
    "patent_id": "US5717914A",
    "title": "Method for categorizing documents into subjects using relevance normalization for documents retrieved from an information retrieval system in response to a query",
    "abstract": "A method for storing input information in an information retrieval system database wherein a plurality of information subject categories are provided. A plurality of subject lexicons are provided, each subject lexicon of the plurality of subject lexicons corresponding to an information subject category of the plurality of information categories. Each subject lexicon contains information representative of its corresponding information subject category. The input information is compared with the subject lexicons and the input information is stored in a selected information subject category according to the comparing of the input information with the subject lexicons.",
    "inventors": [
        "Lawrence A. Husick",
        "John Michael Schultz",
        "Marvin I. Weinberger"
    ],
    "assignee": "Infonautics Corp",
    "classifications": [
        "G06Q30/04",
        "G06F16/353",
        "G06F2213/0038",
        "G06F2216/01",
        "Y10S707/99933",
        "Y10S707/99934",
        "Y10S707/99935"
    ],
    "claims": "\n1. A subjector for selectively storing input information in an information retrieval system database, said input information being formed of a collection of English language words, comprising:\nat least one information subject category within said information retrieval system database;\na first plurality of subjected documents selected from said information retrieval system database and relating to said first information subject category;\na preliminary lexicon determined in accordance with said first plurality of subjected documents wherein an information comparing unit first compares selected documents with said preliminary lexicon;\na second plurality of documents selected in accordance with said first comparing, wherein a determination is made whether documents of said second plurality of documents belong in said first subject category and documents are removed from said second plurality of documents in accordance with said determining whether said documents belong in said second plurality of documents to provide a remaining third plurality of documents, and said information comparing unit second compares said third plurality of documents to determine said first subject lexicon in accordance with said third plurality of documents;\nsaid first subject lexicon corresponding to said information subject category and containing information representative of said information subject category, said first subject lexicon containing a plurality of classifier words, wherein generally all of said classifier words in said first subject lexicon contain at least one English language word;\nan information comparing unit for third comparing said collection of English language words from said input information with said classifier words from said first subject lexicon, wherein said collection of English language words from said input information form at least one document; and\nmemory for storing said input information in said information subject category in accordance with said third comparing.\n2. The subjector for selectively storing input information of claim 1, further comprising a search engine for retrieving said stored input information in accordance with said information subject category.\n3. A method for storing input information in an information retrieval system database, said input information being formed of a collection of English language words, comprising the steps of:\n(A) determining an information subject category within said information retrieval system database;\n(B) determining a subject lexicon corresponding to said information subject category and containing information representative of said information subject category, said subject lexicon containing a plurality of classifier words, wherein each of said plurality of classifier words contains a first English language word (a) and a second English word (b), and each of said plurality of classifier words has a discriminator weight (w(a, b)) calculated in accordance with the formula:\nw(a,b)=log (P(ab)/P(a)P(b))\nwherein P(a) is a probability that said first English language word (a) occurs in a document pool, P(b) is a probability that said second English language word (b) occurs in said document pool, and P(ab) is a probability that said first English language word (a) is positioned adjacent to said second English language word (b) in a subject corpus;\n(C) comparing said collection of English language words from said input information with said classifier words from said subject lexicon; and\n(D) storing said input information in said information subject category in accordance with said comparing of step (C).\n4. A subjector for selectively storing input information in an information retrieval system database, said input information being formed of a collection of English language words, comprising:\nat least one information subject category within said information retrieval system database;\na subject lexicon corresponding to said information subject category and containing information representative of said information subject category, said subject lexicon containing a plurality of classifier words, wherein each of said plurality of classifier words contains a first English language word (a) and a second English word (b), and each of said plurality of classifier words has a discriminator weight (w(a, b)) calculated in accordance with the formula:\nw(a, b)=log (P(ab)/P(a)P(b))\nwherein P(a) is a probability that said first English language word (a) occurs in a document pool, P(b) is a probability that said second English language word (b) occurs in said document pool, and P(ab) is a probability that said first English language word (a) is positioned adjacent to said second English language word (b) in a subject corpus;\nan information comparing unit for first comparing said collection of English language words from said input information with said classifier words from said subject lexicon; and\nmemory for storing said input information in said information subject category in accordance with said first comparing.\n5. A method for storing input information in an information retrieval system database, said input information being formed of a collection of English language words, comprising the steps of:\n(a) determining an information subject category within said information retrieval system database;\n(b) determining a first subject lexicon corresponding to said information subject category and containing information representative of said information subject category, said first subject lexicon containing a plurality of classifier words, wherein generally all of said classifier words in said first subject lexicon contain at least one English language word, said step of determining said first subject lexicon including:\n(i) first selecting a first plurality of subjected documents from said information retrieval system database relating to said information subject category to provide first selected documents;\n(ii) determining a preliminary lexicon in accordance with said first plurality of subjected documents;\n(iii) comparing selected documents with said preliminary lexicon;\n(iv) second selecting a second plurality of documents in accordance with said comparing of step (iii);\n(v) determining whether documents of said second plurality of documents belong in said first subject category:\n(vi) removing documents from said second plurality of documents in accordance with the determining of step (v) to provide a third plurality of documents; and\n(vii) determining said first subject lexicon in accordance with said third plurality of documents;\n(c) comparing said collection of English language words from said input information with said classifier words from said first subject lexicon, wherein said collection of English language words from said input information form at least one document; and\n(d) storing said input information in said information subject category in accordance with said comparing of step (c).\n6. The method for storing input information of claim 1, further comprising the step of retrieving said input information in accordance with said information subject category.\n7. The method for storing information of claim 1 wherein, said first plurality of documents is substantially small and said second plurality of documents is substantially large.\n8. The method for storing information of claim 7, wherein said plurality of documents includes between approximately 5 documents and 20 documents and said second plurality of documents contains between 150 documents and 250 documents.\n9. The method for storing information of claim 1 wherein, said first plurality of documents is substantially small and said second plurality of documents is substantially large.\n10. The method for storing information of claim 9, wherein said plurality of documents includes between approximately 5 documents and 20 documents and said second plurality of documents contains between 150 documents and 250 documents.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3947825A",
        "US4754489A",
        "US4849898A",
        "US4972349A",
        "US5157783A",
        "US5159667A",
        "US5168565A",
        "US5182708A",
        "US5241671A",
        "US5251131A",
        "AU4213393A",
        "US5278980A",
        "US5293552A",
        "US5323316A",
        "WO1994027237A1",
        "WO1994027227A1",
        "WO1995000896A2",
        "WO1995012172A1",
        "WO1995013582A1",
        "WO1995013585A1",
        "US5418951A",
        "WO1995014280A1",
        "WO1995014279A1",
        "WO1995018406A1",
        "US5497319A",
        "US5519608A",
        "US5541836A",
        "US5594837A",
        "US5598557A",
        "US5619709A",
        "US5630125A",
        "US5640533A"
    ],
    "citations_ftf": [
        "US4823306A",
        "US5321833A",
        "US5442778A",
        "US5537586A"
    ],
    "citedby_own": [
        "US5884266A",
        "US5899995A",
        "US5924090A",
        "US5926811A",
        "US5931908A",
        "US5953718A",
        "US5963946A",
        "US5970485A",
        "EP0950965A2",
        "US5991714A",
        "US6003027A",
        "US6012052A",
        "US6016520A",
        "US6029165A",
        "US6049795A",
        "US6098066A",
        "US6105023A",
        "US6115709A",
        "US6154783A",
        "US6189045B1",
        "US6198483B1",
        "US6202061B1",
        "US6212528B1",
        "US6243713B1",
        "US6256785B1",
        "WO2001050338A1",
        "WO2001059591A2",
        "US6304874B1",
        "US6308176B1",
        "US20020016800A1",
        "WO2002015032A2",
        "US6377949B1",
        "US6385605B1",
        "US6385611B1",
        "US6393423B1",
        "US20020062358A1",
        "US6405197B2",
        "US20020082841A1",
        "US6418432B1",
        "US6430559B1",
        "US6430558B1",
        "US6460034B1",
        "US6519585B1",
        "US20030046027A1",
        "US6546383B1",
        "US20030084404A1",
        "US20030097312A1",
        "US6618731B2",
        "US20030177111A1",
        "US6633868B1",
        "US6640229B1",
        "US6668251B1",
        "US6711565B1",
        "US20040111386A1",
        "US6769010B1",
        "US6782393B1",
        "US6804662B1",
        "US6826724B1",
        "US20050071332A1",
        "US6892196B1",
        "US20050108236A1",
        "US6915294B1",
        "US20050203883A1",
        "US20060031215A1",
        "US20060036588A1",
        "US7043526B1",
        "US20060122884A1",
        "US7080073B1",
        "US20060161520A1",
        "US20060179039A1",
        "US20060184512A1",
        "US7103594B1",
        "US7103838B1",
        "US20060200461A1",
        "US7107261B2",
        "US20060239563A1",
        "US20060253462A1",
        "US7181438B1",
        "EP1760613A2",
        "US20070061320A1",
        "US7203725B1",
        "US20070083300A1",
        "US20070088676A1",
        "US7213013B1",
        "US7216115B1",
        "US20070106644A1",
        "US20070106639A1",
        "US20070130199A1",
        "US7233937B2",
        "US7257604B1",
        "US20070198470A1",
        "US20070208754A1",
        "US20070208697A1",
        "US20070233660A1",
        "US20070255686A1",
        "US20080005102A1",
        "US20080005651A1",
        "US20080016101A1",
        "US7333983B2",
        "US20080052289A1",
        "WO2008030236A1",
        "US20080177728A1",
        "US20080222513A1",
        "US20080222168A1",
        "US20080244373A1",
        "US20080267503A1",
        "US20080282200A1",
        "CN100444151C",
        "US7490092B2",
        "US20090055368A1",
        "US20090055242A1",
        "US7546287B2",
        "US20100153440A1",
        "US20100161580A1",
        "US20100169385A1",
        "CN1653422B",
        "US20100293195A1",
        "US20110004462A1",
        "US20110010372A1",
        "US20110221367A1",
        "US20110243478A1",
        "US8375061B2",
        "US8380875B1",
        "US8423555B2",
        "US8463789B1",
        "US20130290303A1",
        "US8626763B1",
        "US20140012849A1",
        "US8639694B1",
        "US8694385B1",
        "US20140147048A1",
        "US8782042B1",
        "US8805840B1",
        "US8977613B1",
        "US20150178261A1",
        "US9348915B2",
        "US9442933B2",
        "US9805373B1",
        "US9886478B2",
        "WO2019195822A1",
        "US10467289B2",
        "US10546311B1",
        "US10592480B1",
        "USRE47934E1",
        "US10643227B1"
    ],
    "citedby_ftf": [
        "US6169997B1",
        "GB9821787D0",
        "CN101882152B",
        "EP4109322A1"
    ]
}