{
    "patent_link": "https://patents.google.com/patent/US20120005749A1/en",
    "patent_id": "US20120005749A1",
    "title": "Generic Fraud Detection Model",
    "abstract": "A method for dynamically updating a model is described. The method includes accessing a model that specifies expected characteristics for a transaction. The model includes variables associated with fraud. The method also includes receiving at least one value for each of the variables while monitoring transactions, and updating a distribution of values for each variable based on the received value. The received value is compared with the updated distribution to determine a deviation from a threshold value associated with a percentile of the updated distribution that is indicative of fraud.",
    "inventors": [
        "Scott M. Zoldi",
        "Steven Wu",
        "Fei Chen"
    ],
    "assignee": "Fair Isaac Corp",
    "classifications": [
        "G06Q40/02",
        "G06Q40/00"
    ],
    "claims": "\n1. A computer-implemented method for dynamically updating a model comprising:\naccessing, by a computing system, a model that includes variables for a type of transaction, each of the variables being associated with a distribution of values;\nreceiving, by the computing system, a value for each of the variables while monitoring transactions of the type;\nupdating, by the computing system, the distribution of values for each variable based on the value received for each variable; and\ncomparing, by the computing system and for each variable, the received value with the updated distribution to determine a deviation of the received value from a threshold value, the threshold value determined based on a percentile of values of the updated distribution that are indicative of fraud.\n2. The method of claim 1, wherein the distribution of values for each variable represent historical values for previous transactions of the type.\n3. The method of claim 1, further comprising weighting each determined deviation with a coefficient correlated to an assigned importance of each variable within the model.\n4. The method of claim 1, further comprising determining a score indicative of a probability of fraud for a transaction of the type based on, for each of the variables, the deviation of the received value from the threshold.\n5. The method of claim 1, further comprising scaling, for each of the variables, the determined deviation based on a variance range between the threshold value and a maximum expected value of the updated distribution.\n6. The method of claim 5, further comprising determining a score indicative of a probability of fraud for the transaction based on the scaled determined deviations.\n7. The method of claim 6, further comprising weighting each of the scaled determined deviations with a coefficient correlated to an assigned importance of each of the variables within the model.\n8. The method of claim 7, wherein each of the scaled determined deviations is calculated based on an equation comprising:\n9. The method of claim 8, wherein the score is calculated based on an equation comprising:\n\nη=Σq(x i|θ)\nwhere η is the score.\n10. The method of claim 1, further comprising scaling, for each of the variables, the determined deviation based on a variance range assigned or selected by a user.\n11. The method of claim 1, further comprising scaling, for each of the variables, the determined deviation based on a variance range between the percentile of values of the updated distribution that are indicative of fraud and a percentile of one or more values of the updated distribution that is indicative of a maximum significant value.\n12. The method of claim 1, wherein:\nthe model comprises segments; and\nat least one of the segments is generated based on user input.\n13. The method of claim 1, wherein:\nthe model comprises segments; and\nat least one segment's expected characteristics for the type of transaction differ from expected characteristics of other segments of the model.\n14. The method of claim 13, further comprising identifying the received values as associated with the at least one segment and exclusively updating, relative to the other segments, the distribution of values for at least one variable of the at least one segment based on the received values.\n15. The method of claim 14, further comprising determining a score indicative of a probability of fraud for a transaction of the type based on the updated at least one segment.\n16. The method of claim 14, further comprising updating the distribution of values for each of the variables based on at least one of the received values.\n17. The method of claim 16, further comprising determining a score indicative of a probability of fraud for a transaction of the type based on the updated distribution of values for each of the variables if substantially insufficient statistics have been gathered for the at least one segment.\n18. The method of claim 1, wherein the percentile of values for the updated distributions that are indicative of fraud are different among at least two of the variables in the model.\n19. A method for processing a transaction comprising:\nreceiving, by a computing system and as having been transmitted from a computing device at which an electronic transaction was initiated, information associated with the electronic transaction;\ndetermining, by the computing system, a value for a characteristic of the electronic transaction using the received information;\nupdating, by the computing system, a distribution of values for the characteristic based on the received value, wherein the updated distribution of values is used to determine a deviation of the received value from a value computed from the updated distribution; and\ndetermining, by the computing system, a score indicative of a probability of fraud for the electronic transaction, wherein the score is based on the deviation of the received value from the computed value and specifies a probability of fraud in the transaction.\n20. The method of claim 19, wherein the value computed from the updated distribution is a value in the updated distribution.\n21. The method of claim 19, wherein electronic transaction was initiated at the computing device at a request of a user that is a party to the transaction.\n22. The method of claim 21, wherein the distribution of values for the characteristic is a distribution of historical values for previous transactions of a same type as the electronic transaction and that were initiated at a plurality of different computing system at requests of multiple different users that were parties to the previous transactions.\n23. The method of claim 19, wherein the computed value is computed based on a fixed percentage of the distribution values, and wherein the fixed percentage defines a threshold above which values are determined to be substantially atypical for the characteristic.\n24. A computing system for determining fraud comprising:\nan interface configured to receive values associated with a transaction that has multiple properties, each value corresponding to at least one of the properties;\na profile updater configured to modify a distribution of historically received values for each property based on the received values; and\na score calculator configured to generate a fraud score for the transaction, wherein generating the fraud score comprises comparing the received values with the modified distributions of values to determine deviations of the received values from threshold percentiles of the modified distributions of values at which values begin to be identified as indicative of fraud, the deviations determined for those of the received values that exceed the threshold percentiles.\n25. The system of claim 24, wherein the score calculator is further configured to scale the determined deviations to the difference between the threshold percentiles and maximum expected values for the modified distribution of values.\n26. A method for generating a fraud indicator comprising:\ngenerating, by a computing system, a score indicative of a probability of fraud for a transaction, the score generated from variables representing properties of the transaction, the variables being determined by:\nreceiving, for each variable, a value;\nupdating, for each variable, a distribution of values to include the received value; and\ndetermining, for each variable, an updated threshold value that is based on the updated distribution of values, wherein the updated threshold value indicates a beginning of a range of values in the updated distribution of values that are unusual relative to the updated distribution of values, wherein the updated threshold value replaces a previous threshold value for the variable before the value was received.\n27. The method of claim 26, wherein the variables are further determined by scaling, for each variable, the received value using the updated threshold value.\n28. The method of claim 26, wherein each of the distributions of values represents values for multiple transactions initiated by various different users.\n29. The method of claim 26, wherein the score is generated by weighting the variables and aggregating the weighted variables to form the generated score.\n30. A computer program product tangibly embodied in a machine-readable storage device, the computer program product including instructions that, when executed by a processor, perform operations for determining a fraud indicator, the operations comprising:\naccessing a model that specifies expected characteristics for an electronic transaction initiating from a computerized device, wherein the model comprises a distribution of values for each of the characteristics, wherein each of the characteristics is associated with a parameter value that identifies a threshold percentile of the associated distribution of values at which values for the characteristic are associated with fraud;\nreceiving, for the transaction, a value for each of the characteristics;\nadding, for each variable, the received value to the associated distribution of values; and\nupdating, in response to the adding, the parameter value for each variable.\n31. The computer program product of claim 30, wherein the operations further comprise:\ngenerating, for each variable, a scaled value by scaling the received value between the updated parameter value and a maximum expected value for the distribution of values; and\ngenerating, based on the scaled values, a fraud score that is proportionate to an existence of fraud for the electronic transaction.",
    "status": "Active",
    "citations_own": [
        "US20050185779A1",
        "US20050278550A1",
        "US8027439B2"
    ],
    "citations_ftf": [
        "US6095413A",
        "US6526389B1",
        "US6597775B2",
        "US7865427B2",
        "US7505931B2",
        "US7497374B2"
    ],
    "citedby_own": [
        "US20180189674A1",
        "CN109035021A",
        "US20190362354A1",
        "US10748127B2",
        "US10762477B2",
        "US10769606B2",
        "US10832246B2",
        "US10839359B2",
        "US10846662B2",
        "US10956888B2",
        "US10963856B2",
        "US10970695B2",
        "US10970688B2",
        "US11037122B2",
        "US11037121B2",
        "US11062290B2",
        "US11144928B2",
        "US11151522B2",
        "US11151523B2",
        "US11157884B2",
        "US11321682B2",
        "US11361290B2",
        "US11373182B2",
        "US11386410B2",
        "US11587099B2",
        "US11593800B2",
        "US11599890B1"
    ],
    "citedby_ftf": [
        "US9412123B2",
        "US10999298B2",
        "US11301585B2",
        "US8938671B2",
        "US8151327B2",
        "US8027439B2",
        "US9110975B1",
        "US8661029B1",
        "US7523016B1",
        "US8938463B1",
        "US8694374B1",
        "US9092510B1",
        "US7627522B2",
        "US8165938B2",
        "US20090030710A1",
        "US8694511B1",
        "US8909655B1",
        "US20090106151A1",
        "US10395187B2",
        "US11037229B2",
        "US10510025B2",
        "US8788967B2",
        "US20090271305A1",
        "US20100005029A1",
        "US8396865B1",
        "US9112850B1",
        "US20100248779A1",
        "US9009146B1",
        "US9471920B2",
        "US10346845B2",
        "US8600873B2",
        "US8447760B1",
        "US8498974B1",
        "US8972391B1",
        "US8874555B1",
        "US8615514B1",
        "US8959093B1",
        "US9652802B1",
        "US20110251951A1",
        "US8296225B2",
        "US9623119B1",
        "US20120016856A1",
        "US8392261B2",
        "US8832083B1",
        "US10332199B2",
        "US8290845B2",
        "US8306889B2",
        "US10460377B2",
        "US10204376B2",
        "US9002867B1",
        "WO2012112781A1",
        "US9244819B2",
        "US11030562B1",
        "US8452813B2",
        "US10754913B2",
        "US8478688B1",
        "US10902426B2",
        "US9633201B1",
        "US9521551B2",
        "US20130304553A1",
        "WO2014022813A1",
        "WO2014078569A1",
        "US10438228B2",
        "US20140214518A1",
        "US10572892B2",
        "US8812387B1",
        "US9917885B2",
        "US10902327B1",
        "US9191403B2",
        "US9779407B2",
        "US9472194B2",
        "US10896421B2",
        "US11017330B2",
        "US9280661B2",
        "US20150032589A1",
        "US20160055427A1",
        "US20150066771A1",
        "US20150339673A1",
        "US10032230B2",
        "US9774681B2",
        "US10091312B1",
        "US20160071017A1",
        "US20160063502A1",
        "US11080709B2",
        "US20160078367A1",
        "US10546099B2",
        "US10290001B2",
        "US10339527B1",
        "US9432506B2",
        "US11093988B2",
        "US20160260099A1",
        "US10528948B2",
        "US11151468B1",
        "US10671915B2",
        "US9852427B2",
        "US9818116B2",
        "US10489840B2",
        "US9888007B2",
        "US10187369B2",
        "US10250583B2",
        "US10791136B2",
        "US11783046B2",
        "US11621969B2",
        "US10965668B2",
        "US10901960B1",
        "US10579822B1",
        "US10699028B1",
        "US10896472B1",
        "US20190342297A1",
        "US20200258147A1",
        "CN111598518B",
        "US11818147B2"
    ]
}