{
    "patent_link": "https://patents.google.com/patent/US20030105677A1/en",
    "patent_id": "US20030105677A1",
    "title": "Automated web ranking bid management account system",
    "abstract": "The present invention relates to an automated web ranking system which enables advertisers to dynamically adjust pay-per-click bids to control advertising costs. The system tracks search terms which are used to market an advertiser's product or services in on line marketing media (“OMM”). The system determines the search term's effectiveness by collecting and analyzing data relating to the number of impressions, the number of clicks, and the number of resulting sales generated by a search term at a given time period. Based on the data collected and parameters which the advertiser provides relating to the advertiser's economic factors, the system calculates a maximum acceptable bid for each search term. The system monitors the web for competitor's bids on an advertiser's search term and places bids which fall below the maximum acceptable bid.",
    "inventors": [
        "Christopher Skinner"
    ],
    "assignee": "Individual",
    "classifications": [
        "G06Q30/02",
        "G06Q30/0256",
        "G06Q30/0601",
        "G06Q30/0611",
        "G06Q40/04",
        "Y10S707/99933",
        "Y10S707/99935"
    ],
    "claims": "\n1. An automated method for web ranking of bids, comprising the steps of:\ntracking Internet user activity generated to an OMM and an advertiser's website when an Internet user conducting a web-based search on the OMM enters at least one search term relating to a service or product of the advertiser;\nacquiring data relating to the Internet user activity;\nsorting said data to remove duplicate information;\ncompiling a master data set from said data wherein data values are arranged according to time of Internet user activity and a designated primary key;\ndetermining sufficiency of data based on specified conditions;\ncalculating an acceptable new maximum bid for said search term;\ndetermining whether said maximum bid is a justified expense for the advertiser in light of profit determining factors;\ndetermining whether to maintain, modify, or remove a bid for a search term;\nretrieving information on competitor's bids;\nidentifying desired ranking;\npreparing an insertion order with an appropriate bid for achieving the desired ranking; and\nautomatically uploading insertion order to OMM.\n2. The method of claim 1, wherein Internet user activity generated to an OMM and an advertiser's website is tracked by the OMM, the advertiser's website, and a tracking engine.\n3. The method of claim 2, wherein said tracking engine tracks the Internet user's activity by assigning a tracking URL having a keycode embedded therein that identifies the OMM and a search term which was used by the Internet user to access the advertiser's listing.\n4. The method of claim 3, wherein said primary key comprises the keycode used in the tracking URL.\n5. The method of claim 1, wherein said step of acquiring data relating to Internet user activity includes sending GET requests at specified time intervals to the OMM, the tracking engine, and the advertiser's web site.\n6. The method of claim 1, further comprising maintaining a database of a plurality of search terms relating to the advertiser's service or product.\n7. The method of claim 1, wherein the data set contains a designated threshold value of visits and actions taken by the user on the advertiser's website for fulfilling said specified conditions for data sufficiency.\n8. The method of claim 1, wherein said profit determining factors comprise an expected return on advertising spend (ROAS) value, a minimum acceptable return on advertising spend (ROAS) value, a maximum return on advertising spend (ROAS) value, a computational linguistics value of the search term, and the new maximum acceptable bid value.\n9. The method of claim 1, wherein said step of identifying desired ranking includes identifying the highest competitor bid which falls below the new maximum acceptable bid value.\n10. The method of claim 1, wherein the step of preparing insertion order with appropriate bid for achieving the desired ranking includes entering a bid that is a minimal value above the highest competitor bid which falls below the new maximum acceptable bid value.\n11. An automated web ranking system comprising:\nat least one server computer having a microprocessor, an area of main memory for executing program code under the direction of the microprocessor, a storage device for storing data and program code, and a bus connecting the microprocessor, main memory, and the storage device;\na data communications device connected to said bus for connecting said server computer to a network;\na computer program code for automated web ranking, the code being stored in said storage device and executing in said main memory under the direction of said microprocessor, the computer program including:\nmeans for tracking Internet user activity generated to an OMM and an advertiser's website when an Internet user conducting a web-based search on the OMM enters at least one search term relating to a service or product of the advertiser;\nmeans for acquiring data relating to the Internet user activity;\nmeans for sorting said data to remove duplicate information;\nmeans for compiling a master data set from said data wherein data values are arranged according to time of Internet user activity and a designated primary key;\nmeans for determining sufficiency of data based on specified conditions;\nmeans for calculating an acceptable new maximum bid for said search term;\nmeans for determining whether said maximum bid is a justified expense for the advertiser in light of profit determining factors;\nmeans for determining whether to maintain, modify, or remove a bid for a search term;\nmeans for retrieving information on competitor's bids;\nmeans for identifying desired ranking;\nmeans for preparing an insertion order with an appropriate bid for achieving the desired ranking; and\nmeans for automatically uploading insertion order to OMM.\n12. The system of claim 11, wherein Internet user activity generated to an OMM and an advertiser's website is tracked by the OMM, the advertiser's website, and a tracking engine.\n13. The system of claim 12, wherein said tracking engine tracks the Internet user's activity by assigning a tracking URL having a keycode embedded therein that identifies the OMM and search term which was used by the Internet user to access the advertiser's listing.\n14. The system of claim 11, further comprising means for sending GET requests at specified time intervals to the OMM, the tracking engine, and the advertiser's web site.\n15. The system of claim 11, further comprising means for identifying the highest competitor bid which falls below the new maximum acceptable bid value.\n16. A computer program product that includes a medium readable by a processor, the medium having stored thereon a set of instructions for automated web ranking, comprising:\na first sequence of instructions which, when executed by the processor, causes the processor to acquire data relating to the Internet user activity;\na second sequence of instructions which, when executed by the processor, causes the processor to sort said data to remove duplicate information;\na third sequence of instructions which, when executed by the processor, causes the processor to compile a master data set from said data wherein data values are arranged according to time of Internet user activity and a designated primary key;\na fourth sequence of instructions which, when executed by the processor, causes the processor to determine sufficiency of data based on specified conditions;\na fifth sequence of instructions which, when executed by the processor, causes the processor to calculate an acceptable new maximum bid for said search term;\na sixth sequence of instructions which, when executed by the processor, causes the processor to determine whether said maximum bid is a justified expense for the advertiser in light of profit determining factors;\na seventh sequence of instructions which, when executed by the processor, causes the processor to determine whether to maintain, modify, or remove a bid for a search term;\nan eight sequence of instructions which, when executed by the processor, causes the processor to retrieve information on competitor's bids;\na ninth sequence of instructions which, when executed by the processor, causes the processor to identify desired ranking;\na tenth sequence of instructions which, when executed by the processor, causes the processor to prepare an insertion order with an appropriate bid for achieving the desired ranking; and\nan eleventh sequence of instructions which, when executed by the processor, causes the processor to automatically upload insertion order to OMM.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US6078866A",
        "US6269361B1",
        "US20010051911A1",
        "US20020072999A1",
        "US20020147708A1",
        "US6477509B1",
        "US20030028529A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20030126027A1",
        "US20040039733A1",
        "US20040068460A1",
        "US20050021461A1",
        "US20050021441A1",
        "US20050137939A1",
        "US20050144067A1",
        "US20050144068A1",
        "US20050144064A1",
        "US20050149390A1",
        "US20050149388A1",
        "US20050203766A1",
        "US20050209919A1",
        "US20050209920A1",
        "US20050216547A1",
        "US20050223000A1",
        "US20060026063A1",
        "US20060026064A1",
        "US20060041536A1",
        "US20060100988A1",
        "WO2006055000A1",
        "US20060149625A1",
        "US20060190328A1",
        "US20060206479A1",
        "US20060247981A1",
        "US20060253437A1",
        "WO2007024811A1",
        "US20070050245A1",
        "US20070088605A1",
        "US20070100708A1",
        "US20070118432A1",
        "US20070143266A1",
        "US20070156757A1",
        "US20070162379A1",
        "US20070233566A1",
        "US20080052278A1",
        "US20080071767A1",
        "US20080098058A1",
        "US20080126159A1",
        "US20080154705A1",
        "WO2008106687A2",
        "US20080288481A1",
        "US20080320436A1",
        "US20090063249A1",
        "US20090171746A1",
        "US20090204478A1",
        "US20100042467A1",
        "US20100094725A1",
        "US20100153539A1",
        "US20100161417A1",
        "US7877392B2",
        "US20110035276A1",
        "US20110040604A1",
        "US20110093811A1",
        "US20110161091A1",
        "US20110213654A1",
        "US20120053990A1",
        "US20120130816A1",
        "US20120130798A1",
        "US8315908B1",
        "US20120310690A1",
        "US20120323627A1",
        "US20120330941A1",
        "US8396742B1",
        "US20130211915A1",
        "US8781888B1",
        "US20140310094A1",
        "US20140324602A1",
        "US8943039B1",
        "US8972379B1",
        "US20150106158A1",
        "US20150134464A1",
        "US20150178779A1",
        "US20150339353A1",
        "US9235565B2",
        "US9330082B2",
        "US9330083B2",
        "US20160267533A1",
        "US9892431B1",
        "US9922334B1",
        "US10007926B2",
        "US10032452B1",
        "US10152723B2",
        "US10248667B1",
        "US10445788B2",
        "US10453100B2",
        "US10475082B2",
        "US10593329B2",
        "US10650066B2",
        "US10650408B1",
        "US10708313B2",
        "US10735552B2",
        "US10769677B1",
        "US10776830B2",
        "US10878448B1",
        "US11010794B2",
        "US11120467B2",
        "US11244324B2",
        "US11823236B1"
    ],
    "citedby_ftf": [
        "US8140388B2",
        "US7565425B2",
        "US8239273B1",
        "US7822661B1",
        "US7689466B1",
        "US7516086B2",
        "US7844589B2",
        "US7873536B2",
        "US8055553B1",
        "US7539674B2",
        "US20110313853A1",
        "US8229914B2",
        "US8688671B2",
        "US8805339B2",
        "US8503995B2",
        "US20110145076A1",
        "US8812526B2",
        "US10592930B2",
        "US8989718B2",
        "US7660581B2",
        "US7769764B2",
        "US8302030B2",
        "US7702318B2",
        "US8433297B2",
        "US7676394B2",
        "US8832100B2",
        "US8666376B2",
        "US8819659B2",
        "US8195133B2",
        "US8103545B2",
        "US7912458B2",
        "US9471925B2",
        "US8238888B2",
        "US10911894B2",
        "US8615719B2",
        "US9076175B2",
        "US20100076994A1",
        "US7752209B2",
        "US20110106614A1",
        "US8209344B2",
        "US9058406B2",
        "US9703892B2",
        "US10038756B2",
        "US20110153428A1",
        "US8364540B2",
        "US8364521B2",
        "US8660891B2",
        "US20070250501A1",
        "US20070214118A1",
        "US8370197B2",
        "US20070244868A1",
        "US8175585B2",
        "US20080091487A1",
        "US8909676B1",
        "US20100257054A1",
        "US20090138330A1",
        "US20090287537A1",
        "US8117050B2",
        "US20090327331A1",
        "US8224698B2",
        "US9177333B2",
        "US9390139B1",
        "US8793236B2"
    ]
}