{
    "patent_link": "https://patents.google.com/patent/US4349869A/en",
    "patent_id": "US4349869A",
    "title": "Dynamic matrix control method",
    "abstract": "A method for controlling and optimizing the operation of a series of interdependent processes in a plant environment. Manipulation of one or more constrained process input variables is used to achieve feedforward/feedback control of one or more process output variables. In the synthesis of the method of controlling and optimizing, input variables are subjected to measured perturbations and the dynamic effects on the outputs are noted for prediction of the future response of the processes during on-line operation. Time variant and time invariant constraints on system operation are incorporated to allow optimum operation of the interdependent processes.",
    "inventors": [
        "David M. Prett",
        "Brian L. Ramaker",
        "Charles R. Cutler"
    ],
    "assignee": "Shell USA Inc",
    "classifications": [
        "B01J19/0033",
        "B01D3/42",
        "C10G11/187",
        "G05B13/022"
    ],
    "claims": "\n1. A method of controlling and optimizing the operation of a process having a plurality of independently controlled, manipulated variables and at least one controlled variable dependent on said manipulated variables, said method comprising the steps of:\nintroducing test disturbances in said manipulated variables and measuring the effect of the disturbances on said controlled variable;\ncalculating at discrete intervals of time from said introducing and measuring the magnitude of response of said controlled variable to a given change in one of said manipulated variables;\nmeasuring the present values of said manipulated variables and said controlled variable;\nusing said calculated magnitude of response to calculate for discrete intervals of time a new set of moves for said manipulated variables for obtaining new values and for moving said controlled variable toward its optimum setpoint; and\nadjusting said manipulated variables in accordance with said new set of moves to reach said new values.\n2. Method of claim 1 wherein for each discrete interval of time said new values are compared with said present values of said manipulated variables to determine if said manipulated variables can be moved to said new values.\n3. Method of claim 2 further comprising removing at least a first manipulated variable from the method and recalculating a new set of moves for the remaining manipulated variables if said first manipulated variable cannot be moved to said new value.\n4. Method of claim 1 wherein said measured values are used to form a projection in time of the future value of said controlled variable.\n5. Method of claim 1 wherein a number of consecutive moves of said manipulated variables are calculated to reach said future value of said controlled variable.\n6. Method of claim 5 wherein only a part of said consecutive moves are implemented before recalculating a new set of moves.\n7. Method according to claim 1 wherein said process has a plurality of controlled variables and said controlled variables are assigned weighting factors for moving some of said controlled variables toward their respective setpoints in a manner more efficient than others of said controlled variables.\n8. Method according to claim 1, further comprising:\nintroducing test disturbances in a set of measurable disturbances not a part of said manipulated variables;\ncalculating from said introducing of said measurable disturbances the response of said controlled variable to a given change in one of said measurable disturbances; and\nusing said calculated response to said measurable disturbances to calculate said new set of moves to move said controlled variable toward its optimum setpoint.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "GB843793A",
        "US3044701A",
        "US3534400A",
        "US3798426A",
        "US3828171A",
        "US3862403A",
        "US3873816A",
        "US3891836A",
        "US4169283A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "WO1984002590A1",
        "WO1985001807A1",
        "EP0152871A2",
        "US4577270A",
        "US4602326A",
        "US4616308A",
        "US4630189A",
        "US4736316A",
        "US4754410A",
        "US4755925A",
        "WO1988005947A1",
        "US4768143A",
        "US4769766A",
        "WO1988007708A1",
        "US4922412A",
        "USRE33267E",
        "US4982320A",
        "WO1991006918A1",
        "US5038270A",
        "US5043863A",
        "US5119468A",
        "US5155677A",
        "WO1993006557A1",
        "US5265034A",
        "US5301102A",
        "US5301101A",
        "US5328787A",
        "US5329443A",
        "US5347446A",
        "US5351184A",
        "US5396416A",
        "US5457625A",
        "US5519605A",
        "US5522224A",
        "US5541833A",
        "WO1997012300A1",
        "US5682309A",
        "US5696696A",
        "US5740033A",
        "US5758047A",
        "US5774381A",
        "US5923571A",
        "US5933345A",
        "US6097989A",
        "US6207936B1",
        "US6493596B1",
        "US20030073787A1",
        "US20030195665A1",
        "US20040015248A1",
        "US6697713B2",
        "US20040049295A1",
        "US20040059441A1",
        "US20040073409A1",
        "US20040083028A1",
        "US6745088B2",
        "US20040117766A1",
        "US20040133363A1",
        "US6818864B2",
        "US20050016704A1",
        "US20050182500A1",
        "US20050201048A1",
        "US20060010946A1",
        "US20060074501A1",
        "US20060229743A1",
        "US20060241786A1",
        "US20060259197A1",
        "US7149590B2",
        "US20060287741A1",
        "US20070032907A1",
        "WO2007024847A2",
        "US20070078529A1",
        "US20070168057A1",
        "US20080052050A1",
        "US20080065242A1",
        "US20080065241A1",
        "WO2008047098A1",
        "US20080188957A1",
        "US20090054998A1",
        "US20090287320A1",
        "US20100036866A1",
        "US20100036702A1",
        "US20100042367A1",
        "US20100087933A1",
        "US20100131250A1",
        "US20110144772A1",
        "US20130310953A1",
        "EP2868731A1",
        "US9235657B1",
        "US9436179B1",
        "US9852481B1",
        "US10101731B2",
        "CN108681244A",
        "DE10341764B4",
        "CN109224815A",
        "US10186889B2",
        "US10190793B2",
        "US10190789B2",
        "US10197632B2",
        "US10222427B2",
        "US10250039B2",
        "US10283968B2",
        "CN109828459A",
        "KR20190082755A",
        "US10389136B2",
        "US10418832B2",
        "US10418833B2",
        "US10554170B2",
        "US10564610B2",
        "US10594153B2",
        "US10700541B2",
        "EP3683634A1",
        "US10742055B2",
        "US10778012B2",
        "US10838441B2",
        "US10838440B2",
        "US11159022B2",
        "US11163271B2",
        "US11210617B2",
        "US11249446B2"
    ],
    "citedby_ftf": []
}