{
    "patent_id": "US-11693092-B2",
    "title": "Gesture recognition using multiple antenna ",
    "assignee": "Google Llc",
    "publication_date": "2023-07-04",
    "patent_link": "https://patents.google.com/patent/US11693092B2/en",
    "inventors": [
        "Jaime Lien",
        "Nicholas Edward Gillian",
        "Ivan Poupyrev"
    ],
    "classifications": [
        "G01S7/415",
        "A63F13/21",
        "A63F13/24",
        "G01S13/56",
        "G01S13/66",
        "G01S13/86",
        "G01S13/867",
        "G01S13/88",
        "G01S13/888",
        "G01S13/90",
        "G01S13/904",
        "G01S7/4004",
        "G01S7/41",
        "G01S7/412",
        "G06F16/245",
        "G06F18/217",
        "G06F18/25",
        "G06F18/253",
        "G06F18/28",
        "G06F18/41",
        "G06F21/32",
        "G06F21/6245",
        "G06F3/011",
        "G06F3/017",
        "G06F3/04815",
        "G06N20/00",
        "G06V10/806",
        "G06V20/64",
        "G06V40/28",
        "H04Q9/00",
        "H04W16/28",
        "H04W4/80",
        "A63F2300/8082",
        "G01S13/865",
        "G01S13/931",
        "G01S19/42",
        "G01S2013/9322",
        "G06F1/163",
        "G06F2203/0384",
        "G06F2221/2105",
        "G06F3/0346",
        "G06F3/0484",
        "G06F3/165",
        "G06T7/75",
        "G08C17/02",
        "G08C2201/93",
        "H04Q2209/883"
    ],
    "abstract": "Various embodiments wirelessly detect micro gestures using multiple antenna of a gesture sensor device. At times, the gesture sensor device transmits multiple outgoing radio frequency (RF) signals, each outgoing RF signal transmitted via a respective antenna of the gesture sensor device. The outgoing RF signals are configured to help capture information that can be used to identify micro-gestures performed by a hand. The gesture sensor device captures incoming RF signals generated by the outgoing RF signals reflecting off of the hand, and then analyzes the incoming RF signals to identify the micro-gesture.",
    "claims": "\n1. A method comprising:\nreceiving, by a computing device, a plurality of incoming radio frequency (RF) signals generated by at least one outgoing RF signal reflecting off two or more portions of a user;\nprocessing, by the computing device, a set of data originating from the incoming RF signals to extract information about movements of each of the portions of the user;\ndetermining, by the computing device and based on the information about the movements of each of the portions of the user, a relative movement between the portions of the user; and\nprocessing, by the computing device, the relative movement between the portions of the user to identify a gesture performed by at least one of the portions of the user.\n2. The method of claim 1, wherein:\nthe set of data comprises raw data; and\nthe processing the set of data comprises applying at least one beamforming technique on the raw data.\n3. The method of claim 1, further comprising:\ngenerating, by the computing device, raw data corresponding to the incoming RF signals; and\ntransforming, by the computing device, the raw data into at least one transformation,\nwherein:\nthe transformation comprises one or more of:\nan I/Q transformation that yields one or more complex vectors containing phase and amplitude information,\na beamforming transformation that yields a spatial representation of the portions of the user,\na range-Doppler transformation that yields velocity and direction information about the portions of the user,\na range profile transformation that yields recognition information about the portions of the user,\na micro-Doppler transformation that yields high-resolution recognition information about the portions of the user, or\na spectrogram transformation that represents corresponding frequencies of the incoming RF signals; and\nthe set of data comprises the transformation.\n4. The method of claim 1, wherein the processing the set of data comprises first processing the set of data at a coarser resolution and subsequently processing the set of data at a finer resolution.\n5. The method of claim 1, wherein the set of data includes Doppler information about each of the portions of the user over time.\n6. The method of claim 1, wherein the set of data further includes information about millimeter-scale movement of the portions of the user.\n7. The method of claim 6, wherein the set of data further includes information about millimeter-scale movement of the portions of the user.\n8. The method of claim 1, wherein the portions of the user comprise respective fingers of a hand of the user.\n9. The method of claim 8, wherein the gesture comprises the hand of the user forming a certain shape.\n10. The method of claim 9, wherein the gesture further comprises one or more fingers in a certain orientation relative to other parts of the hand of the user.\n11. A device configured to identify a relative-movement gesture performed by a target object, the device comprising:\na processor; and\na computer-readable media comprising instructions that, when executed by the processor, cause the device to:\nreceive a plurality of incoming radio frequency (RF) signals generated by at least one outgoing RF signal reflecting off the target object;\ngenerate signal data corresponding to the incoming RF signals;\ndetermine, based on the signal data, that the target object has performed the relative-movement gesture, the relative-movement gesture comprising a portion of the target object moving relative to another portion of the target object; and\noutput an indication of the relative-movement gesture.\n12. The device of claim 11, wherein the device comprises a smartphone.\n13. The device of claim 11, wherein the instructions further cause the device to transmit the at least one outgoing RF signal using one or more of: time diversity, frequency diversity, or spatial diversity.\n14. The device of claim 11, wherein:\nthe instructions further cause the processor to receive a plurality of other incoming RF signals generated by one or more other outgoing RF signals reflecting off the target object at respective previous times;\nthe generation of the signal data comprises generating signal data for the incoming RF signals and other signal data for the other incoming RF signals; and\nthe determination that the target object has performed the relative-movement gesture is based further on the other signal data.\n15. The device of claim 11, further comprising a plurality of receive antennas, wherein:\nthe receipt of the incoming RF signals comprises receiving the incoming RF signals via respective ones of the receive antennas; and\nthe generation of the signal data comprises applying at least one beamforming technique on the incoming RF signals.\n16. The device of claim 11, wherein the determination that the target object has performed the relative-movement gesture is based further on millimeter-scale movement of portions of the target object.\n17. The device of claim 16, wherein the determination that the target object has performed the relative-movement gesture is based further on determining that the millimeter-scale movement of the portions of the target object corresponds to a transformation of the target object into a physical configuration or shape.\n18. The device of claim 11, wherein the target object is a hand.\n19. The device of claim 18, wherein the relative-movement gesture comprises one or more fingers of the hand moving, or in a certain orientation, relative to other parts of the hand.\n20. The device of claim 18, wherein the relative-movement gesture comprises a finger of the hand forming a shape.\n21. A device configured to identify a relative-movement gesture performed by a target object, the device comprising:\na processor; and\na computer-readable media comprising instructions that, when executed by the processor, cause the device to:\nreceive a plurality of incoming radio frequency (RF) signals generated by at least one outgoing RF signal reflecting off the target object;\ngenerate signal data corresponding to the incoming RF signals;\ndetermine, based on the signal data and using at least one machine-learning algorithm, that the target object has performed the relative-movement gesture, the relative-movement gesture comprising a portion of the target object moving relative to another portion of the target object; and\noutput an indication of the relative-movement gesture.\n22. The device of claim 21, wherein the machine-learning algorithm is trained using other signal data corresponding to other instances of the relative-movement gesture.\n23. The device of claim 21, wherein the machine-learning algorithm comprises one or more of a Random Forrest algorithm, a deep learning algorithm, an artificial neural network algorithm, a convolutional neural net algorithm, a clustering algorithm, or a Bayesian algorithm.\n24. The device of claim 21, wherein:\nthe signal data comprises raw data;\nthe instructions further cause the device to transform, using at least one other machine-learning algorithm, the signal data into a different representation; and\nthe determination that the target object has performed the relative-movement gesture is based further on the different representation.\n25. The device of claim 21, wherein:\nthe target object is a hand; and\nthe relative-movement gesture further comprises one or more fingers of the hand moving relative to other parts of the hand.\n26. The device of claim 21, wherein:\nthe signal data comprises raw data;\nthe instructions further cause the device to transform the signal data into a different representation;\nthe different representation comprises one or more of:\nan I/Q transformation that yields one or more complex vectors containing phase and amplitude information,\na beamforming transformation that yields a spatial representation of the target object,\na range-Doppler transformation that yields velocity and direction information about the target object,\na range profile transformation that yields recognition information about the target object,\na micro-Doppler transformation that yields high-resolution recognition information about the target object, or\na spectrogram transformation that represents corresponding frequencies of the incoming RF signals; and\nthe determination that the target object has performed the relative-movement gesture comprises inputting the different representation into the at least one machine-learning algorithm.\n27. The device of claim 21, wherein the relative-movement gesture is three-dimensional.\n28. The device of claim 21, wherein the determination that the target object has performed the relative-movement gesture comprises:\ndetermining, using a first stage, a classification of the target object; and\ndetermining, using a second stage, that the target object has performed the relative-movement gesture.\n29. The device of claim 28, wherein the second stage is based on the classification of the target object.\n30. The device of claim 28, wherein the classification of the target object comprises a classification of the target object as a certain body part.\n31. A device configured to identify a relative-movement gesture performed by a target object, the device comprising:\nat least one transmit antenna;\na plurality of receive antennas;\na processor; and\na computer-readable media comprising instructions that, when executed by the processor, cause the device to:\nreceive a plurality of incoming radio frequency (RF) signals generated by at least one outgoing RF signal reflecting off the target object, each of the incoming RF signals received by one of the receive antennas;\ngenerate signal data corresponding to the incoming RF signals;\ndetermine, based on the signal data, that the target object has performed the relative-movement gesture, the relative-movement gesture comprising a first portion of the target object moving relative to a second portion of the target object; and\noutput an indication of the relative-movement gesture.\n32. The device of claim 31, wherein the receive antennas are spatially distributed to support triangulation between the device and the first and second portions of the target object.\n33. The device of claim 31, wherein:\nthe instructions further cause the device to determine a spatial profile of the target object; and\nthe determination that the target object has performed the relative-movement gesture is based further on the spatial profile of the target object.\n34. The device of claim 33, wherein the at least one transmit antenna comprises a plurality of transmit antennas.\n35. The device of claim 34, wherein the instructions further cause the device to transmit the at least one outgoing RF signal using constructive or destructive interference.\n36. The device of claim 31, wherein:\nthe signal data comprises raw data;\nthe instructions further cause the device to transform the signal data into a different representation;\nthe different representation comprises one or more of:\nan I/Q transformation that yields one or more complex vectors containing phase and amplitude information,\na beamforming transformation that yields a spatial representation of the target object,\na range-Doppler transformation that yields velocity and direction information about the target object,\na range profile transformation that yields recognition information about the target object,\na micro-Doppler transformation that yields high-resolution recognition information about the target object, or\na spectrogram transformation that represents corresponding frequencies of the incoming RF signals; and\nthe determination that the target object has performed the relative-movement gesture is based further on the different representation.\n37. The device of claim 36, wherein the relative-movement gesture comprises a swipe or tap gesture.\n38. The device of claim 31, wherein the signal data comprises respective signal data for the first and second portions of the target object.\n39. The device of claim 38, wherein the signal data comprises movement information corresponding to the first and second portions of the target object.\n40. The device of claim 39, wherein:\nthe target object is a hand;\nthe first and second portions of the target object are respective fingers of the hand; and\nthe relative-movement gesture comprises a movement between the fingers of the hand.",
    "status": "Active",
    "citations_own": [
        "US3570312A",
        "US3610874A",
        "US3752017A",
        "US3953706A",
        "US4104012A",
        "GB2070469A",
        "US4321930A",
        "EP0161895A2",
        "US4654967A",
        "US4700044A",
        "US4838797A",
        "WO1990001895A1",
        "US5016500A",
        "US5024533A",
        "US5121124A",
        "US5298715A",
        "US5309916A",
        "US5341979A",
        "US5410471A",
        "US5564571A",
        "US5656798A",
        "US5724707A",
        "US5798798A",
        "JPH11168268A",
        "JPH11237477A",
        "US6032450A",
        "US6037893A",
        "US6080690A",
        "US6101431A",
        "US6129673A",
        "US6179785B1",
        "WO2001027855A2",
        "WO2001030123A1",
        "CN1299501A",
        "US6254544B1",
        "JP2001208828A",
        "DE10011263A1",
        "WO2001075778A1",
        "US6303924B1",
        "US20010030624A1",
        "US20010035836A1",
        "US6313825B1",
        "US6340979B1",
        "US20020009972A1",
        "US6380882B1",
        "US6386757B1",
        "US20020080156A1",
        "US6440593B2",
        "WO2002082999A1",
        "US20020170897A1",
        "US6492980B2",
        "US20030005030A1",
        "JP2003500759A",
        "US6513970B1",
        "US6513833B2",
        "US20030036685A1",
        "US6524239B1",
        "US6543668B1",
        "US20030071750A1",
        "US20030093000A1",
        "US20030100228A1",
        "US20030122677A1",
        "JP2003280049A",
        "CN1462382A",
        "US20040008137A1",
        "WO2004004557A1",
        "US20040009729A1",
        "US20040046736A1",
        "US6711354B2",
        "US6717065B2",
        "US20040102693A1",
        "WO2004053601A2",
        "US20040157662A1",
        "US6802720B2",
        "US6805672B2",
        "US20040249250A1",
        "US6833807B2",
        "US20040259391A1",
        "US6835898B2",
        "US6854985B1",
        "US20050069695A1",
        "US20050128124A1",
        "US20050148876A1",
        "US6929484B2",
        "JP2005231450A",
        "US20050195330A1",
        "US20050231419A1",
        "WO2005103863A2",
        "US6970128B1",
        "US20050267366A1",
        "US6997882B1",
        "US20060035554A1",
        "US20060040739A1",
        "US20060047386A1",
        "US20060061504A1",
        "US7019682B1",
        "JP2006514382A",
        "US20060125803A1",
        "US20060136997A1",
        "JP2006163886A",
        "US20060139314A1",
        "US20060139162A1",
        "US20060148351A1",
        "US20060157734A1",
        "US20060166620A1",
        "US20060170584A1",
        "US20060183980A1",
        "JP2006234716A",
        "US20060209021A1",
        "US20060244654A1",
        "US7134879B2",
        "CN1862601A",
        "US20060258205A1",
        "US20060284757A1",
        "US7158076B2",
        "US7164820B2",
        "JP2007011873A",
        "US20070027369A1",
        "US20070024488A1",
        "US20070024946A1",
        "US20070026695A1",
        "US20070030195A1",
        "US7194371B1",
        "US7205932B2",
        "US7209775B2",
        "EP1785744A1",
        "US20070118043A1",
        "US7223105B2",
        "US20070161921A1",
        "US7249954B2",
        "US20070176821A1",
        "EP1815788A1",
        "US20070192647A1",
        "US20070197115A1",
        "US20070197878A1",
        "US20070210074A1",
        "JP2007266772A",
        "US20070237423A1",
        "WO2007125298A1",
        "US7299964B2",
        "US20070276632A1",
        "US20070276262A1",
        "US7310236B2",
        "JP2007333385A",
        "US20080001735A1",
        "US20080002027A1",
        "US20080015422A1",
        "US20080024438A1",
        "US20080039731A1",
        "US20080059578A1",
        "US20080065291A1",
        "US7348285B2",
        "US20080074307A1",
        "GB2443208A",
        "US20080122796A1",
        "US20080134102A1",
        "US20080136775A1",
        "US20080168396A1",
        "US20080168403A1",
        "US20080194204A1",
        "US20080194975A1",
        "US7421061B2",
        "US20080211766A1",
        "US20080233822A1",
        "US20080278450A1",
        "US20080282665A1",
        "KR20080102516A",
        "JP2008293501A",
        "US20080303800A1",
        "US20080320419A1",
        "US20080316085A1",
        "US20090002220A1",
        "US20090018408A1",
        "US20090018428A1",
        "CN101349943A",
        "US20090033585A1",
        "JP2009037434A",
        "US20090053950A1",
        "US20090056300A1",
        "US20090058820A1",
        "WO2009032073A1",
        "US20090113298A1",
        "US7528082B2",
        "US20090118648A1",
        "US20090115617A1",
        "US7544627B2",
        "US20090177068A1",
        "WO2009083467A1",
        "US20090203244A1",
        "US7578195B2",
        "US20090226043A1",
        "US20090253585A1",
        "US20090270690A1",
        "US20090278915A1",
        "US20090288762A1",
        "US20090292468A1",
        "US20090295712A1",
        "US20090299197A1",
        "WO2009148064A1",
        "US20090303100A1",
        "US20090319181A1",
        "US20100002912A1",
        "US7644488B2",
        "US7647093B2",
        "US20100013676A1",
        "CN101636711A",
        "US20100045513A1",
        "US20100050133A1",
        "US7670144B2",
        "US20100053151A1",
        "JP2010049583A",
        "JP2010048583A",
        "US20100060570A1",
        "US7677729B2",
        "US20100065320A1",
        "US20100069730A1",
        "US20100071205A1",
        "WO2010032173A1",
        "US7691067B2",
        "US7698154B2",
        "US20100094141A1",
        "EP2177017A1",
        "US20100107099A1",
        "US20100109938A1",
        "US20100152600A1",
        "CN101751126A",
        "US7750841B2",
        "US20100179820A1",
        "US20100198067A1",
        "US20100204550A1",
        "US20100201586A1",
        "US20100205667A1",
        "US20100208035A1",
        "US7791700B2",
        "US20100225562A1",
        "US20100234094A1",
        "US20100241009A1",
        "US20100281438A1",
        "US7834276B2",
        "US20100292549A1",
        "US20100306713A1",
        "CN101910781A",
        "US20100313414A1",
        "US20100324384A1",
        "US20100325770A1",
        "JP2011003202A",
        "US20110003664A1",
        "US20110010014A1",
        "US20110018795A1",
        "US20110029038A1",
        "US20110073353A1",
        "US20110083111A1",
        "US20110093820A1",
        "JP2011086114A",
        "US20110119640A1",
        "US20110118564A1",
        "US7952512B1",
        "US20110166940A1",
        "US20110181509A1",
        "US20110181510A1",
        "US20110193939A1",
        "US20110197263A1",
        "US7999722B2",
        "US20110202404A1",
        "US20110213218A1",
        "CN102184020A",
        "US20110221666A1",
        "US20110239118A1",
        "US20110234492A1",
        "US20110242305A1",
        "US20110245688A1",
        "US20110279303A1",
        "US8062220B2",
        "US8063815B2",
        "US20110286585A1",
        "US20110307842A1",
        "JP2011253241A",
        "US20110303341A1",
        "US20110318985A1",
        "US20110316888A1",
        "US20120001875A1",
        "US20120013571A1",
        "JP2012018583A",
        "US20120019168A1",
        "US20120029369A1",
        "EP2417908A1",
        "US20120047468A1",
        "WO2012026013A1",
        "US20120069043A1",
        "US20120068876A1",
        "US20120075958A1",
        "JP2012068854A",
        "US20120092284A1",
        "US8169404B1",
        "US20120105358A1",
        "US8179604B1",
        "US20120123232A1",
        "WO2012064847A1",
        "US20120127082A1",
        "US8193929B1",
        "US20120150493A1",
        "US20120144934A1",
        "US20120146950A1",
        "US20120156926A1",
        "US20120154313A1",
        "US20120174299A1",
        "US20120182222A1",
        "US20120191223A1",
        "US20120193801A1",
        "US20120200600A1",
        "US20120220835A1",
        "CN102660988A",
        "JP2012185833A",
        "US20120243374A1",
        "US20120254810A1",
        "US20120248093A1",
        "US8282232B2",
        "US8289185B2",
        "US20120268416A1",
        "JP2012208714A",
        "US20120268310A1",
        "US20120270564A1",
        "US8301232B2",
        "US20120276849A1",
        "US20120280900A1",
        "WO2012152476A1",
        "US20120298748A1",
        "US8326313B2",
        "US20120310665A1",
        "CN102819315A",
        "US8334226B2",
        "US8344949B2",
        "US20130016070A1",
        "CN102893327A",
        "JP2013016060A",
        "US20130027218A1",
        "US8367942B2",
        "US20130035563A1",
        "US8374668B1",
        "CN106342197B",
        "JP2013037674A",
        "US20130046544A1",
        "US20130053653A1",
        "US20130076788A1",
        "US20130079649A1",
        "US20130076649A1",
        "US20130078624A1",
        "US20130082922A1",
        "US20130083173A1",
        "CN202887794U",
        "US20130096439A1",
        "US20130102217A1",
        "US20130104084A1",
        "CN103076911A",
        "US20130106710A1",
        "CN103091667A",
        "US20130113830A1",
        "US20130117377A1",
        "US20130113647A1",
        "US20130132931A1",
        "US20130150735A1",
        "WO2013082806A1",
        "US20130147833A1",
        "WO2013084108A1",
        "US20130154919A1",
        "US20130161078A1",
        "US8475367B1",
        "US20130169471A1",
        "US20130176161A1",
        "US20130176258A1",
        "US20130195330A1",
        "US20130194173A1",
        "US20130196716A1",
        "US8505474B2",
        "US8509882B2",
        "US20130207962A1",
        "US8514221B2",
        "US20130222232A1",
        "US8527146B1",
        "US20130229508A1",
        "US20130245986A1",
        "US20130241765A1",
        "WO2013137412A1",
        "US20130253029A1",
        "US20130249793A1",
        "JP2013196047A",
        "US20130263029A1",
        "US20130260630A1",
        "US8549829B2",
        "US8560972B2",
        "WO2013154864A1",
        "US8562526B2",
        "CN103355860A",
        "US20130281024A1",
        "US20130278499A1",
        "US20130278501A1",
        "US20130283203A1",
        "US8569189B2",
        "US8576110B2",
        "US20130310700A1",
        "US20130322729A1",
        "US20130332438A1",
        "KR20130137005A",
        "WO2013186696A1",
        "US8614689B2",
        "US20130345569A1",
        "WO2013192166A1",
        "WO2013191657A1",
        "US20140005809A1",
        "CN103534664A",
        "US20140022108A1",
        "US20140028539A1",
        "US20140035737A1",
        "WO2014019085A1",
        "JP2014503873A",
        "US8655004B2",
        "US20140051941A1",
        "US20140049487A1",
        "US20140050354A1",
        "WO2014032984A1",
        "KR20140027837A",
        "US20140070957A1",
        "US20140073486A1",
        "US20140072190A1",
        "US20140073969A1",
        "US20140081100A1",
        "CN103675868A",
        "US20140095480A1",
        "US20140097979A1",
        "US8700137B2",
        "US20140121540A1",
        "KR20140053988A",
        "KR20140055985A",
        "US20140135631A1",
        "US20140139430A1",
        "US20140139616A1",
        "US20140143678A1",
        "US20140139422A1",
        "US20140149859A1",
        "US8758020B2",
        "US8759713B2",
        "US20140181509A1",
        "TW201425974A",
        "US8764651B2",
        "CN103907405A",
        "US20140188989A1",
        "US20140184499A1",
        "US20140184496A1",
        "US20140191939A1",
        "US20140200416A1",
        "US20140201690A1",
        "US8785778B2",
        "US20140208275A1",
        "US20140203080A1",
        "US8790257B2",
        "WO2014116968A1",
        "US20140215389A1",
        "DE102013201359A1",
        "WO2014124520A1",
        "US8814574B2",
        "US8819812B1",
        "EP2770408A2",
        "US20140239065A1",
        "US20140244277A1",
        "US20140250515A1",
        "US20140246415A1",
        "US20140247212A1",
        "CN104035552A",
        "US20140253709A1",
        "US20140253431A1",
        "WO2014138280A1",
        "US20140275854A1",
        "US20140281975A1",
        "US20140276104A1",
        "US20140265642A1",
        "US20140262478A1",
        "US20140282877A1",
        "US20140270698A1",
        "US20140280295A1",
        "US20140298266A1",
        "WO2014160893A2",
        "US20140297006A1",
        "US8854433B1",
        "WO2014165476A1",
        "US20140300506A1",
        "US20140309855A1",
        "US20140306936A1",
        "US20140316261A1",
        "US20140318699A1",
        "US20140329567A1",
        "US20140333467A1",
        "US20140343392A1",
        "US20140347295A1",
        "JP2014532332A",
        "KR20140138779A",
        "US20140357369A1",
        "US20140368378A1",
        "US20140368441A1",
        "WO2014204323A1",
        "US20140376788A1",
        "US8921473B1",
        "US20150002391A1",
        "US8926509B2",
        "KR20150002718A",
        "US20150009096A1",
        "US20150026815A1",
        "US20150030256A1",
        "US20150029050A1",
        "US8948839B1",
        "US20150040040A1",
        "WO2015018675A1",
        "US20150046183A1",
        "WO2015017931A1",
        "WO2015022671A1",
        "JP2015507263A",
        "US20150062033A1",
        "US20150068069A1",
        "US20150077345A1",
        "US20150077282A1",
        "US20150085060A1",
        "US20150084855A1",
        "US20150091820A1",
        "US20150095987A1",
        "US20150091903A1",
        "US20150091859A1",
        "US20150100328A1",
        "US20150099941A1",
        "US20150106770A1",
        "US20150112606A1",
        "US20150109164A1",
        "US20150133017A1",
        "US20150145805A1",
        "US20150162729A1",
        "US9055879B2",
        "US20150177866A1",
        "US20150177374A1",
        "US20150185314A1",
        "WO2015099796A1",
        "US9075429B1",
        "US20150199045A1",
        "US20150204973A1",
        "US20150205358A1",
        "US9093289B2",
        "CN104838336A",
        "US20150229885A1",
        "US20150226004A1",
        "US20150223733A1",
        "FR3017722A1",
        "US20150256763A1",
        "US20150261320A1",
        "US20150257653A1",
        "US9141194B1",
        "US20150268027A1",
        "US9148949B2",
        "EP2923642A1",
        "US20150277569A1",
        "US20150280102A1",
        "US20150287187A1",
        "US20150285906A1",
        "US20150297105A1",
        "US20150301167A1",
        "US20150312041A1",
        "US20150314780A1",
        "US20150317518A1",
        "US20150323993A1",
        "US20150332075A1",
        "US20150341550A1",
        "US20150346820A1",
        "US20150346701A1",
        "US20150350902A1",
        "US20150351703A1",
        "US20150370250A1",
        "US9223494B1",
        "US20150375339A1",
        "US9230160B1",
        "US9229102B1",
        "US20160011668A1",
        "US20160018948A1",
        "US20160026253A1",
        "US20160026768A1",
        "US20160041618A1",
        "US20160038083A1",
        "US20160041617A1",
        "US20160042169A1",
        "US20160048235A1",
        "US20160048672A1",
        "US20160048236A1",
        "US20160045706A1",
        "US20160055201A1",
        "US20160054792A1",
        "US20160054803A1",
        "US20160075016A1",
        "US20160075015A1",
        "US20160077202A1",
        "US20160085296A1",
        "US20160090839A1",
        "US20160089042A1",
        "US20160100166A1",
        "US20160098089A1",
        "WO2016053624A1",
        "US20160096270A1",
        "US20160103500A1",
        "US20160106328A1",
        "US9331422B2",
        "US20160124579A1",
        "US20160131741A1",
        "US20160140872A1",
        "US9346167B2",
        "US20160146931A1",
        "US20160145776A1",
        "US9354709B1",
        "US20160171293A1",
        "US20160170491A1",
        "US20160206244A1",
        "US20160213331A1",
        "US20160216825A1",
        "US20160220152A1",
        "US9412273B2",
        "US20160234365A1",
        "US20160238696A1",
        "US20160252607A1",
        "US20160253044A1",
        "US20160249698A1",
        "US20160252965A1",
        "US20160259037A1",
        "US20160262685A1",
        "US20160282988A1",
        "WO2016154568A1",
        "US20160284436A1",
        "US20160287172A1",
        "US20160291143A1",
        "US20160299526A1",
        "US20160306034A1",
        "WO2016176606A1",
        "US20160321428A1",
        "US20160320853A1",
        "US20160320852A1",
        "WO2016178797A1",
        "CN106154270A",
        "US20160338599A1",
        "US9508141B2",
        "US20160349790A1",
        "US20160349845A1",
        "US20160345638A1",
        "US9511877B2",
        "US9524597B2",
        "US20160377712A1",
        "US20170013417A1",
        "US20170011210A1",
        "WO2017019299A1",
        "US20170029985A1",
        "US9569001B2",
        "US20170052618A1",
        "US9582933B1",
        "US20170060298A1",
        "US9594443B2",
        "US20170075481A1",
        "US20170097413A1",
        "US20170097684A1",
        "US20170125940A1",
        "US20170124407A1",
        "US20170131395A1",
        "US20170164904A1",
        "US20170168630A1",
        "US9699663B1",
        "US20170192629A1",
        "US20170196513A1",
        "US9729986B2",
        "US20170231089A1",
        "US20170224280A1",
        "US20170233903A1",
        "US20170258366A1",
        "US9766742B2",
        "US9807619B2",
        "US20170325337A1",
        "US20170322633A1",
        "US20170329412A1",
        "US20170329425A1",
        "US20170325518A1",
        "WO2017200571A1",
        "US20180005766A1",
        "US9870056B1",
        "US9947080B2",
        "US20180106897A1",
        "US20180113032A1",
        "US9958541B2",
        "US20180157330A1",
        "US9994233B2",
        "US20180160943A1",
        "US20180177464A1",
        "US10016162B1",
        "US10027923B1",
        "US10034630B2",
        "US10063427B1",
        "US10073590B2",
        "US10088908B1",
        "US10203405B2",
        "US10304567B2",
        "US10376195B1",
        "US20200064471A1",
        "US20200326708A1",
        "US10931934B2",
        "JP2021085256A"
    ],
    "citations_ftf": [
        "US5468917A",
        "JP3829220B2",
        "JP2982792B2",
        "CN1299501C",
        "JP2005103863A",
        "WO2005033387A2",
        "WO2008061385A2",
        "US20110057164A1",
        "JP5668966B2",
        "JP5726446B2",
        "JP5889539B2",
        "US20130147933A1",
        "JP5915414B2",
        "KR101387190B1",
        "KR20160004073A"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "EP2678709B1",
        "CN104756148B",
        "JP6273662B2",
        "US9575560B2",
        "US9921660B2",
        "US9811164B2",
        "US9588625B2",
        "US10268321B2",
        "US11169988B2",
        "US9778749B2",
        "US9600080B2",
        "DE102015201317A1",
        "US10016162B1",
        "US9983747B2",
        "KR102002112B1",
        "KR102327044B1",
        "US10139916B2",
        "US9693592B2",
        "US10088908B1",
        "US10817065B1",
        "WO2017079484A1",
        "CN105938399B",
        "US10492302B2",
        "US11003345B2",
        "US10175781B2",
        "US10285456B2",
        "EP3267220A1",
        "US11067667B2",
        "US10934764B2",
        "US10572024B1",
        "US11380118B2",
        "US10579150B2",
        "US10466772B2",
        "US11243293B2",
        "US11435739B2",
        "US11048407B1",
        "DE102018202343A1",
        "EP3589973A1",
        "US10684693B2",
        "WO2018165485A1",
        "JP6828807B2",
        "US20200341114A1",
        "US10551935B2",
        "US10914834B2",
        "US10782390B2",
        "US10795009B2",
        "US10754005B2",
        "US20210103031A1",
        "EP3431002B1",
        "US11030289B2",
        "EP3661815A4",
        "US11079289B2",
        "EP3673385A4",
        "EP3454079B1",
        "US10677905B2",
        "CN107895139B",
        "US10641888B2",
        "US10474934B1",
        "US10725161B2",
        "US10935651B2",
        "JP6870607B2",
        "US10423964B2",
        "US11167771B2",
        "US10969479B2",
        "US11140813B1",
        "KR102116604B1",
        "CN110113468B",
        "US20190244062A1",
        "US10432779B2",
        "US11550046B2",
        "US11169251B2",
        "WO2019195327A1",
        "US11465557B2",
        "EP3553551B1",
        "EP3553552B1",
        "EP3553559B1",
        "US10713343B2",
        "US11391817B2",
        "US10772511B2",
        "US10802133B2",
        "KR102511292B1",
        "GB2576213A",
        "US10794997B2",
        "US10770035B2",
        "US10890653B2",
        "US10698603B2",
        "US20200082014A1",
        "IT201800009299A1",
        "US10536156B1",
        "US10788880B2",
        "WO2020086648A1",
        "EP3647910A1",
        "US10761611B2",
        "US11406892B2",
        "US11310226B2",
        "US11327155B2",
        "US11748903B2",
        "KR102140045B1",
        "CN111507361A",
        "US11226406B1",
        "US11626010B2",
        "CN110018470A",
        "US11555915B2",
        "US20220146662A1",
        "US11017209B2",
        "US11550031B2",
        "US10643420B1",
        "US11734401B1",
        "KR102021531B1",
        "US20220163380A1",
        "EP3719532B1",
        "US11715228B2",
        "US20220026986A1",
        "CN110034375A",
        "US11442550B2",
        "CN113614676A",
        "JP7163513B2",
        "WO2020263250A1",
        "GB2585074A",
        "KR20210002989A",
        "EP3770632A1",
        "WO2021013356A1",
        "CN113906367A",
        "CN113853566A",
        "US11385722B2",
        "EP3966662A1",
        "WO2021021219A1",
        "WO2021021224A1",
        "US20210042545A1",
        "KR102119346B1",
        "WO2021040748A1",
        "US11467672B2",
        "WO2021040742A1",
        "WO2021040745A1",
        "CN110597390B",
        "CN110609282B",
        "DE102019125348A1",
        "KR20210034843A",
        "CN112666572A",
        "CN110515092B",
        "KR20210048725A",
        "US11747462B1",
        "KR20210074749A",
        "EP4078212A1",
        "CN113138557A",
        "US11567580B2",
        "US11467254B2",
        "US11734767B1",
        "CN113495267A",
        "CN111427036A",
        "US11676343B1",
        "CN111624572B",
        "IL275524B",
        "US11605228B2",
        "CN111813224B",
        "US11563783B2",
        "US11555920B2",
        "US20230252308A1",
        "CN114488153A",
        "US11782149B2",
        "CA3209555A1",
        "KR102351551B1",
        "US11592908B2",
        "EP4060366A1",
        "US11543890B2",
        "US11804077B2",
        "EP4071586A1",
        "US11467675B1",
        "CN115412837A",
        "CN115412104A",
        "CN113561911B",
        "US20230135704A1",
        "US20230136270A1",
        "US20230176243A1",
        "CN116414045A",
        "GB202204096D0",
        "US20230333660A1",
        "CN115378591B"
    ]
}