{
    "patent_id": "US-11403715-B2",
    "title": "Method and system for providing domain-specific and dynamic type ahead suggestions for search query terms ",
    "assignee": "Intuit Inc.",
    "publication_date": "2022-08-02",
    "patent_link": "https://patents.google.com/patent/US11403715B2/en",
    "inventors": [
        "Igor A. Podgorny",
        "Benjamin Indyk",
        "Todd Frey Goodyear"
    ],
    "classifications": [
        "G06Q40/123",
        "G06F16/3322",
        "G06F16/90324",
        "G06N7/005",
        "G06N7/01"
    ],
    "abstract": "Disclosed methods and systems provide domain-specific type ahead suggestions for search query terms with a customer self-service system for a tax return preparation system, according to one embodiment. Type ahead suggestions include suggestions for completing a single search query term and/or suggestions for completing a search query having multiple search query terms. The customer self-service system receives one or more search query terms in a search text box, searches for potential search queries that are likely to complete the one or more search query terms, and provides a selected one of the potential search queries in the search text box as a type ahead suggestion, adjacent to the received one or more search query terms, according to one embodiment. The customer self-service system selects one of the potential search queries based on the received search query terms, the user's profile, and/or the user's tax data, according to one embodiment.",
    "claims": "\n1. A method for providing domain-specific and dynamic type-ahead suggestions for search query terms, the method performed by one or more processors of a computing system associated with a customer self-service system and comprising:\nstoring a plurality of potential search queries in a memory associated with the computing system, each of the plurality of potential search queries including one or more search terms;\npresenting user experience data and a search text box on a display screen viewable by a user;\nreceiving, via the search text box presented on the display screen, one or more search query terms of a search query provided by the user;\nidentifying a number of topics in each of the one or more search query terms provided by the user;\ndetermining one or more topic relevance scores for each of the potential search queries using a predictive topic model, each topic relevance score indicating a relevance of the corresponding potential search query to a respective one of the topics identified in the received search query terms;\nranking the plurality of potential search queries based on their respective topic relevance scores;\nidentifying which potential search query of the plurality of potential search queries has a highest topic relevance score; and\npresenting the identified potential search query as a type-ahead suggestion on the display screen adjacent to the one or more search query terms provided in the search text box, the presented type-ahead suggestion configured to assist the user by completing the search query.\n2. The method of claim 1, further comprising:\nstoring a user profile for each of a plurality of users associated with the customer self-service system;\ndetermining a level of relevance of each of the plurality of potential search queries to each user profile; and\ndetermining, for each of the plurality of potential search queries, a probability score for each user profile based on the determined relevance levels.\n3. The method of claim 2, wherein the determination of the topic relevance scores is further based on the probability scores determined for the user's profile.\n4. The method of claim 2, wherein the user profile includes one or more of a search history of a respective user, an income of the respective user, a zip code of the respective user, or tax exemptions of the respective user.\n5. The method of claim 1, further comprising:\ntraining the predictive topic model using one of logistical regression, a decision tree, an artificial neural network, a support vector machine, a naive Bayes operation, a linear discriminant analysis, or a k-nearest neighbor algorithm.\n6. The method of claim 1, wherein determining the topic relevance scores further comprises applying the one or more received search query terms to a Latent Dirichlet Allocation algorithm.\n7. The method of claim 1, wherein the predictive topic model is configured to identify the topics in each of the one or more search query terms based at least in part on a number of topics associated with each of the plurality of potential search queries.\n8. The method of claim 1, wherein the predictive topic model includes one or more of a Latent Dirichlet Allocation algorithm, a Latent Semantic Indexing (“LSI”) algorithm, a query clustering algorithm, or a query de-duplication algorithm.\n9. The method of claim 1, further comprising:\nreceiving one or more additional search query terms from the user via the search text box; and\ndynamically updating the type-ahead suggestion presented on the display screen based on the one or more additional search query terms.\n10. The method of claim 1, wherein the customer self-service system is associated with an electronic tax return preparation system, the method further comprising:\ndetermining a type of question associated with the one or more search query terms received from the user, the determined type of question comprising one or both of a tax related question or a product-related question.\n11. A computing system configured to provide domain-specific and dynamic type-ahead suggestions for search query terms, the computing system comprising:\none or more processors; and\na memory coupled to the one or more processors and storing instructions that, when executed by the one or more processors, causes the computing system to perform operations comprising:\nstoring a plurality of potential search queries in a memory associated with the computing system, each of the plurality of potential search queries including one or more search terms;\npresenting user experience data and a search text box on a display screen viewable by a user;\nreceiving, via the search text box presented on the display screen, one or more search query terms of a search query provided by the user;\nidentifying a number of topics in each of the one or more search query terms provided by the user;\ndetermining one or more topic relevance scores for each of the potential search queries using a predictive topic model, each topic relevance score indicating a relevance of the corresponding potential search query to a respective one of the topics identified in the received search query terms;\nranking the plurality of potential search queries based on their respective topic relevance scores;\nidentifying which potential search query of the plurality of potential search queries has a highest topic relevance score; and\npresenting the identified potential search query as a type-ahead suggestion on the display screen adjacent to the one or more search query terms provided in the search text box, the presented type-ahead suggestion configured to assist the user by completing the search query.\n12. The computing system of claim 11, wherein execution of the instructions causes the computing system to perform operations further comprising:\nstoring a user profile for each of a plurality of users associated with the customer self-service system;\ndetermining a level of relevance of each of the plurality of potential search queries to each user profile; and\ndetermining, for each of the plurality of potential search queries, a probability score for each user profile based on the determined relevance levels.\n13. The computing system of claim 12, wherein the determination of the topic relevance scores is further based on the probability scores determined for the user's profile.\n14. The computing system of claim 12, wherein the user profile includes one or more of a search history of a respective user, an income of the respective user, a zip code of the respective user, or tax exemptions of the respective user.\n15. The computing system of claim 11, wherein execution of the instructions causes the computing system to perform operations further comprising:\ntraining the predictive topic model using one of logistical regression, a decision tree, an artificial neural network, a support vector machine, a naive Bayes operation, a linear discriminant analysis, or a k-nearest neighbor algorithm.\n16. The computing system of claim 11, wherein determining the topic relevance scores further comprises applying the one or more received search query terms to a Latent Dirichlet Allocation algorithm.\n17. The computing system of claim 11, wherein the predictive topic model is configured to identify the topics in each of the one or more search query terms based at least in part on a number of topics associated with each of the plurality of potential search queries.\n18. The computing system of claim 11, wherein the predictive topic model includes one or more of a Latent Dirichlet Allocation algorithm, a Latent Semantic Indexing (“LSI”) algorithm, a query clustering algorithm, or a query de-duplication algorithm.\n19. The computing system of claim 11, wherein execution of the instructions causes the computing system to perform operations further comprising:\nreceiving one or more additional search query terms from the user via the search text box; and\ndynamically updating the type-ahead suggestion presented on the display screen based on the one or more additional search query terms.\n20. The computing system of claim 11, wherein the customer self-service system is associated with an electronic tax return preparation system, and execution of the instructions causes the computing system to perform operations further comprising:\ndetermining a type of question associated with the one or more search query terms received from the user, the determined type of question comprising one or both of a tax related question or a product-related question."
}