{
    "patent_id": "US-11170660-B2",
    "title": "Harvesting question/answer training data from watched hypotheses in a deep QA system ",
    "assignee": "International Business Machines Corporation",
    "publication_date": "2021-11-09",
    "patent_link": "https://patents.google.com/patent/US11170660B2/en",
    "inventors": [
        "Charles E. Beller",
        "William G. Dubyak",
        "Palani Sakthi",
        "Kristen M. Summers"
    ],
    "classifications": [
        "G09B7/02",
        "G06F16/215",
        "G06F16/288",
        "G06F16/3326",
        "G06N5/022",
        "G06N5/041",
        "G06N20/00"
    ],
    "abstract": "Embodiments can provide a computer implemented method for harvesting training data for a training set for use by a system capable of answering questions, the system comprising a processor and a memory comprising instructions executed by the processor, the method comprising receiving, from a user, an input question; processing the input question and returning, to the user, a result set comprising one or more ranked hypotheses and one or more ranked evidence passages corresponding to the one or more ranked hypotheses; receiving, from the user, an indication that one of the one or more ranked hypotheses is to be designated a watched hypothesis; adding the input question and the watched hypothesis to a to-be-vetted question/answer (QA) pair set comprising one or more to-be-vetted QA pairs; vetting each of the one or more to-be-vetted QA pairs in the to-be-vetted QA pair set through a first-pass automatic vetting procedure; if a vetted QA pair passes the first-pass automatic vetting procedure, adding the vetted QA pair to the training set; and retraining one or more ranking models based upon the training set.",
    "claims": "\n1. A computer implemented method for harvesting training data for a training set for use by a system capable of answering questions, the system comprising a processor and a memory comprising instructions executed by the processor, the method comprising:\nreceiving, from a user, an input question;\nprocessing the input question and returning, to the user, a result set comprising one or more ranked hypotheses and one or more ranked evidence passages corresponding to the one or more ranked hypotheses;\nreceiving, from the user, an indication that one of the one or more ranked hypotheses is to be designated a watched hypothesis;\nadding the input question and the watched hypothesis to a to-be-vetted question/answer (QA) pair set comprising one or more to-be-vetted QA pairs;\nvetting each of the one or more to-be-vetted QA pairs in the to-be-vetted QA pair set through a first-pass automatic vetting procedure, wherein the first-pass automatic vetting procedure comprises:\nassigning a threshold value for determining whether the one or more to-be-vetted QA pair passes the first-pass automatic vetting procedure,\nassigning to the user a WH-reliability score proportional to a percentage of QA pairs obtained from the user's previous indications of watched hypotheses that have successfully passed the first-pass automatic vetting, wherein the assignment comprises determining that the number of vetted QA pairs associated with the user is equal to or greater than 1 and assigning to the user a WH-reliability score equal to the quotient of a number of QA pairs in the training set associated with the user and of a number watched hypotheses associated with the user,\nproducing a final weighing of the to-be-vetted QA pair based on at least the WH-reliability score, wherein the to-be-vetted QA pair becomes a vetted QA pair following the producing of the final weighing of the to-be-vetted QA pair; and\ndetermining that the final weighing meets or exceeds the threshold value;\nadding the vetted QA pair to the training set based on the determining that the final weighing meets or exceeds the threshold value; and\nretraining one or more ranking models based upon the training set.\n2. The method as recited in claim 1, further comprising:\ndetermining that the final weighing does not meet or exceed the threshold value; and\nvetting the vetted QA pair through additional human vetting based on the determining that the final weighing does not meet or exceed the threshold value.\n3. The method as recited in claim 1, wherein the first-pass automatic vetting further comprises:\ncomparing a parse structure of the to-be-vetted QA pair with one or more existing QA pairs in the training set;\ndetermining that the to-be-vetted QA pair is comparable with the one or more existing QA pairs;\ndeclaring the to-be-vetted QA pair as a duplicate pair based on the determination that the to-be-vetted QA pair is comparable with the one or more existing QA pairs; and\ndiscarding the duplicate pair.\n4. The method as recited in claim 3, wherein the assigning to the user a WH-reliability score is calculated as if the duplicate pair is not discarded.\n5. The method as recited in claim 3, wherein the to-be-vetted QA pair is determined to be comparable with the one or more existing QA pairs on the basis of at least one of string matches, spelling variants, and known synonyms.\n6. The method as recited in claim 1, wherein the first-pass automatic vetting further comprises:\ncalculating a QA consistency score based upon one or more features of the input question and the watched hypothesis.\n7. The method as recited in claim 1, wherein the first-pass automatic vetting further comprises:\ncombining the WH-reliability score and the QA consistency score to produce the final weighing of the to-be-vetted QA pair.\n8. A computer program product for harvesting training data for a training set for use by a system capable of answering questions, the computer program product comprising a non-transitory computer readable storage medium having program instructions embodied therewith, the program instructions executable by a processor to cause the processor to:\nreceive, from a user, an input question;\nprocess the input question and returning, to the user, a result set comprising one or more ranked hypotheses and one or more ranked evidence passages corresponding to the one or more ranked hypotheses;\nreceive, from the user, an indication that one of the one or more ranked hypotheses is to be designated a watched hypothesis;\nadd the input question and the watched hypothesis to a to-be-vetted question/answer (QA) pair set comprising one or more to-be-vetted QA pairs;\nvet each of the one or more to-be-vetted QA pairs in the to-be-vetted QA pair set through a first-pass automatic vetting procedure, wherein the first-pass automatic vetting procedure comprises:\nassigning a threshold value for determining whether a to-be-vetted QA pair passes the first-pass automatic vetting procedure,\nassigning to the user a WH-reliability score proportional to a percentage of QA pairs obtained from the user's previous indications of watched hypotheses that have successfully passed the first-pass automatic vetting, wherein the assignment comprises determining that the number of vetted QA pairs associated with the user is equal to or greater than 1 and assigning to the user a WH-reliability score equal to the quotient of a number of QA pairs in the training set associated with the user and of a number watched hypotheses associated with the user,\nproducing a final weighing of the to-be-vetted QA pair based on at least the WH-reliability score, wherein the to-be-vetted QA pair becomes a vetted QA pair following a production of the final weighing of the to-be-vetted QA pair; and\ndetermine that the final weighing meets or exceeds the threshold value;\nadd the vetted QA pair to the training set based on the determine that the final weighing meets or exceeds the threshold value; and\nretrain one or more ranking models based upon the training set.\n9. The computer program product of claim 8, wherein the program instructions executable by the processor further cause the processor to:\ndetermine that the final weighing does not meet or exceed the threshold value; and\nvet the vetted QA pair through additional human vetting based on the determine that the final weighing does not meet or exceed the threshold value.\n10. The computer program product of claim 8, wherein the program instructions executable by the processor further cause the processor to:\ncompare a parse structure of the to-be-vetted QA pair with one or more existing QA pairs in the training set;\ndetermine that the to-be-vetted QA pair is comparable with the one or more existing QA pairs;\ndeclare the to-be-vetted QA pair as a duplicate pair based on the determination that the to-be-vetted QA pair is comparable with the one or more existing QA pairs; and\ndiscard the duplicate pair.\n11. The computer program product of claim 10, wherein the assignment to the user a WH reliability score is calculated as if the duplicate pair is not discarded.\n12. The computer program product of claim 8, wherein the to-be-vetted QA pair is determined to be comparable with the one or more existing QA pairs on the basis of at least one of string matches, spelling variants, and known synonyms.\n13. The computer program product of claim 8, wherein the program instructions executable by the processor further cause the processor to:\ncalculate a QA consistency score based upon one or more features of the input question and the watched hypothesis.\n14. The computer program product of claim 8, wherein the program instructions executable by the processor further cause the processor to:\ncombine the WH-reliability score and the QA consistency score to produce the final weighing of the to-be-vetted QA pair.\n15. A system for harvesting training data for a training set, the system comprising:\na memory having program instructions embodied therewith;\na processor, wherein the program instructions executable by the processor cause the processor to:\nreceive, from a user, an input question;\nprocess the input question and return, to the user, a result set comprising one or more ranked hypotheses and one or more ranked evidence passages corresponding to the one or more ranked hypotheses;\nreceive, from the user, an indication that one of the one or more ranked hypotheses is to be designated a watched hypothesis;\nadd the input question and the watched hypothesis to a to-be-vetted question/answer (QA) pair set comprising one or more to-be-vetted QA pairs;\nvet each of the one or more to-be-vetted QA pairs in the to-be-vetted QA pair set through a first-pass automatic vetting procedure, wherein the first-pass automatic vetting procedure comprises:\nassigning a threshold value for determining whether a to-be-vetted QA pair passes the first-pass automatic vetting procedure,\nassigning to the user a WH-reliability score proportional to a percentage of QA pairs obtained from the user's previous indications of watched hypotheses that have successfully passed the first-pass automatic vetting, wherein the assignment comprises determining that the number of vetted QA pairs associated with the user is equal to or greater than 1 and assigning to the user a WH-reliability score equal to the quotient of a number of QA pairs in the training set associated with the user and of a number watched hypotheses associated with the user,\nproducing a final weighing of the to-be-vetted QA pair based on at least the WH-reliability score, wherein the to-be-vetted QA pair becomes a vetted QA pair following a production of the final weighing of the to-be vetted QA pair; and\ndetermine that the final weighing meets or exceeds the threshold value;\nadd the vetted QA pair to the training set based on the determine that the final weighing meets or exceeds the threshold value; and\nretrain one or more ranking models based upon the training set.\n16. The system of claim 15 wherein the processor is further configured to:\ndetermine that the final weighing does not meet or exceed the threshold value; and\nvet the vetted QA pair through additional human vetting based on the determine that the final weighing does not meet or exceed the threshold value.\n17. The system of claim 15 wherein the processor is further configured to:\ncompare a parse structure of the to-be-vetted QA pair with one or more existing QA pairs in the training set;\ndetermine that the to-be-vetted QA pair is comparable with the one or more existing QA pairs;\ndeclare the to-be-vetted QA pair as a duplicate pair based on the determination that the to-be-vetted QA pair is comparable with one or more existing QA pairs; and\ndiscard the duplicate pair.\n18. The system of claim 17, wherein the assignment to the user a WH reliability score is calculated as if the duplicate pair is not discarded.\n19. The system of claim 15 wherein the processor is further configured to:\ncalculate a QA consistency score based upon one or more features of the input question and the watched hypothesis; and\ncombine the WH-reliability score and the QA consistency score to produce the final weighing of the to-be-vetted QA pair.\n20. A computer implemented method for harvesting training data for a training set for use by a system capable of answering questions, the system comprising a processor and a memory comprising instructions executed by the processor, the method comprising:\nreceiving, from a user, an input question;\nprocessing the input question and returning, to the user, a result set comprising one or more ranked hypotheses and one or more ranked evidence passages corresponding to the one or more ranked hypotheses;\nreceiving, from the user, an indication that one of the one or more ranked hypotheses is to be designated a watched hypothesis;\nadding the input question and the watched hypothesis to a to-be-vetted question/answer (QA) pair set comprising one or more to-be-vetted QA pairs;\nvetting each of the one or more to-be-vetted QA pairs in the to-be-vetted QA pair set through a first-pass automatic vetting procedure, wherein the first-pass automatic vetting procedure comprises:\nassigning a threshold value for determining whether the one or more to-be-vetted QA pair passes the first-pass automatic vetting procedure,\nassigning to the user a WH-reliability score proportional to a percentage of QA pairs obtained from the user's previous indications of watched hypotheses that have successfully passed the first-pass automatic vetting, wherein the assignment comprises determining that the user has less than one vetted QA pairs associated with the user; and assigning to the user a WH-reliability score equal to 0.5,\nproducing a final weighing of the to-be-vetted QA pair based on at least the WH-reliability score, wherein the to-be-vetted QA pair becomes a vetted QA pair following the producing of the final weighing of the to-be-vetted QA pair; and\ndetermining that the final weighing meets or exceeds the threshold value;\nadding the vetted QA pair to the training set based on the determining that the final weighing meets or exceeds the threshold value; and\nretraining one or more ranking models based upon the training set.",
    "status": "Active",
    "citations_own": [
        "US20110125734A1",
        "WO2012047541A1",
        "US20140172880A1",
        "US20150179082A1",
        "US20160034457A1",
        "US9280908B2",
        "US20160078149A1",
        "US20160180242A1",
        "US20160217389A1",
        "US9514412B2",
        "US20170004204A1",
        "US20180011926A1",
        "US20180025274A1"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "US10755294B1",
        "US10475044B1",
        "US10572954B2",
        "US10733677B2",
        "US10552843B1",
        "US10748157B1",
        "US10922367B2",
        "US11093951B1",
        "US11436642B1",
        "US20190258900A1",
        "US11449762B2",
        "US11269665B1",
        "US20220036007A1"
    ]
}