{
    "patent_id": "US-10795958-B2",
    "title": "Intelligent distributed geographic information system ",
    "assignee": "Google Llc",
    "publication_date": "2020-10-06",
    "patent_link": "https://patents.google.com/patent/US10795958B2/en",
    "inventors": [
        "Michael T. Jones",
        "John Rohlf",
        "Brian McClendon"
    ],
    "classifications": [
        "G06F3/04815",
        "G06F16/9537",
        "G06F16/2425",
        "G06F16/2428",
        "G06F16/248",
        "G06F16/29",
        "G06F16/9538",
        "G06N7/005",
        "G06N7/01",
        "G06T17/05",
        "G06F16/284",
        "G06F16/338",
        "G06F16/9038",
        "G06F16/951",
        "G06F16/9535",
        "G06Q40/00"
    ],
    "abstract": "Interactive geographic information systems (GIS) and techniques are disclosed that provide users with a greater degree of flexibility, utility, and information. A markup language is provided that facilitates communication between servers and clients of the interactive GIS, which enables a number of GIS features, such as network links (time-based and/or view-dependent dynamic data layers), ground overlays, screen overlays, placemarks, 3D models, and stylized GIS elements, such as geometry, icons, description balloons, polygons, and labels in the viewer by which the user sees the target area. Also, “virtual tours” of user-defined paths in the context of distributed geospatial visualization is enabled. Streaming and interactive visualization of filled polygon data are also enabled thereby allowing buildings and other such features to be provided in 3D. Also, techniques for enabling ambiguous search requests in a GIS are provided.",
    "claims": "\n1. A method for automatically updating digital maps, the method comprising:\nreceiving, by one or more processors in a client device via a communication network from a geographic information systems (GIS) server system, geographic information for generating interactive digital maps;\ngenerating, by the one or more processors in the client device, a digital map of a geographic area using the received geographic information;\nreceiving, by the one or more processors in the client device via the communication network from the GIS server system, a geospatial description file that includes a designated location and a viewpoint of a virtual camera for viewing the designated location, wherein the viewpoint is unrelated to geometry specified by the designated location, such that the designated location is not within view; and\npresenting, by the one or more processors in the client device, an indication of the designated location on the digital map, the digital map presented from the viewpoint of the virtual camera.\n2. The method of claim 1, further comprising:\npresenting, by the one or more processors in the client device, the digital map of the geographic area from an initial viewpoint of the virtual camera;\npresenting, by the one or more processors in the client device, a user control for viewing the designated location; and\nin response to receiving a selection of the user control, presenting, by the one or more processors in the client device, an indication of the designated location on the digital map and adjusting a view of the digital map from the initial viewpoint of the virtual camera to the viewpoint from the geospatial description file.\n3. The method of claim 1, wherein the viewpoint of the virtual camera for viewing the designated location includes one or more of: a location of the viewpoint, a heading for the viewpoint indicative of a direction the virtual camera is facing, a tilt angle for the viewpoint, or a range indicative of the distance from a surface to the viewpoint of the virtual camera.\n4. The method of claim 1, wherein the geospatial description file is consistent with a Keyhole Markup Language (KML) or compressed KML (KMZ) specification.\n5. The method of claim 1, wherein receiving the geospatial description file includes iteratively fetching content from a third-party content server using a view-dependent network link (VDNL).\n6. The method of claim 5, wherein using the view-dependent network link (VDNL) includes submitting, by the one or more processors, a VDNL data structure that specifies the third-party content server.\n7. The method of claim 1, wherein generating the digital map includes generating a 3D satellite image map.\n8. A client device comprising:\none or more processors; and\na non-transitory computer-readable medium storing thereon instructions that, when executed by the one or more processors, cause the client device to:\nreceive, via a communication network from a geographic information systems (GIS) server system, geographic information for generating interactive digital maps;\ngenerate a digital map of a geographic area using the received geographic information;\nreceive, via the communication network from the GIS server system, a geospatial description file that includes a designated location and a viewpoint of a virtual camera for viewing the designated location, wherein the viewpoint is unrelated to geometry specified by the designated location, such that the designated location is not within view; and\npresent an indication of the designated location on the digital map, the digital map presented from the viewpoint of the virtual camera.\n9. The client device of claim 8, wherein the instructions further cause the client device to:\npresent the digital map of the geographic area from an initial viewpoint of the virtual camera;\npresent a user control for viewing the designated location; and\nin response to receiving a selection of the user control, present an indication of the designated location on the digital map and adjusting a view of the digital map from the initial viewpoint of the virtual camera to the viewpoint from the geospatial description file.\n10. The client device of claim 8, wherein the viewpoint of the virtual camera for viewing the designated location includes one or more of: a location of the viewpoint, a heading for the viewpoint indicative of a direction the virtual camera is facing, a tilt angle for the viewpoint, or a range indicative of the distance from a surface to the viewpoint of the virtual camera.\n11. The client device of claim 8, wherein the geospatial description file is consistent with a Keyhole Markup Language (KML) or compressed KML (KMZ) specification.\n12. The client device of claim 8, wherein to receive the geospatial description file, the instructions cause the client device to iteratively fetch content from a third-party content server using a view-dependent network link (VDNL).\n13. The client device of claim 12, wherein to use the view-dependent network link (VDNL), the instructions cause the client device to submit a VDNL data structure that specifies the third-party content server.\n14. The method of claim 8, wherein generating the digital map includes generating a 3D satellite image map.\n15. A non-transitory computer-readable medium storing thereon instructions that, when executed by one or more processors, cause the one or more processors to:\nreceive, via a communication network from a geographic information systems (GIS) server system, geographic information for generating interactive digital maps;\ngenerate a digital map of a geographic area using the received geographic information;\nreceive, via the communication network from the GIS server system, a geospatial description file that includes a designated location and a viewpoint of a virtual camera for viewing the designated location, wherein the viewpoint is unrelated to geometry specified by the designated location, such that the designated location is not within view; and\npresent an indication of the designated location on the digital map, the digital map presented from the viewpoint of the virtual camera.\n16. The non-transitory computer-readable medium of claim 15, wherein the instructions further cause the one or more processors to:\npresent the digital map of the geographic area from an initial viewpoint of the virtual camera;\npresent a user control for viewing the designated location; and\nin response to receiving a selection of the user control, present an indication of the designated location on the digital map and adjusting a view of the digital map from the initial viewpoint of the virtual camera to the viewpoint from the geospatial description file.\n17. The non-transitory computer-readable medium of claim 15, wherein the viewpoint of the virtual camera for viewing the designated location includes one or more of: a location of the viewpoint, a heading for the viewpoint indicative of a direction the virtual camera is facing, a tilt angle for the viewpoint, or a range indicative of the distance from a surface to the viewpoint of the virtual camera."
}