{
    "patent_id": "US-11619927-B2",
    "title": "Automatic analysis of real time conditions in an activity space ",
    "assignee": "Drishti Technologies, Inc.",
    "publication_date": "2023-04-04",
    "patent_link": "https://patents.google.com/patent/US11619927B2/en",
    "inventors": [
        "Prasad Narasimha Akella",
        "Krishnendu Chaudhury",
        "Ananth Uggirala"
    ],
    "classifications": [
        "G05B19/4183",
        "G05B19/41835",
        "G06F11/0721",
        "G06F11/079",
        "G06F11/3452",
        "G06F16/2228",
        "G06F16/2365",
        "G06F16/24568",
        "G06F16/9024",
        "G06F16/9035",
        "G06F16/904",
        "G06F30/20",
        "G06F30/23",
        "G06F9/4498",
        "G06F9/4881",
        "G06N20/00",
        "G06N3/008",
        "G06N3/04",
        "G06N3/044",
        "G06N3/0445",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/08",
        "G06N3/084",
        "G06N7/005",
        "G06N7/01",
        "G06Q10/06",
        "G06Q10/063112",
        "G06Q10/06316",
        "G06Q10/06393",
        "G06Q10/06395",
        "G06Q10/06398",
        "G06T19/006",
        "G06V10/25",
        "G06V10/454",
        "G06V10/82",
        "G06V20/52",
        "G06V40/20",
        "G09B19/00",
        "B25J9/1664",
        "B25J9/1697",
        "G01M99/005",
        "G05B19/41865",
        "G05B19/423",
        "G05B2219/32056",
        "G05B2219/36442",
        "G05B23/0224",
        "G06F18/217",
        "G06F2111/10",
        "G06F2111/20",
        "G06K9/6262",
        "G06N3/006",
        "G06Q10/083",
        "G06Q50/26",
        "G16H10/60",
        "G16H40/20",
        "Y02P90/02"
    ],
    "abstract": "Efficient and effective workspace condition analysis systems and methods are presented. In one embodiment, a method comprises: accessing information associated with an activity space, including information on a newly discovered previously unmodeled entity; analyzing the activity information, including activity information associated with the previously unmodeled entity; forwarding feedback on the results of the analysis, including analysis results for the updated modeled information; and utilizing the feedback in a coordinated path plan check process. In one exemplary implementation the coordinated path plan check process comprises: creating a solid/CAD model including updated modeled information; simulating an activity including the updated modeled information; generating a coordinated path plan for entities in the activity space; and testing the coordinated path plan. The coordinated path plan check process can be a success. The analyzing can include automatic identification of potential collision points for a first actor, including potential collision points with the newly discovered object. The newly discovered previously unmodeled entity interferes with an actor from performing an activity. The newly discovered object is a portion of a tool component of a product.",
    "claims": "\n1. A method comprising:\naccessing information associated with an activity space in real time, including information on a newly discovered previously unmodeled entity based on automatically sensed information;\nanalyzing activity information included in the information associated with the activity space, including activity information associated with the newly discovered previously unmodeled entity, wherein the automatically sensed information is included in data packets and the analyzing includes automated artificial intelligence analysis in real time of a plurality of actors activities in the activity space with respect to each other, previously modeled entities, and the newly discovered previously unmodeled entity, wherein the automated artificial intelligence analysis includes utilizing machine learning back-end unit processes in the analysis;\nforwarding feedback on the results of the analysis, including analysis results for updated modeled information, wherein the updated modeled information is based on the information associated with the newly discovered previously unmodeled entity; and\nutilizing the feedback in a coordinated path plan check process for the plurality of actors, wherein the feedback enables avoidance of detrimental conditions and situations in the activity space, including detrimental contact between the plurality of actors, previously modeled entity and the newly discovered previously unmodeled entity.\n2. The method of claim 1, wherein the coordinated path plan check process comprises:\ncreating a solid/CAD model including updated modeled information, wherein the solid/CAD model is a model of entities in the activity space including the newly discovered previously unmodeled entity;\nsimulating an activity including the updated modeled information;\ngenerating a coordinated path plan for the entities in the activity space; and\ntesting the coordinated path plan.\n3. The method of claim 1, wherein the coordinated path plan check process is a success.\n4. The method of claim 1, wherein the analyzing includes automatic identification of potential collision points for a first actor, including potential collision points with the newly discovered previously unmodeled entity, wherein the first actor is included in the plurality of actors.\n5. The method of claim 1, wherein the newly discovered previously unmodeled entity interferes with an actor from performing an activity, wherein the actor is included in the plurality of actors.\n6. The method of claim 1, wherein the newly discovered previously unmodeled entity is a portion of a tool component of a product.\n7. A system comprising:\none or more data storage units, the one or more data storage units configured to store information for the engine, including information associated with one or more stations, wherein the one or more stations include a plurality of entities, wherein the plurality of entities includes a first actor and a second actor;\none or more engines configured to:\naccess information associated with an activity space in real time, including information on a newly discovered previously unmodeled entity based on automatically sensed information;\nanalyze activity information included in the information associated with the activity space, including activity information associated with the newly discovered previously unmodeled entity, wherein the automatically sensed information is included in data packets and the analyzing includes automated artificial intelligence analysis in real time of activities of the first actor and the second actor in the activity space with respect to each other, previously modeled entities, and the newly discovered previously unmodeled entity, wherein the automated artificial intelligence analysis includes utilizing machine learning back-end unit processes in the analysis;\nforward feedback on the results of the analysis, including analysis results for updated modeled information, wherein the updated modeled information is based on the information associated with the newly discovered previously unmodeled entity; and\nutilize the feedback in a coordinated path plan check process for the first actor and the second actor, wherein the feedback enables avoidance of detrimental conditions and situations in the activity space, including detrimental contact between the first actor and the second actor, previously modeled entity, and the newly discovered previously unmodeled entity.\n8. The system of claim 7, wherein the first actor is a robot and the coordinated path plan check process comprises:\ncreating a solid/CAD model including updated modeled information, wherein the solid/CAD model is a model of entities in the activity space including the newly discovered previously unmodeled entity;\nsimulating an activity including the updated modeled information;\ngenerating a coordinated path plan for the entities in the activity space; and\ntesting the coordinated path plan.\n9. The system of claim 7, wherein the coordinated path plan check process is a success.\n10. The system of claim 7, wherein the analyzing includes automatic identification of potential collision points for the first actor, including potential collision points with the newly discovered previously unmodeled entity.\n11. The system of claim 7, wherein the newly discovered previously unmodeled entity interferes with an actor from performing an activity in a work environment, wherein the actor is included in the plurality of entities.\n12. The system of claim 7, wherein the newly discovered previously unmodeled entity is a portion of a tool component of a product.\n13. The system of claim 7, the engine processes the information and generates updated modeled information which is forwarded to the path process.\n14. One or more non-transitory computing device-readable storage mediums storing instructions executable by one or more computing devices to perform a method comprising:\naccessing information associated with an activity space, including information on a newly discovered previously unmodeled object that is discovered in real time;\nanalyzing activity information included in the information associated with the activity space, including activity information associated with the newly discovered previously unmodeled object based on automatically sensed information wherein the automatically sensed information is included in data packets and the analyzing includes automated artificial intelligence analysis in real time of a plurality of actors activities in the activity space with respect to each other, previously modeled entities, and the newly discovered previously unmodeled object, wherein the automated artificial intelligence analysis includes utilizing machine learning back-end unit processes in the analysis;\nforwarding feedback on the results of the analysis, including analysis results for updated modeled information, wherein the updated modeled information is based on the information associated with the newly discovered previously unmodeled object; and\nutilizing the feedback in a coordinated path plan check process for the plurality of actors, wherein the feedback enables avoidance of detrimental conditions and situations in the activity space, including detrimental conditions between the plurality of actors, previously modeled entity and the newly discovered previously unmodeled entity.\n15. The device-readable storage mediums of claim 14, wherein the coordinated path plan check process comprises:\ncreating a solid/CAD model including updated modeled information, wherein the solid/CAD model is a model of entities in the activity space including the newly discovered previously unmodeled object;\nsimulating an activity including the updated modeled information;\ngenerating a coordinated path plan for the entities in the activity space; and\ntesting the coordinated path plan.\n16. The device-readable storage mediums of claim 14, wherein the coordinated path plan check process is a success.\n17. The device-readable storage mediums of claim 14, wherein the analyzing includes automatic identification of potential collision points for a first actor, including potential collision points with the newly discovered unmodeled object.\n18. The device-readable storage mediums of claim 14, wherein the newly discovered previously unmodeled object interferes with an actor from performing an activity.\n19. The device-readable storage mediums of claim 14, wherein the newly discovered unmodeled object is a portion of a tool component of a product.",
    "status": "Active",
    "citations_own": [
        "US20030229471A1",
        "US20050105765A1",
        "US20060224254A1",
        "US20060241792A1",
        "US20060271526A1",
        "US20090016600A1",
        "US20090089227A1",
        "US20100082512A1",
        "US20100235033A1",
        "US20110043626A1",
        "US20110196533A1",
        "US20120197898A1",
        "US20120225413A1",
        "WO2012141601A2",
        "EP2626757A1",
        "US20130307693A1",
        "US20130339923A1",
        "US20140079297A1",
        "US20140172357A1",
        "US20140222813A1",
        "US20140277593A1",
        "US20140326084A1",
        "US20140337000A1",
        "US20150251315A1",
        "US20150364158A1",
        "US20160085607A1",
        "WO2017040167A1",
        "US20170067737A1",
        "US20170098161A1",
        "US20170210008A1",
        "US20170232613A1"
    ],
    "citations_ftf": [
        "US5093794A",
        "US5177688A",
        "US5229948A",
        "US5615138A",
        "US5880960A",
        "JPH10261122A",
        "US6349237B1",
        "US6263255B1",
        "US6259959B1",
        "US6198980B1",
        "US6263253B1",
        "US6418351B1",
        "US6963827B1",
        "US6606527B2",
        "US6631305B2",
        "US7475405B2",
        "WO2002031746A1",
        "US6622055B2",
        "US6763277B1",
        "US8914300B2",
        "US6915172B2",
        "US6654673B2",
        "US20040148047A1",
        "WO2003065179A2",
        "US7209859B2",
        "JP3715258B2",
        "US10065317B2",
        "US6856847B2",
        "WO2004053605A1",
        "US6829514B2",
        "US7379206B2",
        "US20050226489A1",
        "US7561200B2",
        "JP4460411B2",
        "US7587804B2",
        "US7151972B2",
        "US8589944B2",
        "US7889069B2",
        "DE102006014634B4",
        "WO2006132282A1",
        "US7979293B2",
        "US8095492B2",
        "KR20070075957A",
        "US7558638B2",
        "WO2008008727A2",
        "US8677007B2",
        "WO2008025016A2",
        "US7966151B2",
        "US20080123750A1",
        "US8175732B2",
        "US8041444B2",
        "US7257459B1",
        "JP4396708B2",
        "US8260783B2",
        "US7680600B2",
        "EP2045679A1",
        "US7684892B2",
        "US7809457B2",
        "US20090138334A1",
        "US7983778B2",
        "JP5130037B2",
        "US20100010879A1",
        "US8010217B2",
        "DE102008048552B4",
        "JP4648486B2",
        "US8306931B1",
        "US8607093B2",
        "EP2333623A1",
        "JP2011152615A",
        "US9377778B2",
        "US8463637B2",
        "US9940508B2",
        "US9607652B2",
        "US9283675B2",
        "US9953468B2",
        "JP2013009159A",
        "US20130070056A1",
        "EP2764455B1",
        "CN103988136A",
        "US9026752B1",
        "US9008839B1",
        "US20130226674A1",
        "US8976032B2",
        "US9379949B2",
        "US20130290972A1",
        "EP2845094B1",
        "EP2856266B1",
        "US11128935B2",
        "WO2014004901A1",
        "EP2685403A3",
        "US9735746B2",
        "US20140067108A1",
        "WO2014039290A2",
        "US9085080B2",
        "WO2014111948A1",
        "US20140247347A1",
        "US20160132046A1",
        "US20140275888A1",
        "US9448965B2",
        "US9573277B2",
        "US10802876B2",
        "US9471610B1",
        "US9379951B2",
        "US9665660B2",
        "US9833197B1",
        "US20150294143A1",
        "JP6344084B2",
        "US10846536B2",
        "US9050723B1",
        "US9272418B1",
        "DE102014218096A1",
        "US9130860B1",
        "US10571869B2",
        "US9656390B2",
        "US20160148135A1",
        "US9623560B1",
        "US10310904B2",
        "US9305216B1",
        "US9588514B2",
        "US20180011973A1",
        "CN107409126B",
        "US9486921B1",
        "US20160321594A1",
        "US10698390B2",
        "US10042697B2",
        "US10363632B2",
        "US10748406B2",
        "JP6426547B2",
        "US10274930B2",
        "DE102015216272A1",
        "JP6551531B2",
        "US10878807B2",
        "US20170178311A1",
        "JP6333870B2",
        "JP6059375B1",
        "JP6504072B2",
        "EP3208757A1",
        "JP6114421B1",
        "US20170243154A1",
        "JP6328675B2",
        "US10363659B2",
        "CA3018326A1",
        "US20190105779A1",
        "US9996409B2",
        "JP6852729B2",
        "JP2017199077A",
        "US20170308800A1",
        "JP6450704B2",
        "JP7129342B2",
        "US10322506B2",
        "US9921726B1",
        "US11373254B2",
        "US10375325B2",
        "US10445702B1",
        "US10146609B1",
        "JP6947759B2",
        "US9569729B1",
        "US10928792B2",
        "EP3494428A4",
        "JP6819128B2",
        "JP6517762B2",
        "US11079728B2",
        "US20180109469A1",
        "JP6431017B2",
        "JP6441546B2",
        "US20180129192A1",
        "US10425506B2",
        "TWI616827B",
        "US10134006B2",
        "JP6852381B2",
        "JP6392839B2",
        "US11263596B2",
        "US10445668B2",
        "US20180197131A1",
        "JP6392908B2",
        "US11010614B2",
        "US20180217583A1",
        "US11226720B1",
        "US11040450B2",
        "US10376142B2",
        "WO2018146772A1",
        "JP6903963B2",
        "US20200188732A1",
        "US10346944B2",
        "CN107066979A",
        "JP6845072B2",
        "US10917419B2",
        "US20180330250A1",
        "US10456912B2",
        "US20180349829A1",
        "JP6965603B2",
        "US10484413B2",
        "US10360214B2",
        "JP2019082923A",
        "WO2019090264A1",
        "US20190143517A1",
        "EP3540661A1",
        "US11292133B2"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "WO2018081833A1",
        "US10678244B2",
        "US11157441B2",
        "US10671349B2",
        "US11409692B2",
        "WO2019090264A1",
        "US11017550B2",
        "US11164380B2",
        "US11113887B2",
        "US11561791B2",
        "US20190266542A1",
        "DE112019001287T5",
        "US10769485B2",
        "US11215999B2",
        "US11636333B2",
        "US20200050677A1",
        "US11562231B2",
        "US11196678B2",
        "US11537811B2",
        "US10770180B1",
        "US11102068B1",
        "US11610117B2",
        "US11199561B2",
        "US10997461B2",
        "US11567514B2",
        "US10956755B2",
        "CN113874912A",
        "US10963786B1",
        "US20200359550A1",
        "CN110210750A",
        "IT201900008247A1",
        "US20220212826A1",
        "IT201900008250A1",
        "US20200394572A1",
        "IT201900009390A1",
        "CN110472063B",
        "US11099529B2",
        "CN110363360A",
        "US11415975B2",
        "CN110781266B",
        "WO2021067935A1",
        "KR102051543B1",
        "US10990876B1",
        "US11138805B2",
        "US11288515B2",
        "CN113454660A",
        "US11157783B2",
        "US11442429B2",
        "US11472028B2",
        "US11551344B2",
        "WO2021127400A1",
        "SG10201913029SA",
        "CN111144026A",
        "US11769577B1",
        "WO2021154320A1",
        "US11529737B2",
        "US11257032B2",
        "JP7180886B2",
        "CN115210744A",
        "US11360463B2",
        "DE102020117318A1",
        "CN112035251B",
        "US20220016779A1",
        "US10950352B1",
        "CN112036707B",
        "DE102020210530A1",
        "EP3961326A1",
        "US11709819B2",
        "WO2022094040A1",
        "KR102453835B1",
        "US20220237540A1",
        "CH718327A1",
        "CN112926443B",
        "US20220305646A1",
        "CN113128412B",
        "JP2023013367A",
        "TWI776664B",
        "CN113505771B",
        "CN114770493A",
        "US11783495B1",
        "US11736290B1",
        "US11741216B1",
        "US11741215B1"
    ]
}