{
    "patent_id": "US-11600390-B2",
    "title": "Machine learning clinical decision support system for risk categorization ",
    "assignee": "Cerner Innovation, Inc.",
    "publication_date": "2023-03-07",
    "patent_link": "https://patents.google.com/patent/US11600390B2/en",
    "inventors": [
        "Sasanka Are",
        "John Matthew Sugden"
    ],
    "classifications": [
        "G16H50/20",
        "G06N20/00",
        "G06N20/20",
        "G06N5/003",
        "G06N5/01"
    ],
    "abstract": "Improved risk categorization is provided for clinical decision support and forecasting future health care spend. A risk index is provided that improves on other risk stratification models by synthesizing electronic medical records and health questionnaires with an individual patient's claim histories. Machine learning algorithms catalogue patients into distinct group clusters, based on risk which may be associated with annual health care spending, thereby enabling administrators to forecast future health care spending on the individual and population level.",
    "claims": "\n1. A computerized system comprising:\na risk index classifier configured to classify members of a population of humans into one or more risk groups from a set of risk groups;\none or more processors; and\ncomputer storage memory having computer-executable instructions stored thereon which, when executed by the processor, implement a method of predicting likely future health care spend for the population members, the method comprising:\nreceiving a set of member data for a plurality of members of the population, wherein the set of member data comprises data related to claims and behavior or lifestyle information;\ngenerating one or more risk index models used by the risk index classifier based on a type of the set of member data, the one or more risk index models generated using a set of machine learning algorithms;\nclassifying, using the risk index classifier, one or more members of the population into one or more risk groups from the set of risk groups, based on the set of member data;\ndetermining a future health care spend forecast for the classified one or more members of the population; and\nmodifying a health care event based on the determined forecast,\nwherein the set of member data comprises data related to claims and data related to at least one of (i) wellness or personal-health-assessment (PHA) information and (ii) electronic medical record (EMR) information.\n2. The computerized system of claim 1, wherein the modified health care event comprises selecting or modifying a computer health care treatment program associated with the classified one or more members of the population.\n3. The computerized system of claim 1, wherein the set of member data comprises data related to claims, wellness or personal-health-assessment (PHA) information and electronic medical record (EMR) information.\n4. The computerized system of claim 1 further comprising:\naggregating the receiving a set of member data; and\ndetermining interpretative data based on the aggregated set of member data,\nwherein classifying the one or more members of the population into one or more risk groups from the set of risk groups is further based on the interpretative data.\n5. The computerized system of claim 1, wherein the type of the set of member data comprises data from claims, clinical data, EMR, wellness information, PHA, demographic information, pharmacy claims, or information about patient lifestyle.\n6. The computerized system of claim 1, wherein one or more index models are generated at least based on the received set of member data.\n7. The computerized system of claim 1, wherein the set of machine learning algorithms comprises an ensemble of alternating decision trees.\n8. The computerized system of claim 7 wherein the set of machine learning algorithms further comprises a cost-sensitive classifier, a multi-class classifier, and a rotational forest ensemble method.\n9. The computerized system of claim 1 wherein the set of machine learning algorithms comprises a cost-sensitive classifier.\n10. The computerized system of claim 1, wherein generating the one or more risk index models comprises using the set of machine learning algorithms and historic patient data.\n11. The computerized system of claim 1 further comprising determining the number of risk groups in the set of risk groups, based in part on the received set of member data.\n12. A method for predicting likely future health care spend for individual members of a population of humans using a computing system, the method comprising:\nreceiving electronic data over a communications network for the members of the population, the data comprising historical information related to claims and data related to at least one of (i) wellness or personal-health-assessment (PHA) information and (ii) electronic medical record (EMR) information, wherein the electronic data comprises data related to claims and behavior or lifestyle information;\ngenerating, via the computing system, one or more risk index models used by the risk index classifier based on a type of the received data, the one or more risk index models generated using a set of machine learning algorithms;\nclassifying, via the computing system, members of the population into a set of risk groups, based on the received data and a risk index model, the risk index model using one or more machine learning algorithms; and\ndetermining, via a computing system, a set of future health care costs over a duration of time associated with the classified members based on the classification and the received data.\n13. The method of claim 12 further comprising modifying a health care event based on the determined set of future health care costs.\n14. The method of claim 12, wherein the one or more machine learning algorithms comprises an ensemble of alternating decision trees.\n15. The method of claim 14, wherein the set of machine learning algorithms further comprises a cost-sensitive classifier.\n16. The method of claim 12 wherein the type of the received data comprises data from claims, clinical data, EMR data, wellness information, PHA data, demographic information, pharmacy claims, or information about patient lifestyle.\n17. One or more computer-storage media having computer-executable instructions embodied thereon that, when executed by a computing device, cause the computing device to perform a method of determining future health care costs for members in a population of human patients, the method comprising:\nreceiving raw data for the members in the population, the raw data comprising claims information and at least one of (i) wellness or personal-health-assessment (PHA) information and (ii) electronic medical record (EMR) information for each of the members, wherein the raw comprises data related to claims and behavior or lifestyle information;\ngenerating a risk index model based on the raw data, a type of the raw data, and a set of machine learning algorithms;\nclassifying the members of the population into one or more risk groups using the risk index model;\ndetermining a future health care costs over a duration of time for the members based on the risk groups for which the members are classified; and\nmodifying a health care event based on the determined future health care cost.\n18. The media claim 17, wherein the set of machine learning algorithms comprises an ensemble of alternating decision trees.\n19. The media claim 17, wherein the set of machine learning algorithms comprises a cost-sensitive classifier.\n20. The media of claim 17 further comprising:\naggregating the receiving raw data; and\ndetermining interpretative data based on the aggregated raw data.",
    "status": "Active",
    "citations_own": [
        "US5799101A",
        "US20050032066A1",
        "US7392201B1",
        "US20090216558A1",
        "US7685000B1",
        "US7853456B2",
        "US20160078184A1",
        "US20170140114A1"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "US10650927B2",
        "US11087879B2",
        "JP7157758B2",
        "US11081215B2",
        "US11158427B2",
        "WO2019036035A1",
        "US20200388358A1",
        "US11508479B2",
        "US10650928B1",
        "US10811139B1",
        "WO2020036571A1",
        "US11763950B1",
        "WO2020185556A1",
        "US11625789B1",
        "US11621085B1",
        "US11557392B2",
        "US11238469B1",
        "WO2020247651A1",
        "US20200410601A1",
        "US10726359B1",
        "US20230013833A1",
        "US10643751B1",
        "US10643749B1",
        "US11270785B1",
        "CN111815052A",
        "RU2752792C1",
        "US20220059230A1",
        "US11113770B1",
        "CA3215338A1",
        "US20220367061A1",
        "JP7048796B1",
        "WO2023037298A1",
        "CN115146725B"
    ]
}