{
    "patent_id": "US-11106799-B2",
    "title": "Methods, media, and systems for detecting an anomalous sequence of function calls ",
    "assignee": "The Trustees Of Columbia University In The City Of New York",
    "publication_date": "2021-08-31",
    "patent_link": "https://patents.google.com/patent/US11106799B2/en",
    "inventors": [
        "Angelos D. Keromytis",
        "Salvatore J. Stolfo"
    ],
    "classifications": [
        "G06F21/577",
        "G06F11/08",
        "G06F11/3688",
        "G06F21/55",
        "G06F21/566",
        "G06N7/005",
        "G06N7/01",
        "G06F2221/033",
        "H04L63/1425"
    ],
    "abstract": "Methods, media, and systems for detecting an anomalous sequence of function calls are provided. The methods can include compressing a sequence of function calls made by the execution of a program using a compression model; and determining the presence of an anomalous sequence of function calls in the sequence of function calls based on the extent to which the sequence of function calls is compressed. The methods can further include executing at least one known program; observing at least one sequence of function calls made by the execution of the at least one known program; assigning each type of function call in the at least one sequence of function calls made by the at least one known program a unique identifier; and creating at least part of the compression model by recording at least one sequence of unique identifiers.",
    "claims": "\n1. A method of computing a model of program execution behavior, the method comprising:\nassigning, using a hardware processor, a first sequence of function calls to a first computing device of an application community and a second sequence of function calls to a second computing device of the application community, wherein the application community includes a plurality of computing devices running a program that executes the first sequence of function calls and the second sequence of function calls;\nreceiving a first model of the first sequence of function calls from the first computing device and a second model of the second sequence of function calls from the second computing device;\nmodifying a combined model based at least in part on the first model and the second model; and\nnotifying at least one of the plurality of computing devices in the application community of an anomalous function call that was detected using the combined model.\n2. The method of claim 1, wherein the first computing device of the application community monitors a first portion of the program and the second computing device of the application community monitors a second portion of the program.\n3. The method of claim 2, wherein the first portion of the program and the second portion of the program are a same portion of the program.\n4. The method of claim 2, wherein the first portion of the program and the second portion of the program are a different portion of the program.\n5. The method of claim 1, wherein at least one of the first model and the second model is generated using probabilistic modeling that generates a density estimation of sequences of function calls.\n6. The method of claim 5, further comprising:\napplying first and second order consistency checks, wherein the first order consistency check comprises computing a first probability of an observation of a first given feature value and the second order consistency check comprises computing a second probability of the first given feature value given another feature value; and\nidentifying the first given feature value as anomalous if at least one of the first probability and the second probability are less than a predetermined threshold probability.\n7. The method of claim 1, wherein at least one of the first model and the second model is generated using a one-class support vector machine.\n8. The method of claim 1, further comprising:\ndetermining whether a function call from at least one of the first sequence of function calls and the second sequence of function calls has been executed less than a threshold number of times; and\nin response to the determination, identifying the function call as having a greater likelihood of including an anomaly.\n9. The method of claim 1, further comprising transmitting at least one of the second model from the second computing device to the first computing device and the first model from the first computing device to the second computing device.\n10. A system for computing a model of program execution behavior, the system comprising:\na hardware processor that is programmed to:\nassign a first sequence of function calls to a first computing device of an application community and a second sequence of function calls to a second computing device of the application community, wherein the application community includes a plurality of computing devices running a program that executes the first sequence of function calls and the second sequence of function calls;\nreceive a first model of the first sequence of function calls from the first computing device and a second model of the second sequence of function calls from the second computing device;\nmodify a combined model based at least in part on the first model and the second model; and\nnotify at least one of the plurality of computing devices in the application community of an anomalous function call that was detected using the combined model.\n11. The system of claim 10, wherein the first computing device of the application community monitors a first portion of the program and the second computing device of the application community monitors a second portion of the program.\n12. The system of claim 11, wherein the first portion of the program and the second portion of the program are a same portion of the program.\n13. The system of claim 11, wherein the first portion of the program and the second portion of the program are a different portion of the program.\n14. The system of claim 10, wherein at least one of the first model and the second model is generated using probabilistic modeling that generates a density estimation of sequences of function calls.\n15. The system of claim 14, wherein the hardware processor is further programmed to:\napply first and second order consistency checks, wherein the first order consistency check comprises computing a first probability of an observation of a first given feature value and the second order consistency check comprises computing a second probability of the first given feature value given another feature value; and\nidentify the first given feature value as anomalous if at least one of the first probability and the second probability are less than a predetermined threshold probability.\n16. The system of claim 10, wherein at least one of the first model and the second model is generated using a one-class support vector machine.\n17. The system of claim 10, wherein the hardware processor is further programmed to:\ndetermine whether a function call from at least one of the first sequence of function calls and the second sequence of function calls has been executed less than a threshold number of times; and\nin response to the determination, identify the function call as having a greater likelihood of including an anomaly.\n18. The system of claim 10, wherein the hardware processor is further programmed to transmit at least one of the second model from the second computing device to the first computing device and the first model from the first computing device to the second computing device.\n19. A non-transitory computer-readable medium containing computer executable instructions that, when executed by a processor, cause the processor to perform a method of computing a model of program execution behavior, the method comprising:\nassigning a first sequence of function calls to a first computing device of an application community and a second sequence of function calls to a second computing device of the application community, wherein the application community includes a plurality of computing devices running a program that executes the first sequence of function calls and the second sequence of function calls;\nreceiving a first model of the first sequence of function calls from the first computing device and a second model of the second sequence of function calls from the second computing device;\nmodifying a combined model based at least in part on the first model and the second model; and\nnotifying at least one of the plurality of computing devices in the application community of an anomalous function call that was detected using the combined model.",
    "status": "Active",
    "citations_own": [
        "US5398196A",
        "GB2277151B",
        "US5696822A",
        "US5857071A",
        "US5964889A",
        "US5978917A",
        "US6067535A",
        "US6195024B1",
        "KR20010089062A",
        "US20020013691A1",
        "US6347374B1",
        "US20020026605A1",
        "US6357008B1",
        "US20020095607A1",
        "US20020133721A1",
        "US20020194490A1",
        "JP2002368820A",
        "US20030065926A1",
        "US20030070003A1",
        "US20030149700A1",
        "US20030159090A1",
        "US20030200462A1",
        "US6681331B1",
        "US6698016B1",
        "US20040042506A1",
        "US6718469B2",
        "US20040153644A1",
        "US20040153823A1",
        "US6775780B1",
        "US20040163079A1",
        "US20040205474A1",
        "US20040260947A1",
        "US20050038827A1",
        "US20050086333A1",
        "US20050086630A1",
        "US20050108562A1",
        "US20050198470A1",
        "US6952776B1",
        "US20050259678A1",
        "US6970924B1",
        "US20050273854A1",
        "US6983380B2",
        "US20060010495A1",
        "US20060021054A1",
        "US20060053180A1",
        "US7065657B1",
        "US7069583B2",
        "US7072876B1",
        "US20060156380A1",
        "US20060168329A1",
        "US7093239B1",
        "US7096215B2",
        "US20060195745A1",
        "US20060264694A1",
        "US20060265694A1",
        "US7146305B2",
        "US20060288415A1",
        "US7155708B2",
        "US20070006300A1",
        "US20070028220A1",
        "US7225343B1",
        "US20070283338A1",
        "US20080016574A1",
        "US7331062B2",
        "US7340666B1",
        "US7356736B2",
        "US7373524B2",
        "US20080148398A1",
        "US7392543B2",
        "US7409717B1",
        "US7412723B2",
        "US7448084B1",
        "US20090013316A1",
        "US20090037682A1",
        "US7496898B1",
        "US7523500B1",
        "US7526758B2",
        "US7639714B2",
        "US7644441B2",
        "US7647589B1",
        "US7716736B2",
        "US7735138B2",
        "US7748038B2",
        "US7818781B2",
        "US7832012B2",
        "US7877807B2",
        "US8074115B2",
        "US8108929B2",
        "US8135994B2",
        "US8341743B2",
        "US8528086B1"
    ],
    "citations_ftf": [
        "US5440723A",
        "US6108786A",
        "US6263348B1",
        "US6839850B1",
        "US6405318B1",
        "US7272855B1",
        "AU6103900A",
        "US6785818B1",
        "US6742124B1",
        "US6973577B1",
        "US7007301B2",
        "US7134141B2",
        "US6928549B2",
        "US20030084328A1",
        "US7836503B2",
        "US7334005B2"
    ],
    "citedby_own": [
        "US20220138042A1"
    ],
    "citedby_ftf": [
        "US8407785B2",
        "EP1952240A2",
        "WO2007050244A2",
        "US8510596B1",
        "WO2008055156A2",
        "US8407160B2",
        "US20080235001A1",
        "US9378108B2",
        "US9558019B2",
        "US8132157B2",
        "JP2009176180A",
        "JP5277667B2",
        "US10027688B2",
        "US8719823B2",
        "JP4572259B1",
        "US8479286B2",
        "US8578497B2",
        "US8826438B2",
        "US9300525B2",
        "US8819632B2",
        "US9516058B2",
        "KR101440299B1",
        "WO2012071989A1",
        "CN103839006B",
        "US8788884B2",
        "US8429744B1",
        "CN103853979B",
        "US8631489B2",
        "US8949672B1",
        "US9286182B2",
        "US9032528B2",
        "NL2007180C2",
        "EP2756366B1",
        "US8700946B2",
        "FR2984553B1",
        "US8990183B2",
        "DE102012012521A1",
        "US9430677B2",
        "CN104520806B",
        "US9542176B2",
        "US10547674B2",
        "US9680861B2",
        "US9166994B2",
        "US9894088B2",
        "US10084806B2",
        "RU2514141C1",
        "US20140173556A1",
        "US10127379B2",
        "US9792436B1",
        "US9571511B2",
        "WO2014210050A1",
        "JP2016534479A",
        "US9213831B2",
        "US9262296B1",
        "US8930916B1",
        "WO2015120243A1",
        "US9158604B1",
        "CA2953793C",
        "US9178902B1",
        "US9680646B2",
        "US9930065B2",
        "US9465940B1",
        "US9495633B2",
        "IN2015DE01177A",
        "US10152488B2",
        "US9846774B2",
        "CN106295337B",
        "US10037425B2",
        "US10140287B2",
        "US10063575B2",
        "US9923911B2",
        "CN106709336A",
        "US9823998B2",
        "US10440036B2",
        "WO2017111927A1",
        "US9985982B1",
        "JP6679943B2",
        "JP6827266B2",
        "US10432650B2",
        "EP3440819B1",
        "US10341391B1",
        "EP3472746B1",
        "WO2017221667A1",
        "US10241847B2",
        "US10430591B1",
        "US10565373B1",
        "US10733533B2",
        "RU2651196C1",
        "US10430584B2",
        "US20190362074A1",
        "CN109032918B",
        "US11200317B2",
        "US11138085B2",
        "US11144375B2",
        "US10657025B2",
        "US11263315B2",
        "US11250125B2",
        "US11089034B2",
        "US11153332B2",
        "US11323459B2",
        "US11392699B2",
        "CN110674495B",
        "CN110889117B",
        "US11586849B2",
        "EP4111343A1",
        "CN114265601A",
        "US11704403B2",
        "US11349732B1"
    ]
}