{
    "patent_link": "https://patents.google.com/patent/US4460918A/en",
    "patent_id": "US4460918A",
    "title": "Automatic switching circuit for a dual mode television receiver",
    "abstract": "A television signal receiving apparatus having a first input for receiving a composite video signal and a second input for receiving a direct-drive RGB signal includes an electronic switching circuit for automatically switching between composite video and RGB modes of operation. The switching circuit is responsive to the presence of the sync component of an RGB signal at the second input for automatically establishing the RGB mode of operation wherein only the input RGB signal is used to form the image display and is responsive to the absence of the sync component of the RGB signal at the second input for establishing the composite video mode of operation wherein the composite video signal at the first input is used to form the image display. Provisions are included for developing an override signal for allowing the development of a mixed mode image display.",
    "inventors": [
        "Michael D. Flasza"
    ],
    "assignee": "Zenith Electronics LLC",
    "classifications": [],
    "claims": "\n1. In a television signal receiving apparatus having red, green and blue video output stages, a first input for receiving a composite video signal and a second input for receiving an RGB signal including a sync component and red, green and blue video components, an electronic signal switching circuit comprising:\nmeans coupling the red, green and blue video components of the RGB signal from the second input to said red, green and blue video output stages respectively;\nchroma-luma processing means for deriving red, green and blue video components from the composite video signal received at the first input;\nmeans for coupling said derived red, green and blue video components to said red, green and blue video output stages respectively; and\ncomposite video blanking means operable in response to the presence of the sync component of the RGB siganl at the second input for blanking said derived red, green and blue video components.\n2. An electronic signal switching circuit according to claim 1 including means for isolating the red, green and blue video components of the RGB signal coupled to said video output stages from said composite video blanking means.\n3. An electronic signal switching circuit according to claim 1 including viewer operable means for developing a mixed mode signal for overriding said composite video blanking means so as to allow the red, green and blue video components of the RGB signal and the derived red, green and blue video components to be coupled to said red, green and blue video output stages respectively.\n4. An electronic signal switching circuit according to claim 1 wherein said television signal receiving apparatus includes a sync processing circuit and including sync switching means operable in response to the presence of the sync component of the RGB signal at the second input for coupling the sync component of the RGB signal to said sync processing circuit and otherwise operable for coupling the composite video signl from the first input to the sync processing circuit.\n5. An electronic signal switching circuit according to claim 4 including switching control means responsive to the sync component of the RGB signal at the second input for operating said composite video blanking means and said sync switching means.\n6. An electronic signal switching circuit according to claim 4 wherein said television signal receiving apparatus includes means for developing a horizontal flyback signal and a vertical high signal and including means for clamping each of said red, green and blue video components of the RGB signal coupled to said video output stages to a blanking level in response to said horizontal flyback signal and said vertical high signal.\n7. In a television signal receiving apparatus having a sync processing circuit, red, green and blue video output stages, a first input for receiving a composite video signal and a second input for receiving an RGB signal including a sync component and red, green and blue video components, an electronic signal switching circuit comprising:\nmeans coupling the red, green and blue video components of the RGB signal from the second input to said red, green and blue video output stages respectively;\nchroma-luma processing means for deriving red, green and blue video components from the composite video signal received at the first input;\nmeans for coupling said derived red, green and blue video components to said red, green and blue video output stages respectively;\nswitching control means for developing a control signal in response to the presence of the sync component of the RGB signal at said second input;\ncomposite video blanking means responsive to said control signal for blanking said derived red, green and blue video components; and\nsync switching means responsive to said control signal for coupling the sync component of the RGB signal to said sync processing circuit and otherwise coupling the composite video signal from the first input to the sync processing circuit.\n8. An electronic signal switching circuit according to claim 7 including means for isolating the red, green and blue video components of the RGB signal coupled to said video output stages from said composite video blanking means.\n9. An electronic signal switching circuit according to claim 7 including viewer operable means for developing a mixed mode signal for overriding said composite video blanking means so as to allow the red, green and blue video components of the RGB signal and the derived red, green and blue video components to be coupled to said red, green and blue video output stages respectively.\n10. An electronic signal switching circuit according to claim 7 wherein said television signal receiving apparatus includes means for developing a horizontal flyback signal and a vertical high signal and including means for clamping each of said red, green and blue video components of the RGB signal coupled to said video output stages to a blanking level in response to said horizontal flyback signal and said vertical high signal.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3969755A",
        "US4139865A",
        "US4149186A",
        "US4151557A",
        "US4167704A",
        "US4312016A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "FR2573601A1",
        "EP0199542A2",
        "US4644387A",
        "US4660073A",
        "FR2593659A1",
        "US4686698A",
        "US4709267A",
        "US4800423A",
        "US4800429A",
        "US4802000A",
        "US4954880A",
        "US5034818A",
        "US5287091A",
        "US5382982A",
        "US5610663A",
        "EP0762378A1",
        "WO1997010678A1",
        "US5875002A",
        "US5896179A",
        "US5978041A",
        "US6008861A",
        "US6073192A",
        "US6177961B1",
        "US6226044B1",
        "US6559893B1",
        "US20030147013A1",
        "US20030174156A1",
        "US6791623B1",
        "US20050128352A1",
        "US7321717B1",
        "CN100429932C",
        "US20090060046A1",
        "US7747702B2",
        "USRE44814E1"
    ],
    "citedby_ftf": []
}