{
    "patent_link": "https://patents.google.com/patent/US20060064415A1/en",
    "patent_id": "US20060064415A1",
    "title": "Data mining platform for bioinformatics and other knowledge discovery",
    "abstract": "The data mining platform comprises a plurality of system modules (500, 550), each formed from a plurality of components. Each module has an input data component (502, 552), a data analysis engine (504, 554) for processing the input data, an output data component (506, 556) for outputting the results of the data analysis, and a web server (510) to access and monitor the other modules within the unit and to provide communication to other units. Each module processes a different type of data, for example, a first module processes microarray (gene expression) data while a second module processes biomedical literature on the Internet for information supporting relationships between genes and diseases and gene functionality",
    "inventors": [
        "Isabelle Guyon",
        "Edward Reiss",
        "Rene Doursat",
        "Jason Weston",
        "David Lewis"
    ],
    "assignee": "Health Discovery Corp",
    "classifications": [
        "G06N20/00",
        "G06F18/2113",
        "G06F18/2115",
        "G06F18/2411",
        "G06N20/10",
        "G06V10/764",
        "G06V10/771",
        "G16B25/10",
        "G16B40/00",
        "G16B40/10",
        "G16B40/20",
        "G16B40/30",
        "G16B50/00",
        "G16B50/20",
        "G16B25/00",
        "G16B45/00",
        "Y10S707/99936"
    ],
    "claims": "\n1. A computer-implemented data mining platform for generating an output comprising knowledge from analysis of a plurality of data sets, wherein the data sets include heterogeneous data types or the data sets come from heterogeneous data sources, the platform comprising:\na plurality of modules, each module adapted for processing one data type of the plurality of heterogeneous data types, each module comprising an input data source, a data analysis engine, a data output and a server connection for each of the input data source, the data analysis engine and the data output, wherein the data analysis engine comprises at least one processor for executing one or more support vector machines for generating a plurality of classes of data and at least one margin between classes, and one or more feature subset ranking algorithms;\na server connected to the server connection for communicating with each of the input data source, the data analysis engine and the data output and for providing means for monitoring one or more of the input data source, the data analysis engine, and the data output; and\na combined data analysis engine in communication with the server for combining the data output from the plurality of modules to generate a single output representing results obtained from analyzing the plurality of heterogeneous data types.\n2. (canceled)\n3. The data mining platform of claim 1, wherein the at least one processor further executes at least one pre-processing algorithm for pre-processing the input data.\n4. (canceled)\n5. The data mining platform of claim 1, wherein the feature subset ranking algorithm comprises recursive feature elimination.\n6. The data mining platform of claim 1, wherein the data analysis engine includes a visualization tool for displaying the results.\n7. The data mining platform of claim 1, wherein the one data type comprises gene expression data and wherein the data analysis engine generates a ranked list of genes.\n8. The data mining platform of claim 7, wherein the data analysis engine generates a gene observation tree for visually displaying the ranked list of genes.\n9. (canceled)\n10. The data mining platform of claim 3, wherein the pre-processing algorithm comprises one or more data-cleaning algorithm for removing data outliers.\n11. The data mining platform of claim 10, wherein the one or more data cleaning algorithm comprises ranking outliers according to one or more algorithm of SVM-α, SVM-ξ, and SUB-ERR.\n12. The data mining platform of claim 3, wherein the pre-processing algorithm comprises a feature ranking algorithm.\n13. The data mining platform of claim 12, wherein the feature ranking algorithm comprises determining a distance from a margin between classes.\n14. The data-mining platform of claim 1, wherein the at least one processor executes multiple runs of feature subset ranking on a plurality of sub-samples of the same data set and further executes an algorithm to organize the results of feature subset ranking in a graph.\n15. The data-mining platform of claim 14, wherein the graph is a tree.\n16. The data-mining platform of claim 1, wherein the at least one processor executes multiple runs of feature subset ranking on multiple data sets including heterogeneous data types or from heterogeneous data sources to produce ranked lists of subsets and further executes an algorithm to merge the ranked lists of subsets of features into a single ranked list of subset of features.\n17. The data-mining platform of claim 12, wherein the at least one processor executes multiple feature ranking algorithms on multiple data sets including heterogeneous data types or from heterogeneous data sources to produce ranked lists of features and further executes an algorithm to merge the ranked lists of features into a single ranked list of features.\n18. The data-mining platform of claim 1, wherein the at least one processor executes an algorithm to merge into a single graph a structure of features previously obtained, including ranked lists of subsets of features, ranked lists of features, or trees of features.\n19. The data mining platform of any one of claim 1, wherein the one data type comprises gene expression data and the features are gene expression coefficients.\n20. The data mining platform of any one of claim 1, wherein the one data type comprises knowledge contained in published literature.\n21. The data mining platform of claim 1, wherein the data analysis engine validates an analysis obtained with one data type with the analysis obtained with another data type.\n22. The data mining of claim 7, wherein the data analysis engine generates a gene observation tree based on gene expression data.\n23. The data mining of claim 22 wherein the gene observation tree has a plurality of the tree nodes that are linked to knowledge derived from the literature.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US6157921A"
    ],
    "citations_ftf": [
        "US5138694A",
        "IT1261090B",
        "US5495606A",
        "US5835755A",
        "US5793964A",
        "US5689698A",
        "US6112195A",
        "US6128624A",
        "US6658395B1",
        "US6996549B2",
        "US7117188B2",
        "US7444308B2",
        "US6760715B1",
        "US6789069B1",
        "US6606622B1",
        "US6470333B1",
        "US6266668B1",
        "US6714925B1",
        "EP1228447A2",
        "WO2001013105A1",
        "US20030009295A1",
        "US20030171876A1",
        "US20030100999A1",
        "US20020052882A1",
        "EP1364049A2",
        "AU2001294644A1",
        "EP1381971A2",
        "EP1360608A2",
        "US20020133504A1",
        "AU2002217904A1",
        "US6944602B2",
        "US6789091B2",
        "AU2002305652A1"
    ],
    "citedby_own": [
        "US20030120458A1",
        "US20040193652A1",
        "US20040255252A1",
        "US20050008148A1",
        "US20050102303A1",
        "US20050108025A1",
        "US20050228591A1",
        "US20050283464A1",
        "US20060015357A1",
        "US20060271472A1",
        "US20060288031A1",
        "US20070011187A1",
        "US20070011135A1",
        "US20070033122A1",
        "US20070033126A1",
        "US20070118399A1",
        "US20080021898A1",
        "US20080021677A1",
        "US20080033999A1",
        "US20080046402A1",
        "US20080097939A1",
        "US20080097938A1",
        "US20080183454A1",
        "US20080228735A1",
        "US20080275731A1",
        "US20080281530A1",
        "US20090019065A1",
        "US20090132450A1",
        "WO2009103156A1",
        "US20100063930A1",
        "US20100099891A1",
        "US7711747B2",
        "US7797692B1",
        "US20110145652A1",
        "US20120004893A1",
        "US8200509B2",
        "WO2012033976A3",
        "US20120197827A1",
        "US8255403B2",
        "US8386519B2",
        "US20130054577A1",
        "US8392152B2",
        "US20130166599A1",
        "US20130328880A1",
        "US20140074864A1",
        "WO2014043623A1",
        "US8682693B2",
        "US20140186808A1",
        "US8788286B2",
        "CN104021199A",
        "US20150039331A1",
        "US20150039325A1",
        "US9031870B2",
        "US20150339363A1",
        "EP2786267A4",
        "US9633166B2",
        "US9846885B1",
        "US20180081912A1",
        "US20190034767A1",
        "US20190221311A1",
        "CN110046236A",
        "US20190279738A1",
        "US20190384777A1",
        "US10936962B1",
        "US10943676B2",
        "US11151653B1",
        "US11322227B2",
        "US11501241B2",
        "US11545250B2",
        "US11553872B2"
    ],
    "citedby_ftf": [
        "US6735253B1",
        "US7143434B1",
        "US6714925B1",
        "US7970718B2",
        "AUPQ684400A0",
        "US8543519B2",
        "US20040172225A1",
        "US7339992B2",
        "WO2003091850A2",
        "US20060155584A1",
        "WO2006096612A2",
        "JP4646681B2",
        "EP1907995A2",
        "US7624066B2",
        "US7610255B2",
        "US20080140623A1",
        "US7465241B2",
        "US8126881B1",
        "RU2497193C2",
        "WO2009126785A2",
        "WO2009155281A1",
        "US8121967B2",
        "US20100057603A1",
        "WO2010030794A1",
        "WO2010075408A1",
        "US8671069B2",
        "JP5714001B2",
        "US8935258B2",
        "US8229866B2",
        "US9218187B2",
        "US8407171B2",
        "US8874378B2",
        "US9208405B2",
        "DE102011002928A1",
        "JP6199297B2",
        "US8768921B2",
        "US8873813B2",
        "US9916538B2",
        "US11074495B2",
        "US10007946B1",
        "US9465873B1",
        "US9104718B1",
        "US9830635B1",
        "US10127596B1",
        "US20150206064A1",
        "US11195057B2",
        "WO2016077416A1",
        "KR101623431B1",
        "US10446259B2",
        "US11250958B2",
        "WO2018145201A1",
        "CN109559214A",
        "US10268704B1",
        "US11631497B2",
        "EP3575813B1",
        "US11354591B2",
        "US11398297B2",
        "CN111861519A",
        "US20220202169A1",
        "US10515715B1",
        "CA3157134A1",
        "CA3076653A1",
        "US11145401B1",
        "CN113017650B"
    ]
}