{
    "patent_link": "https://patents.google.com/patent/US4475193A/en",
    "patent_id": "US4475193A",
    "title": "Power line carrier multi telephone extension system for full duplex conferencing between telephones",
    "abstract": "In a power line carrier telephone extension system for transmitting electrical signals between the telephone line and an extension telephone over the AC electric power line available at a telephone subscriber's premises, that includes a main station for processing signals between the subscriber's telephone line and power lines and an extension telephone of the system that plugs into the power line, means that provides for a plurality of such extension telephones all of which can place calls to the telephone line, answer calls from the telephone line and conference together in full duplex communication.",
    "inventors": [
        "William M. Brown"
    ],
    "assignee": "Astech Inc",
    "classifications": [
        "H04B3/54",
        "H04M1/71",
        "H04B2203/5437"
    ],
    "claims": "\n1. A System for signalling between stations on the power line in a building comprising,\n(a) a main station, denoted M, and one or more (up to N) satellite stations denoted E1, E2--En--EN.\n(b) a the M station:\n(b1) an M transmitter that transmits information signals as modulations of the carrier frequency Fm,\n(b2) N receivers, one for each of the satellite stations, each for receiving a corresponding one of the satellite carrier frequencies F1, F2,--Fn-FN, each receiver detecting the corresponding satellite station information signal modulations of the station carrier frequency Fn and producing an output, representative thereof,\n(b3) means for combining the outputs for said M receivers producing a combined receiver output signal, referred to herein as MRXN,\n(b4) means for coupling said MRXN to the input of the M transmitter, and\n(b5) means for coupling the inputs to the said N receivers and the output of the M transmitter to the power line in the building;\n(b6) whereby all information signals from the N receivers are transmitted over the power line on the carrier Fm; and\n(c) at each satellite station, En:\n(c1) an En receiver for receiving Fm,\n(c2) an En transmitter for transmitting information signals as modulations of the station carrier frequency Fn,\n(c3) a source of En information signals,\n(c4) an En received signal utilization device,\n(c5) means for coupling the En source output to the En transmitter input,\n(c6) means for coupling the En receiver output to the En utilization device, and\n(c7) means for coupling the input of the En receiver and the output of the En transmitter to the power line in the building;\n(d) whereby two or more of said satellite stations can communicate with each other simultaneously, full duplex.\n2. A system as in claim 1, wherein the means at the M station for coupling the inputs of the N receivers and the output of the M transmitter to the power line of the building includes:\n(a) an M station input-output (RX-TX) transformer having primary and secondary sides,\n(b) an M station adaptor plug (AP) transformer having primary and secondary sides,\n(c) said M station RX-TX and AP transformers are coupled as follows:\n(c1) the inputs of each of the N receivers couple to the M RX-TX transformer,\n(c2) the output of the M transmitter couples to the M RX-TX transformer,\n(c3) one side of the M RX-TX transformer couples to one side of the M AP transformer and\n(c4) the other side of the M AP transformer connects to the power line.\n3. A System as in claim 2 wherein the said other side of the M AP transformer is an inductance-capacitance circuit.\n4. A System as in claim 2 wherein,\n(a) the M transmitter output couples to the other side of the M RX-TX transformer and\n(b) the inputs to each of the N receivers couple to the one side of the M RX-TX transformer.\n5. A System as in claim 4 wherein, the inputs to each of the N receivers are in electrical series and said series is in electrical series with the said one side of the M RX-TX transformer.\n6. A System as in claim 1 wherein all means at the M station are contained in at least two separate envelopes including a first and a second M envelope, of which the first contains the M transmitter, the N receivers and the M RX-TX transformer and the second contains the M AP transformer and the envelopes are connected by an electrical cable.\n7. A System as in claim 6 wherein the second envelope has electrical contacts projecting there from for connection to the power line at a conventiona1 power line receptacle and is of sufficiently small size and weight that it is held at the receptacle by the projecting contacts.\n8. A System as in claim 7 and further including a source of power at the M station including:\n(a) an M power transformer (PT) having primary and secondary sides,\n(b) an M voltage regulator,\n(c) one side of the M PT connects to the power line and the other side connects to the M voltage regulator, and\n(d) the M voltage regulator is contained in the first envelope and the M PT is contained in the second envelope.\n9. A System as in claim 1 wherein the means at each satellite station En for coupling the input of the En receiver and the output of the En transmitter to the power line of the building includes:\n(a) an En station input-output (RX-TX) transformer having primary and secondary sides,\n(b) an En station adaptor plug (AP) having primary and secondary sides,\n(c) said En station RX-TX and AP transformers are coupled as follows:\n(c1) the input to the En receiver couples to the En RX-TX transformer,\n(c2) the output of the En transmitter couples to the En RX-TX transformer,\n(c3) one side of the En RX-TX transformer couples to one side of the En AP transformer, and\n(c4) the other side of the En AP transformer connects to the power line.\n10. A System as in claim 9 wherein,\n(a) the En transmitter output couples to the other side of the En RX-TX transformer, and\n(b) the input to the En receiver couples to one side of the RX-TX transformer.\n11. A System as in claim 10 wherein, the input of the En receiver is an electrical series with said one side of the En RX-TX transformer.\n12. A System as in claim 9 wherein, all means at the En station is contained in at least two separate envelopes, including first and second En envelope, of which the first contains the En transmitter, the En receiver and the En RX-TX transformer and the second contains the En AP transformer and the envelopes are connected by an electric cable.\n13. A System as in claim 11 wherein the second envelope has electrical contacts projecting therefrom for connection to the power line at a conventional power line receptacle and is of sufficiently small size and weight that it is held at the receptacle by the projecting contacts.\n14. A power line RF carrier telephone extension system for signalling between (1) a telephone subscriber's telephone line of a conventional telephone communication system wherein a separate telephone line is provided from a central switching system at one location to each subscriber at the subscriber's premises and each subscriber's telephone line includes at least two wires, the ring line and the tip line and, (2) each of one or more extension telephones by RF carrier over the available power line at the subscriber's premises, including at the subscriber's premises: a subscriber main station (M) near said subscriber telephone line and having access to said power line and one or more (up to N) subscriber extension stations (E1, E2 ---En--- EN), each having access to said power line, comprising,\n(a) at the M station:\n(a1) means connected to the telephone line for detecting audio frequency signals on the telephone line, referred to herein as TL signals,\n(a2) an M transmitter including means for producing a main carrier frequency, Fm, and modulating means for modulating Fm,\n(a3) N receivers, one for each of the En stations, each receiver for receiving a different one of the En stations transmitted RF carrier frequencies, F1, F2 --Fn ---FN and including an Fn demodulator, and producing modulations of Fn in the output thereof,\n(a4) means for combining the outputs of said N receivers, producing a combined receiver output signal, referred to herein as MRXN,\n(a5) means for combining the detected TL and MRXN signals and, coupling the combined signals to the input of the transmitter, said transmitter input of the transmitter, said transmitter input being referred to herein as MTX, and\n(a6) means for coupling the transmitter output to the power line,\nwhereby the power line carries the modulated Fm to the NE stations; and\n(b) at each E station, denoted generally as En:\n(b1) an En telephone,\n(b2) a source of power for the En telephone, whereby the En telephone produces audio and dial signals when it is used,\n(b3) an En receiver for modulated Fm including an Fm demodulator, and producing the modulations of Fm in the output thereof, referred to herein as EnRX,\n(b4) means for coupling modulated Fm from the power line to the input of the receiver and\n(b5) means for coupling said EnRX to the En telephone,\nwhereby the En telephone receives the TL and MRXN signals,\n(b6) the extension telephone producing information signals, which may include audio and data signals, and dial signal and a telephone line hold signal when it is used by the subscriber,\n(b7) an En transmitter including means for producing the En telephone carrier frequency, Fn and modulating means for modulating Fn by the En telephone audio signals and signals representative of the En dial signals and hold signal producing modulated Fn and (b7) means for coupling the modulated Fn to the power line,\nwhereby the power line carries the modulated Fn to the main station and telephone calls from the telephone line can be answered by any of the E1, E2 -- En---EN telephones and telephone calls can be made to the telephone line by any of the E1, E2 --En ---EN telephones and any or all of the E1, E2 --En telephones can conference on a telephone line call.\n15. A System as in claim 14, wherein the means at the M station for coupling the inputs to the receivers and the output of the M transmitter to the power line of the building includes:\n(a) an M station input-output (RX-TX) transformer having primary and secondary sides,\n(b) an M adaptor plug (AP) transformer having primary and secondary sides,\n(c) said M station RX-TX and AP transformers are coupled as follows:\n(c1) the inputs into each of the N receivers couple to the M RX-TX transformer,\n(c2) the output of the M transmitter couples to the M RX-TX transformer,\n(c3) one side of the M RX-TX transformer couples to one side of the M AP transformer and\n(c4) the other side of the M AP transformer connects to the power line.\n16. A System as in claim 15 wherein the said other side of the AP transformer is an inductance-capacitance circuit.\n17. A System as in claim 15 wherein,\n(a) the M transmitter output couples to the other side of the M RX-TX transformer and\n(b) the inputs to each of the N receivers couple to the one side of the M RX-TX transformer.\n18. A System as in claim 17 wherein, the inputs to each of the M receivers are in electrical series and said series is in electrical series with the said one side of the M RX-TX transformer.\n19. A System as in claim 18 wherein all means at the M station are contained in at least two separate enevelopes including a first and a second M envelope, of which the first contains the N transmitter, the M receivers and the M RX-TX transformer and the second contains the M AP transformer and the envelopes are connected by an electrical cable.\n20. A System as in claim 19 wherein the second envelope has electrical contacts projecting there from for connection to the power line at a conventional power line receptacle and is of sufficiently small size and weight that it is held at the receptacle by the projecting contacts.\n21. A System as in claim 20 and further including a source of power at the M station including:\n(a) an M power transformer having (PT) primary and secondary sides,\n(b) an M voltage regulator,\n(c) one side of M PT connects to the power line and the other side connects to the M voltage regulator, and\n(d) the M voltage regulator is contained in the first envelope and the M PT is contained in the second envelope.\n22. A System as in claim 14 wherein the means at each of the E stations (En) for coupling the input of the receiver and the output of the transmitter to the power line of the building includes:\n(a) an En station input-output (RX-TX) transformer having primary and secondary sides,\n(b) an En station adaptor plug (AP) having primary and secondary sides,\n(c) said En station RX-TX and AP transformers are coupled as follows:\n(c1) the input to the En receiver couples to the En RX-TX transformer,\n(c2) the output of the En transmitter couples to the En RX-TX transformer,\n(c3) one side of the En RX-TX transformer couples to one side of the En AP transformer, and\n(c4) the other side of the En AP transformer connects to the power line.\n23. A System as in claim 22 wherein,\n(a) the En transmitter output couples to the other side of the En RX-TX transformer, and\n(b) the input to the En receiver couples to one side of the En RX-TX transformer.\n24. A System as in claim 23 wherein, the input of the En receiver is an electrical series with said one side of the En RX-TX transformer.\n25. A System as in claim 22 wherein, all means at the En station is contained in at least two separate envelopes, including a first and a second En envelope of which the first contains the En transmitter, the En receiver and the En RX-TX transformer and the second contains the En AP transformer and the envelopes are connected by an electric cable.\n26. A System as in claim 24 wherein the second envelope has electrical contacts projecting therefrom for connection to the power line at a conventional power line receptacle and is of sufficiently small size and weight that it is held at the receptacle by the projecting contacts.\n27. A telephone extension system for signalling between (1) a telephone subscriber's telephone line of a conventional telephone communication system wherein a separate telephone line is provided from a central switching system at one location to each subscriber at the subscriber's premises and each subscriber's telephone line includes at least two wires, the ring line and the tip line and, (2) each of one or more extension telephones by RF carrier over transmission line line at the subscriber's premises, including at the subscriber's premises: a subscriber main station (M) near said subscriber telephone line and having access to said transmission line and one or more (up to N) subscriber extension stations (E1, E2 ---En--- EN), each having access to said transmission line, comprising,\n(a) at the M station:\n(a1) means connected to the telephone line for detecting audio frequency signals on the telephone line, referred to herein as TL signals,\n(a2) an M transmitter including means for producing a main carrier frequency, Fm, and modulating means for modulating Fm,\n(a3) N receivers, one for each of the En stations, each receiver for receiving a different one of the En stations transmitted RF carrier frequencies, F1, F2-- Fn---FN and including an Fn demodulator, and producing modulations of Fn in the output thereof,\n(a4) means for combining the outputs of said N receivers, producing a combined receiver output signal, referred to herein as MRXN,\n(a5) means for combining the detected TL and MRXN signals and, coupling the combined signals to the input of the transmitter, said transmitter input being referred to herein as MTX, and\n(a6) means for coupling the transmitter output to the transmission line,\nwhereby the transmission line carries the modulated Fm to the NE stations; and\n(b) at each E station, denoted generally as En:\n(b1) an En telephone,\n(b2) a source of power for the En telephone, whereby the En telephone produces audio and dial signals when it is used,\n(b3) an En receiver for modulated Fm including an Fm demodulator, and producing the modulations of Fm in the output thereof, referred to herein as EnRX,\n(b4) means for coupling modulated Fm from the transmission line to the input of the receiver and\n(b5) means for coupling said EnRX to the En telephone,\nwhereby the En telephone receives the TL and MRXN signals,\n(b6) the extension telephone producing information signals, which may include audio, dial and command signals when it is used by the subscriber,\n(b7) an En transmitter including means for producing the En telephone carrier frequency, Fn, and modulating means for modulating Fn by the En telephone audio signals and signals representative of the En dial signals producing modulated Fn and command (b7) means for coupling the modulated Fn to the transmission line,\nwhereby the transmission line carries the modulated Fn to the main station and telephone calls from the telephone line can be answered by any of the E1, E2 -- En---EN telephones and any or all of the E1, E2 --En ---EN telephones can conference on a telephone line call.\n28. A System as in claim 27 wherein,\n(a) each dial and command signal produced at an E station is a digital code word consisting of several binary bits that signify the dial or command signal by the E station,\n(b) whereby the said signal code word is modulated by the E station carrier frequency (Fn) and launched onto the transmission line at the station, and\n(c) means are provided at the M station for storing the signal code word, for comparing the detected code word with the stored code word and for controlling a dialing or command device depending upon said comparison,\n(d) whereby only code words that satisfy said comparison are effective to accomplish the dialing or command.\n29. A system as in claim 28 and further including:\n(a) means at the E station for producing and adding to each dial and command code word to be transmitted a digital address word, called the address word to preceed the code word in time and to consist of several binary bits that signify the address of the E station,\n(b) whereby the address word followed by the code word is modulated by the E station carrier frequency and launched onto the transmission line at the station, and\n(c) means are provided at the M station for storing the address codes of the E stations, for detecting such address words from the received RF carrier, for comparing such detected address words with the stored address codes and for controlling the detection of the received signal depending upon said comparison,\n(d) whereby only dial and command code signals preceeded by a stored address code are detected at the M station.\n30. A System as in claim 29 and further including,\n(a) means at the E station for producing and adding a digital check word called the check word, following an address word and a dial or command word and consisting of several binary bits that signify a predetermined combination of the preceeding address and dial or command words,\n(b) whereby the address word followed by the code word followed by the check word are modulated by the E station carrier frequency and launched onto the transmission line at the TX station, and\n(c) means at the M station for combining the detected address and dial or command code words and comparing the combination with the detected check word and for controlling the detection of the received signal depending upon said comparison,\n(d) whereby only dial or command code words preceeded by address and followed by check words for which the detected address and code words combine to compare in the predetermined combination manner with the detected check word are detected.\n31. A System as in claim in 27 wherein,\n(a) the RF carrier modulation by the information signals that are analog (such as the audio) is frequency modulation, the RF carrier modulation by the binary bits is digitally modulated frequency shift keying, and\n(b) the percent modulation of the binary bits is greater than the percent modulation of the analog signal.\n32. A System as in claim 31 wherein,\n(a) each binary bit has a value of binary \"1\" or binary \"0\" and is represented by one of two states of the RF carrier transmission,\n(b) the two states are on and off, and\n(c) each bit is represented by a combination of both on and off states, the combination for \"1\" bit being different than the combination for \"0\" bit, and\n(d) whereby each bit is initiated by a switching in state of the transmitter between the on and off states.\n33. A System as in claim 32 and further including,\n(a) means at the M station for integrating received RF carrier over the time interval of each bit, and\n(b) means responsive thereto for determining the value of the bit.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3864521A",
        "US3949172A",
        "US4058678A",
        "US4239940A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4734932A",
        "US4996709A",
        "US5125077A",
        "US5319634A",
        "US5434913A",
        "US5490247A",
        "US5493568A",
        "US5502762A",
        "US5506954A",
        "US5530737A",
        "US5555258A",
        "US5566339A",
        "US5566238A",
        "US5572438A",
        "US5574934A",
        "US5579389A",
        "US5600797A",
        "US5631967A",
        "US5673393A",
        "US5708701A",
        "US5717685A",
        "US5754765A",
        "US5805053A",
        "US5805582A",
        "US5809237A",
        "US5818821A",
        "US5862388A",
        "US5896556A",
        "US5911119A",
        "US5924486A",
        "US5949891A",
        "US5952914A",
        "US5970127A",
        "US6014386A",
        "US6035026A",
        "US6055435A",
        "US6058104A",
        "US6107912A",
        "US6125398A",
        "US6212547B1",
        "US6243571B1",
        "EP1104599A1",
        "US6404761B1",
        "US6418131B1",
        "US20020124051A1",
        "WO2002093878A1",
        "US6487175B1",
        "US20040047406A1",
        "US6717510B1",
        "US20040117330A1",
        "US6778817B1",
        "US6898620B1",
        "US20070043478A1",
        "US7185054B1",
        "US20070093672A1",
        "US7274688B2",
        "US7436842B2",
        "US7522714B2",
        "US7542554B2",
        "US7656904B2",
        "US7747702B2",
        "US7818367B2",
        "US7852874B2",
        "US7873058B2",
        "US7876767B2",
        "US20110130887A1",
        "USRE44814E1",
        "US10986165B2"
    ],
    "citedby_ftf": []
}