{
    "patent_link": "https://patents.google.com/patent/US5917900A/en",
    "patent_id": "US5917900A",
    "title": "Remote data gateway",
    "abstract": "A system and method for permitting a customer to perform intelligent call routing (ICR) in a carrier's network. A Remote Data Gateway (RDG) permits customers to control the routing of their call traffic on the carrier's network. The RDG provides the routing and delivery of call processing queries, generated on the carrier's network, to a Customer Access Point (CAP). The customer can use the CAP to perform ICR and other call processing functions. The results are sent as a response back to the RDG, which delivers the response to the carrier's network for implementation. Features provided by the RDG include improved security, improved service reliability, message and protocol translation, and maximum efficiency of network and system resources through a dynamic registration process.",
    "inventors": [
        "Jeffrey E. Allison",
        "Christine S. Chaney",
        "Adam David Mermel",
        "Frances D. E. Taylor"
    ],
    "assignee": "Verizon Patent and Licensing Inc",
    "classifications": [
        "H04Q3/0029",
        "H04Q3/66",
        "H04Q2213/13095",
        "H04Q2213/13141",
        "H04Q2213/13167",
        "H04Q2213/13196",
        "H04Q2213/13204",
        "H04Q2213/13213",
        "H04Q2213/13345",
        "H04Q2213/13349"
    ],
    "claims": "\n1. A system for processing a call in a telecommunications network, comprising:\na first primary remote data gateway locally associated with a first data access point, said first primary remote data gateway operative to receive a call processing query from said first data access point at said locally associated remote data gateway, said call processing query including a request for call routing instructions;\nmeans for translating said call processing query to a customer message format and customer protocol; and\nmeans for sending said translated call processing query to a customer access point for processing.\n2. The method of claim 1, further including:\na back-up remote data gateway associated with said first data access point; said back-up remote data gateway configured in a hot cutover mode to provide continuity of processing of said call processing query in the event of a prime remote data gateway failure.\n3. The system of claim 2, further comprising:\nmeans for activating a trigger point in a call processing plan at said data access point when a link to said customer access point is established;\nmeans for deactivating said trigger point when said link to said customer access point is disestablished; and\nmeans for using default routing for a call when processing for said call at said data access point reaches said trigger point and said trigger point is not activated.\n4. The system of claim 3, further comprising:\nmeans for sending a heartbeat message to said customer access point to determine whether said link has been disestablished; and\nmeans for attempting to reestablish said link when said link is determined to be disestablished.\n5. A method for processing a call in a telecommunications network, comprising the steps of:\nlocally associating a first primary remote data gateway with a first data access point;\nreceiving a call processing query from said first data access point at said locally associated remote data gateway, said call processing query including a request for call routing instructions;\ntranslating said call processing query to a customer message format and customer protocol; and\nsending said translated call processing query to a customer access point for processing.\n6. The method of claim 5, further including the steps of:\nassociating a back-up remote data gateway with said first data access point; and\nconfiguring said back-up remote data gateway in a hot cutover mode to provide continuity of processing of said call processing query in the event of a prime remote data gateway failure.\n7. The method of claim 6, further comprising the steps of:\nactivating a trigger point in a call processing plan at said data access point when a link to said customer access point is established;\ndeactivating said trigger point when said link to said customer access point is disestablished; and\nusing default routing for a call when processing for said call at said data access point reaches said trigger point and said trigger point is not activated.\n8. The method of claim 7, further comprising the step of:\nsending a heartbeat message to said customer access point to determine whether said link has been disestablished; and\nattempting to reestablish said link when said link is determined to be disestablished.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4953204A",
        "US5537611A",
        "US5787160A",
        "US5787163A"
    ],
    "citations_ftf": [
        "US5153909A",
        "EP0706743B1",
        "AU704385B2",
        "EP0866625A1"
    ],
    "citedby_own": [
        "US6185288B1",
        "US6324183B1",
        "US20010049730A1",
        "US20010054158A1",
        "US6366658B1",
        "US6389126B1",
        "US6418205B2",
        "US6427002B2",
        "US6427071B1",
        "US20020105969A1",
        "US20020131400A1",
        "US6493353B2",
        "US6496567B1",
        "US6510203B1",
        "US6532366B1",
        "US6647111B1",
        "US20030231653A1",
        "US6668051B1",
        "US6771649B1",
        "US6782004B1",
        "US20040252822A1",
        "US20050144600A1",
        "US20050181787A1",
        "US6940866B1",
        "US20050207448A1",
        "US6967956B1",
        "US6987781B1",
        "US20060013203A1",
        "US7113581B2",
        "EP1737252A1",
        "US20070097852A1",
        "US20070286740A1",
        "US7320017B1",
        "US7414995B1",
        "US20080212517A1",
        "US20080313288A1",
        "US20090034512A1",
        "US7532647B2",
        "EP2175681A1",
        "US7804789B2",
        "US8776206B1",
        "US9088478B2",
        "US9219677B2",
        "US20190191321A1"
    ],
    "citedby_ftf": []
}