{
    "patent_link": "https://patents.google.com/patent/US6388592B1/en",
    "patent_id": "US6388592B1",
    "title": "Using simulated pseudo data to speed up statistical predictive modeling from massive data sets",
    "abstract": "The computational cost of many statistical modeling algorithms is affected by the input/output (I/O) cost of accessing out-of-core training data. This is an important challenge for emerging data mining applications, where the amount of training data can be potentially enormous. A heuristic approach to this problem is described. This approach is based on constructing a simple probability model from the large training data set, and using this model to generate simulated pseudo data for some aspects of the statistical modeling procedure. This approach is illustrated in the context of building a Naive Bayes probability model with feature selection. Here, the usual algorithms would require numerous data scans over the massive training data set, but our heuristic obtains models of comparable accuracy with just two data scans.",
    "inventors": [
        "Ramesh Natarajan"
    ],
    "assignee": "International Business Machines Corp",
    "classifications": [],
    "claims": "\n1. A method for constructing statistical predictive models from massive training data sets in a computationally efficient way, the method comprising the steps of:\n2. A method for constructing statistical predictive models from massive training data sets as recited in claim 1, wherein this computational methodology is used to compute a Naive Bayes model with feature selection in only two data scans, compared to O(J2) data scans which would otherwise be required (J being the number of features in the model), the method further comprising of the steps of:\n3. The method for constructing statistical predictive models from massive training data sets as recited in claim 1, wherein this computational methodology is used to compute a Naive Bayes model with feature selection in only two data scans, compared to O(J2) data scans which would be required by a straightforward implementation (J being the number of features in the model), the method further comprising the steps of:\n4. The method for constructing statistical predictive models from massive training data sets as recited in claim 3, wherein in step (a)(i), the number of occurrences of each response category is Nk and the priors πk are estimated using the response frequencies in the training data as\nπ\nk\n=\nN\nk\n+\nλ\nk\nN\n+\n∑\nk\n′\n=\n1\nK\n\n\nλ\nk\n′\n,\n5. The method for constructing statistical predictive models from massive training data sets as recited in claim 4, wherein the independence assumption in step (b)(ii) is given by P(X=x|y=k)=Πj=1 JP(Xj=xj|y=k), which states that the covariates {Xj}j=1 J in X are all conditionally independent given a response y.\n6. The method for constructing statistical predictive models from massive training data sets as recited in claim 5, wherein in step (c)(i) the maximum likelihood function is defined by\n\nTR\n=\n-\n∑\nk\n=\n1\nK\n\n\nN\nk\nN\n\n[\nlog\n\n\nπ\nk\n+\n∑\nj\n=\n1\nJ\n\n\n∑\nm\n=\n1\nM\nj\n\n\nN\njmk\nN\nk\n\nlog\n\n\nP\njmk\n]\n\nA\n=\n+\n1\nN\n\n∑\ni\n=\n1\nN\n\n\nlog\n\n\n(\n∑\nk\n′\n\n{\n∏\nj\n=\n1\nJ\n\n\nP\njx\nj\n,\ni\n\nk\n′\n}\n\nπ\nk\n′\n)\n\nB\n,\n7. The method for constructing statistical predictive models from massive training data sets as recited in claim 6, wherein in step (d)(i) the BIC-penalized log-likelihood is evaluated exactly using Ĵ from a penalized form of TR in the form",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US6182058B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20020147697A1",
        "US6611837B2",
        "US20030208457A1",
        "US20040024786A1",
        "US6738786B2",
        "GB2395301A",
        "US6745189B2",
        "US20040111169A1",
        "US20040181498A1",
        "US20040225631A1",
        "US6823328B2",
        "US20040236758A1",
        "US20050125474A1",
        "US6931393B1",
        "US6963876B2",
        "US7010606B1",
        "US7051037B1",
        "US7079626B2",
        "US7092941B1",
        "US20060293950A1",
        "US20070219974A1",
        "US20070220034A1",
        "US20080028062A1",
        "US20080120263A1",
        "US20080235208A1",
        "US20110022369A1",
        "US7912773B1",
        "US8015133B1",
        "US8190512B1",
        "US8498931B2",
        "US8515862B2",
        "US8768866B2",
        "CN104239516A",
        "US9231979B2",
        "US20160283869A1",
        "US9594907B2",
        "CN107451694A",
        "CN111929641A",
        "US10997277B1",
        "US11030635B2"
    ],
    "citedby_ftf": []
}