{
    "patent_link": "https://patents.google.com/patent/US4754410A/en",
    "patent_id": "US4754410A",
    "title": "Automated rule based process control method with feedback and apparatus therefor",
    "abstract": "The present invention provides a rule based process control system which automatically learns how to control a process by inducing control rules from the process as it changes. During process operation data samples from the process are collected which include the controllable variables in the process along with the dependent variable (goal or goals) of the process. If a sample is not predicted by the current rules that control the process, new rules are induced from the new sample and previously collected samples by creating a decision tree. The controllable variable having the greatest effect on the goal occupies the highest tree node. New rules are produced from the decision tree which predict process behavior based on the new and old samples. From these new rules, control rules which satisfy system constraints and improve on the goal(s) are selected. The control rules are then used to control the process until another sample is not predicted by the new rules. In this manner, data samples are collected and saved which represent the possible states of the process and from which rules for controlling the process are produced. As the sample set grows, the domain in which the process can be predictably controlled also grows. If the sample set is allowed to grow infinitely, all the rules for controlling the system can be produced. As a result, the system learns how to control the process under varying conditions and induces rules that optimize the process toward the desired goal.",
    "inventors": [
        "William J. Leech",
        "Thomas N. Dean"
    ],
    "assignee": "CBS Corp",
    "classifications": [
        "G06F17/00",
        "G06N5/04",
        "B65H67/0405",
        "D01H9/00",
        "D01H9/003",
        "G05B13/028",
        "G06N5/025",
        "B65H2701/31",
        "Y10S706/906"
    ],
    "claims": "\n1. A method of controlling a process having a process goal and control settings, comprising the steps of:\n(a) operating the process at current settings in accordance with a current rule;\n(b) sampling the process and determining whether a current sample representing a current state of the process is predicted by the current rule;\n(c) inducing a new rule when the sample is not predicted by the current rule and combining the current rule with the new rule to produce a combined rule;\n(d) changing the control settings in accordance with the combined rule when the combined rule will move the process toward the goal; and\n(e) operating the process at the changed control settings.\n2. A method as recited in claim 1, wherein step (b) comprises the steps of:\n(b1) comparing the current sample goal with a rule goal;\n(b2) discarding the current sample if the current sample goal indicates the rule goal is satisfied; and\n(b3) saving the current sample in a rule sample data set if the current sample goal indicates rule goal is not satisfied.\n3. A method as recited in claim 2, wherein step (c) comprises the steps of:\n(c1) applying a classification function to the rule sample data set to produce a decision tree;\n(c2) generating a rule from the decision tree.\n4. A process as recited in claim 3, wherein step (c1) comprises the steps of:\n(i) calculating information gain for rule attributes using a weighting factor for each attribute;\n(ii) selecting as a decision tree node the attribute with the greatest information gain;\n(iii) subdividing the rule sample data set into subsets in dependence on the attribute selected; and\n(iv) repeating steps (i)-(iii) for each subset.\n5. A process as recited in claim 4 wherein step (c1) includes determining whether rules induction constraints have been met.\n6. A process as recited in claim 4, wherein an attribute comprises one of a numeric control variable and a logical control variable.\n7. A method as recited in claim 3, wherein step (d) comprises the steps of:\n(d1) discarding rules which do not satisfy the goal;\n(d2) discarding rules which do not satisfy system constraints;\n(d3) selecting a rule which allows improvements in the goal; and\n(d4) changing the control settings in accordance with a change control strategy for the rule selected.\n8. A process control system apparatus using control settings and having a process goal, comprising:\nprocess sensing means for sensing values of controllable variables in the process;\nprocess control means for controlling the process in dependence on the control settings; and\ncontrol setting means for controlling the process in dependence on a current control rule having current control settings, inducing a substitute control rule including substitute control settings replacing the current control rule and current control settings when a data sample of the controllable variables is not predicted by the current control rule and outputting the substitute control settings to said process control means to control the process when the substitute control settings will move the process toward the goal.\n9. An apparatus as recited in claim 8, wherein said control setting means stores plural data samples and includes:\nclassification means for applying a classification function to the data samples and producing a decision tree; and\nmeans for generating a rule from the decision tree.\n10. An apparatus as recited in claim 9, wherein said classification means includes information gain means for calculating the information gain of each controllable variable using a weighting factor for each variable and selecting attributes for nodes of the tree that provide the greatest information gain.\n11. A method of controlling a process having control settings and a goal, comprising the steps of:\n(a) operating the process at current control settings in accordance with a current rule;\n(b) sampling the process and determining whether a current sample representing a current state of the process is predicted by the current rule;\n(c) inducing a new rule if the sample is not predicted by the current rule by applying an information gain classification function to produce a decision tree;\n(d) discarding rules which do not satisfy the goal and control setting change constraints and changing the control settings in accordance with the new rule; and\n(e) operating the process at the changed control settings.\n12. A process control system apparatus using control settings and having a process goal, comprising:\nprocess sensing means for sensing values of controllable variables in the process;\nprocess control means for controlling the process in dependence on the control settings; and\ncontrol setting means for controlling the process in dependence on a current control rule having current control settings, for inducing a substitute control rule, by applying a classification function to produce a decision tree and including substitute control settings, when a data sample of the controllable variables is not predicted by the current control rule and for outputting the substitute control settings to said process control means to control the process when the substitute control settings will move the process toward the goal.\n13. An apparatus as recited in claim 12, wherein said classification means includes information gain means for calculating the information gain of each controllable variable using a weighting factor for each variable and selecting attributes for nodes of the tree that provide the greatest information gain.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4328556A",
        "US4349869A",
        "US4458321A",
        "US4459259A",
        "US4472770A",
        "US4517468A",
        "US4563735A",
        "US4591983A",
        "US4595982A",
        "US4628435A",
        "US4642782A",
        "US4644479A",
        "US4649515A",
        "US4656603A",
        "US4658370A",
        "US4670848A",
        "US4675829A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4901229A",
        "US4907167A",
        "US4910691A",
        "US4947337A",
        "US5027305A",
        "US5027751A",
        "US5043863A",
        "US5051932A",
        "DE4108310A1",
        "US5058043A",
        "DE4121453A1",
        "US5109380A",
        "US5151984A",
        "EP0506038A2",
        "US5159685A",
        "US5172579A",
        "US5195029A",
        "US5208898A",
        "US5218669A",
        "US5239484A",
        "US5249260A",
        "US5251288A",
        "US5267141A",
        "US5280565A",
        "US5289563A",
        "US5377308A",
        "US5481649A",
        "US5487131A",
        "US5499193A",
        "US5541833A",
        "US5546507A",
        "US5732397A",
        "US5740321A",
        "US5761387A",
        "US5787409A",
        "US5787232A",
        "US5924077A",
        "US6018741A",
        "US6112190A",
        "US6112126A",
        "US6125339A",
        "US6157922A",
        "US6205441B1",
        "US6327550B1",
        "US6438532B1",
        "US6438741B1",
        "US20020123928A1",
        "US6470229B1",
        "US20020165841A1",
        "US6490574B1",
        "WO2002103544A1",
        "WO2003005134A2",
        "US6546363B1",
        "US20030115078A1",
        "US20030200075A1",
        "US20030200189A1",
        "US20030200191A1",
        "US20040019574A1",
        "US6782377B2",
        "US6801885B1",
        "US20050008227A1",
        "US20050033709A1",
        "US6865524B1",
        "US20060112056A1",
        "US7110956B1",
        "US7150030B1",
        "FR2887353A1",
        "US7185192B1",
        "US7240355B1",
        "US20070191992A1",
        "US20070202603A1",
        "US20080168016A1",
        "WO2008039565A3",
        "US20080281566A1",
        "US20090048025A1",
        "US20090048857A1",
        "US20090157362A1",
        "US7690013B1",
        "US7765039B1",
        "US20100306069A1",
        "US7949565B1",
        "US7970722B1",
        "US20110179011A1",
        "US20120041910A1",
        "US8315958B1",
        "US8964338B2",
        "US8974573B2",
        "US9121407B2",
        "US9140728B2",
        "US9285802B2",
        "US9310094B2",
        "US9310439B2",
        "US9551504B2",
        "US9638436B2",
        "US20170206468A1",
        "US9765979B2",
        "US9803902B2",
        "US9823632B2",
        "US9885507B2",
        "RU2697957C1",
        "US20200242611A1",
        "WO2020172295A1",
        "EP3858474A4",
        "US11486872B2",
        "US11605085B2",
        "US11704594B2"
    ],
    "citedby_ftf": [
        "DE3853077T2",
        "JPH02257221A",
        "IL94626A",
        "JP2978184B2",
        "WO1991006051A1",
        "JPH0699047B2",
        "US5267348A",
        "CA2095120A1",
        "US5586218A",
        "EP0575473B1",
        "JPH06180691A",
        "US5701399A",
        "GB2278936A",
        "JP7250027B2"
    ]
}