{
    "patent_link": "https://patents.google.com/patent/US20070055153A1/en",
    "patent_id": "US20070055153A1",
    "title": "Medical diagnostic imaging optimization based on anatomy recognition",
    "abstract": "Anatomical information is identified from a medical image and/or used for controlling a medical diagnostic imaging system, such as an ultrasound system. To identify anatomical information from a medical image, a processor applies a multi-class classifier. The anatomical information is used to set an imaging parameter of the medical imaging system. The setting or identification may be used in combination or separately.",
    "inventors": [
        "Constantine Simopoulos",
        "Shaohua Zhou",
        "Jin-hyeong Park",
        "Dorin Comaniciu",
        "Bogdan Georgescu"
    ],
    "assignee": "Siemens Medical Solutions USA Inc",
    "classifications": [
        "A61B8/00",
        "G16H30/20",
        "G16H30/40",
        "G16H50/20",
        "A61B6/503",
        "A61B8/0883"
    ],
    "claims": "\n1. A method for controlling a medical diagnostic ultrasound imaging system, the method comprising:\nobtaining an ultrasound image;\nidentifying, with a processor and trained classifier, an anatomical feature in the image;\nsetting, with the processor, an imaging value as a function of the anatomical feature; and\nsubsequently imaging with the medical diagnostic ultrasound system, the imaging responsive to the imaging value set as the function of the anatomical feature.\n2. The method of claim 1 wherein identifying the anatomical feature comprises extracting the anatomical feature with a multi-class classifier.\n3. The method of claim 2 wherein extracting comprises applying the multi-class classifier with feature vectors selected using a boosting framework.\n4. The method of claim 2 wherein extracting comprises applying the multi-class classifier with a tree and cascade structure.\n5. The method of claim 1 wherein identifying comprises identifying a canonical view.\n6. The method of claim 1 wherein setting comprises setting a beam location for a color pan box, a Doppler gate or both.\n7. The method of claim 1 wherein setting comprises setting a B-mode display depth, a B-mode frequency, or both.\n8. The method of claim 1 wherein identifying and setting are performed during an imaging session substantially in real-time, and wherein subsequently imaging is performed during the imaging session.\n9. In a computer readable storage medium having stored therein data representing instructions executable by a programmed processor for controlling a medical imaging system, the storage medium comprising instructions for:\nderiving anatomical information from a medical image with machine-learned feature vectors; and\nsetting at least one imaging parameter of the medical imaging system as a function of the anatomical information.\n10. The instructions of claim 9 wherein deriving the anatomical information comprises extracting the anatomical information with a multi-class classifier.\n11. The instructions of claim 10 wherein extracting comprises applying the multi-class classifier with feature vectors selected using a boosting framework.\n12. The instructions of claim 10 wherein extracting comprises applying the multi-class classifier with a tree and cascade structure.\n13. The instructions of claim 9 wherein deriving comprises deriving the anatomical information from a medical diagnostic ultrasound image, and wherein setting comprises setting the at least one imaging parameter of a medical diagnostic ultrasound imaging system.\n14. The instructions of claim 9 wherein deriving comprises identifying cardiac structure associated with a particular view of a heart.\n15. The instructions of claim 9 wherein deriving comprises identifying a heart valve, and wherein setting comprises positioning a color pan box, a Doppler gate or both for subsequent images.\n16. The instructions of claim 9 wherein deriving and setting are performed during an imaging session substantially in real-time, images obtained in the imaging session responsive to the at least one imaging parameter set as a function of the anatomical information.\n17. The instructions of claim 9 wherein setting comprises setting a B-mode display depth, a B-mode frequency, or both as a function of the anatomical information.\n18. A medical diagnostic imaging system, the imaging system comprising:\na memory operable to store a medical image; and\na processor operable to apply a classifier based on machine learning to the medical image, the classifier operable to identify a canonical view, tissue structure, flow pattern or combinations thereof from the medical image, the processor operable to control imaging as a function of the view, structure, pattern or combination thereof.\n19. The imaging system of claim 18 wherein the classifier comprises a multi-class boosting classifier with a tree and cascade structure.\n20. The imaging system of claim 18 wherein the processor comprises medical diagnostic ultrasound imaging system processor, the medical image comprises an ultrasound image, and the processor being operable to control comprises positioning a color pan box, positioning a Doppler gate, setting a B-mode display depth, setting a B-mode frequency, or combinations thereof.\n21. The imaging system of claim 18 wherein the classifier is operable to identify cardiac structure associated with a particular view of a heart.\n22. A method for identifying information from a medical image, the method comprising:\napplying a multi-class classifier to the medical image; and\nidentifying a particular canonical view, tissue structure, flow pattern or combinations thereof from the medical image as a function of applying the multi-class classifier.\n23. The method of claim 22 wherein applying the multi-class classifier comprises applying the multi-class classifier with feature vectors learned from boosting.\n24. The method of claim 22 wherein applying the multi-class classifier comprises applying the classifier with a tree and cascade structure.\n25. The method of claim 22 further comprising:\nautomatically setting imaging parameters of an imaging system as a function of the particular canonical view, tissue structure, flow pattern or combination thereof.\n26. In a computer readable storage medium having stored therein data representing instructions executable by a programmed processor for identifying information from a medical image, the storage medium comprising instructions for:\napplying a multi-class classifier to the medical image; and\nidentifying a particular canonical view, tissue structure, flow pattern or combinations thereof from the medical image as a function of applying the multi-class classifier.",
    "status": "Active",
    "citations_own": [
        "US20050096539A1",
        "US20050251013A1",
        "US20060064017A1",
        "US7092749B2",
        "US7286707B2",
        "US7311666B2"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20080154565A1",
        "US20080281203A1",
        "WO2009042074A1",
        "US20090270731A1",
        "US20100256500A1",
        "JP2010231768A",
        "US20110172514A1",
        "US20110188715A1",
        "US20110293180A1",
        "US20130281862A1",
        "US20140012532A1",
        "US20140047182A1",
        "US8744152B2",
        "US8942917B2",
        "US20150043799A1",
        "US9250931B2",
        "US9275377B2",
        "US9286247B2",
        "TWI562756B",
        "US20170011185A1",
        "US9549713B2",
        "WO2017079529A1",
        "US20170262982A1",
        "JP2017189394A",
        "US20170360403A1",
        "US20180042578A1",
        "US20180108128A1",
        "CN109788942A",
        "WO2019168699A1",
        "EP3517047A4",
        "EP3517046A4",
        "US10456105B2",
        "US20190374165A1",
        "EP3578108A4",
        "EP3653129A1",
        "US10668386B2",
        "KR20200101418A",
        "US20200345324A1",
        "US20200364517A1",
        "US20200411164A1",
        "US10943147B2",
        "US10948559B2",
        "CN112766314A",
        "CN113143300A",
        "EP3859744A1",
        "WO2021232320A1",
        "US20210407095A1",
        "US11215711B2",
        "WO2022207754A1",
        "US11627943B2",
        "WO2023097009A1",
        "US11710309B2"
    ],
    "citedby_ftf": [
        "US20060058674A1",
        "US20060064017A1",
        "US8460190B2",
        "KR20130055510A",
        "KR20150098119A",
        "KR20150108701A",
        "US10813595B2",
        "US11264135B2",
        "US11497478B2",
        "US11517290B2",
        "US11138477B2",
        "US11602332B2"
    ]
}