{
    "patent_id": "US-11106893-B1",
    "title": "System and method for evaluating the perception system of an autonomous vehicle ",
    "assignee": "Waymo Llc",
    "publication_date": "2021-08-31",
    "patent_link": "https://patents.google.com/patent/US11106893B1/en",
    "inventors": [
        "Jiajun Zhu",
        "Christopher Paul Urmson",
        "Dirk Haehnel",
        "Nathaniel Fairfield",
        "Russell Leigh Smith"
    ],
    "classifications": [
        "B60R1/00",
        "G06K9/00201",
        "B60W60/0051",
        "B60T17/18",
        "B60T17/221",
        "B60T7/22",
        "B60T8/00",
        "B60T8/17",
        "B60T8/885",
        "B60W10/18",
        "B60W10/20",
        "B60W30/08",
        "B60W40/02",
        "B60W40/06",
        "B60W40/107",
        "B60W50/14",
        "B60W60/001",
        "G01C21/3617",
        "G01S17/86",
        "G01S17/931",
        "G05D1/0055",
        "G05D1/0061",
        "G05D1/0088",
        "G05D1/021",
        "G05D1/0212",
        "G05D1/0214",
        "G05D1/0276",
        "G06K9/00805",
        "G06Q10/02",
        "G06Q30/02",
        "G06Q30/0207",
        "G06Q40/08",
        "G06T7/20",
        "G06T7/223",
        "G06T7/231",
        "G06T7/521",
        "G06T7/74",
        "G06V20/58",
        "G06V20/64",
        "G07C9/00563",
        "B60R2300/30",
        "B60T2201/022",
        "B60T2210/32",
        "B60T2270/406",
        "B60W2050/0005",
        "B60W2050/0292",
        "B60W2050/146",
        "B60W2420/42",
        "B60W2420/52",
        "B60W2530/14",
        "B60W2552/05",
        "B60W2555/60",
        "B60W2556/10",
        "B60W2556/50",
        "B60W2720/106",
        "B60W30/186",
        "B60Y2400/81",
        "B62D6/00",
        "G01S13/865",
        "G01S13/867",
        "G05B2219/2637",
        "G05D1/024",
        "G05D1/0246",
        "G05D1/0257",
        "G05D1/0274",
        "G05D1/0278",
        "G05D2201/0213",
        "G06K9/00791",
        "G06K9/00798",
        "G06K9/3241",
        "G06T2207/10004",
        "G06T2207/10028",
        "G06T2207/30236",
        "G06T2207/30252",
        "G06T2207/30261",
        "G06V10/255",
        "G06V20/56",
        "G06V20/588"
    ],
    "abstract": "A method and apparatus are provided for optimizing one or more object detection parameters used by an autonomous vehicle to detect objects in images. The autonomous vehicle may capture the images using one or more sensors. The autonomous vehicle may then determine object labels and their corresponding object label parameters for the detected objects. The captured images and the object label parameters may be communicated to an object identification server. The object identification server may request that one or more reviewers identify objects in the captured images. The object identification server may then compare the identification of objects by reviewers with the identification of objects by the autonomous vehicle. Depending on the results of the comparison, the object identification server may recommend or perform the optimization of one or more of the object detection parameters.",
    "claims": "\n1. A method for optimizing object detection performed by autonomous vehicles, the method comprising:\nreceiving, by one or more computing devices having one or more processors, sensor data captured by a sensor of an autonomous vehicle, wherein the sensor data includes one or more first object labels for an object that are applied by one or more systems of the autonomous vehicle;\nreceiving, by the one or more computing devices, one or more second object labels for the object that are applied at least in part by a human reviewer using an input device in conjunction with a reviewer object identification application to generate the one or more second object labels;\ncomparing, by the one or more computing devices, the one or more first object labels to the one or more second object labels to identify one or more differences between parameters of the one or more first object labels and parameters of the one or more second object labels; and\ngenerating, by the one or more computing devices, a recommendation for an adjustment of at least one object detection parameter of the one or more systems based on the comparing in order to optimize object detection.\n2. The method of claim 1, wherein the type of sensor is a camera.\n3. The method of claim 1, wherein the type of sensor is a LIDAR sensor.\n4. The method of claim 1, wherein the one or more second object labels include a name of the object provided by the reviewer.\n5. The method of claim 1, wherein the one or more second object labels include a bounding shape for the object provided by the reviewer.\n6. The method of claim 1, wherein the one or more second object labels include a first object label applied by the reviewer, a second object label applied by the reviewer, and a third object label automatically generated by a computing device based on the first object label and the second object label.\n7. The method of claim 1, wherein the comparing includes comparing object label parameters of the one or more first labels with corresponding object label parameters of the one or more second object labels.\n8. The method of claim 7, wherein the object label parameters for the one or more second object labels include one or more of a width parameter, a height parameter, an image number parameter, or one or more location parameters.\n9. The method of claim 7, further comprising, determining the object label parameters for the one or more second object labels using dimensions of a bounding shape provided by the reviewer.\n10. The method of claim 7, wherein the object label parameters for the one or more second object labels include a speed for the object.\n11. The method of claim 1, wherein the one or more first object labels for an object were applied by one or more systems of the autonomous vehicle while the autonomous vehicle was operating autonomously.\n12. The method of claim 1, wherein the object detection parameter enables the one or more systems to detect an object in an image.\n13. A system for optimizing object detection performed by autonomous vehicles, the system comprising one or more computing devices having one or more processors configured to:\nreceive sensor data captured by a sensor of an autonomous vehicle, wherein the sensor data includes one or more first object labels for an object that are applied by one or more systems of the autonomous vehicle;\nreceive one or more second object labels for the object that are applied at least in part by a human reviewer using an input device in conjunction with a reviewer object identification application to generate the one or more second object labels;\ncompare the one or more first object labels to the one or more second object labels to identify one or more differences between parameters of the one or more first object labels and parameters of the one or more second object labels; and\ngenerate a recommendation for an adjustment of at least one object detection parameter of the one or more systems based on the comparing in order to optimize object detection.\n14. The system of claim 13, wherein the type of sensor is a camera.\n15. The system of claim 13, wherein the type of sensor is a LIDAR sensor.\n16. The system of claim 13, wherein the one or more second object labels include a name of the object provided by the reviewer.\n17. The system of claim 13, wherein the one or more second object labels include a bounding shape for the object provided by the reviewer.\n18. The system of claim 13, wherein the one or more second object labels include a first object label applied by the reviewer, a second object label applied by the reviewer, and a third object label automatically generated by a computing device based on the first object label and the second object label.\n19. The system of claim 13, wherein the comparing includes comparing object label parameters of the one or more first labels with corresponding object label parameters of the one or more second object labels.\n20. The system of claim 19, wherein the one or more processors are further configured to determine the object label parameters for the one or more second object labels using dimensions of a bounding shape provided by the reviewer."
}