{
    "patent_link": "https://patents.google.com/patent/US20100218231A1/en",
    "patent_id": "US20100218231A1",
    "title": "Deterministically skewing transmission of content streams",
    "abstract": "Described are computer-based methods and apparatuses, including computer program products, for deterministically skewing transmission of content streams. A content stream comprising one or more video frames is received. The content stream is buffered in a buffer, wherein the buffer allows simultaneous read access to the content stream at a plurality of locations. One or more video frames of the content stream are transmitted from the buffer to a first device associated with a first subscriber beginning at a first location in the buffer based on a first transmission delay parameter. One or more video frames of the content stream are transmitted from the buffer to a second device associated with a second subscriber beginning at a second location in the buffer based on a second transmission delay parameter.",
    "inventors": [
        "Craig Frink",
        "Michael G. Hluchyj",
        "Santosh Krishnan",
        "Christopher Lawler",
        "Daniel Pond",
        "Robert Ryan",
        "Qin-Fan Zhu"
    ],
    "assignee": "Akamai Technologies Inc",
    "classifications": [
        "H04N7/17318",
        "H04N21/222",
        "H04N21/23439",
        "H04N21/2393",
        "H04N21/242",
        "H04N21/2625",
        "H04N21/4384",
        "H04N21/44004",
        "H04N21/6437",
        "H04N21/64784",
        "H04N21/8455"
    ],
    "claims": "\n1. A computerized method comprising:\nreceiving a content stream comprising one or more video frames;\nbuffering the content stream in a buffer, wherein the buffer allows simultaneous read access to the content stream at a plurality of locations;\ntransmitting one or more video frames of the content stream from the buffer to a first device associated with a first subscriber beginning at a first location in the buffer based on a first transmission delay parameter; and\ntransmitting one or more video frames of the content stream from the buffer to a second device associated with a second subscriber beginning at a second location in the buffer based on a second transmission delay parameter.\n2. The method of claim 1, further comprising associating the first transmission delay with a plurality of devices associated with the first subscriber.\n3. The method of claim 1, further comprising associating a different transmission delay with each device from a plurality of devices associated with the first subscriber.\n4. The method of claim 1, wherein transmitting one or more video frames of the content stream from the buffer to the first device comprises:\npointing a read pointer associated with the first device at a location in the buffer based on the first transmission delay parameter; and\ntransmitting one or more video frames of the content stream from the buffer to the first device beginning with a video frame at the location pointed to by the read pointer.\n5. The method of claim 1, wherein:\nbuffering comprises generating index information for the content stream, the index information comprising location data for the one or more video frames in the buffer; and\nwherein transmitting one or more video frames of the content stream from the buffer to the first device comprises:\npointing a read pointer associated with the first device at a location in the buffer based on the first transmission delay parameter and the index information; and\ntransmitting one or more video frames of the content stream from the buffer to the first device beginning with a video frame at the location pointed to by the read pointer.\n6. The method of claim 1, wherein transmitting one or more video frames of the content stream from the buffer to the second device comprises:\npointing a read pointer associated with the second device at a location in the buffer based on the second transmission delay parameter; and\ntransmitting one or more video frames of the content stream from the buffer to the second device beginning with a video frame at the location pointed to by the read pointer.\n7. The method of claim 1, further comprising:\nreceiving a content request from the first device, wherein the content associated with the content request is buffered in a second buffer; and\nmaintaining the first transmission delay parameter for the first device with the second buffer.\n8. The method of claim 7, wherein maintaining comprises:\npointing a read pointer associated with the first device at a location in the second buffer based on the first transmission delay parameter; and\ntransmitting one or more video frames of a content stream from the second buffer to the first device beginning with a video frame at the location pointed to by the read pointer.\n9. The method of claim 1, wherein the content stream is a live broadcast.\n10. The method of claim 1, wherein the first location and the second location comprise a random access point.\n11. The method of claim 1, further comprising computing the first transmission delay parameter as an offset to a write pointer.\n12. The method of claim 11, wherein buffering comprises:\nbuffering a first frame of the one or more video frames of the content stream in the buffer; and\nadvancing the write pointer of the buffer to a next location in the buffer.\n13. The method of claim 1, wherein transmitting one or more video frames of the content stream from the buffer to the first device comprises:\ntransmitting a video frame beginning at the first location from the buffer to the first device, the first location pointed to by a read pointer associated with the first device; and\nadvancing the read pointer to a next location in the buffer.\n14. The method of claim 1, further comprising determining a size of the buffer based on a maximum transmission delay parameter, wherein the first transmission delay parameter and the second transmission delay parameter are less than or equal to the maximum transmission delay parameter.\n15. The method of claim 14, further comprising modifying the maximum transmission delay parameter based on a number of read pointers associated with the buffer, a processing performance value, or any combination thereof.\n16. The method of claim 15, further comprising modifying the size of the buffer based on the modified maximum transmission delay parameter.\n17. The method of claim 1, wherein the content stream is a MPEG-2 transport stream, an Adobe RTMP-based stream, an interleaved RTSP-based stream, or any combination thereof.\n18. The method of claim 1, further comprising associating each of the first transmission delay parameter and the second transmission delay parameter with a predetermined value.\n19. The method of claim 1, further comprising determining a value associated with each of the first transmission delay parameter and the second transmission delay parameter based on a random number comprising a range based on the predetermined time period.\n20. The method of claim 1, further comprising determining a value associated with each of the first transmission delay parameter and the second transmission delay parameter by adding a predetermined incremental value to a previously determined transmission delay parameter.\n21. The method of claim 1, further comprising performing content processing of the content stream, wherein content processing comprises performing ad insertions, graphical overlays, transrating, transformations, or any combination thereof.\n22. A system comprising:\nan ingest module configured to receive a content stream comprising one or more video frames;\na buffer in communication with the ingest module configured to buffer the content stream, wherein the buffer allows simultaneous read access to the buffered content stream at a plurality of locations; and\na delivery module in communication with the buffer configured to:\ntransmit one or more video frames of the content stream from the buffer to a first device associated with a first subscriber beginning at a first location in the buffer based on a first transmission delay parameter; and\ntransmit one or more video frames of the content stream from the buffer to a second device associated with a second subscriber beginning at a second location in the buffer based on a second transmission delay parameter.\n23. A computer program product, tangibly embodied in a computer readable storage medium, the computer program product including instructions being operable to cause a data processing apparatus to:\nreceive a content stream comprising one or more video frames;\nbuffer the content stream in a buffer, wherein the buffer allows simultaneous read access to the content stream at a plurality of locations;\ntransmit one or more video frames of the content stream from the buffer to a first device associated with a first subscriber beginning at a first location in the buffer based on a first transmission delay parameter; and\ntransmit one or more video frames of the content stream from the buffer to a second device associated with a second subscriber beginning at a second location in the buffer based on a second transmission delay parameter.\n24. A system comprising:\nmeans for receiving a content stream comprising one or more video frames;\nmeans for buffering the content stream, wherein the buffering means allows simultaneous read access to the buffered content stream at a plurality of locations; and\nmeans for:\ntransmitting one or more video frames of the content stream from the buffering means to a first device associated with a first subscriber beginning at a first location of the buffering means based on a first transmission delay parameter; and\ntransmitting one or more video frames of the content stream from the buffering means to a second device associated with a second subscriber beginning at a second location of the buffering means based on a second transmission delay parameter.",
    "status": "Active",
    "citations_own": [
        "US5424770A",
        "US5499046A",
        "US5505577A",
        "US5534944A",
        "US5594490A",
        "US5655117A",
        "US5659539A",
        "US5805804A",
        "US5859660A",
        "US5878220A",
        "US5926649A",
        "US6055577A",
        "US6112226A",
        "US6119154A",
        "US6138147A",
        "US6154496A",
        "US6401126B1",
        "US6480539B1",
        "US6567471B1",
        "US20030208765A1",
        "US20040218617A1",
        "US6912251B1",
        "US20050188099A1",
        "US6937770B1",
        "US20050193410A1",
        "US6944585B1",
        "US20050223107A1",
        "US20050256873A1",
        "US6971119B1",
        "US7058721B1",
        "US20060165088A1",
        "US20060171390A1",
        "US7107309B1",
        "US20060230176A1",
        "US20060294555A1",
        "US20070055984A1",
        "US20070070895A1",
        "US20070121629A1",
        "US20070130597A1",
        "US20090083813A1",
        "US7561515B2",
        "US20090180534A1",
        "US20090182790A1",
        "US20090182939A1",
        "US20090182843A1",
        "US20100046604A1",
        "US7746799B2"
    ],
    "citations_ftf": [
        "EP0625856B1",
        "US5708796A",
        "JPH09130346A",
        "JPH10275059A",
        "US7412533B1",
        "DE69810250T2",
        "JP4232209B2",
        "US6691208B2",
        "US6678332B1",
        "AU2001229644A1",
        "EP1310092A1",
        "US7216170B2",
        "US7603689B2",
        "EP1675399A3",
        "US7719995B2",
        "US7885270B2",
        "US8750315B2",
        "US8743906B2",
        "US8325764B2",
        "US8650602B2"
    ],
    "citedby_own": [
        "US20110157471A1",
        "US20110313553A1",
        "US20120124606A1",
        "US20120251085A1",
        "US20130002532A1",
        "US20130064306A1",
        "US20130148022A1",
        "US20130156094A1",
        "US8863182B1",
        "US20140325032A1",
        "US20150040076A1",
        "US9003436B2",
        "US20150281298A1",
        "US9247286B2",
        "US9392337B2",
        "US9432704B2",
        "US9485456B2",
        "US20160344833A1",
        "US9519728B2",
        "US9531760B2",
        "US9596283B2",
        "US9621939B2",
        "US9635421B2",
        "US9883223B2",
        "US9906838B2",
        "US9971429B2",
        "US20180160196A1",
        "US10028025B2",
        "US10051304B2",
        "US10048745B1",
        "US10116676B2",
        "US10136172B2",
        "US10148623B2",
        "US10178435B1",
        "US10250932B2",
        "US10278008B2",
        "US10313755B2",
        "US10339281B2",
        "US10339467B2",
        "US20190208240A1",
        "US10404758B2",
        "US10419797B2",
        "US20190394498A1",
        "US10586023B2",
        "US10602231B2",
        "US10652607B2",
        "US20200228813A1",
        "US10863238B2",
        "US10958629B2",
        "US11032518B2",
        "US11076189B2",
        "US11159851B2",
        "US11184288B2",
        "US11212593B2",
        "US20220060779A1",
        "US11363321B2",
        "US11381549B2",
        "US20220360802A1",
        "US11552999B2",
        "US11792462B2"
    ],
    "citedby_ftf": [
        "US10395198B2",
        "US10318970B2",
        "US10218986B2",
        "JP2022544157A",
        "CN114616826A",
        "BR112022002147A2",
        "EP4055829A1"
    ]
}