{
    "patent_id": "US-10739955-B2",
    "title": "System and method for adaptive data visualization ",
    "assignee": "Royal Bank Of Canada",
    "publication_date": "2020-08-11",
    "patent_link": "https://patents.google.com/patent/US10739955B2/en",
    "inventors": [
        "Luyu Wang",
        "Yanshuai CAO"
    ],
    "classifications": [
        "G06F3/0484",
        "G06N20/00",
        "G06F3/0482",
        "G06N7/005",
        "G06N7/01",
        "G06T11/206"
    ],
    "abstract": "An interactive data visualization system is provided that utilizes unsupervised learning process, to automatically choose the hyperparameters for generating insights, which are then used for visualizing the data using interactive plots that update dynamically in response to input control commands.",
    "claims": "\n1. A data visualization system for generating an interface with one or more visualizations of interactive plots of two-dimensional or three-dimensional data by reducing the dimensionality of high dimensional data, the interactive plots indicative of chaining of union or intersect of selections, the data visualization system comprising:\na memory;\na processor configured to process machine readable instructions to:\nreceive user files comprising the high dimensional data;\nprocess the user files by applying an automatic hyperparameter selection to reduce the dimensionality of the user files from the high dimensional data to the two-dimensional or three-dimensional data of the interactive plots;\ngenerate the interactive plots using the processed user files, the interactive plots indicative of chaining of union or intersect of selections of the two-dimensional or three-dimensional data;\nstore the interactive plots at the memory;\ngenerate the interface with visual elements indicating the interactive plots of the two-dimensional or three-dimensional data, the interface having selectable indicia configured to be responsive to input to select data points of the interactive plots;\nresponsive to the selectable indicia, generate updated interactive plots based on the selected data points to indicate chaining of union or intersect of the selected data points;\nstore the updated interactive plots;\nupdate the interface with additional visual elements indicating the updated interactive plots; and\na user interface component configured to display the interface with the visual elements indicating the interactive plots and the additional visual elements indicating the updated interactive plots.\n2. The system of claim 1, wherein the processor is configured to process the user files using a pseudo Bayesian Information criterion for the automatic hyperparameter selection.\n3. The data visualization system of claim 2, wherein the pseudo Bayesian information criterion is applied to automatically generate a best perplexity.\n4. The data visualization system of claim 3, wherein the pseudo Bayesian Information criterion is computed using:\n5. The system of claim 3, wherein the processor is configured to implement machine learning to compute t-SNE with different perplexities to select the best perplexity.\n6. The system of claim 2, wherein the interface instantiates handles or widgets for modifying the hyperparameter selection including a value for a perplexity for the pseudo Bayesian Information criterion to update the interactive plots.\n7. The system of claim 1, wherein the processor is configured to implement an unsupervised learning process for the automatic hyperparameter selection.\n8. The system of claim 1, wherein the processor is configured to process the user files by applying the automatic hyperparameter selection to reduce the dimensionality of the user files for generation of the interactive plot.\n9. The system of claim 1, wherein the interactive plots represent scatter plots linked to histograms of an original dimension of the user files to show a comparison between distributions of selected data point or the subset of data points.\n10. The system of claim 1, wherein the data point represents an outlier data point or the subset of data points represents a cluster.\n11. The system of claim 1, wherein the interface has the selectable indicia configured to be responsive to input to trigger an operation for chaining of union or intersect selections of the selected data point or the subset of data points.\n12. The system of claim 1, wherein the processor is configured to process the user files to reduce the dimensionality of the user files for generation of the interactive plots using dimensionality reduction processes principle component analysis (PCA), independent component analysis (ICA) and t-Distributed Stochastic Neighbour Embedding (t-SNE), the interactive plots comprising reduction results from the dimensionality reduction processes.\n13. The system of claim 9, wherein the interactive plots comprise a first scatter plot for the dimensionality reduction process principle component analysis (PCA), a second scatter plot for the dimensionality reduction process independent component analysis (ICA), and third scatter plot for the dimensionality reduction process t-Distributed Stochastic Neighbour Embedding (t-SNE), and a plurality of histograms showing distributions for the dimensionality reduction processes.\n14. The system of claim 1, wherein the processor is configured to store received input in a data storage as past selections for use in generating a union or intersect.\n15. The system of claim 1, wherein the selected data point or the subset of data points is from a first interactive plot which triggers generation of an automatic update of visual elements for other interactive plots at the interface.\n16. The system of claim 1, wherein the selectable indicia are logical anchor points of the visual elements that are indicative of an interactive ability to control visualization and the interface.\n17. The system of claim 1, wherein the processor is configured to preprocess the user files to correct missing values, sett appropriate types, and compute descriptive data.\n18. The system of claim 1, wherein the processor is configured to link a first interactive plot to a second interactive plot, wherein the selectable indicia of the interface are configured to be responsive to input to select the data points from the first interactive plot, wherein the processor is configured to generate the updated interactive plots by highlighting the data points in the second interactive plot.\n19. A data visualization process for generating an interface with one or more visualizations of interactive plots of two-dimensional or three-dimensional data by reducing the dimensionality of high dimensional data, the interactive plots indicative of chaining of union or intersect of selections, the process comprising:\nat a processor,\nreceiving user files comprising the high dimensional data;\nprocessing the user files by applying using a pseudo Bayesian Information criterion for automatic hyperparameter selection to reduce the dimensionality of the user files from the high dimensional data to the two-dimensional or three-dimensional data of the interactive plots, wherein the pseudo Bayesian information criterion is applied to automatically generate an optimal perplexity;\ngenerating the interactive plots using the processed user files, the interactive plots indicative of chaining of union or intersect of selections of the two-dimensional or three-dimensional data;\nstoring the interactive plots at the memory;\ngenerating the interface with visual elements indicating the interactive plots of the two-dimensional or three-dimensional data, the interface having selectable indicia configured to be responsive to input to select data points of the interactive plots;\nresponsive to the selectable indicia, generating updated interactive plots based on the selected data points to indicate chaining of union or intersect of the selected data points;\nstoring the updated interactive plots;\nupdating the interface with additional visual elements indicating the updated interactive plots; and\nat an a user interface component,\ndisplaying the interface with the visual elements indicating the interactive plots and dynamically updating the interface the additional visual elements indicating the updated interactive plots.\n20. A non-transitory computer readable medium storing machine executable instructions to configure a processor for generating an interface with one or more visualizations of interactive plots of two-dimensional or three-dimensional data by reducing the dimensionality of high dimensional data, the interactive plots indicative of chaining of union or intersect of selections by:\nreceiving user files comprising the high dimensional data;\nprocessing the user files by applying using a pseudo Bayesian Information criterion for automatic hyperparameter selection to reduce the dimensionality of the user files from the high dimensional data to the two-dimensional or three-dimensional data of the interactive plots, wherein the pseudo Bayesian information criterion is applied to automatically generate an optimal perplexity;\ngenerating the interactive plots using the processed user files, the interactive plots indicative of chaining of union or intersect of selections of the two-dimensional or three-dimensional data;\nstoring the interactive plots at a memory;\ngenerating the interface with visual elements indicating the interactive plots of the two-dimensional or three-dimensional data, the interface having selectable indicia configured to be responsive to input to data points of the interactive plots;\nresponsive to the selectable indicia, generating updated interactive plots based on the selected data points to indicate chaining of union or intersect of the selected data points;\nstoring the updated interactive plots;\nupdating the interface with additional visual elements indicating the updated interactive plots; and\ncontrolling the display of the interface, at a display device, with the visual elements indicating the interactive plots and dynamically updating the interface the additional visual elements indicating the updated interactive plots.",
    "status": "Active",
    "citations_own": [
        "US6990238B1",
        "US7071940B2",
        "US20140336942A1",
        "US20140344193A1",
        "US20170098318A1",
        "US20180018386A1",
        "US9990687B1",
        "US20190050713A1",
        "US10289283B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US11126151B2"
    ],
    "citedby_ftf": [
        "EP3625689A4",
        "US10282237B1",
        "US11270217B2",
        "US11157981B2",
        "US11704567B2",
        "US10528891B1",
        "CN111625181B",
        "US11157812B2",
        "US11200448B2",
        "JP2022546430A",
        "KR20230031553A",
        "CN114545167B"
    ]
}