{
    "patent_id": "US-11423886-B2",
    "title": "Task flow identification based on user intent ",
    "assignee": "Apple Inc.",
    "publication_date": "2022-08-23",
    "patent_link": "https://patents.google.com/patent/US11423886B2/en",
    "inventors": [
        "Thomas Robert Gruber",
        "Adam John Cheyer",
        "Dag Kittlaus",
        "Didier Rene Guzzoni",
        "Christopher Dean Brigham",
        "Richard Donald Giuli",
        "Marcello Bastea-Forte",
        "Harry Joseph Saddler"
    ],
    "classifications": [
        "G06F16/00",
        "G06F3/167",
        "G06F16/9537",
        "G10L15/1815",
        "B60K35/00",
        "G06F16/3329",
        "G06F16/3344",
        "G06F3/00",
        "G06F3/16",
        "G06F40/279",
        "G06F40/30",
        "G06F40/35",
        "G06F40/40",
        "G06F9/44",
        "G06F9/54",
        "G06N3/006",
        "G06N5/022",
        "G06N5/041",
        "G06Q10/00",
        "G10L13/02",
        "G10L13/08",
        "G10L15/18",
        "G10L15/183",
        "G10L15/22",
        "G10L15/26",
        "G10L15/30",
        "G10L21/06",
        "H04M1/6091",
        "H04M1/7243",
        "H04M1/72448",
        "H04M1/72484",
        "G10L13/00",
        "G10L15/1822",
        "G10L2015/223"
    ],
    "abstract": "The intelligent automated assistant system engages with the user in an integrated, conversational manner using natural language dialog, and invokes external services when appropriate to obtain information or perform various actions. The system can be implemented using any of a number of different platforms, such as the web, email, smartphone, and the like, or any combination thereof. In one embodiment, the system is based on sets of interrelated domains and tasks, and employs additional functionally powered by external services with which the system can interact.",
    "claims": "\n1. An electronic device, comprising:\none or more processors;\na memory; and\none or more programs, wherein the one or more programs are stored in the memory and configured to be executed by the one or more processors, the one or more programs including instructions for:\nreceiving input from a user;\ndetermining an intent corresponding to the received input;\nperforming a first task based on the determined intent;\nproviding a first output associated with the performed task;\nin accordance with a detection of a user selection corresponding to the first output:\nproviding a second output including at least one additional task corresponding to the performed task; and\nin accordance with a detection that no user selection corresponding to the first output has occurred:\nproviding a third output including at least one option to select a task parameter associated with the first task.\n2. The device of claim 1, the one or more programs further including instructions for:\nreceiving a second input from the user, wherein the second input corresponds to a selection of a task from the at least one provided additional task; and\nperforming a second task based on the second input.\n3. The device of claim 1, wherein the at least one additional task includes an interaction with a remote source over a network connection.\n4. The device of claim 1, wherein the at least one additional task includes an interaction with information stored on the electronic device.\n5. The device of claim 1, wherein the at least one additional task includes a task to save information corresponding to the first task.\n6. The device of claim 1, wherein the at least one additional task includes a task to send information to another user, wherein the information corresponds to the first task.\n7. The device of claim 1, wherein the at least one additional task includes a task to display map information corresponding to the first task.\n8. The device of claim 1, wherein the at least one additional task includes a task to initiate a phone call to a contact associated with the first task.\n9. The device of claim 1, wherein the at least one additional task includes a task to set an alarm associated with the first task.\n10. The device of claim 1, wherein the at least one additional task includes a task to initiate a reservation procedure associated with the first task.\n11. The device of claim 1, wherein the at least one additional task includes a task to create a note file associated with the first task.\n12. The device of claim 1, wherein the second output includes an audible representation of at least one additional task corresponding to the performed task.\n13. The device of claim 1, the one or more programs further including instructions for:\nreceiving a second user input including a speech input; and\ndetermining a user intent of the second speech input based on the second output including at least one additional task corresponding to the performed task.\n14. The device of claim 1, wherein at least one of the first task and the at least one additional task includes performing a task on a secondary device.\n15. The device of claim 1, wherein the task parameter is associated with a domain corresponding to the first task.\n16. The device of claim 1, wherein determining an intent corresponding to the received input comprises:\nobtaining context information including a history of interactions between the user and the electronic device; and\ndetermining the intent based on the context information.\n17. The device of claim 16, the one or more programs further including instructions for:\nprior to receiving the input from the user, receiving a speech input from the user within a predetermined time of the received input; and\nprocessing the received speech input to obtain the context information.\n18. The device of claim 16, the one or more programs further including instructions for:\nprior to receiving the input from the user, receiving a non-speech input from the user within a predetermined time of the received input; and\nprocessing the received non-speech input to obtain the context information.\n19. A non-transitory computer readable storage medium storing one or more programs, the one or more programs comprising instructions, which when executed by one or more processors of an electronic device, cause the device to:\nreceive input from a user;\ndetermine an intent corresponding to the received input;\nperform a first task based on the determined intent;\nprovide a first output associated with the performed task;\nin accordance with a detection of a user selection corresponding to the first output:\nprovide a second output including at least one additional task corresponding to the performed task; and\nin accordance with a detection that no user selection corresponding to the first output has occurred:\nprovide a third output including at least one option to select a task parameter associated with the first task.\n20. The computer readable storage medium of claim 19, wherein the one or more programs cause the device to:\nreceive a second input from the user, wherein the second input corresponds to a selection of a task from the at least one provided additional task; and\nperform a second task based on the second input.\n21. The computer readable storage medium of claim 19, wherein the at least one additional task includes an interaction with a remote source over a network connection.\n22. The computer readable storage medium of claim 19, wherein the at least one additional task includes an interaction with information stored on the electronic device.\n23. The computer readable storage medium of claim 19, wherein the at least one additional task includes a task to save information corresponding to the first task.\n24. The computer readable storage medium of claim 19, wherein the at least one additional task includes a task to send information to another user, wherein the information corresponds to the first task.\n25. The computer readable storage medium of claim 19, wherein the at least one additional task includes a task to display map information corresponding to the first task.\n26. The computer readable storage medium of claim 19, wherein the at least one additional task includes a task to initiate a phone call to a contact associated with the first task.\n27. The computer readable storage medium of claim 19, wherein the at least one additional task includes a task to set an alarm associated with the first task.\n28. The computer readable storage medium of claim 19, wherein the at least one additional task includes a task to initiate a reservation procedure associated with the first task.\n29. The computer readable storage medium of claim 19, wherein the at least one additional task includes a task to create a note file associated with the first task.\n30. The computer readable storage medium of claim 19, wherein the second output includes an audible representation of at least one additional task corresponding to the performed task.\n31. The computer readable storage medium of claim 19, wherein the one or more programs cause the device to:\nreceive a second user input including a speech input; and\ndetermine a user intent of the second speech input based on the second output including at least one additional task corresponding to the performed task.\n32. The computer readable storage medium of claim 19, wherein at least one of the first task and the at least one additional task includes performing a task on a secondary device.\n33. The computer readable storage medium of claim 19, wherein the task parameter is associated with a domain corresponding to the first task.\n34. The computer readable storage medium of claim 19, wherein determining an intent corresponding to the received input comprises:\nobtaining context information including a history of interactions between the user and the electronic device; and\ndetermining the intent based on the context information.\n35. The computer readable storage medium of claim 34, wherein the one or more programs cause the device to:\nprior to receiving the input from the user, receiving a speech input from the user within a predetermined time of the received input; and\nprocessing the received speech input to obtain the context information.\n36. The computer readable storage medium of claim 34, wherein the one or more programs cause the device to:\nprior to receiving the input from the user, receiving a non-speech input from the user within a predetermined time of the received input; and\nprocessing the received non-speech input to obtain the context information.\n37. A computer-implemented method, comprising:\nat an electronic device with one or more processors and memory:\nreceiving input from a user;\ndetermining an intent corresponding to the received input;\nperforming a first task based on the determined intent;\nproviding a first output associated with the performed task;\nin accordance with a detection of a user selection corresponding to the first output:\nproviding a second output including at least one additional task corresponding to the performed task; and\nin accordance with a detection that no user selection corresponding to the first output has occurred:\nproviding a third output including at least one option to select a task parameter associated with the first task.\n38. The method of claim 37, comprising:\nreceiving a second input from the user, wherein the second input corresponds to a selection of a task from the at least one provided additional task; and\nperforming a second task based on the second input.\n39. The method of claim 37, wherein the at least one additional task includes an interaction with a remote source over a network connection.\n40. The method of claim 37, wherein the at least one additional task includes an interaction with information stored on the electronic device.\n41. The method of claim 37, wherein the at least one additional task includes a task to save information corresponding to the first task.\n42. The method of claim 37, wherein the at least one additional task includes a task to send information to another user, wherein the information corresponds to the first task.\n43. The method of claim 37, wherein the at least one additional task includes a task to display map information corresponding to the first task.\n44. The method of claim 37, wherein the at least one additional task includes a task to initiate a phone call to a contact associated with the first task.\n45. The method of claim 37, wherein the at least one additional task includes a task to set an alarm associated with the first task.\n46. The method of claim 37, wherein the at least one additional task includes a task to initiate a reservation procedure associated with the first task.\n47. The method of claim 37, wherein the at least one additional task includes a task to create a note file associated with the first task.\n48. The method of claim 37, wherein the second output includes an audible representation of at least one additional task corresponding to the performed task.\n49. The method of claim 37, comprising:\nreceiving a second user input including a speech input; and\ndetermining a user intent of the second speech input based on the second output including at least one additional task corresponding to the performed task.\n50. The method of claim 37, wherein at least one of the first task and the at least one additional task includes performing a task on a secondary device.\n51. The method of claim 37, wherein the task parameter is associated with a domain corresponding to the first task.\n52. The method of claim 37, wherein determining an intent corresponding to the received input comprises:\nobtaining context information including a history of interactions between the user and the electronic device; and\ndetermining the intent based on the context information.\n53. The method of claim 52, comprising:\nprior to receiving the input from the user, receiving a speech input from the user within a predetermined time of the received input; and\nprocessing the received speech input to obtain the context information.\n54. The method of claim 52, comprising:\nprior to receiving the input from the user, receiving a non-speech input from the user within a predetermined time of the received input; and\nprocessing the received non-speech input to obtain the context information."
}