{
    "patent_link": "https://patents.google.com/patent/US4660166A/en",
    "patent_id": "US4660166A",
    "title": "Electronic network for collective decision based on large number of connections between signals",
    "abstract": "Amplifiers, optionally having complementary (positive and negative) outputs, are connected to a matrix of input and output conductors (where the output conductors are each a pair for the case of complementary amplifier outputs). Each connection is implemented with a resistors Rij =Rji connecting the output(s) of amplifiers j to the input of amplifiers i, and vice versa, where i and j are the ith and jth amplifiers not necessarily in sequence. The value of each resistor is selected for the nature of the decisional operation intended to satisfy the following circuit equation of motion ##EQU1## where Vj =g(uj) the output of amplifier j due to an input ui, Ci is the input capacitance of amplifier i, and Ri is the equivalent of pi and Rij according to the equation ##EQU2## and Rij =Rji. For the implementation of an associative memory, only positive (or negative) output terminals need be connected by resistors of unit value to input terminals of amplifiers i and j for the amplifier i in which a binary 1 is to be stored. (The amplifier j is one or more of the other amplifiers.) The outputs of the array of amplifiers will produce the entire word stored in response to a few bit-1 input signals Ii to amplifiers so connected by resistors Rij. For problem solution, the resistance Rij =Rji is selected to have a value that, with appropriate signals at all input conductors (perhaps zero) the network will collectively drive to a stable state at the complementary output terminals which provide an output code word that is a very good solution to the problem.",
    "inventors": [
        "John J. Hopfield"
    ],
    "assignee": "AT&T Corp",
    "classifications": [
        "G06J1/00",
        "G06N20/00",
        "G06N3/044",
        "G06N3/048",
        "G06N3/063",
        "G11C15/04"
    ],
    "claims": "\n1. A network of nonlinear devices having continuous input-output relations for parallel processing of input signals, having useful collective decisional properties to which all of the input signals make a contribution to some degree in the range from 0 to 100%, comprising a matrix of N input and N output conductors, where N is a positive integer greater than 1, and each of said N output conductors may be a pair of complementary positive and negative conductors, N amplifiers of high gain, each amplifier having at least a positive output terminal and optionally a complementary negative output terminal for the case of each output conductor being comprised of a pair, each input conductor of said array being connected to the input terminal of a separate one of said amplifiers, and each amplifier having its output terminal connected to a separate one of said output conductors, each amplifier of a series . . . i, j, k . . . having its output conductor connected to the input conductor of a separate selected amplifier, where each connection is implemented with a resistor Rij, and the value of each resistor is selected for the nature of the decisional operation intended to satisfy the following circuit equation of motion: ##EQU21## where the subscript letters i and j designate representative ones of said series of amplifiers, the magnitude Tij is a conductance equal to 1/Rij which defines the network decisional properties, ui is the input to amplifier i at the starting time to, Ii is an input signal from a high impedance current source connected to amplifier i, and Vj is the output of amplifier j due to an input uj thereto, thereby presenting on said output conductors a decision expressed as binary word of N bits after said network has reached a stable state to which the conductances between amplifiers force the network.\n2. An electronic network as defined in claim 1 wherein each of said N amplifiers has a single input terminal connected to a different one of said input conductors and at least a noninverting output terminal connected to a different one of said output conductors, and said conductance Tij may take a positive value of either zero or some finite constant set by connecting resistors Rij =Rji for each binary one of an N-bit word stored in said N×N matrix.\n3. An electronic network as defined in claim 2, wherein said input signal to each input conductor of said N×N matrix is set equal to one of two values, one of which is zero and some of which are not zero to present to the network a binary word containing at least a few binary ones in the same position as binary ones in any one of a number of N-bit words stored in said network, where the binary digits of information stored as N-bit words in determined by connecting resistors Rij ≠0.\n4. An electronic network as defined in claim 3 wherein said input signal to each input conductor of said N×N matrix is set equal to a binary level of one plus or minus some value depending upon the degree of certainty that a binary one has been stored in the ith position by connection of resistor Rij and of an equal resistor Rji, where the subscript letter i designates a representative one of said series of amplifiers . . . j, i, k, . . . not necessarily arranged in sequence.\n5. An electronic network as defined in claim 1 wherein each of said N amplifiers has two complementary output terminals, one an inverting output terminal and one a noninverting output terminal, and each of said N output conductors is comprised of a pair of conductors, a different pair of said output conductors being separately connected to said two output terminals of each amplifier, one connected to the inverting output terminal and one connected to the noninverting output terminal, and the sign of Tij is determined by which of said pair of output conductors of amplifier j is connected to the single input conductor connected to amplifier i, where the letter i designates a representative one of said series of amplifiers . . . i, j, k, . . . .\n6. An electronic network as defined in claim 5 wherein said conductance Tij may take any value, and Rij =Rji.\n7. An electronic network as defined in claim 6 wherein said input signal to the ith amplifier of said series of amplifiers . . . i, j, k, . . . is set equal to any selected value, including zero, and Tij is selected to program for the solution of a predetermined problem.\n8. An electronic network for collective decision based on a large number N of signals comprising an array of N amplifiers each designated by a letter from a series . . . i, j, k, . . . connected to a matrix of N input and N output conductors, each connection implemented with equal resistors Rij and Rji connecting the outputs of amplifiers j and i to the inputs of amplifiers i and j, where i and j are the ith and jth amplifiers of said series not necessarily arranged in sequence, where the value of each resistor is selected for the nature of the decisional operation intended to satisfy the following circuit equation of motion ##EQU22## where Vj =g(ui) is the output of amplifier j due to an input ui and an amplifier gain g, Ci is the input capacitance of amplifier i, and Ri is the equivalent of pi and Rij according to the equation ##EQU23## and Rij =Rji.\n9. An electronic network as defined in claim 8 for the implementation of an associative memory, wherein only output terminals of one polarity are provided for connection by resistors of unit value to input terminals of amplifiers i and j for output terminals of amplifiers j and i, respectively, for the amplifier pairs i, j in each of which a binary 1 is to be stored, and with global feedback of the opposite sign, whereby the outputs of the array of amplifiers will produce a particular entire stored word chosen from the many represented in the connection matrix in response to a few bit-1 input signals Ii amplifiers so connected by resistors Rij and Rji.\n10. An electronic network as defined in claim 9 for problem solution, wherein the resistance Rij =Rji is selected to have a value that, with input signals at all input conductors, one or more of which may be zero, the network will drive to a stable state at the complementary output terminals which collectively provide an output code word that is a very good solution to the problem.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US3891836A",
        "US3934231A",
        "US3934124A",
        "US3950733A",
        "US4254474A",
        "US4326259A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "EP0242110A2",
        "US4719591A",
        "US4731747A",
        "US4755963A",
        "US4782460A",
        "WO1988010463A2",
        "WO1989001228A1",
        "US4807168A",
        "US4809222A",
        "US4849925A",
        "US4862498A",
        "US4866645A",
        "WO1989009449A1",
        "US4876668A",
        "US4885757A",
        "WO1989012275A1",
        "EP0349819A1",
        "US4903226A",
        "US4904881A",
        "US4906865A",
        "EP0357016A2",
        "US4912653A",
        "US4912651A",
        "US4912652A",
        "US4912654A",
        "US4912647A",
        "US4912655A",
        "US4912649A",
        "US4914603A",
        "US4918617A",
        "US4926180A",
        "US4926064A",
        "EP0370543A2",
        "US4932021A",
        "EP0373228A1",
        "US4941122A",
        "US4950917A",
        "EP0385436A2",
        "WO1990010274A1",
        "US4956564A",
        "US4961002A",
        "US4961005A",
        "US4965579A",
        "US4967369A",
        "US4969021A",
        "US4983962A",
        "US4995088A",
        "US4999525A",
        "US5004309A",
        "US5008833A",
        "US5010512A",
        "US5016188A",
        "US5016211A",
        "US5021988A",
        "EP0430638A2",
        "US5023833A",
        "US5028810A",
        "US5039871A",
        "US5040214A",
        "US5040134A",
        "US5039870A",
        "US5040230A",
        "US5050095A",
        "US5053991A",
        "US5053638A",
        "US5056037A",
        "US5058184A",
        "US5059814A",
        "US5061866A",
        "US5068662A",
        "US5068801A",
        "US5072130A",
        "US5075868A",
        "US5093781A",
        "US5093792A",
        "US5101340A",
        "US5103496A",
        "US5107454A",
        "WO1992008307A2",
        "US5119469A",
        "US5125098A",
        "US5131072A",
        "US5132813A",
        "US5133073A",
        "US5134685A",
        "US5140670A",
        "US5150323A",
        "US5157785A",
        "US5163133A",
        "US5170463A",
        "US5195170A",
        "US5202956A",
        "US5204549A",
        "US5214747A",
        "US5222195A",
        "US5223750A",
        "US5247606A",
        "US5248899A",
        "US5253328A",
        "US5253327A",
        "US5255349A",
        "US5259038A",
        "US5261035A",
        "US5263121A",
        "WO1993023814A1",
        "US5274745A",
        "US5274742A",
        "US5276770A",
        "US5283418A",
        "US5285522A",
        "US5291198A",
        "US5293455A",
        "US5315704A",
        "US5319737A",
        "US5355438A",
        "WO1994024637A1",
        "US5394511A",
        "US5416696A",
        "US5416889A",
        "US5420963A",
        "US5434951A",
        "US5452400A",
        "US5463717A",
        "US5479574A",
        "US5504841A",
        "US5517667A",
        "US5524177A",
        "WO1996017307A1",
        "US5533168A",
        "US5544280A",
        "US5581659A",
        "US5615305A",
        "US6052679A",
        "WO2000029970A1",
        "US6208963B1",
        "EP1094623A2",
        "US6463438B1",
        "US20030028353A1",
        "US20030033265A1",
        "US6581049B1",
        "US20030140849A1",
        "US20050159824A1",
        "US20050163347A1",
        "US6957204B1",
        "US20050288954A1",
        "US20060085098A1",
        "US20060095653A1",
        "US20060107153A1",
        "US20060259894A1",
        "US20060277533A1",
        "US20070033346A1",
        "US20070079108A1",
        "US20070288668A1",
        "US20070299797A1",
        "US20090132452A1",
        "US8266085B1",
        "US8364136B2",
        "US8369967B2",
        "US8892495B2",
        "WO2015073771A2",
        "WO2015159242A1",
        "US10133151B2",
        "US10268843B2",
        "US10361802B1",
        "US11113051B2"
    ],
    "citedby_ftf": []
}