{
    "patent_id": "US-11386259-B2",
    "title": "Removing personal information from text using multiple levels of redaction ",
    "assignee": "Asapp, Inc.",
    "publication_date": "2022-07-12",
    "patent_link": "https://patents.google.com/patent/US11386259B2/en",
    "inventors": [
        "Frederick William Poe Heckel",
        "Shawn Henry"
    ],
    "classifications": [
        "G06F40/166",
        "G06F21/60",
        "G06F21/6245",
        "G06F40/30",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/048",
        "G06N3/08",
        "G06N3/044",
        "G06N3/0445",
        "G06N3/084",
        "G06N7/005",
        "G06N7/01"
    ],
    "abstract": "When processing a request containing personal information, personal information may be needed to respond to the request, but it may be desired to limit storage of personal information for privacy reasons. To accomplish both objectives, text of a message may be processed using multiple levels of redaction. A first level of redaction may replace digits of the text with a token so that sensitive numbers, such as credit card numbers or social security numbers are no longer present. A second level of redaction may replace one or more words of the text with a label indicating the text that was present, such as by replacing an address with a label indicating that an address was present or by replacing a credit card number with a label indicating that a credit card number was present.",
    "claims": "\n1. A computer-implemented method for redacting text, comprising:\nreceiving text of a message from a user;\ngenerating first redacted text by replacing one or more digits of the text with a token representing digits;\ncomputing label scores for words of the first redacted text by processing the first redacted text with one or more layers of a neural network, wherein a label score indicates a match between a word and a class of words and wherein the label scores comprise first label scores for a first word of the first redacted text;\nselecting a first label for the first word using the first label scores; and\ngenerating second redacted text by replacing the first word with the first label in the first redacted text.\n2. The computer-implemented method of claim 1, wherein the token representing digits is #.\n3. The computer-implemented method of claim 1, wherein generating the first redacted text comprises replacing each digit in the text with the token.\n4. The computer-implemented method of claim 1, wherein computing the label scores comprises computing label scores for each word of the first redacted text.\n5. The computer-implemented method of claim 1, wherein computing the label scores comprises computing context vectors for words of the first redacted text.\n6. The computer-implemented method of claim 1, wherein computing the label scores comprises obtaining word embeddings for words of the first redacted text, wherein a word embedding represents a word in a vector space.\n7. The computer-implemented method of claim 1, wherein the first label corresponds to a phone number, a mailing address, an email address, a credit card number, or a social security number.\n8. The computer-implemented method of claim 1, comprising causing the second redacted text to be presented to a person.\n9. A system, comprising:\nat least one computer comprising at least one processor and at least one memory, the at least one computer configured to:\nreceive text of a message from a user;\ngenerate first redacted text by replacing one or more digits of the text with a token representing digits;\ncompute label scores for words of the first redacted text by processing the first redacted text with one or more layers of a neural network, wherein each label score indicates a match between a word and a class of words and wherein the label scores comprise first label scores for a first word of the first redacted text;\nselect a first label for the first word using the first label scores; and\ngenerate second redacted text by replacing the first word with the first label in the first redacted text.\n10. The system of claim 9, wherein the neural network comprises a recurrent neural network layer or a bidirectional recurrent neural network layer.\n11. The system of claim 9, wherein the neural network comprises a classifier layer.\n12. The system of claim 9, wherein the first redacted text is generated by a first device and the second redacted text is generated by a second device.\n13. The system of claim 9, wherein the message is received from a customer of a company and relates to obtaining support from the company.\n14. The system of claim 9, wherein the system is implemented by a third party providing services to a plurality of companies.\n15. One or more non-transitory, computer-readable media comprising computer executable instructions that, when executed, cause at least one processor to perform actions comprising:\nreceiving text of a message from a user;\ngenerating first redacted text by replacing one or more digits of the text with a token representing digits;\ncomputing label scores for words of the first redacted text by processing the first redacted text with one or more layers of a neural network, wherein each label score indicates a match between a word and a class of words and wherein the label scores comprise first label scores for a first word of the first redacted text;\nselecting a first label for the first word using the first label scores; and\ngenerating second redacted text by replacing the first word with the first label in the first redacted text.\n16. The one or more non-transitory, computer-readable media of claim 15, wherein the neural network comprises a conditional random field layer.\n17. The one or more non-transitory, computer-readable media of claim 15, wherein generating the second redacted text comprises removing personally identifiable information from the text.\n18. The one or more non-transitory, computer-readable media of claim 15, wherein the neural network comprises one or more of a convolutional layer or a multi-layer perceptron layer.\n19. The one or more non-transitory, computer-readable media of claim 15, wherein the text is stored in in-memory storage and the second redacted text is stored in durable storage.\n20. The one or more non-transitory, computer-readable media of claim 15, wherein the actions comprise generating third redacted text from the second redacted text, wherein a redaction level of the third redacted text is higher than a redaction level of the second redacted text.",
    "status": "Active",
    "citations_own": [
        "US4941178A",
        "US5195034A",
        "US5227971A",
        "US5369575A",
        "US5627940A",
        "US6173279B1",
        "US6177932B1",
        "US6327363B1",
        "US6356869B1",
        "US6381645B1",
        "US6453292B2",
        "US20030033347A1",
        "US20030033288A1",
        "US20030103621A1",
        "US20040003283A1",
        "US6823313B1",
        "US20040254904A1",
        "US20050076084A1",
        "US20050105712A1",
        "CN1633817A",
        "US6915254B1",
        "US20050228790A1",
        "US6981040B1",
        "US20060112127A1",
        "US20060173776A1",
        "USH2187H1",
        "US20070094217A1",
        "US20070100625A1",
        "US20070100618A1",
        "US20070121899A1",
        "US20070156406A1",
        "US20070168448A1",
        "US20080091435A1",
        "US20080112620A1",
        "US20080168135A1",
        "US20080168070A1",
        "US20090018829A1",
        "US7603330B2",
        "US20090306967A1",
        "US20110066634A1",
        "US20110082825A1",
        "US20110093414A1",
        "US20110173346A1",
        "US8024196B1",
        "US20110239113A1",
        "US20110270771A1",
        "US8054951B1",
        "US20110286596A1",
        "US20110314012A1",
        "US20120005515A1",
        "US20120053945A1",
        "US8156138B2",
        "US20120102130A1",
        "US8271403B2",
        "US20120239380A1",
        "US20120266258A1",
        "US20130027612A1",
        "US20130035931A1",
        "US20130143587A1",
        "US20130144605A1",
        "US20130166485A1",
        "US20130173604A1",
        "US8494152B1",
        "US8577671B1",
        "US20130317808A1",
        "US8626509B2",
        "US20140047234A1",
        "US20140075004A1",
        "US20140079195A1",
        "US20140180788A1",
        "US20140282138A1",
        "US20140278379A1",
        "US20140297281A1",
        "US20140297268A1",
        "US20140317030A1",
        "US20140330818A1",
        "US20140365209A1",
        "US20150006143A1",
        "US20150033106A1",
        "US20150032724A1",
        "US20150052002A1",
        "US20150073798A1",
        "US20150142704A1",
        "US9043197B1",
        "US20150149177A1",
        "US20150154285A1",
        "US20150178390A1",
        "US20150195406A1",
        "US20150215624A1",
        "US20150220995A1",
        "US20150220833A1",
        "US20150228275A1",
        "US20150242385A1",
        "CN105009556A",
        "US20150310377A1",
        "US20150309987A1",
        "US20150340032A1",
        "US20150363393A1",
        "US20150365387A1",
        "US20160019816A1",
        "US20160063067A1",
        "US20160078456A1",
        "US20160092688A1",
        "US9336269B1",
        "US20160163311A1",
        "US20160163314A1",
        "US20160180151A1",
        "US20160180838A1",
        "US20160182672A1",
        "US20160239846A1",
        "US20160247068A1",
        "US20160255034A1",
        "US20160323398A1",
        "US20160328388A1",
        "US20160364522A1",
        "US20170013073A1",
        "US20170011279A1",
        "US20170060844A1",
        "US9591136B1",
        "US9602987B1",
        "US20170091320A1",
        "US20170103324A1",
        "US20170116982A1",
        "US20170147682A1",
        "US20170148073A1",
        "US20170177712A1",
        "US20170200077A1",
        "US9715496B1",
        "US20170213138A1",
        "US9723151B2",
        "US9727925B2",
        "US9742916B1",
        "US9761222B1",
        "US9762733B1",
        "US20170308523A1",
        "US20170323016A1",
        "US20180005112A1",
        "US20180012232A1",
        "US20180018562A1",
        "US9875440B1",
        "US20180032755A1",
        "US9892414B1",
        "US20180052664A1",
        "US9911413B1",
        "US20180068233A1",
        "US20180121738A1",
        "US20180131645A1",
        "US20180143965A1",
        "US20180174579A1",
        "US20180174037A1",
        "US20180181807A1",
        "US20180203848A1",
        "US10049663B2",
        "US20180232434A1",
        "US20180239830A1",
        "US10067938B2",
        "US20180253734A1",
        "US20180260680A1",
        "US10083690B2",
        "US10089072B2",
        "US20180285599A1",
        "US10097690B1",
        "US10127908B1",
        "US20180329886A1",
        "US20180357439A1",
        "US20180376002A1",
        "US10169315B1",
        "US20190019197A1",
        "US20190051302A1",
        "US10210244B1",
        "US20190102378A1",
        "US20190122101A1",
        "WO2019113409A1",
        "US20190182383A1",
        "US20190213601A1",
        "US20190286700A1",
        "US20190340201A1",
        "US10490182B1",
        "US20200019609A1",
        "US20200042613A1",
        "US20200081939A1",
        "US10599774B1",
        "US20200151254A1",
        "US20200151253A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20200304472A1",
        "US20230177276A1",
        "US11755848B1"
    ],
    "citedby_ftf": [
        "US10083451B2",
        "CN111555954B",
        "US10109275B2",
        "US10497004B2",
        "US10489792B2",
        "US10169315B1",
        "US11194968B2",
        "US10460235B1",
        "US11055400B2",
        "US10721190B2",
        "US11216510B2",
        "US10699112B1",
        "US11748566B1",
        "US11526670B2",
        "US11140110B2",
        "US11010560B2",
        "US10747957B2",
        "US11551004B2",
        "US20190130917A1",
        "US11727245B2",
        "US11341266B2",
        "US10956474B2",
        "US11588760B2",
        "US20200342056A1",
        "CN111950279B",
        "CN110134961A",
        "CN110287479B",
        "US11308276B2",
        "DE102019210994A1",
        "US11720757B2",
        "US11227009B1",
        "US11386226B2",
        "US11488014B2",
        "US11425064B2",
        "CN110781306B",
        "CN111160031A",
        "US11734493B2",
        "US11727209B2",
        "US11393233B2",
        "CN111737949B",
        "US11663406B2",
        "CN111814472B",
        "CN111932413B",
        "US20220188567A1",
        "US20220198044A1",
        "CN113254653B",
        "WO2023003488A1",
        "US20230037069A1"
    ]
}