{
    "patent_link": "https://patents.google.com/patent/US5297253A/en",
    "patent_id": "US5297253A",
    "title": "Computer user interface navigational tool",
    "abstract": "A navigational tool is disclosed for traversing information units stored in a memory of a computer system. The computer system has a monitor and a control device and operates according to a computer application program. The navigational tool has three modules. The first module independently tracks a path traversed by the computer system under the control of the application program through the memory which generates and organizes a sequence of nodes into a hierarchical representation of the path followed by the computer system through the memory. The second module displays the sequence of nodes on the monitor simultaneously with the display generated by the application program. The sequence of nodes is continuously and automatically updated as the computer system traverses the memory. The control device is used to select any one of the sequence of nodes displayed on the monitor. The third module uses this selection to redirect traversal of the computer system to the level of the memory represented by the selected node.",
    "inventors": [
        "Leslie M. Meisel"
    ],
    "assignee": "Ehrlich Assoc Inc",
    "classifications": [
        "G06F3/0482",
        "G06F16/34"
    ],
    "claims": "\n1. A navigational tool for traversing information units stored in a memory of a computer system, the computer system having a monitor and operating according to a preselected application program, the navigational tool comprising:\na first module for independently tracking a path traversed by the computer system under the control of the application program through the memory, generating a sequence of nodes, each representative of one level of the path followed by the computer system under the control of the application program and organizing the nodes into a hierarchical representation of the path;\na second module for displaying the sequence of nodes on the monitor simultaneously with a display generated by the application program;\nthe first module operating to continuously update the sequence of nodes as the computer system continues to independently traverse the memory under the control of the application program;\nthe second module operating to display on the monitor, the updated sequence of nodes simultaneously with a display generated by the application program;\na control device coupled to the monitor for controllably selecting any one of the sequence of nodes displayed on the monitor; and\na third module responsive to the selection of a node by the control device to redirect the traversal of the computer system to the level of the path represented by the selected node.\n2. The navigational tool of claim 1, further comprising an index mechanism, selectable by the control device, for displaying on the monitor a topic index of the information units stored in the memory.\n3. The navigational tool of claim 2 wherein each topic displayed in the topic index is further selectable by the control device.\n4. The navigational tool of claim 3, further comprising\na fourth module, responsive to the selection of a topic by the control device, to redirect traversal of the computer system to the information unit of the selected topic,\nthe fourth module causing the second module to replace the sequence of nodes displayed with an index sequence of nodes, the first node in the index sequence of nodes representative of the topic index, each subsequent node in the index sequence of nodes representative of one level of the path followed by the computer system subsequent to the selection of a topic from the topic index.\n5. The navigational tool of claim 2 wherein the index mechanism is an index icon.\n6. The navigational tool of claim 4 wherein the third module is responsive to the selection of the first node in the index sequence of nodes by returning to the operational state of the computer system immediately prior to the selection of the index mechanism.\n7. The navigational tool of claim 1 wherein each level of the path comprises a plurality of units of information, each unit of information represented by a unit number.\n8. The navigational tool of claim 7 wherein the display generated by the application program comprises a display of one unit of information.\n9. The navigational tool of claim 8 wherein the node representative of the level currently displayed by the application program further includes an indication of the total number of units of information for each level and the unit of information currently displayed on the monitor.\n10. The navigational tool of claim 9 further comprising a next mechanism, selectable by the control device, for displaying on the monitor the unit of information having a unit number one greater than the unit of information currently displayed.\n11. The navigational tool of claim 10 wherein the next mechanism is a next icon.\n12. The navigational tool of claim 9 further comprising a previous mechanism, selectable by the control device, for displaying on the monitor the unit of information having a unit number one less than the unit of information currently displayed.\n13. The navigational tool of claim 12 wherein the previous mechanism is a previous icon.\n14. The navigational tool of claim 1 wherein the control device is a mouse.\n15. The navigational tool of claim 1, wherein each node comprises an identifier of the level of information that is represented by the node.\n16. The navigational tool of claim 1 wherein the second module further displays a plurality of special features icons selectable by the control device, each one of the plurality of special features icons representing a function executable by the application program.\n17. The navigational tool of claim 16 wherein the selection of one of the plurality of special features icons causes the application program to execute the represented function.\n18. The navigational tool of claim 16 wherein the function represented by each one of the plurality of special features icons is a function of the display currently generated by the application program.\n19. The navigational tool of claim 18 wherein the special features icons include a help icon, a graphic icon, a play movie icon and a quiz icon.\n20. The navigational tool of claim 1 wherein a first node in the sequence of nodes is representative of a main menu of the application program.\n21. The navigational tool of claim 1 wherein a last node in the sequence of nodes is representative of the display currently generated by the application program.\n22. The navigational tool of claim 1 wherein the application program is a multi-media knowledge base program.\n23. The navigational tool of claim 1 wherein the application program is a data-base program.\n24. A method for traversing information units stored in a memory of a computer system, the computer system having a monitor and operating according to a preselected application program, the method comprising the steps of:\nindependently tracking a path traversed by the computer system under the control of the application program through the memory;\ngenerating a sequence of nodes, each representative of one level of the path followed by the computer system under the control of the program;\norganizing the nodes into a hierarchical representation of the path;\ndisplaying the sequence of nodes on the monitor simultaneously with a display generated by the application program;\noperating to continuously update the sequence of nodes as the computer system continues to independently traverse the memory under the control of the application program;\ncontrollably selecting any one of the sequence of nodes displayed on the monitor; and\nthereafter redirecting the traversal of the computer system to the level of the path represented by the selected node.\n25. The method of claim 24, further comprising the steps of:\noperating to display on the monitor an index icon;\ncontrollably selecting the index icon; and thereafter displaying on the monitor a topic index of the information units stored in the memory.\n26. The method of claim 25, further comprising the steps of:\ncontrollably selecting a topic from the topic index;\nthereafter redirecting traversal of the computer system to the information unit of the selected topic; and\nreplacing the sequence of nodes displayed with an index sequence of nodes, the first node in the index sequence of nodes representative of the topic index, each subsequent node in the index sequence of nodes representative of one level of the path followed by the computer system subsequent to the selection of a topic from the topic index.\n27. The method of claim 26, further comprising the steps of:\ncontrollably selecting the first node in the index sequence of nodes; and\nthereafter returning to the operational state of the computer system immediately prior to the selection of the index icon.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4553206A",
        "US4574364A",
        "US4821211A",
        "US4827419A",
        "US4899292A",
        "US4954969A",
        "US4992972A",
        "US5032989A",
        "US5041967A",
        "US5122972A",
        "US5179654A",
        "US5191645A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5434965A",
        "US5442746A",
        "EP0676705A1",
        "US5504853A",
        "US5546529A",
        "US5649191A",
        "WO1997027534A1",
        "US5668961A",
        "US5689669A",
        "US5715444A",
        "US5717439A",
        "US5737554A",
        "US5748956A",
        "WO1998022866A1",
        "US5771379A",
        "US5787417A",
        "US5812134A",
        "US5815155A",
        "US5838319A",
        "US5854630A",
        "US5894311A",
        "WO1999027435A1",
        "US5918233A",
        "US5995106A",
        "US6006171A",
        "US6037937A",
        "US6177942B1",
        "US6256030B1",
        "DE10003189A1",
        "US20010032274A1",
        "US6310610B1",
        "US6310648B1",
        "US6335725B1",
        "US6340979B1",
        "US6385600B1",
        "US6421066B1",
        "US6424354B1",
        "US20020122047A1",
        "US6477499B1",
        "US20020175956A1",
        "US6489975B1",
        "DE10120722C1",
        "DE10132956A1",
        "US20030128241A1",
        "US6622148B1",
        "US6668377B1",
        "DE10230854A1",
        "WO2004051455A1",
        "US20040268413A1",
        "US6868525B1",
        "US20050144568A1",
        "US6920445B2",
        "US20050160372A1",
        "US20050234979A1",
        "WO2005106632A2",
        "US6966038B1",
        "US20060132482A1",
        "US20060136456A1",
        "US7071934B1",
        "US20060174289A1",
        "US20060190842A1",
        "EP1724665A1",
        "US20060265669A1",
        "US7181438B1",
        "US20070094267A1",
        "US20070130532A1",
        "US20070168059A1",
        "US20080059150A1",
        "US20080168380A1",
        "US7548899B1",
        "US20090172585A1",
        "US20090172603A1",
        "US20090172593A1",
        "US20090187855A1",
        "US20090271742A1",
        "DE102009013488A1",
        "US20110179390A1",
        "US20130254715A1",
        "US20150052486A1",
        "US20160103581A1",
        "US11182053B2"
    ],
    "citedby_ftf": []
}