{
    "patent_link": "https://patents.google.com/patent/US20020111847A1/en",
    "patent_id": "US20020111847A1",
    "title": "System and method for calculating a marketing appearance frequency measurement",
    "abstract": "A method of determining a marketing appearance frequency measurement is provided. The method includes the steps of measuring how visible to potential customers a company's point(s) of presence are within certain specified media spaces and how well the visibility within those same media spaces causes customers to exhibit certain behaviors. The resulting measurement is calibrated in such a way that the marketing frequency appearance measurement can be used as a predictor of behavior in the form of measurable business attributes such as traffic, sales, stock price, awareness, etc. The method applies for online media spaces, offline media spaces, or both, and the method further includes the step of validating the marketing appearance frequency measurement to known customer traffic, company revenue, or any number of other business attributes.",
    "inventors": [
        "James Smith"
    ],
    "assignee": "SuperMedia LLC",
    "classifications": [
        "G06Q30/02",
        "G06Q30/0201",
        "G06Q30/0202"
    ],
    "claims": "\n1. A method of determining a marketing appearance frequency measurement for at least one target point of presence for a company, the method comprising:\nsearching at least one media space to determine the number of times the at least one target point of presence appears within the at least one media space;\ncalculating weighted values for each appearance;\ncalculating an open score by summing the weighted values;\ncalculating a marketing appearance frequency measurement for the at least one target point of presence, wherein the marketing frequency measurement is equal to an exponential function of the open score adjusted for the scope of the search, and the weighted values are weighted so that the marketing appearance frequency measurement is proportional to a business attribute to be tracked.\n2. The method of claim 1, further comprising calculating an open score for each media space, wherein each open score is additive so that the open scores can be added to derive a combined open score, which is used to calculate the marketing appearance frequency measurement.\n3. The method of claim 1, wherein adjusting the open score for the scope of the search comprises dividing the open score by an estimation of the maximum open score for the at least one media space searched.\n4. The method of claim 1, wherein adjusting the open score for the scope of the search comprises dividing the open score by the total number of points of presence of the same type as the at least one target point of presence that were observed during the search.\n5. The method of claim 1, wherein the exponential function comprises a term equal to 1 minus the exponential of the open score adjusted for the scope of the search.\n6. The method of claim 5, wherein the exponential function further includes a scaling factor designed to place the resulting marketing appearance frequency measurement within a predetermined range.\n7. The method of claim 1, wherein the media spaces comprise offline sources, online sources, or both.\n8. The method of claim 1, wherein the weighted values are calculated to represent the likelihood each appearance will be seen and effect the business attribute being tracked.\n9. The method of claim 1, further comprising the step of validating the marketing appearance frequency measurement to known customer traffic, sales, or both.\n10. The method of claim 9, further comprising the step of calibrating the marketing appearance frequency measurement using known traffic, sales, or both.\n11. The method of claim 1, further comprising the step of using the marketing appearance frequency measurement to predict at least one of the following:\ncustomer traffic;\nsales;\nstock price;\nadvertising expenditures; and\nawareness.\n12. The method of claim 11, further comprising the step of using the marketing appearance frequency measurement to identify the sources of customer traffic resulting from the at least one target point of presence.\n13. The method of claim 1, further comprising the steps of calculating a marketing appearance frequency measurement for at least one target point of presence for a plurality of companies and generating a marketing appearance frequency index from the calculated marketing appearance frequency measurements.\n14. The method of claim 1, wherein the at least one media space searched includes at least one of the following media spaces: telephone books, press releases, news articles, billboards, keyword-driven Internet search engines, categorical directories on Internet search engines, World-Wide Web banner ads, and other World-Wide Web pages.\n15. A method of determining a marketing appearance frequency measurement for at least one target URL of a company, the method comprising:\nsearching at least one media space on World-Wide Web sites to determine the number of times the at least one target URL appears within the at least one media space;\ncalculating weighted values for each appearance;\ncalculating an open score by summing the weighted values;\ncalculating a marketing appearance frequency measurement for the at least one target URL, wherein the marketing frequency measurement is equal to an exponential function of the open score adjusted for the scope of the search, and the weighted values are weighted so that the marketing appearance frequency measurement is proportional to a business attribute to be tracked.\n16. The method of claim 15, further comprising calculating an open score for each media space, wherein each open score is additive so that the open scores can be added to derive a combined open score, which is used to calculate the marketing appearance frequency measurement.\n17. The method of claim 15, wherein the searched media spaces include at least one of the following:\nkeyword driven search result pages;\nsearch engine category pages;\nincoming links on third party pages;\ninternet chat rooms;\ninternet news groups;\ncompany press releases; and\nbanner ads on any page.\n18. The method of claim 16, wherein the searched media spaces include at least one of the following:\nkeyword driven search result pages;\nsearch engine category pages;\nincoming links on third party pages;\ninternet chat rooms;\ninternet news groups;\ncompany press releases; and\nbanner ads on any page.\n19. The method of claim 15, wherein each appearance is weighted based on the likelihood that the appearance will be seen by a potential customer and effect the business attribute being tracked.\n20. The method of claim 19, wherein the business attribute being tracked is customer traffic.\n21. The method of claim 20, further comprising the step of using the marketing appearance frequency measurement to predict customer traffic to the at least one target URL.\n22. The method of claim 15, wherein the weighted values are calculated to represent the likelihood each appearance will be seen and effect the business attribute being tracked.\n23. A computer, comprising:\na memory configured to store a computer program and data; and\na processor configured to run the computer program, the computer program configured to perform the following functions:\nsearch certain pages on certain World-Wide Web sites to collect a set of observations relating to at least one target point of presence for a company;\ncompute weighted values for each appearance of the target point or points of presence;\ncompute an open score by summing the weighted values; and\ncompute a marketing appearance frequency measurement from the open score for the target point or points of presence, wherein the marketing frequency measurement is equal to an exponential function of the open score adjusted for the scope of the search, and the weighted values are weighted so that the marketing appearance frequency measurement is proportional to a business attribute to be tracked.\n24. The computer of claim 23, wherein the computer program further calculates a marketing appearance frequency measurement for at least one target point of presence for a plurality of companies and generates a marketing appearance frequency index from the calculated marketing appearance frequency measurements.\n25. The computer of claim 23, wherein the computer program further estimates traffic for the at least one target point of presence based on the marketing appearance frequency measurement.\n26. The computer of claim 23, wherein the computer program further calculates a marketing frequency index for any number of companies having one or more points of presence in the same media space as the at least one target point of presence.\n27. The computer of claim 23, wherein the computer program adjusts the open score for the scope of the search by dividing the open score by an estimation of the maximum open score for the at least one media space searched.\n28. The computer of claim 23, wherein the computer program adjusts the open score by dividing the open score by the total number of points of presence of the same type as the at least one target point of presence that were observed during the search.\n29. The computer of claim 23, wherein the exponential function used by the computer program comprises a term equal to 1 minus the exponential of the open score adjusted for the scope of the search.\n30. The computer of claim 29, wherein the exponential function used by the computer program further includes a scaling factor designed to place the resulting marketing appearance frequency measurement within a predetermined range.\n31. The computer of claim 23, wherein the calculated weighted values represent the likelihood each appearance will be seen and effect the business attribute being tracked.",
    "status": "Abandoned",
    "citations_own": [
        "US6009409A",
        "US6182050B1",
        "US6286005B1",
        "US6351736B1",
        "US6584492B1",
        "US6714975B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20030004777A1",
        "US20030046389A1",
        "US20030055819A1",
        "US20030101093A1",
        "US20030110074A1",
        "US20030208578A1",
        "US20040260677A1",
        "US20040267717A1",
        "US20050015394A1",
        "US20050050013A1",
        "US20050149388A1",
        "US20060015390A1",
        "US20060074742A1",
        "US20060145916A1",
        "US20070143266A1",
        "US20070156757A1",
        "US20070162379A1",
        "US20070265893A1",
        "US20080059310A1",
        "US20080077577A1",
        "US20080243835A1",
        "US20080256018A1",
        "US20080294487A1",
        "US7461051B2",
        "US8024447B1",
        "US8266246B1",
        "ITMI20111044A1",
        "WO2013003603A2",
        "US8572173B2",
        "US8660872B1",
        "US20140188831A1",
        "US8886651B1",
        "US8918312B1",
        "US8925099B1",
        "US20160012454A1",
        "US9331969B2",
        "US9336487B2",
        "US9432468B2",
        "US9558276B2",
        "US9563336B2",
        "US9576292B2",
        "US9590930B2",
        "US9639869B1",
        "US9672196B2",
        "US9767212B2",
        "US9819561B2",
        "US9892417B2",
        "US10038683B2",
        "US10083459B2",
        "US10104020B2",
        "US10180966B1",
        "US10185715B1",
        "US10235688B2",
        "US10278065B2",
        "US10289648B2",
        "US10402431B2",
        "US10475082B2",
        "US10636041B1",
        "US10869253B2",
        "US10979378B1",
        "US11227291B2",
        "US11263548B2",
        "US11386442B2"
    ],
    "citedby_ftf": []
}