{
    "patent_id": "US-11244484-B2",
    "title": "AI-driven design platform ",
    "assignee": "Accenture Global Solutions Limited",
    "publication_date": "2022-02-08",
    "patent_link": "https://patents.google.com/patent/US11244484B2/en",
    "inventors": [
        "Alpana A. Dubey",
        "Mary Elizabeth Hamilton",
        "Manish Mehta",
        "Suma Mani Kuriakose",
        "Nitish A. Bhardwaj"
    ],
    "classifications": [
        "G06F16/3329",
        "G06T11/60",
        "G06F16/583",
        "G06F16/9038",
        "G06F30/00",
        "G06F30/10",
        "G06F30/27",
        "G06N20/00",
        "G06N3/006",
        "G06N3/044",
        "G06N3/0445",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/08",
        "G06N5/022",
        "G06T11/001",
        "G06T7/11",
        "G06F2111/02",
        "G06F2119/18",
        "G06F3/0484",
        "H04L67/01",
        "H04L67/42"
    ],
    "abstract": "Implementations of the present disclosure include generating, by a design generation assistant, a design image representing a design subject, the design subject having one or more regulations applicable thereto, querying, by a regulation assistant, an answer extractor to provide a query result based on a query, the answer extractor including at least one deep learning model that processes the query to provide the query result, the query being descriptive of at least a portion of the design subject, the query result being representative of at least one regulation applicable to the design subject, and displaying, within a graphical user interface (GUI), the query result.",
    "claims": "\n1. A computer-implemented method for generating a design using an artificial intelligence (AI)-based platform comprising a suite of AI-based design assistants, the method comprising:\ngenerating, by a design generation assistant, a design image representing a design subject, the design subject having one or more regulations applicable thereto;\nprocessing one or more regulatory documents to provide text data representative of text sections and tuple data representative of tables, the text data being provided from a text preprocessing unit that separates combined sections of text within a regulatory document to provide the text sections as respective cohesive text sections;\nquerying, by a regulation assistant, an answer extractor to provide a query result based on a query, the answer extractor comprising at least one deep learning model that processes the query to provide the query result, the query being descriptive of at least a portion of the design subject, the query result being representative of at least one regulation applicable to the design subject; and\ndisplaying, within a graphical user interface (GUI), the query result.\n2. The method of claim 1, wherein the answer extractor comprises a word embedding layer, a convolution layer, an encoder layer, and an attention layer.\n3. The method of claim 2, wherein the word embedding layer generates one or more word embeddings based on the query, the query result being provided based on the one or more word embeddings.\n4. The method of claim 2, wherein the encoder layer comprises a bi-directional long short-term memory (LSTM) encoder that captures word ordering in both a forward direction and a backwards direction.\n5. The method of claim 1, wherein each query result is provided based on one or more regulatory documents each regulatory document being industry-specific.\n6. The method of claim 1, wherein the tuple data is provided from a table preprocessing unit that generates one or more tuples based on cell values of tables.\n7. The method of claim 1, wherein the tuple data comprises resource description framework (RDF) triples.\n8. The method of claim 1, wherein the query is an explicit query submitted by a user through a search interface of the GUI.\n9. The method of claim 1, wherein the query is an implicit query that is automatically submitted based on the subject matter of the design.\n10. The method of claim 1, wherein the design image is displayed in the GUI concurrently with the query result.\n11. The method of claim 1, wherein the query result comprises a plurality of descriptive answers, each descriptive answer having a respective relevance score provided therewith, each relevance score indicating a degree of relevance of a respective descriptive answer to the query.\n12. The method of claim 1, further comprising generating, by the design generation assistant, the design image by processing a content image and a style image to transfer a style represented within the style image to one or more objects represented within the content image.\n13. The method of claim 12, further comprising:\nprocessing, by a trendspotting assistant, data from one or more data sources to identify a set of style images, each style image being representative of a trending style;\nprocessing, by the trendspotting assistant, data from one or more data sources to identify a set of content images, each content image being representative of a trending content; and\nproviding, by the trendspotting assistant, the set of style images and the set of content images to the design generation assistant.\n14. A non-transitory computer-readable storage medium coupled to one or more processors and having instructions stored thereon which, when executed by the one or more processors, cause the one or more processors to perform operations for generating a design using an artificial intelligence (AI)-based platform comprising a suite of AI-based design assistants, the operations comprising:\ngenerating, by a design generation assistant, a design image representing a design subject, the design subject having one or more regulations applicable thereto;\nprocessing one or more regulatory documents to provide text data representative of text sections and tuple data representative of tables, the text data being provided from a text preprocessing unit that separates combined sections of text within a regulatory document to provide the text sections as respective cohesive text sections;\nquerying, by a regulation assistant, an answer extractor to provide a query result based on a query, the answer extractor comprising at least one deep learning model that processes the query to provide the query result, the query being descriptive of at least a portion of the design subject, the query result being representative of at least one regulation applicable to the design subject; and\ndisplaying, within a graphical user interface (GUI), the query result.\n15. The computer-readable storage medium of claim 14, wherein the answer extractor comprises a word embedding layer, a convolution layer, an encoder layer, and an attention layer.\n16. The computer-readable storage medium of claim 15, wherein the word embedding layer generates one or more word embeddings based on the query, the query result being provided based on the one or more word embeddings.\n17. The computer-readable storage medium of claim 15, wherein the encoder layer comprises a bi-directional long short-term memory (LSTM) encoder that captures word ordering in both a forward direction and a backwards direction.\n18. The computer-readable storage medium of claim 14, wherein each query result is provided based on one or more regulatory documents each regulatory document being industry-specific.\n19. The computer-readable storage medium of claim 14, wherein the tuple data is provided from a table preprocessing unit that generates one or more tuples based on cell values of tables.\n20. The computer-readable storage medium of claim 14, wherein the tuple data comprises resource description framework (RDF) triples.\n21. The computer-readable storage medium of claim 14, wherein the query is an explicit query submitted by a user through a search interface of the GUI.\n22. The computer-readable storage medium of claim 14, wherein the query is an implicit query that is automatically submitted based on the subject matter of the design.\n23. The computer-readable storage medium of claim 14, wherein the design image is displayed in the GUI concurrently with the query result.\n24. The computer-readable storage medium of claim 14, wherein the query result comprises a plurality of descriptive answers, each descriptive answer having a respective relevance score provided therewith, each relevance score indicating a degree of relevance of a respective descriptive answer to the query.\n25. The computer-readable storage medium of claim 14, wherein operations further comprise generating, by the design generation assistant, the design image by processing a content image and a style image to transfer a style represented within the style image to one or more objects represented within the content image.\n26. The computer-readable storage medium of claim 25, wherein operations further comprise:\nprocessing, by a trendspotting assistant, data from one or more data sources to identify a set of style images, each style image being representative of a trending style;\nprocessing, by the trendspotting assistant, data from one or more data sources to identify a set of content images, each content image being representative of a trending content; and\nproviding, by the trendspotting assistant, the set of style images and the set of content images to the design generation assistant.\n27. A system, comprising:\none or more computers; and\na computer-readable storage device coupled to the computing device and having instructions stored thereon which, when executed by the computing device, cause the computing device to perform operations for generating a design using an artificial intelligence (AI)-based platform comprising a suite of AI-based design assistants, the operations comprising:\ngenerating, by a design generation assistant, a design image representing a design subject, the design subject having one or more regulations applicable thereto;\nprocessing one or more regulatory documents to provide text data representative of text sections and tuple data representative of tables, the text data being provided from a text preprocessing unit that separates combined sections of text within a regulatory document to provide the text sections as respective cohesive text sections;\nquerying, by a regulation assistant, an answer extractor to provide a query result based on a query, the answer extractor comprising at least one deep learning model that processes the query to provide the query result, the query being descriptive of at least a portion of the design subject, the query result being representative of at least one regulation applicable to the design subject; and\ndisplaying, within a graphical user interface (GUI), the query result.\n28. The system of claim 27, wherein the answer extractor comprises a word embedding layer, a convolution layer, an encoder layer, and an attention layer.\n29. The system of claim 28, wherein the word embedding layer generates one or more word embeddings based on the query, the query result being provided based on the one or more word embeddings.\n30. The system of claim 28, wherein the encoder layer comprises a bi-directional long short-term memory (LSTM) encoder that captures word ordering in both a forward direction and a backwards direction.\n31. The system of claim 27, wherein each query result is provided based on one or more regulatory documents each regulatory document being industry-specific.\n32. The system of claim 27, wherein the tuple data is provided from a table preprocessing unit that generates one or more tuples based on cell values of tables.\n33. The system of claim 27, wherein the tuple data comprises resource description framework (RDF) triples.\n34. The system of claim 27, wherein the query is an explicit query submitted by a user through a search interface of the GUI.\n35. The system of claim 27, wherein the query is an implicit query that is automatically submitted based on the subject matter of the design.\n36. The system of claim 27, wherein the design image is displayed in the GUI concurrently with the query result.\n37. The system of claim 27, wherein the query result comprises a plurality of descriptive answers, each descriptive answer having a respective relevance score provided therewith, each relevance score indicating a degree of relevance of a respective descriptive answer to the query.\n38. The system of claim 27, wherein operations further comprise generating, by the design generation assistant, the design image by processing a content image and a style image to transfer a style represented within the style image to one or more objects represented within the content image.\n39. The system of claim 38, wherein operations further comprise:\nprocessing, by a trendspotting assistant, data from one or more data sources to identify a set of style images, each style image being representative of a trending style;\nprocessing, by the trendspotting assistant, data from one or more data sources to identify a set of content images, each content image being representative of a trending content; and\nproviding, by the trendspotting assistant, the set of style images and the set of content images to the design generation assistant."
}