{
    "patent_link": "https://patents.google.com/patent/US20120271748A1/en",
    "patent_id": "US20120271748A1",
    "title": "Engineering process for a real-time user-defined data collection, analysis, and optimization tool (dot)",
    "abstract": "A method, system, process, and computer program that receives, collects, displays, and optimizes user-defined data. The collection, analysis, and optimization process is applicable to a wide variety of industries for both real-time and historical data. Some sample industries that will benefit from this invention include: securities trading, vehicular traffic optimization, medical image scanning, wireless communications, and aircraft routing.",
    "inventors": [
        "Dean F. DiSalvo"
    ],
    "assignee": "Individual",
    "classifications": [],
    "claims": "\n1. A method for collecting, analyzing, and optimizing real-time and historical data, the method comprising:\nsupplying user-defined raw data;\nstoring the raw data in a database;\ndisplaying the raw data in one or more charts and tables, wherein entries in the one or more charts and tables are user-defined;\nidentifying patterns in the raw data; and\nanalyzing the raw data according to user-defined trade parameters.\n2. The method of claim 1 wherein the trade parameters comprise market depth prices.\n3. The method of claim 1 further comprising a step of simulating orders to buy and sell securities using the raw data to determine outcomes of the buy and sell simulations, wherein the step of simulating identifies one or more patterns and executes a simulation when the raw data satisfies the one or more patterns.\n4. The method of claim 3 wherein the step of simulating further comprises identifying one or more patterns and one or more conditions in the raw data.\n5. The method of claim 1 further comprising a step of placing orders to buy and sell securities, wherein the step of placing orders identifies one or more patterns and executes an order when the raw data satisfies the one or more patterns.\n6. The method of claim 1 further comprising optimizing one or more of the patterns and the trade parameters with user-defined artificial intelligence techniques to adjust the patterns.\n7. The method of claim 1 wherein the patterns comprise predetermined patterns.\n8. The method of claim 1 wherein the patterns comprises user-defined patterns.",
    "status": "Abandoned",
    "citations_own": [
        "US5297032A",
        "US6272474B1",
        "US20020073017A1",
        "US20020133449A1",
        "US20020188552A1",
        "US6801201B2",
        "US20050080710A1",
        "US6907404B1",
        "US20050283427A1",
        "US7177833B1",
        "US7212999B2"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20100309200A1",
        "US20110069072A1",
        "US20130103561A1",
        "US8631325B1",
        "US20140108906A1",
        "US20140122679A1",
        "US20140164960A1",
        "US20140229449A1",
        "US20140278764A1",
        "US20140359036A1",
        "US20140372853A1",
        "US8972295B2",
        "US20150067566A1",
        "US20150073958A1",
        "US20150077428A1",
        "US20150154699A1",
        "USD733178S1",
        "US20150195345A1",
        "US20150242742A1",
        "US9230351B2",
        "US9251277B2",
        "US9251276B1",
        "US20160055587A1",
        "US9389909B1",
        "US20160217526A1",
        "US9430720B1",
        "US9484004B2",
        "US20170093655A1",
        "RU2622857C1",
        "US9817871B2",
        "US20170330073A1",
        "US20180089707A1",
        "US9942312B1",
        "US20180241611A1",
        "WO2019014103A1",
        "US20190044836A1",
        "US10305739B1",
        "US10318545B1",
        "US20190191009A1",
        "US10482241B2",
        "US10530792B2",
        "US10536476B2",
        "US10534908B2",
        "US20200034336A1",
        "US10552734B2",
        "US10552605B2",
        "US10560313B2",
        "US10630705B2",
        "US10673879B2",
        "US10681064B2",
        "US10685283B2",
        "US10764306B2",
        "US10771247B2",
        "US10803512B2",
        "USD914755S1",
        "US10983682B2",
        "US10986111B2",
        "USD916737S1",
        "USD916740S1",
        "USD916736S1",
        "USD916739S1",
        "USD918223S1",
        "US11068146B2",
        "USD928838S1",
        "US11128651B2",
        "US11217023B1",
        "US11222346B2",
        "US11257159B2",
        "US20220058840A1",
        "US11282138B2",
        "US20220100360A1",
        "US11321781B1",
        "US20220215474A1",
        "US11385774B2",
        "US11470094B2",
        "USD967158S1",
        "US20220374984A1",
        "US20220392125A1",
        "US11562027B1",
        "USD976938S1",
        "US20230316400A1"
    ],
    "citedby_ftf": []
}