{
    "patent_id": "US-11615331-B2",
    "title": "Explainable artificial intelligence ",
    "assignee": "Accenture Global Solutions Limited",
    "publication_date": "2023-03-28",
    "patent_link": "https://patents.google.com/patent/US11615331B2/en",
    "inventors": [
        "Chung-Sheng Li",
        "Guanglei Xiong",
        "Ashish Jain",
        "Emmanuel Munguia Tapia",
        "Sukryool Kang",
        "Benjamin Nathan Grosof"
    ],
    "classifications": [
        "G06N5/022",
        "G06N5/048",
        "G06F16/35",
        "G06F16/367",
        "G06N20/00",
        "G06N5/04",
        "G06N5/042",
        "G06N5/045"
    ],
    "abstract": "Examples of artificial intelligence-based reasoning explanation are described. In an example implementation, a knowledge model having a plurality of ontologies and a plurality of inferencing rules is generated. Once the knowledge model is generated, based on a real-world problem, a knowledge model from amongst various knowledge models is selected to be used for resolving a real-world problem. The data procured from the real-world problem is clustered and classified into an ontology of the determined knowledge model. Inferencing rules to be used for deconstructing the real-world problem are identified, and a machine reasoning is generated to provide a hypothesis for the problem and an explanation to accompany the hypothesis.",
    "claims": "\n1. An artificial intelligence (AI) system comprising:\na processor; and\na memory storing instructions, which when executed by the processor, cause the system to:\ngenerate one or more knowledge models, each of the knowledge models comprising a plurality of ontologies and a plurality of inferencing rules for generating an explanation for a decision made by the AI system, wherein, to generate the one or more knowledge models, the processor is configured to:\ncreate the plurality of ontologies based on data procured from real-world interactions, the data procured being real-world data, the real-world data comprising structured data, unstructured data, and semi-structured data; and\nconstruct the plurality of inferencing rules based on the plurality of ontologies and the real-world data procured from the real-world interactions; and\nwherein, for decision-making when faced with a real-world problem, the processor is to:\nselect a knowledge model from the generated one or more knowledge models to be used for resolving the real-world problem, based on the real-world problem; and\nexecute a decision-making process and generate an explanation for the decision made, wherein, to execute the decision-making process and to generate an explanation for the decision made, the processor is configured to:\nclassify and cluster data procured from the real-world problem into an ontology of the selected knowledge model by:\nclustering the data procured from the real-world problem into a plurality of clusters; and\nmapping the plurality of clusters with the plurality of ontologies of the selected knowledge model to refine the clusters and the ontologies;\nidentify inferencing rules to be used for deconstructing the real-world problem, wherein the identified inferencing rules are triggered using a backward chaining process, wherein in the backward chaining process, the identified inferencing rules are used to evaluate sub-problems from the real-world problem and create a tree of goals, by matching the identified inferencing rules against the corresponding goals while traversing in a depth-first and a left-to-right manner; and\nprovide a machine-learning based reasoning to provide a hypothesis for the real-world problem and an explanation to accompany the hypothesis, wherein the processor is to determine a confidence level parameter indicating a strength of the explanation for the decision made based on the identified inferencing rules, and wherein the confidence level parameter further indicates “value at risk” of the decision.\n2. The AI system as claimed in claim 1, wherein the processor is to generate a visual representation of the decision and the explanation using machine learning techniques.\n3. The AI system as claimed in claim 1, wherein the processor is to parse the real-world problem to curate logical sentences in the real-world problem.\n4. The AI system as claimed in claim 1; wherein the processor is to provide a human-readable form of the deconstruction of the real-world problem to preview a line of reasoning.\n5. An AI system comprising:\na processor; and\na memory storing instructions, which when executed by the processor, cause the system to:\ngenerate one or more knowledge models, each of the knowledge models comprising a plurality of ontologies and a plurality of inferencing rules for generating an explanation for a decision made by the AI system, wherein, to generate the one or more knowledge models, the processor is configured to:\ncreate the plurality of ontologies based on data procured from real-world interactions, the data procured being real-world data, the real-world data comprising structured data, unstructured data, and semi-structured data, wherein the processor is to utilize inductive reasoning techniques for creating the ontology; and\nconstruct the plurality of inferencing rules based on the plurality of ontologies and the real-world data procured from the real-world interactions, wherein the processor is to utilize deductive reasoning techniques for creating the plurality of inferencing rules; and\nwherein, for decision-making when faced with a real-world problem, the processor is to:\nselect a knowledge model from the generated one or more knowledge models to be used for resolving the real-world problem, based on the real-world problem; and\nexecute a decision-making process and generate an explanation for the decision made, wherein, to execute the decision-making process and to generate an explanation for the decision made, the processor is configured to:\nclassify and cluster data procured from the real-world problem into an ontology of the selected knowledge model by:\nclustering the data procured from the real-world problem into a plurality of clusters; and\nmapping the plurality of clusters with the plurality of ontologies of the selected knowledge model to refine the clusters and the ontologies;\nidentify inferencing rules to be used for de-constructing the real-world problem, wherein the processor is to utilize the deductive reasoning techniques for deconstructing the real-world problem, wherein the identified inferencing rules are triggered using a backward chaining process, wherein in the backward chaining process, the identified inferencing rules are used to evaluate sub-problems from the real-world problem and create a tree of goals, by matching the identified inferencing rules against the corresponding goals while traversing in a depth-first and a left-to-right manner;\nprovide a machine-generated reasoning to provide a hypothesis for the problem and an explanation to accompany the hypothesis, wherein abductive reasoning techniques are utilized for providing the hypothesis and the explanation; and\ndetermine a confidence parameter, indicative of a strength of the explanation for the decision made based on the identified inferencing rules, wherein the confidence level parameter further indicates “value at risk” of the decision.\n6. The AI system as claimed in claim 5, wherein the processor is to build a strength of the explanation into the inferencing rules.\n7. The AI system as claimed in claim 5, wherein the processor is to parse the real-world problem to curate logical sentences in the real-world problem.\n8. The AI system as claimed in claim 5, wherein the processor is to provide a human-readable form of the deconstruction of the real-world problem to preview a line of reasoning.\n9. The AI system as claimed in claim 5, wherein the inductive reasoning techniques comprise one of supervised clustering techniques and unsupervised clustering techniques.\n10. The AI system as claimed in claim 5, wherein the abductive reasoning techniques comprise evidence-based reasoning techniques.\n11. A non-transitory computer readable medium including machine readable instructions that are executable by a processor to:\ngenerate one or more knowledge models, each of the knowledge models comprising a plurality of ontologies and a plurality of inferencing rules for generating an explanation for a decision made by an AI system, wherein generating the one or more knowledge models comprises creating the plurality of ontologies based on data procured from real-world interactions using inductive reasoning techniques for creating the ontology, and creating the plurality of inferencing rules based on the plurality of ontologies and the data procured from the real-world interactions using deductive reasoning techniques tor creating the plurality of inferencing rules;\ndetermine a knowledge model from the generated one or more knowledge models to be used for resolving a real-world problem, based on the real-world problem;\nclassify and cluster data procured from the real-world problem into an ontology of the determined knowledge model by:\nclustering the data procured from the real-world problem into a plurality of dusters; and\nmapping the plurality of clusters with the plurality of ontologies of the determined knowledge model to refine the clusters and the ontologies;\nidentify inferencing rules to be used for deconstructing the real-world problem using deductive reasoning techniques for deconstructing the real-world problem, wherein the identified inferencing rules are triggered using a backward chaining process, wherein in the backward chaining process, the identified inferencing rules are used to evaluate sub-problems from the real-world problem and create a tree of goals, by matching the identified inferencing rules against the corresponding goals while traversing in a depth-first and a left-to-right manner;\nprovide a machine-learning based reasoning to provide a hypothesis for the problem and an explanation to accompany the hypothesis using abductive reasoning techniques for providing the hypothesis and the explanation; and\ndetermine a confidence parameter, indicative of a strength of the explanation for the decision made based on the identified inferencing rules, wherein the confidence level parameter further indicates “value at risk” of the decision.\n12. The non-transitory computer readable medium as claimed in claim 11, wherein to provide the machine-learning based reasoning, the processor is to generate a visual representation of the decision and the explanation using machine learning techniques.\n13. The non-transitory computer readable medium as claimed in claim 11, wherein to identify the inferencing rule, the processor is to parse the real-world problem to curate logical sentences in the real-world problem.\n14. The non-transitory computer readable medium as claimed in claim 11, where-in to identify the inferencing rule, the processor is to provide a human-readable form of the deconstruction of the real-world problem to preview of a line of reasoning.\n15. The non-transitory computer readable medium as claimed in claim 11, where-in the inductive reasoning techniques comprise one of supervised clustering techniques and unsupervised clustering techniques.\n16. The non-transitory computer readable medium as claimed in claim 11, where-in the abductive reasoning techniques comprise evidence-based reasoning techniques.",
    "status": "Active",
    "citations_own": [
        "US20060053170A1",
        "US20060053098A1",
        "US20070203693A1",
        "US20080270336A1",
        "US20110078187A1",
        "US20130110518A1",
        "US20130179388A1",
        "US20140075004A1",
        "US20150235143A1",
        "US20160179945A1",
        "US20170213156A1",
        "US20190147369A1",
        "US10311442B1",
        "US20190214024A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20190043070A1"
    ],
    "citedby_ftf": [
        "US10127240B2",
        "KR102366282B1",
        "EP3674993A1",
        "US11636331B2",
        "CN110619585A",
        "US11049043B2",
        "US20210232940A1",
        "CA3072901A1",
        "US11645566B2",
        "CA3176509A1",
        "WO2022047571A1",
        "EP4244770A1",
        "US11720962B2",
        "US20220300854A1",
        "TWI774324B",
        "TWI808895B"
    ]
}