{
    "patent_link": "https://patents.google.com/patent/US20100191685A1/en",
    "patent_id": "US20100191685A1",
    "title": "Methods and systems for feature selection in machine learning based on feature contribution and model fitness",
    "abstract": "Methods and systems are provided for feature selection in machine learning, in which the features selected for inclusion in a prediction rule are selected based on statistical metric(s) of feature contribution and/or model fitness.",
    "inventors": [
        "Marina Sapir",
        "Faisal M. Khan",
        "David A. Verbel",
        "Olivier Saidi"
    ],
    "assignee": "Champalimaud Foundation",
    "classifications": [
        "G06N5/025",
        "G06F18/2113",
        "G16H50/20",
        "G16H50/50"
    ],
    "claims": "\n1. A method for selecting features for a final prediction rule, said method comprising:\n(a) generating a prediction rule based on data for a set of features, wherein initially said set of features includes n features;\n(b) determining a fitness value for said prediction rule;\n(c) determining a value of contribution to said prediction rule for each of said features in said set of features;\n(d) removing a feature from consideration from said set of features based on the values of contribution;\n(e) iterating (a)-(d) in order to produce n prediction rules and n fitness values; and\n(f) selecting, based on the fitness values for said n prediction rules, one of said n models as said final prediction rule.\n2. The method of claim 1, wherein stages (a)-(f) are performed in that order.\n3. The method of claim 1, wherein determining a fitness value for said prediction rule comprises summing a concordance index (CI) of said prediction rule with a product of a sensitivity and a specificity of said prediction rule.\n4. The method of claim 1, wherein determining a fitness value for said prediction rule comprises measuring a separation between one or more outcome value(s) predicted by said prediction rule and actual outcome(s).\n5. The method of claim 1, wherein determining a fitness value for said prediction rule comprises calculating the following risk functional:\n\nR(k,l)=fitness/(1−sqrt((k(log(l/k)+1)+log(l)/2)/l))\n6. The method of claim 1, wherein said determining a value of contribution comprises determining a contribution value for each feature i by multiplying a weight of said feature i in said prediction rule with a measure of the discriminative ability of said feature i as observed in the data used to generate said prediction rule.\n7. The method of claim 1, wherein said determining a value of contribution comprises determining a contribution value for each feature i by multiplying a weight of said feature i in said prediction rule with a concordance index (CI) for said feature i.\n8. The method of claim 1, wherein said iterating (a)-(d) comprises:\nrepeating (a) and (b) as long as said set of features includes 1 or more features; and\nrepeating (c) and (d) as long as said set of features includes 2 or more features.\n9. An apparatus for determining an outcome for an instance, said apparatus comprising:\na computer implementation of a final prediction rule, wherein said final prediction rule is based on features selected through machine learning, said machine learning comprising (a) generating a prediction rule based on data for a set of features, wherein initially said set includes n features, (b) determining a fitness value for said prediction rule, (c) determining a value of contribution to said prediction rule for each of said features in said set of features, (d) removing a feature from consideration from said set of features based on the values of contribution, (e) iterating (a)-(d) in order to produce n prediction rules and n fitness values, and (f) selecting, based on the fitness values for said n models, one of said n prediction rules as said final prediction rule, wherein said computer implementation of said final prediction rule is configured to:\nreceive data for an instance; and\nevaluate said data for said instance according to said final prediction rule, thereby determining an outcome for said instance.\n10. The apparatus of claim 9, wherein said machine learning determines a fitness value for said prediction rule by summing a concordance index (CI) of said prediction rule with a product of a sensitivity and a specificity of said prediction rule.\n11. The apparatus of claim 9, wherein said machine learning determines a fitness value for said prediction rule by measuring a separation between one or more outcome value(s) predicted by said prediction rule and actual outcome(s).\n12. The apparatus of claim 9, wherein said machine learning determines a fitness value for said prediction rule by calculating the following risk functional:\n\nR(k,l)=fitness/(1−sqrt((k(log(l/k)+1)+log(l)/2)/l))\n13. The apparatus of claim 9, wherein said machine learning determines a value of contribution for each feature i by multiplying a weight of said feature i in said prediction rule with a measure of the discriminative ability of said feature i as observed in the data used to generate said prediction rule.\n14. The apparatus of claim 9, wherein said machine learning determines a value of contribution for each feature i by multiplying a weight of said feature i in said prediction rule with a concordance index (CI) for said feature i.\n15. A computer readable medium comprising computer executable instructions recorded thereon for performing the method comprising:\n(a) generating a prediction rule based on data for a set of features, wherein initially said set includes n features;\n(b) determining a fitness value for said prediction rule;\n(c) determining a value of contribution to said prediction rule for each of said features in said set of features;\n(d) removing a feature from consideration from said set of features based on the values of contribution;\n(e) iterating (a)-(d) to produce n prediction rules and n fitness values; and\n(f) selecting, based on the fitness values for said n models, one of said n prediction rules as the basis for said final prediction rule.\n16. The computer readable medium of claim 15, further comprising computer executable instructions recorded thereon for determining a fitness value for said prediction rule by performing the method comprising summing a concordance index (CI) of said prediction rule with a product of a sensitivity and a specificity of said prediction rule.\n17. The computer readable medium of claim 15, further comprising computer executable instructions recorded thereon for determining a fitness value for said prediction rule by performing the method comprising measuring a separation between one or more outcome value(s) predicted by said prediction rule and actual outcome(s).\n18. The computer readable medium of claim 15, further comprising computer executable instructions recorded thereon for determining a fitness value for said prediction rule by performing the method comprising calculating the following risk functional:\n\nR(k,l)=fitness/(1−sqrt((k(log(l/k)+1)+log(l)/2)/l))\n19. The computer readable medium of claim 15, further comprising computer executable instructions recorded thereon for determining a value of contribution by performing the method comprising determining a contribution value for each feature i by multiplying a weight of said feature i in said prediction rule with a measure of the discriminative ability of said feature i as observed in the data used to generate said prediction rule.\n20. The computer readable medium of claim 15, further comprising computer executable instructions recorded thereon for determining a value of contribution by performing the method comprising determining a contribution value for each feature i by multiplying a weight of said feature i in said prediction rule with a concordance index (CI) for said feature i.",
    "status": "Abandoned",
    "citations_own": [],
    "citations_ftf": [
        "US5649068A",
        "JP3761238B2",
        "US6409664B1",
        "US7475048B2",
        "US7430477B2",
        "JP5246984B2",
        "US6917926B2",
        "US6910192B2",
        "WO2003057011A2",
        "US7467119B2",
        "US8062897B2",
        "US7461048B2",
        "US7505948B2",
        "US6995020B2",
        "WO2005050563A2",
        "WO2005086068A2",
        "EP1728211A2",
        "EP1789923A1",
        "US8093012B2"
    ],
    "citedby_own": [
        "WO2011023356A2",
        "US20140257846A1",
        "US20160078361A1",
        "US9412365B2",
        "US9805713B2",
        "US10134394B2",
        "WO2019088759A1",
        "US10497118B2",
        "US11355245B2"
    ],
    "citedby_ftf": [
        "WO2005086068A2",
        "EP2027465A2",
        "JP5159242B2",
        "JP2011528933A",
        "US9779213B2",
        "WO2010011356A2",
        "EP3845904A1",
        "US9522396B2",
        "JP6066086B2",
        "EP3553527A1",
        "CN104169719B",
        "WO2014155690A1",
        "EP3869257A1",
        "IL227276A0",
        "EP3955042A1",
        "CN107077732B",
        "JP6952683B2",
        "ES2931924T3",
        "EP3188038B1",
        "WO2017168411A1",
        "CN109564209B",
        "US11307196B2",
        "WO2018007244A1",
        "US10997135B2",
        "WO2018089973A1",
        "US11139048B2",
        "US11062792B2",
        "CN111788471A",
        "US11568979B1",
        "KR102162895B1",
        "CN110033123A",
        "US11803917B1",
        "US20220019936A1"
    ]
}