{
    "patent_link": "https://patents.google.com/patent/US5559895A/en",
    "patent_id": "US5559895A",
    "title": "Adaptive method and system for real time verification of dynamic human signatures",
    "abstract": "The adaptive dynamic signature verification system of the invention includes a number of types of signature verification terminals which digitize signatures for further verification by statistical analysis. A feature set is employed that consists of a number of personalized features, some static and some dynamic, each of which is normalized with respect to both time and spatial dimensions and allows for a degree of inconsistency in both speed and size of genuine signatures without losing the ability to discriminate against forgery attempts. The statistical approach also develops and employs either an individual-specific or a common feature subset for accurate signature discrimination.",
    "inventors": [
        "Luan L. Lee",
        "Toby Berger"
    ],
    "assignee": "Cornell Research Foundation Inc",
    "classifications": [],
    "claims": "\n1. A signature verification system comprising:\ndigitizer means for digitizing a signature of a signatory whose signature is to be verified, said digitizer means having a pad upon which said signatory can write or otherwise scribe a signature to be converted into digital data; and\na computer, operatively connected to said digitizer means for receiving said digital data, said computer having storage means for storing digital data and information, including a database comprising sets of features relating to a plurality of previously entered signatory signatures, wherein said database includes a set of feature values for each signature and each feature value represents a mean value and a standard deviation value for the corresponding feature calculated from a plurality of signatures of a signatory, both said mean values and said standard deviation being used to verify said signature, said computer having a program and:\na) means for acquiring said digital data from said pad;\nb) means for generating a set of feature values based upon said acquired digital data, a portion of said set of features being values having a time variable relating to when a portion of said digital data of said signature was made;\nc) means for selecting feature values of said acquired and stored digital data for comparison; and\nd) means for making a verification decision with respect to said signature based upon comparison of said selected feature values including establishing a decision verification threshold, said verification decision updating said database-selected feature values when a current signature is verified.\n2. The signature verification system of claim 1, wherein said computer, in response to contact with a stylus or writing instrument used by said signatory when writing or otherwise scribing said signature, generates a sequence of digits related to said signature, each digit being ascribed a horizontal coordinate (X) and a vertical coordinate (Y), and further wherein said computer generates a set of features of said signature comprising a portion that relates coordinated digits of said sequence of digits with respect to time (T).\n3. The signature verification system of claim 2, wherein said computer verifies a signature when at least a predetermined number of said set of selected feature values are successfully compared.\n4. The signature verification system of claim 3, wherein said predetermined number of said set of selected feature values is at least one half of the number of selected feature values in said set.\n5. The signature verification system of claim 1, further comprising signature address generating means operatively connected to said digitizer means and to said computer for generating a signatory address for accessing signature data in said storage means relating specifically to a current signature being written or otherwise scribed upon said pad of said digitizer means.\n6. The signature verification system of claim 5, wherein said signature address generating means includes a keyboard for entering a PIN number of said signatory.\n7. The signature verification system of claim 6, wherein said signature address generating means further includes a magnetic stripe reader for ascertaining said signatory identity from a magnetic stripe disposed upon a card.\n8. The signature verification system of claim 5, wherein said signature address generating means includes a magnetic stripe reader for ascertaining said signatory identity from a magnetic stripe disposed upon a card.\n9. The signature verification system of claim 1, further comprising a data link disposed between said pad of said digitizer means and said computer.\n10. The signature verification system of claim 9, wherein said digitizer means comprises a portable unit.\n11. A method of developing a reference database of values from signatures of a signatory for the purpose of subsequent signature verification of said signatory, including the steps of:\na) digitizing a plurality of signature, \"m\" , of a signatory to provide digitized data;\nb) normalizing said digitized data;\nc) generating a set of feature values derived from said digitized data of said signatory, wherein each digit of said digitized data having been ascribed a horizontal coordinate (X) and a vertical coordinate (Y), further is related in sequence of said digits with respect to time (T), and wherein said feature values comprise relationships between (X) and (Y) digital information with respect to time;\nd) deriving a mean value for each feature value of said set of feature values, calculated for \"m\" signatures of said signatory;\ne) deriving a standard deviation value for each feature value of said set of feature values, calculated for \"m\" signatures of said signatory;\nf) storing the derived values of steps (d) and (e) in a reference database for comparison with a subsequent signature allegedly of said signatory for signature verification purposes;\ng) digitizing a current signature of said signatory;\nh) generating a set of feature values for said current signature;\ni) comparing the set of feature values for said current signature to the stored mean and standard deviation values for said signatory to determine if said current signature is valid; and\nj) updating said stored mean and standard deviation values using the current signature feature values, when it is determined that said current signature is valid.\n12. The method of developing a reference database of values from signatures of a signatory, in accordance with claim 11, further comprising the step of:\nk) selecting a subset of feature values and storing said subset of feature values in said database, said subset of feature values including features whose values are distributed within a substantially small range of the standard deviations around characteristic mean values that are indicative of a true signature of said signatory.\n13. The method of developing a reference database of values from signatures of a signatory, in accordance with claim 12, further comprising the steps of:\nl) digitizing a plurality of forged signatures;\nm) generating a set of feature values derived from said forged signatures;\nn) deriving a mean value for each feature value of said set of feature values derived from said forged signatures; and\no) deriving a standard deviation value for each feature value of said set of feature values derived from said forged signatures.\n14. The method of developing a reference database of values from signatures of a signatory, in accordance with claim 13, further comprising the step of:\np) for each feature, calculating the standardized distance between said mean value for each feature value of said set of feature values for \"m\" signatures of said signatory, and said mean value for each feature value of said set of feature values derived from said forged signatures.\n15. The method of developing a reference database of values from signatures of a signatory, in accordance with claim 14, further comprising the step of:\nq) arranging said calculated distances in a predetermined order.\n16. The method of developing a reference database of values from signatures of a signatory, in accordance with claim 15, wherein said predetermined order is descending.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US3956734A",
        "US4028674A",
        "US4308522A",
        "US4646351A",
        "US4752965A",
        "US5005205A",
        "US5042073A",
        "US5109426A",
        "US5251265A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5680470A",
        "US5705993A",
        "US5745592A",
        "DE19650541A1",
        "US5828772A",
        "US5838814A",
        "EP0887753A1",
        "US5870721A",
        "US5940811A",
        "US5956409A",
        "US5974161A",
        "US5987153A",
        "US6002783A",
        "US6069968A",
        "EP1033007A1",
        "US6229909B1",
        "WO2001041051A1",
        "US6292437B1",
        "US6356650B1",
        "US6393138B1",
        "US20020097903A1",
        "US6430305B1",
        "US20020116328A1",
        "US6463165B1",
        "US20020153416A1",
        "US20020194119A1",
        "US6501855B1",
        "US6505176B2",
        "US6512840B1",
        "US20030055683A1",
        "US20030088387A1",
        "US6563939B1",
        "US6587841B1",
        "US6587577B1",
        "US6591224B1",
        "US20030142855A1",
        "US20030179912A1",
        "US20030200134A1",
        "US20030218061A1",
        "US6661908B1",
        "US20040064705A1",
        "US20040138997A1",
        "US20040138994A1",
        "US20040148509A1",
        "US20040218801A1",
        "US6820804B2",
        "US6839453B1",
        "US20050053269A1",
        "WO2005024711A1",
        "US20050063570A1",
        "US20050122209A1",
        "US20050169504A1",
        "US20050180618A1",
        "US20050261972A1",
        "US20060005042A1",
        "US20060023922A1",
        "US7040539B1",
        "WO2006066376A2",
        "US20060144924A1",
        "US20060215886A1",
        "US20060227974A1",
        "US20060277123A1",
        "US20060287870A1",
        "US20070164102A1",
        "US20070172132A1",
        "US20070177773A1",
        "US20070177792A1",
        "WO2007102055A2",
        "US20080193052A1",
        "US20080247674A1",
        "US20080253659A1",
        "US20090287697A1",
        "US20090324107A1",
        "US20100021014A1",
        "US7720762B1",
        "US7729985B1",
        "US20100174063A1",
        "US20100189316A1",
        "US20100322486A1",
        "US20110126024A1",
        "US20110135169A1",
        "US7970701B2",
        "GB2480851A",
        "WO2013106235A1",
        "US8606792B1",
        "US8671071B1",
        "GB2508015A",
        "US8885894B2",
        "US9042608B2",
        "US9235831B2",
        "US20170083542A1",
        "US9665704B2",
        "US9916282B2",
        "US10255085B1",
        "US10331490B2",
        "US10339746B1",
        "US10338994B1",
        "US10560313B2",
        "US10685283B2",
        "US10983682B2",
        "WO2021086572A1",
        "US11328285B2",
        "US20220224678A1",
        "WO2023006249A1"
    ],
    "citedby_ftf": []
}