{
    "patent_link": "https://patents.google.com/patent/US5623539A/en",
    "patent_id": "US5623539A",
    "title": "Using voice signal analysis to identify authorized users of a telephone system",
    "abstract": "A user transparent telephone fraud detection and prevention system employs speech analysis techniques to determine whether at least one participant in a telephone conversation is an authorized user of the telephone line. A multi-party conversation on a phone line (e.g., a PBX line) is analyzed to separate speech information from noise and then the speech information is separated according to each participant in the conversation. Speech data for each participant is then compared to a library of speech data of authorized users of the system. If a match is found the system determines that the call is authorized. If no match is found the call is determined to be unauthorized and appropriate line control functions are carried out. Examples of the line control functions are: terminating the call; recording the call; disabling the line; intruding into the call and playing noise or a warning message; and intruding into the call to demand identification data from the call participants. The system is also used to verify that a user of a calling card number is an authorized user.",
    "inventors": [
        "Charles S. Bassenyemukasa",
        "Randolph J. Pilc"
    ],
    "assignee": "Nokia of America Corp",
    "classifications": [
        "H04M15/47",
        "H04M1/66",
        "H04M15/00",
        "H04M3/382",
        "H04M2201/40",
        "H04M2215/0148"
    ],
    "claims": "\n1. An apparatus for determining whether at least one of a plurality of users of a telephone line is an authorized user of said telephone line, said apparatus comprising:\na memory for storing an authorized voice pattern for each of a plurality of authorized users of the telephone line;\na voice segregator for receiving voice information obtained from the telephone line, said voice information corresponding to voice patterns of a plurality of users of the telephone line, said voice segregator segregating said received voice information into a plurality of segregated voice patterns, each said segregated voice pattern corresponding to one of said plurality of users of the telephone line; and\na comparator for receiving said segregated voice patterns from said voice segregator and comparing each said segregated voice pattern to said authorized voice patterns stored in said memory to determine whether one of said plurality of users of the telephone line is an authorized user.\n2. The apparatus of claim 1 wherein said memory, said voice segregator and said comparator are connected to a plurality of telephone lines for determining whether calls made on each of the plurality of telephone lines includes a voice of at least one authorized user.\n3. The apparatus of claim 1 wherein said voice information received by said voice segregator is a live conversation.\n4. The apparatus of claim 1 further comprising line interrupt means for interrupting the telephone line if said comparator determines that none of said plurality of users of the telephone line is an authorized user.\n5. The apparatus of claim 1 further comprising recording means for recording said voice information received from the telephone line if said comparator determines that none of said plurality of users of the telephone line is an authorized user.\n6. The apparatus of claim 1 further comprising a warning message generator for playing a warning message on the telephone line if said comparator determines that none of said plurality of users of the telephone line is an authorized user.\n7. The apparatus of claim 1 further comprising a noise generator for generating noise on the telephone line if said comparator determines that none of said plurality of users of the telephone line is an authorized user.\n8. The apparatus of claim 1 further comprising a telephone line disabling device for disabling the telephone line if said comparator determines that none of said plurality of users of the telephone line is an authorized user.\n9. The apparatus of claim 8 wherein said disabling device disables the telephone line for a predetermined period of time.\n10. The apparatus of claim 1 wherein the telephone line is one line in a private branch exchange.\n11. The apparatus of claim 1 wherein said comparator compares said segregated voice patterns to each said authorized voice pattern stored in said memory, and identifies one of the said authorized voice patterns and one of the said segregated voice patterns that results in the closest match.\n12. The apparatus of claim 11 wherein said comparator determines a quantitative difference between the said segregated voice pattern and the said authorized voice pattern that results in the closest match, and compares said quantitative difference to a threshold to determine whether the telephone line is being used by an authorized user.\n13. The apparatus of claim 1 wherein said memory stores a voice pattern corresponding to at least one authorized user of a calling card used to access said telephone line.\n14. The apparatus of claim 1 wherein said apparatus operates transparently to said plurality of users.\n15. An apparatus for determining whether a telephone line is being used by at least one of a plurality of authorized users of the telephone line, said apparatus comprising:\na memory for storing voice patterns for each of said plurality of authorized users of the telephoning line;\nmeans for segregating a live conversation on the telephone line to obtain at least one voice pattern corresponding to one of a plurality of persons engaged in said live conversation; and\na comparator tbr receiving said segregated voice pattern and comparing said segregated voice pattern to said stored voice patterns.\n16. The apparatus of claim 15 wherein said means for segregating comprises a voice segregator for receiving said live conversation from the telephone line and segregating said live conversation into a plurality of voice patterns, each said segregated voice pattern corresponding to one of said persons engaged in said live conversation.\n17. The apparatus of claim 15 wherein said comparator receives a plurality of voice patterns from said segregating means and identifies one of said plurality of segregated voice patterns that most closely matches any of said stored voice patterns.\n18. The apparatus of claim 15 further comprising line interrupt means for interrupting said five conversation if said comparator determines that none of said plurality of persons engaged in said five conversation is an authorized user of the telephone fine.\n19. The apparatus of claim 16 further comprising recording means for recording said five conversation if said comparator determines that none of said plurality persons engaged in said live conversation is an authorized user of the telephone line.\n20. The apparatus of claim 16 wherein said apparatus operates transparently to said persons engaged in said live conversation.\n21. A method for determining whether a telephone line is being used by an authorized user, said method comprising the steps of:\nsegregating voice information received from the telephone line into a plurality of voice patterns, each said segregated voice pattern corresponding to a single user of the telephone line;\ncomparing each said segregated voice pattern to at least one stored authorized user voice pattern to obtain a result, each authorized user voice pattern corresponding to a user authorized to use said telephone line; and\ndetermining whether the telephone line is being used by an authorized user of said telephone line based on said result.\n22. The method of claim 21 wherein said method is carried out transparently to a user of said telephone line.\n23. The method of claim 21 wherein said step of comparing comprises comparing said segregated voice patterns to a plurality of stored authorized user voice patterns and identifying one of said segregated voice patterns and one of said stored authorized user voice patterns that most closely match.\n24. The method of claim 21 further comprising the step of:\ninterrupting a live conversation on the telephone line if said determining step indicates that the telephone line is not being used by an authorized user.\n25. The method of claim 21 further comprising the step of:\nrecording a live conversation on the telephone line if said determining step indicates that the telephone line is not being used by an authorized user.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3896266A",
        "US4032711A",
        "US4363102A",
        "JPS61238156A",
        "US4720863A",
        "US4773093A",
        "US4827518A",
        "US4961229A",
        "US5036539A",
        "US5054083A",
        "US5123048A",
        "US5166971A",
        "US5247497A",
        "US5271089A",
        "US5274695A",
        "US5339385A",
        "US5414755A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5732133A",
        "US5764742A",
        "US5774858A",
        "WO1998034216A2",
        "US5812950A",
        "US5875234A",
        "US5907597A",
        "US5913196A",
        "US5963908A",
        "US6028926A",
        "WO2000014945A1",
        "WO2000014730A1",
        "US6078807A",
        "US6141405A",
        "US6157707A",
        "US6181803B1",
        "US6185536B1",
        "KR20010019772A",
        "US6327345B1",
        "US6327346B1",
        "US20020035477A1",
        "US20020111809A1",
        "US6445775B1",
        "US6456698B1",
        "US20020173292A1",
        "US6510415B1",
        "US20030046554A1",
        "US20030091175A1",
        "US20030108159A1",
        "US20030108160A1",
        "US20030108158A1",
        "US20030135372A1",
        "US6633632B1",
        "US6654719B1",
        "US6695207B1",
        "US20040128131A1",
        "US6775360B2",
        "US20040161084A1",
        "US6804331B1",
        "US6819758B2",
        "US20040240631A1",
        "US20040243713A1",
        "US6839410B2",
        "US20050027528A1",
        "EP1527552A1",
        "US6937702B1",
        "US20050273333A1",
        "US7099825B1",
        "US20060262908A1",
        "US20060289622A1",
        "US7180994B2",
        "US7191133B1",
        "US20070071206A1",
        "US7203653B1",
        "US20070230683A1",
        "US20070237319A1",
        "US20070266154A1",
        "DE102006043240A1",
        "US20080167871A1",
        "US7403967B1",
        "US7454337B1",
        "US20090016506A1",
        "USRE40634E1",
        "US7529362B1",
        "US20090119368A1",
        "US20090198495A1",
        "US20090292533A1",
        "US20090292531A1",
        "US7664641B1",
        "US7716055B1",
        "US7721109B1",
        "US7739115B1",
        "US7966187B1",
        "US8031849B1",
        "US8180643B1",
        "US20130251119A1",
        "US8650255B2",
        "US8751222B2",
        "US20150156315A1",
        "US9118669B2",
        "US9143610B2",
        "US9143609B2",
        "US9225701B2",
        "US9472194B2",
        "US9473621B1",
        "US9621732B2",
        "US20170345444A1",
        "US9837078B2",
        "US9930088B1",
        "US20180153481A1",
        "US10033857B2",
        "US10057398B2",
        "US10237399B1",
        "US10397402B1",
        "US10659588B1",
        "US10902054B1",
        "US11282526B2"
    ],
    "citedby_ftf": []
}