{
    "patent_link": "https://patents.google.com/patent/US5508913A/en",
    "patent_id": "US5508913A",
    "title": "Electronic automatic offer matching system for freezer exchange transactions among banks",
    "abstract": "An electronic dealing system which performs foreign exchange transactions among banks etc. by matching terms of sale and terms of purchase, provided with a leave-order function whereby a dealing terminal may continue to place orders on the market and automatically perform transactions even after log-out processing. This enables transactions to be safely performed even when the operator is not present.",
    "inventors": [
        "Kenichi Yamamoto",
        "Yoshihisa Kimura",
        "Yasuhide Yamamoto"
    ],
    "assignee": "Minex Corp",
    "classifications": [],
    "claims": "\n1. An electronic transaction system for performing transactions by matching terms of sale and terms of purchase, said electronic transaction system including a leave-order function so that a dealing terminal continues to place orders in a market conditional on the matching of terms of transaction and automatically performs transactions even after an operator has logged out, wherein said leave-order function is set by deal-out processing where at least one order is requested by the dealing terminal.\n2. An electronic transaction system as set forth in claim 1, wherein when log-in processing is executed after deal-out processing is executed with the leave-order function set, the system automatically executes deal-in processing which has been and displays a screen corresponding to the screen at the time of the deal-out processing together with the results of transactions in the time when the leave-order function had been set.\n3. An electronic transaction system as set forth in claim 1, further comprising a facility for cancellation of the leave-order function.\n4. An electronic transaction system as set forth in claim 1, wherein further comprising a facility for cancellation of the leave-order function by another dealing terminal.\n5. An electronic transaction system as set forth in claim 1, wherein the leave-order function is entered by the execution of deal-out processing with orders remaining in the dealing service.\n6. An electronic transactions system as set forth in claim 1, which performs log-in processing and deal-in processing to transact in a predetermined market, sets the leave-order function and performs deal-out processing and log-out processing where this transacting can be executed and continues to place any orders which still exist on the market.\n7. An electronic transaction system as set forth in claim 6, which executes log-in processing from the log-out state with the leave-order function set so as to automatically perform deal-in processing, and which displays results of the transactions of the orders which had been placed as leave orders.\n8. An electronic transaction system as set forth in claim 5, which continues the dealing even if the deal-out processing and log-out processing are performed until the deal-out processing is performed without the leave-order function being set.\n9. An electronic transaction system as set forth in claim 5, wherein when executing deal-out processing while setting a leave-order function, the association between the dealing terminal and a subscriber control apparatus, which is set by logging in and cut by logging out, is cut, but the individual virtual terminal process continues to supply the dealing service without stopping.\n10. An electronic transaction system as set forth in claim 9, which makes a deal-out request and a log-out request from the dealing terminal, returns a deal-out response and a log-out response from said subscriber control apparatus to the dealing terminal and, at that time, makes the deal-out request in the state where there are orders present so as to automatically set the leave-order function, whereby if the leave-order function is set, transactions are automatically established for orders placed on the market which match the terms of transaction.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US3573747A",
        "US4554418A",
        "JPS61502367A",
        "US4674044A",
        "JPS63271558A",
        "US4903201A",
        "US4980826A",
        "JPH0385047A",
        "US5038284A",
        "US5077665A",
        "JPH0432938A",
        "US5101353A",
        "US5136501A",
        "US5220501A",
        "US5297031A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5655088A",
        "WO1997043727A1",
        "US5774553A",
        "WO1998038844A2",
        "US5892900A",
        "WO1999023592A1",
        "US5910987A",
        "US5920861A",
        "US5943422A",
        "US5950176A",
        "US5995947A",
        "US6003008A",
        "US6055519A",
        "US6112181A",
        "US6157721A",
        "US6233566B1",
        "US20010044771A1",
        "US20020002531A1",
        "US20020091626A1",
        "US20020099647A1",
        "US20020103732A1",
        "US20030033212A1",
        "US6532460B1",
        "US20030055778A1",
        "US20030061149A1",
        "US6594643B1",
        "US20030200125A1",
        "US6658568B1",
        "US20040030639A1",
        "US20040030632A1",
        "US20040059668A1",
        "US20040098663A1",
        "US20040107123A1",
        "US6795811B1",
        "US20040193530A1",
        "US20040193531A1",
        "US20040205019A1",
        "US20040243504A1",
        "US20050044027A1",
        "US20050075967A1",
        "US20050096926A1",
        "US20050119965A1",
        "US6963855B1",
        "US20050267836A1",
        "US20050273406A1",
        "US6983259B1",
        "US7006991B2",
        "US7024386B1",
        "US20060100944A1",
        "US20060106730A1",
        "US20060173764A1",
        "US7127422B1",
        "US7130823B1",
        "US7130824B1",
        "US20060265337A1",
        "US7184982B1",
        "US20070118468A1",
        "US20070234069A1",
        "US20070266429A1",
        "US7333952B1",
        "US7366690B1",
        "US20080127304A1",
        "US7386497B1",
        "US7409366B1",
        "US7487123B1",
        "US20090144191A1",
        "WO2008051364A3",
        "US20100030759A1",
        "US7660762B1",
        "US7689483B2",
        "US20100115283A1",
        "US7742980B1",
        "US7827085B1",
        "US7970686B1",
        "US8027899B2",
        "US20120092698A1",
        "US8185473B2",
        "US8504454B2",
        "US8510219B1",
        "US9218720B2",
        "US9727916B1",
        "US9928550B2",
        "US10755350B1",
        "US11526940B2"
    ],
    "citedby_ftf": [
        "US5794207A",
        "GB9416673D0",
        "US5845266A",
        "IL117424A",
        "ES2102264T3",
        "US6519574B1",
        "US5924083A",
        "US6016483A",
        "US6112189A"
    ]
}