{
    "patent_link": "https://patents.google.com/patent/US6430615B1/en",
    "patent_id": "US6430615B1",
    "title": "Predictive model-based measurement acquisition employing a predictive model operating on a manager system and a managed system",
    "abstract": "A method, system and program storage device for measurement acquisition using predictive models which: (a) can improve scalability; (b) can accommodate devices that operate in a disconnected mode; and (c) enable integration of data from sources with different time granularities. Various features can be embodied in software and an object-oriented implementation is described. Different implementations are described, such as standalone predictive models implemented only on a manager (for example systems management/load balancing) or managed system (for example router management); or a parallel implementation with predictive models running on both the manager and managed (agent) systems (for example financial trading or system health monitoring). In a parallel model implementation, the agent constructs a predictive model that is conveyed to the manager system. The models are used in parallel, possibly with no communication for an extended time. The manager uses its model to provide tentative values of measurement variables to management applications. The agent uses its model to check its accuracy. If the model is found to be insufficiently accurate, an updated model is transmitted to the manager. The invention allows other measurement acquisition protocols to operate concurrently on the same measurement variables.",
    "inventors": [
        "Joseph L. Hellerstein",
        "Nikolaus Haus"
    ],
    "assignee": "International Business Machines Corp",
    "classifications": [
        "H04L67/1023",
        "H04L41/0233",
        "H04L41/046",
        "H04L41/147",
        "H04L43/00",
        "H04L67/1001",
        "H04L67/1008",
        "H04L67/101",
        "H04L67/1029",
        "H04L43/022",
        "H04L43/106"
    ],
    "claims": "\n1. A predictive model-based method for measurement data acquisition in a distributed system, comprising the steps of:\n2. The method of claim 1, further comprising the steps of:\n3. The method of claim 2, further comprising the step of, the managed system disconnecting from the managed system except to update the predictive model.\n4. The method of claim 1, further comprising the step of communicating a measurement variable subscription request for a predictive model from the manager system to the managed system, wherein the predictive model is constructed in response to the subscription request.\n5. The method of claim 1, further comprising the step of:\n6. The method of claim 1, further comprising the steps of:\n7. The method of claim 6, further comprising the steps of:\n8. The method of claim 7, further comprising the steps of:\n9. The method of claim 7, further comprising the steps of:\n10. The method of claim 1, wherein the system includes multiple managed systems that have one or more of different collection frequencies and unsynchronized clocks, said method further comprising the steps of:\n11. The method of claim 10, wherein said step of the manager system synchronizing data further comprises the step of adjusting a granularity of the time stamp using the predictive models.\n12. The method of claim 10, wherein the unsynchronized clocks operate at a same rate, further comprising the step of:\n13. The method of claim 1, further comprising the step of:\n14. The method of claim 1, further comprising the step of:\n15. The method of claim 1, in an object-oriented system, further comprising the steps of:\n16. The method of claim 1, further comprising the step of transparently running multiple measurement acquisition protocols concurrently in the system.\n17. The method of claim 1, further comprising the step of: constructing and storing the predictive model as an expression tree.\n18. The method of claim 1, further comprising the steps of:\n19. The method of claim 1, further comprising the step of:\n20. The method of claim 19, in an object-oriented system, said dynamically constructing further comprising the steps of:\n21. A predictive model-based method for measurement data acquisition in a distributed system, comprising the steps of:\n22. The method of claim 21, further comprising the step of:\n23. A program storage device readable by a machine, tangibly embodying a program of instructions executable by the machine to perform method steps for a predictive model-based method for measurement data acquisition in a distributed system, said method steps comprising:\n24. The program storage device of claim 23, further comprising the steps of:\n25. The program storage device of claim 23, further comprising the step of communicating a measurement variable subscription request for a predictive model from the manager system to the managed system, wherein the predictive model is constructed in response to the subscription request.\n26. The program storage device of claim 23, further comprising the step of:\n27. The program storage device of claim 26, further comprising the steps of:\n28. The program storage device of claim 27, further comprising the steps of:\n29. The program storage device of claim 23, wherein the system includes multiple managed systems that have one or more of different collection frequencies and unsynchronized clocks, said method further comprising the steps of:\n30. The program storage device of claim 29, wherein said step of the manager system synchronizing data further comprises the step of adjusting a granularity of the time stamp using the predictive models.\n31. The program storage device of claim 29, wherein the unsynchronized clocks operate at a same rate, further comprising the step of:\n32. The program storage device of claim 23, in an object-oriented system, further comprising the steps of:\n33. The program storage device of claim 23, further comprising the step of transparently running multiple measurement acquisition protocols concurrently in the system.\n34. The program storage device of claim 23, further comprising the step of:\n35. A program storage device readable by a machine, tangibly embodying a program of instructions executable by the machine to perform method steps for predictive model-based method for measurement data acquisition in a distributed system, said method steps comprising:\n36. The program storage device of claim 35, further comprising the step of:\n37. A predictive model-based measurement acquisition system for creating and managing one or more predictive models that predict values of measurement variables in distributed systems, said system comprising:\n38. The system of claim 37, further comprising:\n39. A predictive model-based method for measurement data acquisition in a distributed system, comprising the steps of:\n40. The method of claim 39, further comprising the step of the managed system disconnecting from the managed system except to update the predictive model.\n41. A predictive model-based method for measurement data acquisition in a distributed system, comprising the steps of:\n42. A predictive model-based method for measurement data acquisition in a distributed system, comprising the steps of:\n43. A predictive model-based method for measurement data acquisition in a distributed system, comprising the steps of:\n44. A predictive model-based method for measurement data acquisition in a distributed system, comprising the steps of:\n45. A program storage device readable by a machine, tangibly embodying a program of instructions executable by the machine to perform method steps for a predictive model-based method for measurement data acquisition in a distributed system, said method steps comprising:\n46. A program storage device readable by a machine, tangibly embodying a program of instructions executable by the machine to perform method steps for a predictive model-based method for measurement data acquisition in a distributed system, said method steps comprising:\n47. A program storage device readable by a machine, tangibly embodying a program of instructions executable by the machine to perform method steps for a predictive model-based method for measurement data acquisition in a distributed system, said method steps comprising:\n48. A predictive model-based measurement acquisition system for creating and managing one or more predictive models that predict values of measurement variables in distributed systems, said system comprising:",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4769761A",
        "US5692107A",
        "US5748098A",
        "US5881268A",
        "US5951644A",
        "US5974457A",
        "US5987442A",
        "US6058103A",
        "US6076174A",
        "US6148335A"
    ],
    "citations_ftf": [
        "US5819226A",
        "US5704017A",
        "US5877954A",
        "US5805681A",
        "US6078740A"
    ],
    "citedby_own": [
        "US20020002445A1",
        "US6662141B2",
        "KR20040001248A",
        "US20040054773A1",
        "US20040122950A1",
        "US20040236758A1",
        "US20050015158A1",
        "US20050125213A1",
        "US6917952B1",
        "US20050182747A1",
        "US6937966B1",
        "US20050198398A1",
        "US20050210096A1",
        "US20050209833A1",
        "US20050235255A1",
        "US20050232153A1",
        "US20050243814A1",
        "US20050256945A1",
        "US20050283337A1",
        "US20060007941A1",
        "US20060025984A1",
        "US20060031561A1",
        "US20060036726A1",
        "US7024475B1",
        "US20060179134A1",
        "US7099855B1",
        "US20070101213A1",
        "US7249048B1",
        "US7337209B1",
        "US20090106178A1",
        "US7752159B2",
        "US7756810B2",
        "US20120209661A1",
        "US8290768B1",
        "US20150347435A1",
        "US20170005904A1",
        "US9584665B2",
        "US9699129B1",
        "US10055501B2",
        "US11144844B2"
    ],
    "citedby_ftf": [
        "US7028298B1",
        "US7730063B2",
        "US6871163B2",
        "US7090868B2",
        "BR0317903A",
        "US8914309B2",
        "US20060167778A1",
        "US7979870B1",
        "US8806490B1",
        "US8244854B1",
        "US8108878B1",
        "US20070250474A1",
        "US8270586B2",
        "US20090234904A1",
        "US7990943B2",
        "WO2010149211A1",
        "US9451383B2",
        "US9563532B1",
        "US9454173B2",
        "EP3215943B1",
        "US9774613B2",
        "GB2555690B8",
        "EP3293938B1",
        "CN113114480B"
    ]
}