{
    "patent_id": "US-11596316-B2",
    "title": "Hearing and monitoring system ",
    "assignee": "Bao Tran",
    "publication_date": "2023-03-07",
    "patent_link": "https://patents.google.com/patent/US11596316B2/en",
    "inventors": [
        "Bao Tran"
    ],
    "classifications": [
        "A61B5/02055",
        "A61B1/000096",
        "A61B1/00194",
        "A61B1/045",
        "A61B1/05",
        "A61B1/227",
        "A61B5/0022",
        "A61B5/026",
        "A61B5/0537",
        "A61B5/0538",
        "A61B5/1032",
        "A61B5/1117",
        "A61B5/1118",
        "A61B5/12",
        "A61B5/14546",
        "A61B5/165",
        "A61B5/283",
        "A61B5/291",
        "A61B5/378",
        "A61B5/4803",
        "A61B5/6817",
        "A61B5/6898",
        "A61B5/7267",
        "A61B5/7465",
        "G05B13/027",
        "G05B13/042",
        "G06N20/00",
        "G06N3/08",
        "H04R25/604",
        "H04R25/652",
        "H04R25/659",
        "A61B2560/0247",
        "A61B2562/0219",
        "A61B5/02438",
        "A61B5/0816",
        "A61B5/14532",
        "A61B5/318",
        "A61B5/369",
        "A61B5/486",
        "G06N3/045",
        "G06N5/02",
        "G06N7/01",
        "H04R2225/025",
        "H04R2225/41",
        "H04R2225/77",
        "H04R25/356",
        "H04R25/507"
    ],
    "abstract": "Systems and methods for assisting user with hearing by amplifying sound using an amplifier with gain and amplitude controls for a plurality of frequencies; and applying a learning machine to identify an aural environment and adjust the amplifiers for optimum hearing.",
    "claims": "\n1. A method for assisting a user, comprising:\ncapturing sound using an in-ear device;\namplifying sound using an amplifier with gain and amplitude controls for a plurality of frequencies; and\napplying a learning machine to identify an aural environment and adjust the amplifiers for optimum hearing.\n2. The method of claim 1, comprising applying a learning machine to adjust amplifier parameters for a particular environment with a predetermined noise pattern.\n3. The method of claim 1, comprising capturing vital signs with the in-ear device with a camera in the ear to detect ear health.\n4. The method of claim 1, comprising capturing vital signs with the in-ear device by detecting blood flow with an in-ear sensor.\n5. The method of claim 1, comprising capturing vital signs with the in-ear device by detecting with an in-ear sensor blood parameters including carboxyhemoglobin (HbCO), methemoglobin (HbMet) and total hemoglobin (Hbt).\n6. The method of claim 1, comprising detecting a physical condition of an ear drum including curvature and surface abnormality.\n7. The method of claim 1, comprising capturing vital signs with the in-ear device by detecting body temperature, encephalography (EEG) data, electrocardiogram (ECG) data, or bioimpedance (BI) data in the ear.\n8. The method of claim 1, comprising capturing vital signs with the in-ear device by detecting one or more of: alpha rhythm, auditory steady-state response (ASSR), steady-state visual evoked potentials (SSVEP), visually evoked potential (VEP), visually evoked response (VER) and visually evoked cortical potential (VECP), cardiac activity, bioimpedance, speech and breathing.\n9. The method of claim 1, comprising detecting alpha rhythm, auditory steady-state response (ASSR), steady-state visual evoked potentials (SSVEP), and visually evoked potential (VEP).\n10. The method of claim 1, comprising correlating EEG, ECG, bioimpedance, speech and breathing to determine health.\n11. The method of claim 1, comprising correlating cardiac activity, bioimpedance and breathing.\n12. The method of claim 1, comprising determining user health by detecting fluid in an ear structure, change in ear color, curvature of the ear structure.\n13. The method of claim 1, comprising determining one or more bio-markers from the vital signs and indicating user health.\n14. The method of claim 1, wherein the customizing comprises performing a 3D scan inside an ear canal.\n15. The method of claim 14, comprising matching predetermined points on the 3D scan to key points on a template and morphing the key points on the template to the predetermined points.\n16. The method of claim 1, comprising 3D printing a model from the 3D scan and fabricating the in-ear device.\n17. The method of claim 1, comprising correlating genomic biomarkers for diseases to the vital signs from the in-ear device and applying a learning machine to use the vital signs from the in-ear device to predict disease conditions.\n18. The method of claim 1, comprising determining a fall based on accelerometer data, vital signs and sound.\n19. The method of claim 1, comprising determining loneliness or mental condition based on activity of life data.\n20. The method of claim 1, comprising providing a user dashboard showing health data over a period of time and matching research data on the health signals.\n21. The method of claim 1, comprising:\na housing custom;\na microphone to capture sound coupled to a processor to deliver enhanced sound to the user anatomy;\nan amplifier with gain and amplitude controls; and\na learning machine to identify an aural environment and adjusting amplifier controls to optimize hearing based on the identified aural environment."
}