{
    "patent_id": "US-2018181291-A1",
    "title": "Thermostat with wiring terminals configured for spatial compactness and ease of wire installation ",
    "assignee": "Google Llc",
    "publication_date": "2018-06-28",
    "patent_link": "https://patents.google.com/patent/US20180181291A1/en",
    "inventors": [
        "John Benjamin Filson",
        "Eric B. Daniels",
        "Brian Huppi",
        "David Sloo"
    ],
    "classifications": [
        "H04L12/2803",
        "G05B23/0213",
        "G06F3/04847",
        "F24F11/00",
        "F24F11/30",
        "F24F11/50",
        "F24F11/523",
        "F24F11/58",
        "F24F11/62",
        "F24F11/70",
        "F24F11/89",
        "G01J5/0025",
        "G01J5/041",
        "G01K1/02",
        "G01R31/26",
        "G05B15/02",
        "G05D23/19",
        "G05D23/1902",
        "G05D23/1919",
        "G05D23/1932",
        "G05D23/24",
        "G05D23/2454",
        "G05D23/27",
        "G05D23/275",
        "G06F1/3231",
        "G06F1/3265",
        "G06F1/3287",
        "G06F3/011",
        "G06F3/016",
        "G06F3/02",
        "G06F3/0202",
        "G06F3/0304",
        "G06F3/0362",
        "G06F3/042",
        "G06F3/0482",
        "G06F3/04842",
        "G06F3/0487",
        "G06F3/167",
        "G06N20/00",
        "H04L67/10",
        "F24F11/46",
        "F24F11/47",
        "F24F11/52",
        "F24F11/56",
        "F24F11/63",
        "F24F2110/00",
        "F24F2110/10",
        "F24F2120/10",
        "F24F2120/12",
        "F24F2120/14",
        "F24F2140/60",
        "G05B2219/24065",
        "H01H25/06",
        "Y02B70/30",
        "Y02D30/50",
        "Y02D30/70",
        "Y02T10/88",
        "Y04S20/20"
    ],
    "abstract": "A wall-mountable programmable electronic thermostat for controlling an HVAC system is described. The thermostat includes a circular wall-mountable backplate with a central opening to allow for the passage of HVAC wires for electrical connection to the thermostat. The head unit body is also circular and is removeably mountable to the back plate. A plurality of wedge-shaped wiring terminals are mounted on the backplate for making a tool-free connection to HVAC wires. Each wiring terminal has button that a user can depress while a wire is inserted in a wire hole. The terminals are arranged along one or more circular arcs about the central opening of the backplate such that the wire holes face the central opening and the buttons are located close to the outer periphery of the backplate.",
    "claims": "\n1. A thermostat for controlling an HVAC system comprising:\na wiring terminal configured to make an electrical connection with an HVAC wire, the wiring terminal comprising:\na main body fixedly mounted on a backplate of the thermostat, the main body including:\na channel opening that is positioned on a first side of the main body, the channel opening being configured and arranged relative to the backplate to enable insertion of the HVAC wire into an interior of the main body to make an electrical connection between the thermostat and the HVAC wire; and\na spring component that is disposed within the main body and operably coupled therewith so that an electrical contact that is positioned within the main body along an insertion path of the HVAC wire is displaceable within the main body to accommodate insertion of the HVAC wire within the channel opening, the spring component biasing the electrical contact toward the insertion path such that after insertion of the HVAC wire, the electrical contact maintains the HVAC wire securely within the channel opening and in electrical connection with the thermostat; and\na button member that is positioned on a second side of the main body opposite the first side, the button member being moveably coupled with the main body and operably coupled with the spring component so that actuation of the button member displaces the electrical contact from the insertion path to enable insertion or removal of the HVAC wire from the channel opening, wherein the spring component biases the button member toward an unactuated position.\n2. The thermostat of claim 1, wherein the thermostat includes a plurality of wiring terminals that are each configured to make an electrical connection with an HVAC wire, and wherein each wiring terminal includes a main body, a spring component, and a button member.\n3. The thermostat of claim 2, wherein the plurality of wiring terminals are arranged about the backplate so that a channel opening of each wiring terminal faces an aperture in the backplate through which a plurality of HVAC wires are inserted.\n4. The thermostat of claim 1, wherein the thermostat further comprises a head unit that is attached to the backplate.\n5. The thermostat of claim 1, wherein the wiring terminal is further configured so that actuation of the button member opens a loop of an electrical circuit that does not include the HVAC wire, wherein opening of the loop enables automatic detection of the HVAC wire within the wiring terminal.\n6. The thermostat of claim 1, wherein the electrical contact is a distal end of the spring component.\n7. The thermostat of claim 1, wherein the button member is pivotably coupled with the main body.\n8. The thermostat of claim 1, wherein the spring component and button member are configured so that insertion of the HVAC wire within the channel opening is sufficient to displace the electrical contact from the insertion path without requiring actuation of the button member.\n9. The thermostat of claim 8, wherein the spring component and button member are further configured so that insertion of the HVAC wire within the channel opening without actuating the button member causes the button member to move from the unactuated position to an actuated position relative to the main body.\n10. The thermostat of claim 8, wherein the spring component and button member are further configured so that actuation of the button member is required to remove the HVAC wire from the channel opening.\n11. A hazard detector comprising:\na plurality of wiring terminals each configured to make an electrical connection with one of a plurality of wires, wherein each wiring terminal includes:\na main body that includes:\na channel opening that is configured to enable insertion of a respective wire of the plurality of wires into an interior of the main body to make an electrical connection between the hazard detector and the respective wire; and\na spring component that is disposed within the main body and operably coupled therewith so that an electrical contact that is positioned within the main body along an insertion path of the respective wire is displaceable within the main body to accommodate insertion of the respective wire within the channel opening, the spring component biasing the electrical contact toward the insertion path such that after insertion of the respective wire, the electrical contact maintains the respective wire securely within the channel opening and in electrical connection with the hazard detector; and\na release mechanism that is moveably coupled with the main body and operably coupled with the spring component so that actuation of the release mechanism displaces the electrical contact from the insertion path to enable insertion or removal of the respective wire from the channel opening, wherein the spring component biases the release mechanism toward an unactuated position.\n12. The hazard detector of claim 11, wherein the plurality of wiring terminals are arranged so that the channel opening of each wiring terminal faces an aperture in a base component of the hazard detector through which the plurality of wires are inserted.\n13. The hazard detector of claim 11, wherein each wiring terminal is further configured so that actuation of the release mechanism opens a loop of an electrical circuit that does not include the respective wire, wherein opening of the loop enables automatic detection of the respective wire within the wiring terminal.\n14. The hazard detector of claim 11, wherein the electrical contact is a distal end of the spring component.\n15. The hazard detector of claim 11, wherein the release mechanism is pivotably coupled with the main body.\n16. The hazard detector of claim 11, wherein the spring component and release mechanism are configured so that insertion of the respective wire within the channel opening is sufficient to displace the electrical contact from the insertion path without requiring actuation of the release mechanism.\n17. The hazard detector of claim 16, wherein the spring component and release mechanism are further configured so that insertion of the respective wire within the channel opening without actuating the release mechanism causes the release mechanism to move from the unactuated position to an actuated position relative to the main body.\n18. The hazard detector of claim 16, wherein the spring component and release mechanism are further configured so that actuation of the release mechanism is required to remove the respective wire from the channel opening.\n19. The hazard detector of claim 11, wherein the spring component is V-shaped, and wherein the spring component includes a tab that is inserted within a slot of the release mechanism to couple the spring component and the release mechanism.\n20. The hazard detector of claim 11, wherein the hazard detector is a thermostat that is configured to control an HVAC system to condition an enclosure."
}