{
    "patent_id": "US-11610681-B2",
    "title": "Method and apparatus for predicting response to food ",
    "assignee": "Yeda Research And Development Co. Ltd.",
    "publication_date": "2023-03-21",
    "patent_link": "https://patents.google.com/patent/US11610681B2/en",
    "inventors": [
        "Eran Segal",
        "Eran Elinav"
    ],
    "classifications": [
        "G16H50/20",
        "G06N20/00",
        "G06N20/20",
        "G06N7/01",
        "G16H10/60",
        "G16H20/60",
        "G16H50/70",
        "G16H70/00",
        "G06N20/10",
        "G06N3/088",
        "G06N5/01",
        "G06N5/025",
        "Y02A90/10"
    ],
    "abstract": "Method of predicting a response of a subject to food is disclosed. The method comprises: selecting a food to which a response of the subject is unknown; accessing a first database having data describing the subject but not a response of the subject to the selected food; accessing a second database having data pertaining to responses of other subjects to foods, the responses of the other subjects including responses of at least one other subject to the selected food or a food similar to said selected food; and analyzing the databases based on the selected food to estimate the response of the subject to the selected food.",
    "claims": "\n1. A method of predicting a response of a subject to food for providing the subject with a personalized diet, the method comprising:\nby a user interface device, receiving from a user a selected food to which a glycemic response of the subject is unknown;\naccessing a computer readable medium storing a data describing the subject;\nexecuting a machine learning procedure trained to predict responses to food, wherein said machine learning procedure is trained using information based on responses of other subjects to foods, said responses of said other subjects including responses of at least one other subject to said selected food or a food similar to said selected food;\nobtaining from said trained machine learning procedure a prediction of the response of the subject as described by said data to said selected food; and\nproviding the subject with a personalized diet, based on said prediction.\n2. The method of claim 1, wherein said data comprises data pertaining to glycemic responses of said subject to foods.\n3. The method according to claim 1, wherein said information is also based on at least a partial microbiome profile of at least one of said other subjects.\n4. The method according to claim 1, wherein said data comprises at least a partial chemical composition of a food consumed by the subject.\n5. The method according to claim 1, wherein said information is also based on at least a partial chemical composition of a food consumed least one of said other subjects.\n6. The method according to claim 1, wherein said data comprises at least a partial blood chemistry of the subject.\n7. The method according to claim 1, wherein said information is also based on at least a partial blood chemistry of at least one of said other subjects.\n8. The method according to claim 1, wherein said data comprises at least a partial genetic profile of the subject.\n9. The method according to claim 1, wherein said information is also based on at least a partial genetic profile of at least one of said other subjects.\n10. The method according to claim 1, wherein said data comprises metabolomic data associated with the subject.\n11. The method according to claim 1, wherein said information is also based on metabolomic data associated with at least one of said other subjects.\n12. The method according to claim 1, wherein said data comprises a medical condition of the subject.\n13. The method according to claim 1, wherein said information is also based on a medical condition of at least one of said other subjects.\n14. The method according to claim 1, wherein said data comprises food intake habits of the subject.\n15. The method according to claim 1, wherein said information is also based on food intake habits of at least one of said other subjects.\n16. The method according to claim 1, wherein said data comprises a listing of activities performed by the subject over a time period.\n17. The method according to claim 1, wherein said information is also based on a listing of activities performed by at least one of said other subjects over a time period.\n18. A computer software product, comprising a non-transitory computer-readable medium in which program instructions are stored, which instructions, when read by a data processor, cause the data processor to receive information pertaining to a food, and to execute the method according to claim 1.\n19. Apparatus for predicting a response of a subject to food, the apparatus comprising:\na user interface configured to receive a food; and\na data processor having a non-transitory computer-readable medium storing the computer software product of claim 18.\n20. A method of constructing a database for providing at least one subject with a personalized diet, the method comprising, for each subject of a group of subjects:\nmonitoring glucose levels of said subject by a glucose level measuring device connected to the subject;\nreceiving food types consumed by said subject;\nvia a communication network, transmitting said glucose levels and said food types to a data processor for analyzing said glucose levels and said food types to associate a glycemic response to each food type of at least a portion of said consumed food types;\nmaking a database record pertaining to said association in at least one database; and\ntraining a machine learning procedure to predict responses to foods using a training dataset comprising said database record, for use in providing at least one subject with a personalized diet.",
    "status": "Active",
    "citations_own": [
        "CN1164259A",
        "US6063820A",
        "WO2002005702A2",
        "WO2002007741A1",
        "WO2002100266A1",
        "US20030208113A1",
        "US20040221855A1",
        "WO2006079124A2",
        "US20080082584A1",
        "EP2006786A1",
        "US20090099873A1",
        "US20090136454A1",
        "US20100172874A1",
        "WO2011041892A1",
        "US20120264637A1",
        "CN102939391A",
        "US20130078601A1",
        "US8460646B2",
        "US20130224155A1",
        "WO2013175038A1",
        "US20130337086A1",
        "US20140024132A1",
        "US20140073610A1",
        "US8762167B2",
        "US20140179726A1",
        "US20140212492A1",
        "WO2014196913A1",
        "CN104415061A",
        "US20150118330A1",
        "US20150213193A1",
        "US20150259728A1",
        "WO2015166492A2",
        "WO2015166489A2",
        "US9301983B2",
        "US20160158295A1",
        "WO2016174677A1",
        "US20160330980A1",
        "WO2016185469A1"
    ],
    "citations_ftf": [
        "BR0315229A",
        "US8317699B2",
        "CN102028542B",
        "WO2012153295A2",
        "US8601005B2"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US11028449B2",
        "US11047232B2",
        "WO2015166489A2",
        "CA2964480A1",
        "WO2017131696A1",
        "JP6654119B2",
        "CN111226286A",
        "CN111372596A",
        "RU2699284C2",
        "US10818390B1",
        "US11348479B2",
        "US20200066181A1",
        "US11295860B2",
        "US11183291B2",
        "US11183080B2",
        "RU2699517C2",
        "US20200043606A1",
        "WO2020076874A1",
        "CN111110949B",
        "WO2020168015A1",
        "US11250062B2",
        "RU2724498C1",
        "US10515715B1",
        "US20220351803A1",
        "US11688504B2",
        "US10998101B1",
        "US11222719B2",
        "EP3896700A1",
        "CN111540438B",
        "CN111466931A",
        "US11594316B2",
        "US11227690B1",
        "US11334352B1",
        "US11139063B1",
        "WO2022251884A1",
        "CN113796852B"
    ]
}