{
    "patent_id": "US-11669918-B2",
    "title": "Dialog session override policies for assistant systems ",
    "assignee": "Meta Platforms Technologies, Llc",
    "publication_date": "2023-06-06",
    "patent_link": "https://patents.google.com/patent/US11669918B2/en",
    "inventors": [
        "Paul Anthony Crook",
        "Baiyang Liu",
        "Pararth Paresh Shah",
        "Bing Liu"
    ],
    "classifications": [
        "G06Q50/01",
        "H04L51/02",
        "G06F16/3329",
        "G06F16/90332",
        "G06F16/9536",
        "G06F18/2321",
        "G06F18/24",
        "G06F3/011",
        "G06F3/013",
        "G06F40/126",
        "G06F40/205",
        "G06F40/216",
        "G06F40/242",
        "G06F40/253",
        "G06F40/284",
        "G06F40/30",
        "G06F40/35",
        "G06F40/56",
        "G06F9/453",
        "G06F9/485",
        "G06F9/4881",
        "G06F9/54",
        "G06F9/547",
        "G06N20/00",
        "G06N3/044",
        "G06N3/045",
        "G06N3/047",
        "G06N3/08",
        "G06N3/082",
        "G06N5/022",
        "G06Q10/00",
        "G06Q10/109",
        "G06Q10/1095",
        "G06V10/255",
        "G06V10/764",
        "G06V10/82",
        "G06V20/00",
        "G06V20/20",
        "G06V20/30",
        "G06V20/41",
        "G06V40/16",
        "G06V40/25",
        "G10L15/063",
        "G10L15/08",
        "G10L15/16",
        "G10L15/1815",
        "G10L15/22",
        "G10L15/30",
        "G10L15/32",
        "H04L51/18",
        "H04L51/212",
        "H04L51/214",
        "H04L51/222",
        "H04L51/224",
        "H04L51/52",
        "H04L67/306",
        "H04L67/75",
        "H04N7/147",
        "G06F2209/541",
        "G06F3/017",
        "G06F3/167",
        "G06N3/048",
        "G06N3/084",
        "G06V2201/10",
        "G06V40/174",
        "G10L13/00",
        "G10L15/07",
        "G10L15/1822",
        "G10L2015/088",
        "G10L2015/223",
        "G10L2015/227"
    ],
    "abstract": "In one embodiment, a method includes receiving a user input at a client system, wherein the user input is associated with one or more intents and one or more slots, generating one or more first dialog acts based on the user input, calculating a task-confidence score based on one or more intent-confidence scores associated with the one or more intents, respectively, and one or more slot-confidence scores associated with the one or more slots, respectively, generating one or more second dialog acts modifying the one or more first dialog acts responsive to the task-confidence score being less than a threshold score, and presenting a response to the user input at the client system, wherein the response is based on one or more of the first dialog acts or the second dialog acts.",
    "claims": "\n1. A method comprising, by a client system:\nreceiving, at the client system, a user input, wherein the user input is associated with one or more intents and one or more slots;\ngenerating one or more first dialog acts based on the user input;\ncalculating a task-confidence score based on one or more intent-confidence scores associated with the one or more intents, respectively, and one or more slot-confidence scores associated with the one or more slots, respectively;\ngenerating, responsive to the task-confidence score being less than a threshold score, one or more second dialog acts modifying the one or more first dialog acts; and\npresenting, at the client system, a response to the user input, wherein the response is based on one or more of the first dialog acts or the second dialog acts.\n2. The method of claim 1, further comprising:\ndetermining a task based on the user input, wherein the task is associated with the one or more intents and the one or more slots.\n3. The method of claim 2, wherein generating the one or more first dialog acts is further based on a task policy, wherein the task policy specifies dialog acts associated with the task.\n4. The method of claim 3, wherein generating the one or more second dialog acts further comprises:\nanalyzing the task policy and the one or more first dialog acts by one or more rules.\n5. The method of claim 3, wherein generating the one or more second dialog acts further comprises:\nanalyzing the task policy and the one or more first dialog acts by one or more machine-learning models, wherein the machine-learning models comprise one or more of a sequence-to-sequence model, a variational auto-encoder, a deep recurrent and convolutional neural network, or a generate-and-rank model.\n6. The method of claim 1, wherein the user input is associated with a user, the method further comprising:\naccessing a current dialog state associated with the user; and\nupdating the current dialog state based on the user input and contextual information associated with the user input.\n7. The method of claim 6, wherein generating the one or more first dialog acts is further based on the updated dialog state associated with the user.\n8. The method of claim 1, wherein one or more of the second dialog acts are associated with augmentations to one or more of the first dialog acts.\n9. The method of claim 1, wherein one or more of the second dialog acts are associated with replacements of one or more of the first dialog acts.\n10. The method of claim 1, wherein one or more of the second dialog acts are associated with one or more confirmation requests.\n11. The method of claim 1, wherein one or more of the second dialog acts are associated with terminations of one or more of the first dialog acts.\n12. The method of claim 1, wherein one or more of the second dialog acts are associated with a change of a modality for presenting the response.\n13. The method of claim 1, wherein one or more of the second dialog acts are associated with a change of a user interface for presenting the response.\n14. The method of claim 1, wherein one or more of the second dialog acts are associated with error-corrections of one or more of the first dialog acts.\n15. The method of claim 1, wherein generating the one or more first dialog acts comprises providing the user input to a third-party agent via an application programming interface (API), and wherein the one or more first dialog acts are generated based on an execution of a task based on the user input by the third-party agent.\n16. One or more computer-readable non-transitory storage media embodying software that is operable when executed to:\nreceive, at a client system, a user input, wherein the user input is associated with one or more intents and one or more slots;\ngenerate one or more first dialog acts based on the user input;\ncalculate a task-confidence score based on one or more intent-confidence scores associated with the one or more intents, respectively, and one or more slot-confidence scores associated with the one or more slots, respectively;\ngenerate, responsive to the task-confidence score being less than a threshold score, one or more second dialog acts modifying the one or more first dialog acts; and\npresent, at the client system, a response to the user input, wherein the response is based on one or more of the first dialog acts or the second dialog acts.\n17. The media of claim 16, wherein one or more of the second dialog acts are associated with augmentations to one or more of the first dialog acts.\n18. The media of claim 16, wherein one or more of the second dialog acts are associated with replacements of one or more of the first dialog acts.\n19. The media of claim 16, wherein one or more of the second dialog acts are associated with one or more confirmation requests.\n20. A system comprising: one or more processors; and a non-transitory memory coupled to the processors comprising instructions executable by the processors, the processors operable when executing the instructions to:\nreceive, at a client system, a user input, wherein the user input is associated with one or more intents and one or more slots;\ngenerate one or more first dialog acts based on the user input;\ncalculate a task-confidence score based on one or more intent-confidence scores associated with the one or more intents, respectively, and one or more slot-confidence scores associated with the one or more slots, respectively;\ngenerate, responsive to the task-confidence score being less than a threshold score, one or more second dialog acts modifying the one or more first dialog acts; and\npresent, at the client system, a response to the user input, wherein the response is based on one or more of the first dialog acts or the second dialog acts."
}