{
    "patent_link": "https://patents.google.com/patent/US6104400A/en",
    "patent_id": "US6104400A",
    "title": "Large tree structure visualization and display system",
    "abstract": "System for the visualization of a large tree structure in which the selection of a center object (40) amongst the objects of the large tree structure enables n levels of descendants from the center object to be visualized on a screen together with the center object, the system has a visualization control in computer memory enabling the objects of a given level corresponding to the children of a parent object of the immediate higher level to be visualized in a fan-shaped area centered around the parent object. A scrollbar associated with the parent object enables all the children of a parent object to be scrolled in a fan. Fan control buttons on the screen enable the aperture of the fans to be modified so that a variable number of children can be visualized in each fan.",
    "inventors": [
        "Avi Halachmi",
        "Michal Jacovi",
        "Menachem Shtalhaim",
        "Sigalit Ur",
        "Yoelle Maarek"
    ],
    "assignee": "International Business Machines Corp",
    "classifications": [
        "G06F3/0489",
        "G06F3/0481",
        "G06F3/0485",
        "G06F3/04855"
    ],
    "claims": "\n1. System for the visualization of a large tree structure comprising a processing unit (10), a storage (14), a display screen (32) and a mouse (26) for positioning a cursor on said screen, in which the selection of a center object (40) amongst the objects of said large tree structure under the control of said processing unit enables n levels of descendants from said center object to be visualized on said screen together with said center object\nsaid system being characterized in that it comprises visualization control means in said memory enabling the objects of a given level corresponding to the children of a parent object of the immediate higher level to be visualized in a fan centered around said parent object, a scrollbar (62) associated with said parent object enabling all the children thereof to be scrolled in said fan.\n2. System according to claim 1, comprising fan control means (94, 96, 98, 100) in said memory (14) enabling the aperture of said fan centered around said parent object to be modified so that a variable number of children thereof can be visualized in said fan.\n3. System according to claim 2, wherein said fan control means (94, 96, 98, 100) are associated with a plurality of fan control buttons (64 to 69) on the screen (32) which are controlled by dragging said mouse (26) to modify the aperture of said fan centered around said parent object.\n4. System according to claim 3, wherein at least one of said fan control buttons (64, 65, 66 or 67) is located at the junction between two fans centered around two parent objects of the same level and can be moved on the screen (32) by mouse dragging so that one of said two fans gets bigger while the other one gets smaller when said button is moved.\n5. System according to claim 3, wherein at least one of said control buttons (68 or 69) is located at the end of the main fan centered around said center object and can be moved on the screen (32) by mouse dragging so that said main fan and the end fan centered around the parent object which is at the end of the main fan are both enlarged or shrunk.\n6. System according to any one of claims 1 to 5, in which said visualization control means comprise for said center object and for each object of at least the n-1 first levels of descendants considered as a parent object:\na buffer (54) for storing the addresses of the M children of said parent object,\na location defining the aperture angle of a fan within a subset of m children is displayed (m≦M), the addresses of these ones being consecutive in said buffer, and\na first and a second pointers for pointing to respective addresses in said buffer of the first and last children of said subset, the value of said pointers being determined by the value of said aperture angle.\n7. System according to claim 6 in which said scrollbar (62) associated with each parent object is displayed adjacent to said parent object when said mouse (26) flies over said parent object and can be controlled by said mouse so that the value of both first and second pointers are simultaneously incremented or decremented whereby the m children corresponding to the m addresses between the addresses defined by said pointers are scrolled on said screen (32).\n8. System according to claim 7, in which moving one of said fan control buttons (96, 98) located at the junction between two fans centered around two parent objects of the same level causes the aperture angle of the first one of said two fans to be incremented and the aperture angle of the other fan to be decremented, whereby the first fan is enlarged while the other fan is shrunk.\n9. System according to claim 4, in which moving one of said fan control buttons (96, 98) located at the junction between two fans centered around two parent objects of the same level causes the aperture angle of the first one of said two fans to be incremented and the aperture angle of the other fan to be decremented, whereby the first fan is enlarged while the other fan is shrunk.\n10. System according to claim 7, in which moving one of said fan control buttons (94, 100) located at the end of the main fan centered around said center object causes the aperture angles of said main fan and of the end fan centered around the parent object which is at the end of the main fan to be both incremented or decremented whereby said main fan and said end fan are both enlarged or shrunk.\n11. System according to claim 5, in which moving one of said fan control buttons (94, 100) located at the end of the main fan centered around said center object causes the aperture angles of said main fan and of the end fan centered around the parent object which is at the end of the main fan to be both incremented or decremented whereby said main fan and said end fan are both enlarged or shrunk.\n12. System according to claim 6 further comprising means for displaying the chain of ancestors of said center object behind said center object on said screen (32).\n13. System according to claim 6, in which said number n of levels is equal to 2.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5295243A",
        "US5392388A",
        "US5559527A",
        "US5596699A",
        "US5619632A",
        "US5706448A",
        "US5721853A",
        "US5745717A",
        "US5828360A",
        "US5940076A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "WO2002008954A1",
        "US6359635B1",
        "US6380957B1",
        "US20020054166A1",
        "US20020101458A1",
        "US20020101441A1",
        "WO2002069192A1",
        "US6460033B1",
        "US20020145623A1",
        "US20030043206A1",
        "US20030050906A1",
        "US20030056199A1",
        "US20030064757A1",
        "US6563521B1",
        "US20030197744A1",
        "US6675202B1",
        "US6677965B1",
        "US20040169654A1",
        "US20040216056A1",
        "US6868525B1",
        "US20050066277A1",
        "US20050066289A1",
        "US6888554B1",
        "US20050097474A1",
        "US6963339B2",
        "US20060036615A1",
        "US7046248B1",
        "US20060174214A1",
        "US20060212833A1",
        "US20070156677A1",
        "US7251616B1",
        "US20080046816A1",
        "US7353464B1",
        "US20090327928A1",
        "US20110022966A1",
        "US20110161827A1",
        "US20130066852A1",
        "US8438487B1",
        "US20140214849A1",
        "US20150046883A1",
        "US9684983B2",
        "US10417797B2",
        "US10572499B2"
    ],
    "citedby_ftf": []
}