{
    "patent_id": "US-11615695-B2",
    "title": "Coverage agent for computer-aided dispatch systems ",
    "assignee": "Intergraph Corporation",
    "publication_date": "2023-03-28",
    "patent_link": "https://patents.google.com/patent/US11615695B2/en",
    "inventors": [
        "II Jackie Paul Williams",
        "Michael Thomas Cole",
        "José Eduardo Zindel Deboni"
    ],
    "classifications": [
        "G08B25/005",
        "G06N5/043",
        "G06N3/006",
        "G06N5/046",
        "G06N5/048",
        "G06N7/02",
        "H04L67/12",
        "G06N20/00",
        "G06N3/08",
        "G06N7/01"
    ],
    "abstract": "Exemplary embodiments of the present invention provide a virtual dispatch assist system in which various types of Intelligent Agents are deployed (e.g., as part of a new CAD system architecture or as add-ons to existing CAD systems) to analyze vast amounts of historic operational data and provide various types of dispatch assist notifications and recommendations that can be used by a dispatcher or by the CAD system itself (e.g., autonomously) to make dispatch decisions.",
    "claims": "\n1. A computer-aided dispatch (CAD) system comprising:\na CAD database storing CAD data including event descriptions; and\nat least one server comprising a tangible, non-transitory computer readable medium having stored thereon an artificially intelligent area coverage agent configured to operate autonomously without being queried by a user, wherein the artificially intelligent area coverage agent is trained to predict future events based on CAD data and produce location and relocation suggestions for positioning field units for such predicted future events, wherein machine learning is used to maximize redundancy of field unit coverage for a predicted future event.\n2. A system according to claim 1, wherein future events are predicted based on trends, historic data, and external related information.\n3. A system according to claim 1, wherein the suggestions are based on number of available units, maximum time/radius to reach the predicted future events, and expected redundancy on coverage.\n4. A system according to claim 1, wherein machine learning is used to maximize coverage for a predicted future event.\n5. A system according to claim 1, wherein machine learning is used to optimize response time for a predicted future event.\n6. A system according to claim 1, wherein the area coverage agent operates on a demand vector of N positions (X, Y, Events), desired units per demand, number of available units, and reach radius of each unit.\n7. A system according to claim 1, wherein a unit associated with a facility is deemed to be available for all demands within a predetermined reach radius of that facility.\n8. A system according to claim 1, wherein location outputs include a vector of facilities that maximizes demand coverage based on a number of units per facility and a coverage list of demands.\n9. A system according to claim 1, wherein relocation outputs include relocation of units to keep maximum demand coverage and coverage list of demands.\n10. A computer program product comprising a tangible, non-transitory computer readable medium having embodied therein a computer program which, when run on a computer, implements computer processes comprising an artificially intelligent area coverage agent configured to operate autonomously without being queried by a user, wherein the artificially intelligent area coverage agent is trained to predict future events based on computer-aided dispatch (CAD) data and produce location and relocation suggestions for positioning field units for such predicted future events, wherein machine learning is used to maximize redundancy of field unit coverage for a predicted future event.\n11. A computer program product according to claim 10, wherein future events are predicted based on trends, historic data, and external related information.\n12. A computer program product according to claim 10, wherein the suggestions are based on number of available units, maximum time/radius to reach the predicted future events, and expected redundancy on coverage.\n13. A computer program product according to claim 10, wherein machine learning is used to maximize coverage for a predicted future event.\n14. A computer program product according to claim 10, wherein machine learning is used to optimize response time for a predicted future event.\n15. A computer program product according to claim 10, wherein the area coverage agent operates on a demand vector of N positions (X, Y, Events), desired units per demand, number of available units, and reach radius of each unit.\n16. A computer program product according to claim 10, wherein a unit associated with a facility is deemed to be available for all demands within a predetermined reach radius of that facility.\n17. A computer program product according to claim 10, wherein location outputs include a vector of facilities that maximizes demand coverage based on a number of units per facility and a coverage list of demands.\n18. A computer program product according to claim 10, wherein relocation outputs include relocation of units to keep maximum demand coverage and coverage list of demands.",
    "status": "Active",
    "citations_own": [
        "US20020116463A1",
        "US6754643B1",
        "US20080177423A1",
        "US7508321B2",
        "US20110320715A1",
        "US20120123822A1",
        "US8515565B2",
        "US20140019431A1",
        "US20140185959A1",
        "US8799799B1",
        "US8949164B1",
        "US8976939B1",
        "WO2015058133A1",
        "US9129219B1",
        "US20150281927A1",
        "US20150278732A1",
        "US20150363518A1",
        "US20160021025A1",
        "US9324022B2",
        "US20160189043A1",
        "US20160189198A1",
        "US20160253089A1",
        "US9438731B2",
        "US20160364434A1",
        "US20170024449A1",
        "US20170083929A1",
        "US20170091617A1",
        "US20170098181A1",
        "US20170111432A1",
        "US20170161614A1",
        "US20170178007A1",
        "US9712549B2",
        "US20170208021A1",
        "US9736302B2",
        "US20180075343A1",
        "US20180082193A1",
        "US20180121827A1",
        "US20180260708A1",
        "US20180260689A1",
        "US20180260707A1",
        "US20180268305A1",
        "US20180322891A1",
        "CN108804567A",
        "US20180330185A1",
        "US20180329897A1",
        "US10135937B2",
        "US20180336413A1",
        "US20180336455A1",
        "US10140327B2",
        "US20180342028A1",
        "US10146960B1",
        "US20180365554A1",
        "US20190005684A1",
        "US20190102438A1",
        "US20190108833A1",
        "US20190126472A1",
        "US20190188572A1",
        "US20190205757A1",
        "US20190213469A1",
        "US20190212754A1",
        "US20190228186A1",
        "US20190232489A1",
        "US20190244099A1",
        "US20190251419A1",
        "US20190258718A1",
        "US20190258907A1",
        "US20190258918A1",
        "US20190258938A1",
        "US20190259051A1",
        "US20190266475A1",
        "US20190266449A1",
        "US20190279076A1",
        "US20190303764A1",
        "CN110309251A",
        "US20190324988A1",
        "US20190332938A1",
        "US20190332923A1",
        "US20190340509A1",
        "US20190346272A1",
        "US20190354859A1",
        "US20190354867A1",
        "US20190354689A1",
        "US20190354885A1",
        "US20190354869A1",
        "US20190354813A1",
        "US20190362238A1",
        "US20190362201A1",
        "US20190370637A1",
        "US20190369946A1",
        "US20190378397A1",
        "US20200005152A1",
        "US20200005147A1",
        "US20200029084A1",
        "US20200042901A1",
        "US20200050611A1",
        "US20200082227A1",
        "US20200082534A1",
        "US20200090006A1",
        "US20200090048A1",
        "US20200090043A1",
        "US20200092565A1",
        "US20200090042A1",
        "US20200104680A1",
        "US20200104709A1",
        "US20200104677A1",
        "US20200104684A1",
        "US20200104685A1",
        "US20200104640A1",
        "US20200104645A1",
        "US10679756B1",
        "US10791084B2",
        "US20200320431A1",
        "US20200334470A1",
        "US20200401966A1"
    ],
    "citations_ftf": [
        "US20040019651A1",
        "US8676841B2",
        "US20100169757A1",
        "GB0919899D0",
        "EP2721800B1",
        "US9922357B2",
        "JP6416677B2",
        "US20160309021A1",
        "CN109069073B",
        "US10783583B1",
        "US20200175767A1",
        "JP6847101B2",
        "US10349148B2",
        "US11025693B2",
        "US11687712B2",
        "US10567568B2"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US10657614B2",
        "US11425215B1",
        "US10986227B2",
        "US10699548B2",
        "US11735028B2",
        "US10924933B2",
        "WO2020176976A1",
        "US11399095B2",
        "EP4038527A4",
        "US11720375B2",
        "US11157087B1",
        "CN113298893B",
        "CN113361970B",
        "CN114103974B",
        "CN114707646B",
        "CN115171358B"
    ]
}