{
    "patent_id": "US-11714968-B2",
    "title": "Identifying data of interest using machine learning ",
    "assignee": "American Express Travel Related Services Company, Inc.",
    "publication_date": "2023-08-01",
    "patent_link": "https://patents.google.com/patent/US11714968B2/en",
    "inventors": [
        "Ravi Batra",
        "Sandeep Bose",
        "Mario Fragoso",
        "Ravneet Ghuman",
        "Madhu Sudan Reddy Gudur",
        "Suraj Madnani",
        "Curtis T. Merryweather",
        "Ravi Varma",
        "Vinod Yadav"
    ],
    "classifications": [
        "G06F40/30",
        "G06F16/953",
        "G06F16/95",
        "G06F40/295",
        "G06N20/00",
        "G06N20/20",
        "G06N5/01",
        "G06N5/045",
        "G06N20/10",
        "G06N3/044",
        "G06N3/08",
        "G06N7/01",
        "G06Q40/02"
    ],
    "abstract": "Systems and methods for identifying data of interest are disclosed. The system may retrieve unstructured data from an internet data source via an alert system or RSS feed. The system may input the unstructured data into various models and scoring systems to determine whether the data is of interest. The models and scoring systems may be executed in order or in parallel. For example, the system may input the unstructured data into a Naïve Bayes machine learning model, a long short-term memory (LSTM) machine learning model, a named entity recognition (NER) model, a semantic role labeling (SRL) model, a sentiment scoring algorithm, and/or a gradient boosted regression tree (GBRT) machine learning model. Based on determining that the unstructured data is of interest, a data alert may be generated and transmitted for manual review or as part of an automated decisioning process.",
    "claims": "\n1. A method comprising:\nretrieving, by a processor, unstructured data from an internet data source, wherein the retrieval is performed as a parallel process to evaluate data from various data sources;\npreprocessing, by the processor, the unstructured data by performing a part-of-speech tagging process;\ninputting, by the processor, the preprocessed unstructured data into a machine learning model and a sentiment scoring engine, wherein the machine learning model and the sentiment scoring engine are trained to identify data of interest to be used in a decisioning process;\nidentifying, by the processor, the data of interest from the preprocessed unstructured data in response to an output of the machine learning model and the sentiment scoring engine indicating that the preprocessed unstructured data has a probability of being of interest; and\ngenerating, by the processor, a data alert in response to identifying the data of interest, wherein the data alert comprises at least one of the preprocessed unstructured data, a web link, or an output of at least one of the machine learning model or the sentiment scoring engine.\n2. The method of claim 1, further comprising transmitting, by the processor, the data alert to a financial decisioning system to be used in a financial decisioning process of an account of a business, wherein the financial decisioning process comprises: closing or limiting credit accounts, extending lines of credit, opening transaction accounts, or closing transaction accounts.\n3. The method of claim 1, further comprising:\ninputting, by the processor, the preprocessed unstructured data into a named entity recognition (NER) model, wherein the NER model is trained to identify the data of interest;\nidentifying, by the processor, the data of interest from the preprocessed unstructured data in response to an output of the NER model indicating that the preprocessed unstructured data has a probability of being of interest; and\ngenerating, by the processor, the data alert in response to identifying the data of interest, wherein the data alert comprises at least one of the preprocessed unstructured data, the web link, or the output of at least one of the machine learning model, the sentiment scoring engine, or the NER model.\n4. The method of claim 3, further comprising:\ninputting, by the processor, the output of the machine learning model, the sentiment scoring engine, and the NER model into a gradient boosted regression tree (GBRT) machine learning model; and\nidentifying, by the processor, the data of interest based on an output of the GBRT machine learning model indicating that the preprocessed unstructured data has a probability of being of interest.\n5. The method of claim 1, further comprising:\ninputting, by the processor, the preprocessed unstructured data into a semantic role labeling (SRL) model, wherein the SRL model is trained to identify the data of interest;\nidentifying, by the processor, the data of interest from the preprocessed unstructured data in response to an output of the SRL indicating that the preprocessed unstructured data has a probability of being of interest; and\ngenerating, by the processor, the data alert in response to identifying the data of interest, wherein the data alert comprises at least one of the preprocessed unstructured data, the web link, or the output of at least one of the machine learning model, the sentiment scoring engine, or the SRL model.\n6. The method of claim 5, further comprising:\ninputting, by the processor, the output of the machine learning model, the sentiment scoring engine, and the SRL model into a gradient boosted regression tree (GBRT) machine learning model; and\nidentifying, by the processor, the data of interest based on an output of the GBRT machine learning model indicating that the preprocessed unstructured data has a probability of being of interest.\n7. The method of claim 1, further comprising:\ninputting, by the processor, the output of the machine learning model and the sentiment scoring engine into a gradient boosted regression tree (GBRT) machine learning model; and\nidentifying, by the processor, the data of interest based on an output of the GBRT machine learning model indicating that the preprocessed unstructured data has a probability of being of interest.\n8. A non-transitory computer readable medium including instructions for causing a computing system to perform operations comprising:\nretrieving, by a processor, unstructured data from an internet data source, wherein the retrieval is performed as a parallel process to evaluate data from various data sources;\npreprocessing, by the processor, the unstructured data by performing a part-of-speech tagging process;\ninputting, by the processor, the preprocessed unstructured data into a machine learning model and a sentiment scoring engine, wherein the machine learning model and the sentiment scoring engine are trained to identify data of interest to be used in a decisioning process;\nidentifying, by the processor, the data of interest from the preprocessed unstructured data in response to an output of the machine learning model and the sentiment scoring engine indicating that the preprocessed unstructured data has a probability of being of interest;\ngenerating, by the processor, a data alert in response to identifying the data of interest, wherein the data alert comprises at least one of the preprocessed unstructured data, a web link, or an output of at least one of the machine learning model or the sentiment scoring engine; and\ntransmitting, by the processor, the data alert to a financial decisioning system to be used in a financial decisioning process of an account of a business, wherein the financial decisioning process comprises: closing or limiting credit accounts, extending lines of credit, opening transaction accounts, or closing transaction accounts.\n9. The non-transitory computer readable medium of claim 8, the operations further comprising transmitting, by the processor, the data alert to a financial decisioning system to be used in a financial decisioning process of an account of a business, wherein the financial decisioning process comprises: closing or limiting credit accounts, extending lines of credit, opening transaction accounts, or closing transaction accounts.\n10. The non-transitory computer readable medium of claim 8, the operations further comprising:\ninputting, by the processor, the preprocessed unstructured data into a named entity recognition (NER) model, wherein the NER model is trained to identify the data of interest;\nidentifying, by the processor, the data of interest from the preprocessed unstructured data in response to an output of the NER model indicating that the preprocessed unstructured data has a probability of being of interest; and\ngenerating, by the processor, the data alert in response to identifying the data of interest, wherein the data alert comprises at least one of the preprocessed unstructured data, the web link, or the output of at least one of the machine learning model, the sentiment scoring engine, or the NER model.\n11. The non-transitory computer readable medium of claim 10, the operations further comprising:\ninputting, by the processor, the output of the machine learning model, the sentiment scoring engine, and the NER model into a gradient boosted regression tree (GBRT) machine learning model; and\nidentifying, by the processor, the data of interest based on an output of the GBRT machine learning model indicating that the preprocessed unstructured data has a probability of being of interest.\n12. The non-transitory computer readable medium of claim 8, the operations further comprising:\ninputting, by the processor, the preprocessed unstructured data into a semantic role labeling (SRL) model, wherein the SRL model is trained to identify the data of interest;\nidentifying, by the processor, the data of interest from the preprocessed unstructured data in response to an output of the SRL indicating that the preprocessed unstructured data has a probability of being of interest; and\ngenerating, by the processor, the data alert in response to identifying the data of interest, wherein the data alert comprises at least one of the preprocessed unstructured data, the web link, or the output of at least one of the machine learning model, the sentiment scoring engine, or the SRL model.\n13. The non-transitory computer readable medium of claim 12, the operations further comprising:\ninputting, by the processor, the output of the machine learning model, the sentiment scoring engine, and the SRL model into a gradient boosted regression tree (GBRT) machine learning model; and\nidentifying, by the processor, the data of interest based on an output of the GBRT machine learning model indicating that the preprocessed unstructured data has a probability of being of interest.\n14. The non-transitory computer readable medium of claim 8, the operations further comprising:\ninputting, by the processor, the output of the machine learning model and the sentiment scoring engine into a gradient boosted regression tree (GBRT) machine learning model; and\nidentifying, by the processor, the data of interest based on an output of the GBRT machine learning model indicating that the preprocessed unstructured data has a probability of being of interest.\n15. A computing system comprising:\na memory storing instructions;\na processor, coupled to the memory, configured to process the stored instructions to:\nretrieve unstructured data from an internet data source, wherein the retrieval is performed as a parallel process to evaluate data from various data sources;\npreprocess the unstructured data by performing a part-of-speech tagging process;\ninput the preprocessed unstructured data into a machine learning model and a sentiment scoring engine, wherein the machine learning model and the sentiment scoring engine are trained to identify data of interest to be used in a decisioning process;\nidentify the data of interest from the preprocessed unstructured data in response to an output of the machine learning model and the sentiment scoring engine indicating that the preprocessed unstructured data has a probability of being of interest;\ngenerate a data alert in response to identifying the data of interest, wherein the data alert comprises at least one of the preprocessed unstructured data, a web link, or an output of at least one of the machine learning model or the sentiment scoring engine; and\ntransmit the data alert to a financial decisioning system to be used in a financial decisioning process of an account of a business, wherein the financial decisioning process comprises: closing or limiting credit accounts, extending lines of credit, opening transaction accounts, or closing transaction accounts.\n16. The computing system of claim 15, wherein the processor is further configured to transmit the data alert to a financial decisioning system to be used in a financial decisioning process of an account of a business, wherein the financial decisioning process comprises: closing or limiting credit accounts, extending lines of credit, opening transaction accounts, or closing transaction accounts.\n17. The computing system of claim 15, wherein the processor is further configured to:\ninput the preprocessed unstructured data into a named entity recognition (NER) model, wherein the NER model is trained to identify the data of interest;\nidentify the data of interest from the preprocessed unstructured data in response to an output of the NER model indicating that the preprocessed unstructured data has a probability of being of interest; and\ngenerate the data alert in response to identifying the data of interest, wherein the data alert comprises at least one of the preprocessed unstructured data, the web link, or the output of at least one of the machine learning model, the sentiment scoring engine, or the NER model.\n18. The computing system of claim 17, wherein the processor is further configured to:\ninput the output of the machine learning model, the sentiment scoring engine, and the NER model into a gradient boosted regression tree (GBRT) machine learning model; and\nidentify the data of interest based on an output of the GBRT machine learning model indicating that the preprocessed unstructured data has a probability of being of interest.\n19. The computing system of claim 15, wherein the processor is further configured to:\ninput the preprocessed unstructured data into a semantic role labeling (SRL) model, wherein the SRL model is trained to identify the data of interest;\nidentify the data of interest from the preprocessed unstructured data in response to an output of the SRL indicating that the preprocessed unstructured data has a probability of being of interest; and\ngenerate the data alert in response to identifying the data of interest, wherein the data alert comprises at least one of the preprocessed unstructured data, the web link, or the output of at least one of the machine learning model, the sentiment scoring engine, or the SRL model.\n20. The computing system of claim 15, wherein the processor is further configured to:\ninput the output of the machine learning model and the sentiment scoring engine into a gradient boosted regression tree (GBRT) machine learning model; and\nidentify the data of interest based on an output of the GBRT machine learning model indicating that the preprocessed unstructured data has a probability of being of interest.",
    "status": "Active",
    "citations_own": [
        "US20160203498A1",
        "US20170097984A1",
        "US20180018741A1",
        "US20180018582A1",
        "US20180095619A1",
        "US20180121549A1",
        "US20180150524A1",
        "US20190114569A1",
        "US20190180097A1",
        "US20190179903A1",
        "US20190180196A1",
        "US10338968B2",
        "US20190228099A1",
        "US20190236139A1",
        "US10380236B1",
        "US20190296978A1",
        "US20200019893A1",
        "US20200074707A1",
        "US20200110842A1",
        "US20200160196A1",
        "US20200175961A1"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "US10860800B2",
        "US11392772B2",
        "US11636401B2",
        "US11409990B1",
        "US11416689B2",
        "US11789945B2",
        "US11360946B2",
        "US10635751B1",
        "US11587101B2",
        "US11044155B2",
        "US11379445B2",
        "US11343270B1",
        "US11240014B1",
        "US11626983B1",
        "US11477016B1",
        "US11354500B2",
        "US11531308B2",
        "US11409250B2",
        "US11533175B1",
        "US11322050B1",
        "US11449799B1",
        "KR102222080B1",
        "US20210287261A1",
        "US20210374758A1",
        "US20220027916A1",
        "CN112632924A",
        "US20220207606A1",
        "CN113051831B",
        "US11544715B2",
        "US20220374449A1",
        "CN113239179B",
        "US20230046471A1",
        "CN113704618B",
        "CN115470871B"
    ]
}