{
    "patent_link": "https://patents.google.com/patent/US7453472B2/en",
    "patent_id": "US7453472B2",
    "title": "System and method for visual annotation and knowledge representation",
    "abstract": "A method and system for visually annotating an image. Annotations and notes to images, such as digital medical and healthcare images, may be stored in a structured vector representation alongside image information in a single, non-volatile and portable file or in a separate file from the image. The annotations may be composed of point, line and polygon drawings and text symbols, labels or definitions and captions or descriptions. The annotations may be structured in a manner that facilitates grouping and manipulation as user defined groups. The annotations may be related to an image but not inextricably bound such that the original image is completely preserved. Annotations may further be selectively displayed on the image for context appropriate viewing. The annotations may be retrieved for purposes such as editing, printing, display, indexing and reporting for example, and may be displayed on an image for interactive use with an embedded self-contained user interface.",
    "inventors": [
        "Patricia Anne Goede",
        "Jason R. Lauman",
        "Christopher Cochella"
    ],
    "assignee": "University of Utah",
    "classifications": [
        "G06T11/60",
        "G06F16/51",
        "G06F16/56",
        "G06F16/58",
        "G06F40/169",
        "G06T19/00",
        "G16H30/40",
        "G06T2210/41",
        "G06T2219/004"
    ],
    "claims": "\n1. A method of visually annotating a digital image, the method comprising:\npresenting a digital image in a user interface of a display;\nreceiving information defining a region of interest identified by a user interacting with the presented digital image;\nreceiving textual information associated with the received information, wherein an annotation comprises the received information and the received textual information;\npresenting the digital image overlaid with the received information and the received textual information;\npresenting a plurality of annotation indicators in the user interface, an annotation indicator of the plurality of annotation indicators including the received textual information associated with the annotation;\nreceiving a selection of a first annotation indicator of the presented plurality of annotation indicators; and\npresenting the digital image without the received information and the received textual information associated with the received selection.\n2. The method of claim 1, wherein the digital image is an image of at least, a portion of a human body.\n3. The method of claim 1, further comprising electronically storing the annotation as vector based information linked to the digital image.\n4. The method of claim 3, wherein storing comprises storing the annotation in a second file and said digital image is stored in a first file.\n5. The method of claim 3, wherein storing comprises storing the annotation in the same file which contains the digital image.\n6. The method of claim 3 wherein storing comprises storing the annotation as text information.\n7. The method of claim 6, wherein the annotation is stored in an extensible markup language compatible format.\n8. The method of claim 3 wherein the annotation is stored in a format that can be electronically queried.\n9. The method of claim 1, further comprising hierarchically organizing the annotations into logical groupings based on a user defined structure.\n10. The method of claim 1, wherein at least part of the annotation utilizes user defined lexicons.\n11. The method of claim 1, further comprising defining metadata associated with the annotation.\n12. The method of claim 11 wherein the metadata is stored with the annotation.\n13. The method of claim 11 wherein the metadata comprises at least one selected from the group consisting of: the name of the author or creator of the annotation, a date indicating when the annotation was created, a title, a subject, a description, and an area of specialty of the author or creator.\n14. The method of claim 1, wherein the region of interest is defined as an area selected from the group consisting of: a point, a set of points, a polygon, and a polyline.\n15. The method of claim 1 wherein the annotation can be displayed according to a predefined user grouping.\n16. The method of claim 1 wherein the annotation is uniquely identified.\n17. The method of claim 1 wherein the digital image comprises a sequence of digital images.\n18. The method of claim 1, wherein the textual information includes a symbol and a label.\n19. The method of claim 18, further comprising presenting the symbol or the label adjacent the defined region of interest in the user interface based on a user selection.\n20. The method of claim 18, wherein the textual information further includes a caption.\n21. The method of claim 1, further comprising receiving pointer information associated with the received information, wherein an annotation further comprises the received pointer information.\n22. The method of claim 21, wherein the received pointer information includes secondary information related to the received information.\n23. The method of claim 22, further comprising presenting the secondary information in the user interface based on activation of a hot-spot associated with a pointer created in the user interface based on the received pointer information.\n24. The method of claim 1, further comprising:\nreceiving second information defining a second region of interest identified by the user interacting with the presented digital image;\nreceiving second textual information associated with the received second information, wherein a second annotation comprises the received second information and the received second textual information; and\nassociating the annotation and the second annotation with a first annotation group.\n25. The method of claim 24, further comprising:\nreceiving a selection of the first annotation group to present overlaid on the displayed digital image; and\npresenting the digital image with the annotation and the second annotation.\n26. A device for visually annotating a digital image, the device comprising:\na processor; and\na computer memory operably coupled to the processor, the computer memory comprising programming code that, upon execution by the processor, performs operations comprising\npresenting a digital image in a user interface of a display;\nreceiving information defining a region of interest identified by a user interacting with the presented digital image;\nreceiving textual information associated with the received information, wherein an annotation comprises the received information and the received textual information;\npresenting the digital image overlaid with the received information and the received textual information;\npresenting a plurality of annotation indicators in the user interface, an annotation indicator of the plurality of annotation indicators including the received textual information associated with the annotation;\nreceiving a selection of a first annotation indicator of the presented plurality of annotation indicators; and\npresenting the digital image without the received information and the received textual information associated with the received selection.\n27. The device of claim 26, wherein the programming code further performs operations comprising:\nreceiving second information defining a second region of interest identified by the user interacting with the presented digital image;\nreceiving second textual information associated with the received second information, wherein a second annotation comprises the received second information and the received second textual information; and\nassociating the annotation and the second annotation with a first annotation group.\n28. The device of claim 27, wherein the programming code further performs operations comprising:\nreceiving a selection of the first annotation group to present overlaid on the displayed digital image; and\npresenting the digital image with the annotation and the second annotation.\n29. A computer memory comprising programming code therein that, upon execution by a processor, causes a computer to:\npresent a digital image in a user interface of a display;\nreceive information defining a region of interest identified by a user interacting with the presented digital image;\nreceive textual information associated with the received information, wherein an annotation comprises the received information and the received textual information;\npresent the digital image overlaid with the received information and the received textual information;\npresent a plurality of annotation indicators in the user interface, an annotation indicator of the plurality of annotation indicators including the received textual information associated with the annotation;\nreceive a selection of a first annotation indicator of the presented plurality of annotation indicators; and\npresent the digital image without the received information and the received textual information associated with the received selection.\n30. The computer memory of claim 29, wherein the programming code further causes the computer to define metadata associated with the annotation.\n31. The computer memory of claim 29, wherein the programming code further causes the computer to store the annotation as vector based information linked to the digital image.\n32. The computer memory of claim 29, wherein the textual information includes a symbol and a label.\n33. The computer memory of claim 32, wherein the programming code further causes the computer to present the symbol or the label adjacent the defined region of interest in the user interface based on a user selection.\n34. The computer memory of claim 32, wherein the textual information further includes a caption.\n35. The computer memory of claim 29, wherein the programming code further causes the computer to receive pointer information associated with the received information, wherein an annotation further comprises the received pointer information.\n36. The computer memory of claim 35, wherein the received pointer information includes secondary information related to the received information.\n37. The computer memory of claim 36, wherein the programming code further causes the computer to present the secondary information in the user interface based on activation of a hot-spot associated with a pointer created in the user interface based on the received pointer information.\n38. The computer memory of claim 29, wherein the programming code further causes the computer to: receive second information defining a second region of interest identified by the user interacting with the presented digital image; receive second textual information associated with the received second information, wherein a second annotation comprises the received second information and the received second textual information; and associate the annotation and the second annotation with a first annotation group.\n39. The computer memory of claim 38, wherein the programming code further causes the computer to:\nreceive a selection of the first annotation group to present overlaid on the displayed digital image; and\npresent the digital image with the annotation and the second annotation.",
    "status": "Active - Reinstated",
    "citations_own": [
        "US4772206A",
        "US4959828A",
        "US5101436A",
        "US5115501A",
        "US5146552A",
        "US5253362A",
        "US5423322A",
        "US5428357A",
        "US5440338A",
        "US5532844A",
        "US5531988A",
        "US5581682A",
        "US5583980A",
        "US5596700A",
        "US5608872A",
        "US5621871A",
        "US5724985A",
        "US5729620A",
        "US5734915A",
        "US5757368A",
        "US5806079A",
        "US5828774A",
        "US5832474A",
        "US5835627A",
        "US5845301A",
        "US5875249A",
        "US5877819A",
        "US5884246A",
        "US5920317A",
        "US5987345A",
        "US5986662A",
        "US6006242A",
        "US6023530A",
        "US6026363A",
        "US6026494A",
        "US6041335A",
        "US6054990A",
        "US6061717A",
        "US6124858A",
        "US6173068B1",
        "US6175841B1",
        "US6177937B1",
        "US6269366B1",
        "US6279014B1",
        "US6301586B1",
        "US6313836B1",
        "US6342906B1",
        "US6356922B1",
        "US6369812B1",
        "US20020054059A1",
        "US20020055955A1",
        "US20020067340A1",
        "US20020070970A1",
        "US20020097320A1",
        "US6429878B1",
        "US6477460B2",
        "US6480186B1",
        "US6484156B1",
        "US6509915B2",
        "US6519603B1",
        "US6518952B1",
        "US20030052896A1",
        "US6542165B1",
        "US6545660B1",
        "US6546405B2",
        "US6564263B1",
        "US6611725B1",
        "US6684379B2",
        "US20040078215A1",
        "US6804394B1",
        "US20040205482A1",
        "US6839455B2",
        "US6853741B1",
        "US6947584B1",
        "US6970587B1",
        "US7136518B2",
        "US7146031B1",
        "US7225011B2",
        "US7260248B2"
    ],
    "citations_ftf": [
        "US5694608A",
        "US5893125A",
        "US5805118A",
        "US6081829A",
        "US6178432B1",
        "US6366899B1",
        "JPH11261351A",
        "JP2000285814A",
        "US6957233B1",
        "US7451389B2",
        "US7259753B2",
        "US7234108B1",
        "US6897880B2",
        "US7266778B2"
    ],
    "citedby_own": [
        "US20060023924A1",
        "US20060058610A1",
        "US20070124787A1",
        "US20070204165A1",
        "US20070208943A1",
        "US20070294619A1",
        "US20070294614A1",
        "US20080005652A1",
        "US20080059238A1",
        "US20080117225A1",
        "US20080228061A1",
        "US20090040565A1",
        "US20090193327A1",
        "US20090202179A1",
        "US20090254867A1",
        "US20090307618A1",
        "US20100083153A1",
        "US7847970B1",
        "US20100325557A1",
        "US20100329555A1",
        "US20100331043A1",
        "US20110101103A1",
        "US20110145240A1",
        "US20110188715A1",
        "US20110196902A1",
        "US8060747B1",
        "US20120179039A1",
        "US8228347B2",
        "US20130249906A1",
        "US8584008B1",
        "US8737702B2",
        "US20140149942A1",
        "US20140189481A1",
        "CN103917975A",
        "US8942917B2",
        "US9129361B2",
        "US9218680B2",
        "US9292186B2",
        "US9418080B1",
        "US20160253456A1",
        "US10191894B2",
        "US10349825B2",
        "US10489010B1",
        "US10497157B2",
        "US10646199B2",
        "US11100687B2",
        "US20210312121A1",
        "US11215711B2",
        "US11295493B2",
        "US11527329B2",
        "US11710309B2"
    ],
    "citedby_ftf": [
        "JP2005534359A",
        "US7257774B2",
        "US7466323B2",
        "US9396212B2",
        "US20050234992A1",
        "US9087126B2",
        "US20050235272A1",
        "US7644050B2",
        "WO2006017079A2",
        "US8335694B2",
        "US20060041375A1",
        "US7414637B2",
        "US7660488B2",
        "US7920152B2",
        "US7970625B2",
        "US7787672B2",
        "US7885440B2",
        "US7792851B2",
        "US7562342B2",
        "US7769747B2",
        "US9275052B2",
        "US8131647B2",
        "US7567262B1",
        "JP4575216B2",
        "US8238999B2",
        "US7607079B2",
        "WO2007027610A2",
        "US20070052734A1",
        "JP5069689B2",
        "US8117549B2",
        "US8452594B2",
        "US8607147B2",
        "US8942483B2",
        "DE102005061796A1",
        "JP5169816B2",
        "US8244025B2",
        "US8352449B1",
        "EP2008578A4",
        "GB0607763D0",
        "WO2007131157A2",
        "WO2007143084A2",
        "US20070288164A1",
        "US7793211B2",
        "US20080082559A1",
        "US8725565B1",
        "US9672533B1",
        "US7898553B2",
        "US20080108895A1",
        "US7953614B1",
        "AU2006249239B2",
        "US20080147604A1",
        "KR101392166B1",
        "US7865817B2",
        "US20080195962A1",
        "US7751807B2",
        "US8024400B2",
        "JP2008217590A",
        "US7904825B2",
        "US7992082B2",
        "US9665529B1",
        "US7716224B2",
        "US20080243788A1",
        "US8234282B2",
        "KR100808626B1",
        "US8014572B2",
        "US20090013044A1",
        "US7725454B2",
        "US7849065B2",
        "US8457416B2",
        "US8571850B2",
        "US20090132907A1",
        "EP2220619A2",
        "GB2456326B",
        "US20090183007A1",
        "US8199166B2",
        "WO2009120921A1",
        "US8423889B1",
        "JP2010000183A",
        "US8280631B2",
        "US11017160B2",
        "US8893015B2",
        "US10282391B2",
        "US20100188407A1",
        "US20100198663A1",
        "US20100188088A1",
        "US11061165B2",
        "US8380533B2",
        "CN101414307A",
        "US9087032B1",
        "US8378979B2",
        "US8452794B2",
        "US8832584B1",
        "US20100254607A1",
        "JP2010273854A",
        "US8325999B2",
        "US8744147B2",
        "US8897541B2",
        "US9324003B2",
        "US8749588B2",
        "US8712120B1",
        "US8692763B1",
        "CN102792322B",
        "JP5474479B2",
        "US8570326B2",
        "WO2011058482A2",
        "US9497581B2",
        "US9384308B2",
        "US9754225B2",
        "CA2798294C",
        "DE102010026966A1",
        "US8554640B1",
        "US9495322B1",
        "US8787651B2",
        "US9535884B1",
        "US10115158B2",
        "US8855937B2",
        "US9213905B2",
        "US9846848B2",
        "US9058633B2",
        "US20120101784A1",
        "US8768667B2",
        "US9378331B2",
        "WO2012077012A1",
        "CN102033928B",
        "US20140143272A1",
        "US20120166474A1",
        "JP5685928B2",
        "US8638375B2",
        "US8671741B2",
        "JP5853458B2",
        "US9075899B1",
        "US11810661B2",
        "US8992232B2",
        "US9483454B2",
        "US9158741B1",
        "JP6091137B2",
        "JP5972570B2",
        "BR112014018598A8",
        "US9977876B2",
        "US8908943B2",
        "US9535583B2",
        "FR2999429B1",
        "US9495604B1",
        "US9256962B2",
        "US8972882B2",
        "CN103971244B",
        "US8854361B1",
        "CA2895567C",
        "US9430127B2",
        "US9751294B2",
        "US9509758B2",
        "US9213474B2",
        "US9323447B2",
        "US20150124079A1",
        "US20150317071A1",
        "KR20160012837A",
        "US10417763B2",
        "US10127662B1",
        "US9883232B2",
        "US10127331B2",
        "KR102332136B1",
        "US10929508B2",
        "TWI645417B",
        "US9418454B1",
        "US10628509B2",
        "EP3285216A1",
        "US10779786B2",
        "US10445462B2",
        "WO2018093182A1",
        "US10452813B2",
        "US10628481B2",
        "WO2018094553A1",
        "EP3590056A1",
        "US10552978B2",
        "US11074996B2",
        "US11316865B2",
        "US11250382B2",
        "US11515020B2",
        "CN112106146A",
        "US11100366B2",
        "CN108682453A",
        "US10885094B2",
        "KR102273922B1",
        "JP7186120B2",
        "US11048864B2",
        "US11531807B2",
        "US11670408B2",
        "US20210174503A1",
        "US20210251583A1",
        "US11189375B1",
        "US11651499B2",
        "EP4156021A1"
    ]
}