{
    "patent_id": "US-11238066-B2",
    "title": "Generating personalized clusters of multimedia content elements based on user interests ",
    "assignee": "Cortica Ltd.",
    "publication_date": "2022-02-01",
    "patent_link": "https://patents.google.com/patent/US11238066B2/en",
    "inventors": [
        "Igal RAICHELGAUZ",
        "Karina ODINAEV",
        "Yehoshua Y. Zeevi"
    ],
    "classifications": [
        "G06F16/41",
        "G06F16/14",
        "G06F16/152",
        "G06F16/172",
        "G06F16/1748",
        "G06F16/2228",
        "G06F16/284",
        "G06F16/285",
        "G06F16/35",
        "G06F16/40",
        "G06F16/43",
        "G06F16/433",
        "G06F16/434",
        "G06F16/435",
        "G06F16/438",
        "G06F16/4393",
        "G06F16/48",
        "G06F16/483",
        "G06F16/487",
        "G06F16/51",
        "G06F16/683",
        "G06F16/685",
        "G06F16/739",
        "G06F16/783",
        "G06F16/7834",
        "G06F16/7844",
        "G06F16/7847",
        "G06F16/904",
        "G06F16/951",
        "G06F16/9535",
        "G06F16/9558",
        "G06F17/16",
        "G06F3/048",
        "G06F3/0484",
        "G06F3/0488",
        "G06F40/134",
        "G06K9/00281",
        "G06K9/00711",
        "G06K9/00744",
        "G06N20/00",
        "G06N3/045",
        "G06N3/048",
        "G06N3/063",
        "G06N3/088",
        "G06N5/02",
        "G06N5/022",
        "G06N5/025",
        "G06N5/04",
        "G06N7/005",
        "G06N7/01",
        "G06Q30/0201",
        "G06Q30/0246",
        "G06Q30/0261",
        "G06T19/006",
        "G06V10/764",
        "G06V20/40",
        "G06V20/46",
        "G06V20/48",
        "G06V40/171",
        "G09B19/0092",
        "G10L25/51",
        "H04H20/103",
        "H04H20/26",
        "H04H20/93",
        "H04H60/33",
        "H04H60/37",
        "H04H60/46",
        "H04H60/49",
        "H04H60/56",
        "H04H60/58",
        "H04H60/59",
        "H04H60/66",
        "H04H60/71",
        "H04L51/18",
        "H04L51/42",
        "H04L65/601",
        "H04L65/75",
        "H04L65/765",
        "H04L67/02",
        "H04L67/10",
        "H04L67/22",
        "H04L67/306",
        "H04L67/327",
        "H04L67/535",
        "H04L67/63",
        "H04N21/23418",
        "H04N21/25891",
        "H04N21/26603",
        "H04N21/2668",
        "H04N21/278",
        "H04N21/466",
        "H04N21/8106",
        "H04N7/17318",
        "G06K2209/27",
        "G06V2201/10",
        "G10L15/26",
        "G10L15/32",
        "H04H2201/90",
        "Y10S707/99943",
        "Y10S707/99948"
    ],
    "abstract": "A system and method for generating personalized multimedia content element clusters. The method includes determining, based on at least one interest, at least one personalized concept, wherein each personalized concept represents one of the at least one user interest; obtaining at least one multimedia content element related to a user; generating at least one signature for the at least one multimedia content element, each generated signature representing at least a portion of the at least one multimedia content element; determining, based on the generated at least one signature, at least one multimedia content element cluster, wherein each cluster includes a plurality of multimedia content elements sharing a common concept of the at least one personalized concept; and creating at least one personalized multimedia content element cluster by adding, to each determined cluster, at least one of the at least one multimedia content element sharing the common concept of the cluster.",
    "claims": "\n1. A system for clustering multimedia content elements, comprising:\na processing circuitry; and\na memory, the memory containing instructions that, when executed by the processing circuitry, configure the system to:\ndetermine, based on at least one user interest of a user, at least one personalized concept, wherein each personalized concept represents one of the at least one user interest of the user;\nwherein the at least one user interest of the user is determined based on one or more images of a user profile of the user;\nobtain at least one multimedia content element (MMCE) related to the user;\ngenerate at least one signature for the obtained at least one MMCE, each signature representing at least a portion of the obtained at least one MMCE;\ndetermine, based on the generated at least one signature, at least one MMCE cluster, wherein each MMCE cluster includes a plurality of clustered MMCEs sharing a common concept, wherein each common concept is one of the determined at least one personalized concept; and\ncreate at least one personalized MMCE cluster by adding, to each determined MMCE cluster that becomes a personalized MMCE cluster, at least one of the obtained at least one MMCE sharing the common concept of the cluster.\n2. The system of claim 1, wherein the system is further configured to: generate, based on the generated at least one signature, at least one tag for the obtained at least one MMCE, wherein the at least one MMCE cluster is determined based further on the generated at least one tag.\n3. The system of claim 2, wherein each MMCE cluster includes a plurality of MMCEs associated with the generated at least one tag.\n4. The system of claim 2, wherein the system is further configured to: query, with respect to the generated at least one signature, a deep content classification system to obtain at least one concept matching the at least one MMCE, each concept including a signature reduced cluster and metadata, wherein the at least one tag is generated based on the metadata of the obtained at least one concept.\n5. The system of claim 1, wherein the at least one user interest of the user is at least one topic of interest to the user.\n6. The system of claim 5, wherein the one or more images of the user profile comprise a plurality of tracked images; wherein each tracked image is at least one of:\nuploaded by the user, and viewed by the user;\nwherein the system is configured to generate, for each tracked image, at least one signature;\nwherein the at least one interest of the user is determined based on the generated at least one signature for each tracked image.\n7. The system of claim 1, further comprising: a signature generator system, wherein each signature is generated by the signature generator system, wherein the signature generator system includes a plurality of computational cores configured to receive a plurality of unstructured data elements, each computational core of the plurality of computational cores having properties that are at least partly statistically independent of other of the computational cores, wherein the properties of each core are set independently of each other core.\n8. The system of claim 7, wherein each signature is robust to noise and distortion.\n9. The system of claim 1, wherein the system is further configured to:\ndetermine, for each personalized concept, whether an existing MMCE cluster having the personalized concept as a common concept can be found; and\ngenerate a MMCE cluster, when it is determined that an existing MMCE cluster having the personalized concept as a common concept cannot be found, wherein the determined at least one MMCE cluster is the generated MMCE cluster.\n10. The system of claim 1, wherein the at least one signature is generated via a signature generator system, wherein the signature generator system includes a plurality of at least partially statistically independent computational cores, wherein the properties of each computational core are set independently of properties of each other computational core.\n11. The system of claim 1, wherein the system is further configured to: generate a personalized mosaic, wherein the personalized mosaic includes at least one of: an icon representing each personalized MMCE cluster, and a textual description of each personalized MMCE cluster.\n12. The system of claim 1, wherein each personalized concept is a collection of signatures representing a plurality of MMCEs and metadata describing the concept.\n13. A method for generating personalized clusters of multimedia content elements, comprising:\ndetermining, based on at least one user interest of a user, at least one personalized concept, wherein each personalized concept represents one of the at least one user interest;\nwherein the at least one user interest of the user is determined based on one or more images of a user profile of the user;\nobtaining at least one multimedia content element (MMCE) related to the user;\ngenerating at least one signature for the obtained at least one MMCE, each generated signature representing at least a portion of the obtained at least one MMCE;\ndetermining, based on the generated at least one signature, at least one MMCE cluster, wherein each MMCE cluster includes a plurality of clustered MMCEs sharing a common concept, wherein each common concept is one of the determined at least one personalized concept; and\ncreating at least one personalized MMCE cluster by adding, to each determined cluster that becomes a personalized MMCE cluster, at least one of the obtained at least one MMCE sharing the common concept of the cluster.\n14. The method of claim 13, further comprising: generating, based on the generated at least one signature, at least one tag for the obtained at least one MMCE, wherein the at least one MMCE cluster is determined based further on the generated at least one tag.\n15. The method of claim 14, wherein each MMCE cluster includes a plurality of MMCEs associated with the generated at least one tag.\n16. The method of claim 14, wherein generating the at least one tag further comprises: querying, with respect to the generated at least one signature, a deep content classification system to obtain at least one concept matching the at least one MMCE, each concept including a signature reduced cluster and metadata, wherein the at least one tag is generated based on the metadata of the obtained at least one concept.\n17. The method of claim 13, further comprising:\ndetermining, for each personalized concept, whether an existing MMCE cluster having the personalized concept as a common concept can be found; and\ngenerating a MMCE cluster, when it is determined that an existing MMCE cluster having the personalized concept as a common concept cannot be found, wherein the determined at least one MMCE cluster is the generated MMCE cluster.\n18. The method of claim 13, wherein the at least one signature is generated via a signature generator system, wherein the signature generator system includes a plurality of at least partially statistically independent computational cores, wherein the properties of each computational core are set independently of properties of each other computational core.\n19. The method of claim 13, wherein is at least one topic of interest to the user.\n20. The method of claim 13 wherein the one or more images of the user profile comprise a plurality of tracked images; wherein each tracked image is\nat least one of: uploaded by the user, and viewed by the user;\ngenerating, for each tracked image, at least one signature; wherein the at least one interest of the user is determined based on the generated at least one signature for each tracked image.\n21. The method of claim 13, further comprising: generating a personalized mosaic, wherein the personalized mosaic includes at least one of: an icon representing each personalized MMCE cluster, and a textual description of each personalized MMCE cluster.\n22. The method of claim 13, wherein each personalized concept is a collection of signatures representing a plurality of MMCEs and metadata describing the concept.\n23. A non-transitory computer readable medium having stored thereon instructions for causing a processing circuitry to execute a process, the process comprising:\ndetermining, based on at least one user interest of a user, at least one personalized concept, wherein each personalized concept represents one of the at least one user interest of the user;\nobtaining at least one multimedia content element (MMCE) related to the user; wherein the at least one user interest of the user is determined based on one or more images of a user profile of the user;\ngenerating at least one signature for the obtained at least one MMCE, each signature representing at least a portion of the obtained at least one MMCE;\ndetermining, based on the generated at least one signature, at least one MMCE cluster, wherein each MMCE cluster includes a plurality of clustered MMCEs sharing a common concept, wherein each common concept is one of the determined at least one personalized concept; and\ncreating at least one personalized MMCE cluster by adding, to each determined MMCE cluster that becomes a personalized MMCE cluster, at least one of the obtained at least one MMCE sharing the common concept of the cluster.",
    "status": "Active",
    "citations_own": [
        "US20020184505A1",
        "US20030037010A1",
        "US6640015B1",
        "US20040059736A1",
        "US20040091111A1",
        "US20040230572A1",
        "US20050193015A1",
        "US20060100987A1",
        "US20060120626A1",
        "US20060251339A1",
        "US20070196013A1",
        "US20080109433A1",
        "US20080152231A1",
        "US20080166020A1",
        "US20080270569A1",
        "US20080294278A1",
        "US20090022472A1",
        "US20090034791A1",
        "US20090043818A1",
        "US20090080759A1",
        "US20090278934A1",
        "US20100042646A1",
        "US20100082684A1",
        "US20100111408A1",
        "US7801893B2",
        "US20100306193A1",
        "US20110029620A1",
        "US20110038545A1",
        "US20110246566A1",
        "US20120133497A1",
        "US20120179751A1",
        "US8275764B2",
        "US20130103814A1",
        "USRE44225E1",
        "US20130212493A1",
        "US20130226820A1",
        "US8527978B1",
        "US8634980B1",
        "US20140025692A1",
        "US20140059443A1",
        "US20140095425A1",
        "US20140111647A1",
        "US8781152B2",
        "US8782077B1",
        "US20140201330A1",
        "US20140379477A1",
        "US20150033150A1",
        "US20150117784A1",
        "US20150134688A1",
        "US20150363644A1",
        "US9298763B1",
        "US20160210525A1",
        "US20160221592A1",
        "US9440647B1",
        "US20160342683A1",
        "US20160357188A1",
        "US20170032257A1",
        "US20170041254A1",
        "US20170109602A1",
        "US9734533B1",
        "US20170255620A1",
        "US20170323568A1",
        "US20180081368A1",
        "US20180101177A1",
        "US20180157916A1",
        "US20180158323A1",
        "US20180204111A1",
        "US20190005726A1",
        "US20190039627A1",
        "US20190043274A1",
        "US20190045244A1",
        "US20190056718A1",
        "US20190065951A1",
        "US20190188501A1",
        "US20190220011A1",
        "US20190317513A1",
        "US10491885B1",
        "US20190364492A1",
        "US20190385460A1",
        "US20190384303A1",
        "US20190384312A1",
        "US20190389459A1",
        "US20200004248A1",
        "US20200004251A1",
        "US20200004265A1",
        "US20200005631A1",
        "US20200020212A1",
        "US20200018618A1",
        "US20200018606A1",
        "US20200043326A1",
        "US20200050973A1",
        "US20200073977A1",
        "US20200090484A1",
        "US20200097756A1",
        "US20200133307A1"
    ],
    "citations_ftf": [
        "US4733353A",
        "US5078501A",
        "US4972363A",
        "US4932645A",
        "US5214746A",
        "US6850252B1",
        "US5436653A",
        "US5307451A",
        "US5314419A",
        "AU5803394A",
        "CN1113302C",
        "US20010038876A1",
        "CA2130395C",
        "US5835901A",
        "US5412564A",
        "US6052481A",
        "US5759462A",
        "US5758257A",
        "EP0717337B1",
        "JP2002083219A",
        "US5546405A",
        "JPH0981566A",
        "US6985172B1",
        "CA2166247A1",
        "US6076088A",
        "US5852435A",
        "US5870754A",
        "US5926812A",
        "US5991306A",
        "US5873080A",
        "US20030093790A1",
        "US5802521A",
        "US6243375B1",
        "US5806061A",
        "US5940821A",
        "US6038560A",
        "US5987454A",
        "US6523022B1",
        "US6137911A",
        "US6360234B2",
        "US6507672B1",
        "US6070167A",
        "US6594699B1",
        "US6122628A",
        "US7954056B2",
        "US6329986B1",
        "US6144767A",
        "US6240423B1",
        "US6163510A",
        "US6292575B1",
        "US6243713B1",
        "US6275599B1",
        "US7634662B2",
        "EP0990998A3",
        "US6493692B1",
        "US6493705B1",
        "US7158681B2",
        "US6363373B1",
        "US7313805B1",
        "US20020123928A1",
        "US6524861B1",
        "TW452748B",
        "KR20040018395A",
        "US6819797B1",
        "CN1293793B",
        "US6381656B1",
        "US6774917B1",
        "JP2000322448A",
        "US6643620B1",
        "US6557042B1",
        "US6732149B1",
        "US6128651A",
        "US6763519B1",
        "KR100326400B1",
        "US8055588B2",
        "US6807306B1",
        "US6411724B1",
        "KR100518860B1",
        "KR100479613B1",
        "US6813395B1",
        "AUPQ206399A0",
        "JP2001049923A",
        "US6751363B1",
        "US6147636A",
        "KR100346262B1",
        "US6711291B1",
        "US6601026B2",
        "US20030182567A1",
        "US6665657B1",
        "KR100357261B1",
        "WO2001052524A1",
        "US7047033B2",
        "CA2333338A1",
        "US6550018B1",
        "US20020161739A1",
        "US7137065B1",
        "US6523046B2",
        "US8036905B2",
        "US20020032677A1",
        "US20020038299A1",
        "US6804356B1",
        "US6560597B1",
        "US6901207B1",
        "US7260564B1",
        "US20020072935A1",
        "US20060217828A1",
        "US6411229B2",
        "US7987217B2",
        "AU6263101A",
        "JP2001339703A",
        "US6611837B2",
        "US20020019881A1",
        "US7587368B2",
        "US6763069B1",
        "US7035873B2",
        "US6829780B2",
        "US7660737B1",
        "AU2001275982A1",
        "EP1249090A1",
        "US7624337B2",
        "US6675159B1",
        "US20020157116A1",
        "US7464086B2",
        "JP2002057698A",
        "MXPA02003991A",
        "WO2002027541A1",
        "JP3654168B2",
        "AR035655A1",
        "EP1356430B1",
        "US8711217B2",
        "US6970860B1",
        "US7031980B2",
        "US7146349B2",
        "US6763148B1",
        "US7043473B1",
        "US6845374B1",
        "AU2002217973A1",
        "US6961943B2",
        "JP3658761B2",
        "US20040128511A1",
        "WO2002051063A1",
        "AUPR230700A0",
        "JP4329264B2",
        "US20020087828A1",
        "US20020087530A1",
        "US6728681B2",
        "US6753766B2",
        "JP2002229859A",
        "EP1362485B1",
        "US7003726B2",
        "US6704887B2",
        "EP1379938A1",
        "US7681032B2",
        "US6820081B1",
        "US6728706B2",
        "WO2003005242A1",
        "US7143353B2",
        "US7206757B2",
        "US8060906B2",
        "US7933407B2",
        "US6826576B2",
        "US6970881B1",
        "US6938025B1",
        "US6993535B2",
        "US7529659B2",
        "US20020010715A1",
        "JP4153990B2",
        "US20030041047A1",
        "US6747201B2",
        "CA2457715A1",
        "EP1302865A1",
        "US6925475B2",
        "US20030105739A1",
        "US7495795B2",
        "US8635531B2",
        "US7093001B2",
        "US6912517B2",
        "US7283992B2",
        "US7353224B2",
        "US7020654B1",
        "US7921288B1",
        "US20030115191A1",
        "US6978264B2",
        "US20030140257A1",
        "CN1615481A",
        "US20050144455A1",
        "US7215828B2",
        "US7271809B2",
        "US7023979B1",
        "US7392230B2",
        "US7167574B2",
        "AU2003207887A1",
        "US20070038614A1",
        "US20050114198A1",
        "US20030191776A1",
        "US7162475B2",
        "ES2312772T3",
        "US7085771B2",
        "US7370002B2",
        "US20040003394A1",
        "EP1523717A1",
        "CN1672357A",
        "US20030191764A1",
        "WO2004019527A1",
        "US20050226511A1",
        "JP3942995B2",
        "US7519616B2",
        "US20040068757A1",
        "WO2004036497A1",
        "WO2004042493A2",
        "WO2004040475A2",
        "US20040107181A1",
        "US20040162820A1",
        "US7870279B2",
        "US20040111432A1",
        "US7124149B2",
        "GB0229625D0",
        "EP1576499A2",
        "US7734070B1",
        "US7299261B1",
        "US7694318B2",
        "CA2517599A1",
        "US7406459B2",
        "US20070276823A1",
        "JP2007511809A",
        "US7685117B2",
        "US7610306B2",
        "JP2005071227A",
        "AU2003272483A1",
        "GB0321426D0",
        "US20060143674A1",
        "US8321278B2",
        "US7582938B2",
        "US7313574B2",
        "US7346629B2",
        "FR2861937A1",
        "US7240049B2",
        "EP1687806A1",
        "US20060020597A1",
        "US7693834B2",
        "EP1538536A1",
        "EP1706869B3",
        "US7872669B2",
        "US7460709B2",
        "US7548910B1",
        "US20050198006A1",
        "FR2867561B1",
        "US7035740B2",
        "US20070300142A1",
        "US7724943B2",
        "US7382897B2",
        "US7873708B2",
        "US7302089B1",
        "US7697791B1",
        "WO2005114450A1",
        "US7340443B2",
        "WO2005111926A1",
        "US6937924B1",
        "US20050262428A1",
        "US20050289590A1",
        "EP1756693A1",
        "US20090043637A1",
        "US20050289163A1",
        "US20060004745A1",
        "WO2005124599A2",
        "BRPI0512354A",
        "US20080201299A1",
        "US20060015580A1",
        "US7461312B2",
        "US8036893B2",
        "DE102004036154B3",
        "US7487072B2",
        "EP1629730A1",
        "US20060041596A1",
        "US20060218191A1",
        "US7376274B2",
        "WO2006033104A1",
        "US7526607B1",
        "EP1805197A1",
        "US7383179B2",
        "US7287015B2",
        "US7711835B2",
        "KR100601997B1",
        "US7805446B2",
        "US7542969B1",
        "US7469060B2",
        "WO2006056910A1",
        "US7929728B2",
        "JP4678180B2",
        "WO2006075902A1",
        "US20130104251A1",
        "US20070050446A1",
        "US7574436B2",
        "US7769221B1",
        "US20060212407A1",
        "US20060236343A1",
        "US8732175B2",
        "US20060242130A1",
        "US10740722B2",
        "EP1785933A3",
        "US20060253423A1",
        "US7660468B2",
        "US7657126B2",
        "US7783135B2",
        "US20070091106A1",
        "US20060274949A1",
        "US8370639B2",
        "US8312034B2",
        "US7433895B2",
        "US20070009159A1",
        "US7788132B2",
        "US20070130112A1",
        "WO2007004928A1",
        "US7801392B2",
        "US20070038608A1",
        "KR101209425B1",
        "US7774335B1",
        "US8769663B2",
        "US20070156720A1",
        "US8677377B2",
        "US7603360B2",
        "GB2430507A",
        "US8023739B2",
        "US7450740B2",
        "JP4577173B2",
        "US20070083611A1",
        "CN103000210A",
        "US9031999B2",
        "US10742340B2",
        "US9466068B2",
        "US9087049B2",
        "US10380164B2",
        "US8818916B2",
        "US9639532B2",
        "US9256668B2",
        "US11032017B2",
        "US9191626B2",
        "US9235557B2",
        "US9330189B2",
        "US11019161B2",
        "US9218606B2",
        "US8312031B2",
        "US8655801B2",
        "US7730405B2",
        "US20070162761A1",
        "TW200729003A",
        "US11477617B2",
        "US20070244902A1",
        "HK1094647A2",
        "US8009861B2",
        "US8046411B2",
        "JP4823135B2",
        "US7536417B2",
        "US7752243B2",
        "US7921116B2",
        "US8098934B2",
        "US20080040278A1",
        "US20080040277A1",
        "US20080046406A1",
        "US7746882B2",
        "US20080049629A1",
        "US9318108B2",
        "WO2008034057A2",
        "US8483498B2",
        "US20080091527A1",
        "US10733326B2",
        "US20150052155A1",
        "US7792868B2",
        "US7555478B2",
        "US7555477B2",
        "WO2008073366A2",
        "WO2008077119A2",
        "US8312558B2",
        "US8468244B2",
        "US20090245603A1",
        "US8473845B2",
        "US8024400B2",
        "US20080201361A1",
        "US20080201314A1",
        "US20080247543A1",
        "US20080235200A1",
        "US8418206B2",
        "JP2008250654A",
        "US20080256056A1",
        "US8340387B2",
        "US7974994B2",
        "US8316392B2",
        "US8355706B2",
        "US8171030B2",
        "US8627509B2",
        "US8417037B2",
        "US8358840B2",
        "JP4416020B2",
        "US20090037408A1",
        "US20110145068A1",
        "US8380045B2",
        "US8190355B2",
        "US7987194B1",
        "US20090119157A1",
        "US7853558B2",
        "US20090125529A1",
        "US20090148045A1",
        "US9984369B2",
        "US8285718B1",
        "US20090171766A1",
        "US9117219B2",
        "US9937022B2",
        "US8954887B1",
        "US8311344B2",
        "US8009921B2",
        "US8065143B2",
        "US20090216639A1",
        "TWI506565B",
        "JP2011519454A",
        "US10867133B2",
        "US8344233B2",
        "US8553984B2",
        "US8195689B2",
        "US9785708B2",
        "US8655878B1",
        "US20110055585A1",
        "EP2332328A4",
        "US8898568B2",
        "US20100125569A1",
        "US8000655B2",
        "US9317684B2",
        "US8439683B2",
        "US20100191567A1",
        "US8812226B2",
        "US20100198626A1",
        "US8533848B2",
        "US8868861B2",
        "US10326848B2",
        "US8630489B2",
        "US20100312736A1",
        "US8359315B2",
        "US8406532B2",
        "CN101930444A",
        "US8295611B2",
        "US9355337B2",
        "US9521453B2",
        "US9710491B2",
        "KR20110080288A",
        "US8875038B2",
        "US20110208822A1",
        "US8682667B2",
        "US20110218946A1",
        "US8957981B2",
        "US8782046B2",
        "US20110251896A1",
        "US8296422B2",
        "US9025850B2",
        "US8990199B1",
        "WO2012056463A1",
        "US10142687B2",
        "US8631473B2",
        "US20120131454A1",
        "US8396876B2",
        "KR20120064582A",
        "EP2656294A4",
        "US20120167133A1",
        "US10409851B2",
        "US8953888B2",
        "US9424471B2",
        "US20120239690A1",
        "US8909025B2",
        "US9380356B2",
        "US20120294514A1",
        "US9547938B2",
        "US9437009B2",
        "US20120330869A1",
        "US9582786B2",
        "US8564425B2",
        "US9335883B2",
        "US20130067035A1",
        "US8442321B1",
        "US20130086499A1",
        "BR112014008352A2",
        "US9696897B2",
        "US8914371B2",
        "US9135344B2",
        "US8892572B2",
        "US8886648B1",
        "US9846696B2",
        "US8457827B1",
        "US8620718B2",
        "US9223986B2",
        "US20140019264A1",
        "US8548828B1",
        "US8775442B2",
        "US8495489B1",
        "US9165406B1",
        "US9888289B2",
        "US10403042B2",
        "EP2920974A1",
        "US9189021B2",
        "KR101984915B1",
        "AU2012261715B2",
        "US9767768B2",
        "US20140193077A1",
        "US9116924B2",
        "US9313555B2",
        "US8922414B2",
        "US20140250032A1",
        "WO2014137337A1",
        "US20140282655A1",
        "US9760803B2",
        "US9542585B2",
        "US9262748B2",
        "US9679062B2",
        "US9436918B2",
        "US20150120627A1",
        "US9691102B2",
        "US9875445B2",
        "US9158971B2",
        "CN106462560B",
        "US9685079B2",
        "WO2016040376A1",
        "WO2016070193A1",
        "US10725614B2",
        "US20160306798A1",
        "US10394953B2",
        "US10152649B2",
        "GB2549554A",
        "US9947227B1",
        "US10346723B2",
        "US10445565B2",
        "US10496880B2",
        "WO2019067641A1",
        "US10762396B2",
        "US20190304102A1"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "CN2792450Y",
        "DE102005022550A1",
        "US9372940B2",
        "US9529984B2",
        "US8266185B2",
        "US10614626B2",
        "US11403336B2",
        "US9639532B2",
        "US11361014B2",
        "US9087049B2",
        "US10585934B2",
        "US10193990B2",
        "US9747420B2",
        "US9218606B2",
        "US9031999B2",
        "US10535192B2",
        "US11620327B2",
        "US11216498B2",
        "US9489431B2",
        "US9477658B2",
        "US10380267B2",
        "US10691642B2",
        "US20170300486A1",
        "US9558449B2",
        "US10621988B2",
        "US9646005B2",
        "US10380164B2",
        "US9330189B2",
        "US9384196B2",
        "US10698939B2",
        "US8312031B2",
        "US9191626B2",
        "US8818916B2",
        "US10776585B2",
        "US11604847B2",
        "US11032017B2",
        "US9953032B2",
        "US9286623B2",
        "US10635640B2",
        "US9466068B2",
        "US20160321253A1",
        "US10380623B2",
        "US20160085733A1",
        "US8326775B2",
        "US9396435B2",
        "US10742340B2",
        "US10949773B2",
        "US11386139B2",
        "US11019161B2",
        "US10360253B2",
        "US20170286434A1",
        "US11003706B2",
        "US9767143B2",
        "US10387914B2",
        "US10372746B2",
        "US10191976B2",
        "US10180942B2",
        "US10607355B2",
        "US10848590B2",
        "US7774294B2",
        "US10733326B2",
        "US11537636B2",
        "US8280905B2",
        "US8312023B2",
        "US8352265B1",
        "US8639510B1",
        "US8463610B1",
        "US11017436B1",
        "US8195689B2",
        "GB0917417D0",
        "US20110264530A1",
        "US9256678B1",
        "US8688679B2",
        "CA2741202A1",
        "GB2501224B",
        "US8874444B2",
        "US10685234B2",
        "US9854280B2",
        "US20140104385A1",
        "US9276977B2",
        "US20140149916A1",
        "CA2892538C",
        "US9529907B2",
        "US9997267B2",
        "CN103942235B",
        "IL231527A0",
        "CN104486793A",
        "US10325591B1",
        "US10028025B2",
        "WO2016126665A1",
        "US10769196B2",
        "US9767409B1",
        "US9864951B1",
        "US10140572B2",
        "US10558880B2",
        "US11138372B2",
        "US10509811B2",
        "US10387561B2",
        "US20170169518A1",
        "US11195043B2",
        "WO2017105641A1",
        "US10381022B1",
        "CN108780462B",
        "US10063917B2",
        "US20170270406A1",
        "US10586023B2",
        "US10642881B2",
        "EP3469589A1",
        "CN106373119A",
        "US11042536B1",
        "US11165813B2",
        "JP6649231B2",
        "CN108574858A",
        "US10236005B2",
        "US20180354143A1",
        "WO2019008581A1",
        "CN111095183A",
        "US11347816B2",
        "CN108319639A",
        "KR102355152B1",
        "CN108170679B",
        "US20190278818A1",
        "US10929155B2",
        "US10846544B2",
        "US11613261B2",
        "US10839694B2",
        "US20200133308A1",
        "US11126870B2",
        "US11181911B2",
        "US11244176B2",
        "US11392738B2",
        "US10789535B2",
        "US11055361B2",
        "US11170647B2",
        "US10832734B2",
        "US11643005B2",
        "CN109978016B",
        "US11285963B2",
        "US11694088B2",
        "US11132548B2",
        "US11222069B2",
        "US10776669B1",
        "US11488290B2",
        "US10796444B1",
        "US10789527B1",
        "KR20200117216A",
        "CN110136709A",
        "US11562016B2",
        "US11403849B2",
        "US11704292B2",
        "US11593662B2",
        "US10748022B1",
        "US11604827B2",
        "US11590988B2",
        "CN111709420B",
        "US11756424B2",
        "CN112383686B",
        "CN112579778B",
        "CN112990967B",
        "CN112966169A",
        "CN115578421B"
    ]
}