{
    "patent_link": "https://patents.google.com/patent/US20010032192A1/en",
    "patent_id": "US20010032192A1",
    "title": "Method and apparatus for improved financial instrument processing",
    "abstract": "A method and apparatus are provided for issuing secondary programmable account numbers (SPANs) to a customer or customer-designated party, each of which SPANs is associated with a customer primary account or other financial instrument, and each of which SPANs has selected usage parameters assigned thereto. SPANs may be issued as a book, with usage parameters assigned to the book in addition to or instead of individual SPANs. When a SPAN is presented to a merchant for payment, the SPAN, including compliance with usage parameters, is verified and appropriate action taken based on either verification or failure of verification.",
    "inventors": [
        "Laxmiprassad Putta",
        "Sudhakar Durairaj",
        "Sridhar Ramachandran",
        "James Frankel"
    ],
    "assignee": "Individual",
    "classifications": [
        "G06Q40/02",
        "G06Q20/04",
        "G06Q20/0855",
        "G06Q20/10",
        "G06Q20/24",
        "G06Q20/367",
        "G06Q20/3674",
        "G06Q20/3821",
        "G06Q20/385",
        "G06Q20/403",
        "G06Q20/405"
    ],
    "claims": "\n1. A module for issuing secondary programmable account numbers (SPAN's) to a customer including:\na verification module which receives SPAN requests from a customer and verifies the validity of such request;\na generating module operative in response to a verified SPAN request for providing at least one SPAN, each SPAN being associated with at least one customer financial instrument;\na usage module assigning usage parameters to the SPAN's; and\nan issuing module which issues each SPAN to a customer specified party, the issued SPAN being usable only within the assigned usage parameters.\n2. A module as claimed in\nclaim 1\nincluding a memory storing preferred usage parameters for customers, said usage module utilizing the preferred usage parameter for the customer as default usage parameters for each SPAN for the customer.\n3. A module as claimed in\nclaim 2\nwherein each customer SPAN request can include at least one usage parameter, the usage module assigning the at least one usage parameter of the request to the corresponding SPAN in lieu of the corresponding preferred usage parameter.\n4. A module as claimed in\nclaim 1\nwherein each customer SPAN request can include at least one usage parameter, the usage module assigning the at least one usage parameter of the request to the corresponding SPAN.\n5. A module as claimed in\nclaim 1\nwherein said usage parameters include at least two of SPAN duration, SPAN face value, SPAN credit limit, permitted merchants, excluded merchants, value velocity, use velocity, period of use, and number of uses for the SPAN.\n6. A module as claimed in\nclaim 5\nwherein said usage module includes mechanisms for altering at least one of the usage parameters for an issued SPAN in response to a request from at least one of the customer and the party to whom the SPAN is issued.\n7. A module as claimed in\nclaim 1\nwherein said issuing modules issues at least selected SPAN's to a third party designated by the customer.\n8. A module as claimed in\nclaim 1\nwherein the customer has a plurality of financial instruments, and wherein said generating module includes a mechanism for selecting the financial instrument with which each SPAN is associated.\n9. A module as claimed in\nclaim 8\nwherein the financial instrument selected for each generated SPAN is the same as the instrument selected for the previously generated SPAN unless the customer otherwise indicates.\n10. A module as claimed in\nclaim 8\nwherein the financial instrument selected for a SPAN can be charged by the customer after the SPAN is issued.\n11. A module as claimed in\nclaim 1\nwherein said generating module generates and stores a plurality of acceptable SPAN's; and\nwherein the at least one SPAN provided in response to a customer request is provided from the stored acceptable SPAN's\n12. A module as claimed in\nclaim 1\nincluding a magstripe writing device, said issuing module operating said writing device to record a SPAN to be issued on a magstripe of a suitable token.\n13. A module as claimed in\nclaim 1\nwherein said generating module provides a plurality of SPAN's, said issuing module issuing said plurality of SPAN's as a book to which said usage parameters are assigned.\n14. A module as claimed in\nclaim 13\nwherein said usage module assigns at least one usage parameter to each book, each SPAN in the book being usable so long as the cumulative use of the SPAN's for the book do not exceed any usage parameter assigned to the book.\n15. A module as claimed in\nclaim 1\nwherein a SPAN is usable to access funds from a customer-selected financial instrument.\n16. A module as claimed in\nclaim 1\nwherein said financial instrument is a checking account.\n17. A module as claimed in\nclaim 16\nwherein a SPAN is assigned to a check usable as a check and as a credit card number.\n18. A module as claimed in\nclaim 1\nincluding a bridge permitting use of SPAN's across financial networks having different protocols.\n19. A module as claimed in\nclaim 1\nwherein one usage parameter is SPAN duration, a SPAN normally remaining viable for its assigned duration.\n20. A module as claimed in\nclaim 19\nwherein the customer can access the usage module after a SPAN is issued to change its assigned duration.\n21. A module as claimed in\nclaim 19\nwherein said durations are specifiable in time intervals not exceeding days.\n22. A method for issuing secondary programmable account numbers (SPAN's) to a customer including:\na) the customer inputting a SPAN request to an issuing system;\nb) the system verifying at least one of the customer and the request;\nc) the system providing at least one SPAN in response to a verified SPAN request, each SPAN being associated with a selected customer financial instrument;\nd) the system assigning usage parameter to the SPAN's; and\ne) the system issuing each SPAN to a customer specified party, the issued SPAN being usable by such party only within the assigned usage parameters.\n23. A method as claimed in\nclaim 22\nwherein the system stores preferred usage parameters for customers, the system utilizing the preferred usage parameter for the customer as default usage parameters for each SPAN for the customer.\n24. A method as claimed in\nclaim 23\nwherein each customer SPAN request can include at least one usage parameter, the system assigning the at least one usage parameter of the request to the corresponding SPAN in lieu of the corresponding preferred usage parameter.\n25. A method as claimed in\nclaim 22\nwherein each customer SPAN request can include at least one usage parameter, the system assigning the at least one usage parameter of the request to the corresponding SPAN.\n26. A method as claimed in\nclaim 22\nwherein said usage parameters include at least two of SPAN duration, SPAN face value, SPAN credit limit, permitted merchants, excluded merchants, value velocity, use velocity, period of use, and number of uses for the SPAN.\n27. A method as claimed in\nclaim 26\nincluding the system altering at least one of the usage parameters for an issued SPAN in response to an input from at least one of the customer and the party to whom the SPAN is issued.\n28. A method as claimed in\nclaim 22\nwherein, during step (e), the system issues at least selected SPAN's to a third party designated by the customer.\n29. A method as claimed in\nclaim 22\nwherein the customer has a plurality of financial instruments, the system selecting the financial instrument with which each SPAN is associated.\n30. A method as claimed in\nclaim 29\nwherein the financial instrument selected for each generated SPAN is the same as the instrument selected for the previously generated SPAN unless the customer otherwise indicates.\n31. A method as claimed in\nclaim 29\nwherein the instrument selected for a SPAN can be charged by the customer after the SPAN is issued.\n32. A method as claimed in\nclaim 22\nincluding the system generating and storing a plurality of SPAN's, and wherein the at least one SPAN provided in response to a customer request is provided from the stored acceptable SPAN's\n33. A method as claimed in\nclaim 22\nincluding a magstripe writing device, said system operating said writing device to record a SPAN to be issued on a magstripe of a suitable token.\n34. A method as claimed in\nclaim 22\nwherein said system provides a plurality of SPAN's issued as a “book” to which said usage parameters are assigned.\n35. A method as claimed in\nclaim 34\nwherein said system assigns at least one usage parameter to each book, each SPAN in the book being usable so long as the cumulative use of the SPAN's for the book do not exceed any usage parameter assigned to the book.\n36. A method as claimed in\nclaim 22\nwherein a SPAN is usable to access funds from a customer-selected financial instrument.\n37. A method as claimed in\nclaim 22\nsaid financial instrument is a checking account.\n38. A method as claimed in\nclaim 37\nwherein a SPAN is assigned to a check usable as a check and as a credit card number.\n39. A method as claimed in\nclaim 22\nwherein one usage parameter is SPAN duration, a SPAN normally remaining viable for its assigned duration.\n40. A method as claimed in\nclaim 39\nwherein the customer can access the system after a SPAN is issued to change its assigned duration.\n41. A module as claimed in\nclaim 39\nwherein said durations are specifiable in time intervals not exceeding days.\n42. A method as claimed in\nclaim 22\nincluding the system detecting the issuance of at least one of an excessive number of SPANs to a customer during a given time period and an unusual pattern of SPAN requests from a customer, and the system at least terminating the issuing of new SPAN's for the customers in response to such detection.\n43. An authorization module which receives requests for authorization from a party to whom a SPAN issued in accordance with\nclaim 1\nis presented for payment, authenticates the SPAN, verifies that usage parameters for the SPAN have been complied with, denies authorization if it cannot authenticate the SPAN or if usage parameters for the SPAN are not complied with, and, if the SPAN is authenticated and usage parameters met, updates usage parameters based on the authorization request, update the associated customer financial instrument, and sends an authorization output.\n44. An authorization module as claimed in\nclaim 43\nwherein a person authorized to use a SPAN has a token which facilitates identification of the person from a remote site, the authorization module receiving information from the token and utilizing such information to verify that the party is authorized to use the SPAN of the received request.\n45. An authorization module as claimed in\nclaim 44\nwherein the token is one of a dongle, a card with a magstripe and a device generating a time varying value which is substantially unique to an individual at each time interval.\n46. An authorization module as claimed in\nclaim 43\nwherein once a SPAN is presented for payment to a given party, the authorization module permits such SPAN to be used thereafter only for payments to such party.\n47. An authorization module as claimed in\nclaim 43\nwherein a usage parameter is number times a SPAN may be used, and wherein said authorization module treats all items ordered together on a SPAN as a single use even if the items are shipped and/or invoiced separately.\n48. An authorization module as claimed in\nclaim 43\nwherein the identity of the party to whom the SPAN is issued is not required as either an input to or an output from said authentication module.\n49. An authorization module as claimed in\nclaim 43\nincluding at least one fraud detection mechanism.\n50. An authorization module as claimed in\nclaim 49\nwherein said fraud detecting mechanism includes detection of at least one of an unusual pattern of authorization request from a party requesting such authorizations and an unusual pattern of use for SPAN's previously received by such party.\n51. An authorization module as claimed in\nclaim 49\nwherein said fraud detection mechanism includes providing at least notification to a customer over appropriate media of at least any suspicious authorization requests for a SPAN issued at the request of such customer.\n52. An authorization module as claimed in\nclaim 49\nwherein there are fraud detection programs in effect for the primary account, and wherein said fraud detection mechanism facilitates use if such programs by mapping SPANs to the corresponding primary account for such programs.\n53. An authorization module as claimed in\nclaim 43\nincluding a plurality of purses for at least selected SPAN's, each purse being for a different category of payments, and wherein said authorization modules allocates each received authorization request for a SPAN to the appropriate purse.\n54. A method for authenticating requests for authorization from a party to whom a SPAN issued in accordance with the method of\nclaim 22\nis presented for payment including:\na) authenticating the SPAN;\nb) verifying that usage parameters for the SPAN have been complied with;\nc) denying authorization if the SPAN is not authenticated or if usage parameters for the SPAN are not complied with; and\nd) if the SPAN is authenticated and usage parameters are complied with, (i) updating usage parameters based on the authorization request, (ii) updating the associated customer primary account, and (iii) sending an authorization output.\n55. A method as claimed in\nclaim 54\n, wherein a person authorized to use a SPAN has a token which facilitates identification of the person from a remote site, the system receiving information from the token and utilizing such information to verify that the party is authorized to use the SPAN of the received request.\n56. A method as claimed in\nclaim 54\nwherein once a SPAN is presented for payment to a given party, the system permits such SPAN to be used thereafter only for payments to such party.\n57. A method as claimed in\nclaim 54\nwherein a usage parameter is number times a SPAN may be used, and wherein said system treats all items ordered together on a SPAN as a single use even if the items are shipped and/or invoiced separately.\n58. A method as claimed in\nclaim 54\nwherein the identity of the party to whom the SPAN is issued is not revealed to the party to whom the SPAN is presented for payment.\n59. A method as claimed in\nclaim 58\nwherein a pseudo-identity is given to the party to whom the SPAN is presented for payment.\n60. A method as claimed in\nclaim 54\nincluding the system detecting fraud by detecting at least one of an unusual pattern of authorization request from a party requesting such authorizations and an unusual pattern of use for SPAN's previously received by such party.\n61. A method as claimed in\nclaim 54\nincluding the system providing at least notification to a customer over appropriate media of at least any suspicious authorization requests for a SPAN issued at the request of such customer.\n62. A method as claimed in\nclaim 54\nincluding a plurality of purses for at least selected SPAN's, each purse being for a different category of payments, and wherein said system allocates each received authorization request for a SPAN to the appropriate purse.\n63. A system for facilitating access to financial instruments including:\nan issuing module which provides secondary programmable account numbers (SPAN's) in response to verified customer requests, each said SPAN being associated with at least one customer financial instrument, said SPAN's having usage parameters assigned thereto; and\nan authorization module which receives requests for authorization from a party to whom a SPAN is presented for payment, authenticates the SPAN, verifies that usage parameters for the SPAN have been complied with, denies authorization if it cannot authenticate the SPAN or if usage parameters for the SPAN are not complied with, and, if the SPAN is authenticated and usage parameters met, updates usage parameters based on the authorization request, update the associated customer financial instrument; and sends an authorization output.\n64. A method for facilitating access to financial instruments including:\na) issuing secondary programmable account numbers (SPAN's) in response to verified customer requests, each said SPAN being associated with at least one customer financial instrument, said SPAN's having usage parameters assigned thereto;\nb) receiving requests for authorization from a party to whom a SPAN is presented for payment;\nc) authenticating the SPAN;\nd) verifying that usage parameters for the SPAN have been complied with;\ne) denying authorization if the SPAN is not authenticated or if usage parameters for the SPAN are not complied with; and\nf) if the SPAN is authenticated and usage parameters are complied with, (i) updating usage parameters based on the authorization request, (ii) updating the associated customer primary account, and (iii) sending an authorization output.",
    "status": "Abandoned",
    "citations_own": [],
    "citations_ftf": [
        "US6000832A"
    ],
    "citedby_own": [
        "US20020052834A1",
        "US20020099649A1",
        "US20030074290A1",
        "US20030105707A1",
        "US20030208450A1",
        "US20030233334A1",
        "US20040019543A1",
        "US20040030644A1",
        "US20040039691A1",
        "US20040049452A1",
        "US20040117300A1",
        "US20040168066A1",
        "US20040208321A1",
        "US20040230537A1",
        "US20050021519A1",
        "US6901387B2",
        "US20050119942A1",
        "US20050125686A1",
        "US20050125347A1",
        "US20050144123A1",
        "US20050205662A1",
        "US20050222950A1",
        "WO2005101978A3",
        "US20060026099A1",
        "US20060026098A1",
        "US20060116938A1",
        "US20060248593A1",
        "US20070016515A1",
        "US20070130062A1",
        "US7312707B1",
        "US20070299783A1",
        "US20080008359A1",
        "US20080010214A1",
        "US20080077528A1",
        "CN101226616A",
        "US7472090B1",
        "US20090057393A1",
        "US20090100149A1",
        "US20090119176A1",
        "US7567936B1",
        "US7606766B2",
        "US20090265249A1",
        "US20090265241A1",
        "US20090265250A1",
        "US20090271278A1",
        "US20090289106A1",
        "US7668750B2",
        "US20100063895A1",
        "US7690577B2",
        "US7705732B2",
        "US7725427B2",
        "US7739162B1",
        "US7735725B1",
        "US7793845B2",
        "US7857212B1",
        "US7886157B2",
        "US7889052B2",
        "US7949594B2",
        "US20110178927A1",
        "US8001054B1",
        "US8015085B2",
        "US8069084B2",
        "US8073736B2",
        "USRE43157E1",
        "US20120158593A1",
        "US8250225B1",
        "US20120226613A1",
        "US8284025B2",
        "US20130036053A1",
        "US8423475B2",
        "US20130097078A1",
        "US20130297504A1",
        "US8588735B1",
        "US8606631B2",
        "US8687038B2",
        "US8769567B1",
        "US8768838B1",
        "US8793165B1",
        "US20140212056A1",
        "US8800861B1",
        "US20140330712A1",
        "US8918080B2",
        "US8929857B2",
        "US8973109B2",
        "US9024719B1",
        "US9031880B2",
        "US9137389B2",
        "US9275239B2",
        "US9275211B2",
        "US9298700B1",
        "US9317848B2",
        "US9372971B2",
        "US9424413B2",
        "US9454752B2",
        "US9485286B1",
        "US9536366B2",
        "US9569770B1",
        "US9582801B2",
        "US9703938B2",
        "US9715681B2",
        "US9792611B2",
        "US9904919B2",
        "US10007712B1",
        "US20180260833A1",
        "US10282724B2",
        "US20190139045A1",
        "US10313532B2",
        "US10440627B2",
        "US10469670B2",
        "US10560495B2",
        "US10616223B2",
        "US10692135B2",
        "US10694042B2",
        "US10757267B2",
        "US10846683B2",
        "US20210374713A1",
        "US11250414B2",
        "US11328274B2",
        "US11468432B2"
    ],
    "citedby_ftf": [
        "US20040103060A1"
    ]
}