{
    "patent_link": "https://patents.google.com/patent/US5974396A/en",
    "patent_id": "US5974396A",
    "title": "Method and system for gathering and analyzing consumer purchasing information based on product and consumer clustering relationships",
    "abstract": "A method and system for gathering and analyzing customer and purchasing information permits a retailer or retail chain to process transactional information involving large numbers of consumers and consumer products. Product information is gathered that uniquely identifies a specific product by type and manufacturer and grouped into generic product clusters. Consumers are similarly grouped into consumer clusters based on common consumer demographics and other characteristics. Consumer retail transactions are analyzed in terms of product and/or consumer clusters to determine relationships between the consumers and the products. Product, consumer, and transactional data are maintained in a relational database. Targeting of specific consumers with marketing and other promotional literature is based on consumer buying habits, needs, demographics, etc. A retailer queries the database using selected criteria, accumulates data from the database in response to that query, and makes prudent business and marketing decisions based on that response. Queried information from the database may be communicated to a printing subsystem for printing promotional literature directed to particular customers based on cluster information stored in the database.",
    "inventors": [
        "Michael W. Anderson",
        "David Hargreaves",
        "Susan M. Hoellig",
        "Drew S. Johnson",
        "Blaine D. Mischel"
    ],
    "assignee": "Moore Business Forms Inc",
    "classifications": [
        "G06Q30/02",
        "G06Q30/0204",
        "G06Q30/0224",
        "G06Q30/0226",
        "G06Q30/0269"
    ],
    "claims": "\n1. A method for electronically processing using electronic data processing circuitry transactional information involving plural consumer products and consumers, comprising:\ngathering and storing in electronic memory product and consumer information including identifying a consumer and one or more products purchased by said consumer;\ngrouping in said electronic memory by said electronic data processing circuitry said consumer information into M different consumer clusters, M being an integer greater than one, using different sets of consumer criteria, where consumers in each of the M consumer clusters have in common one of the sets of consumer criteria,\ngrouping in said electronic memory by said electronic data processing circuitry said product information into N different product clusters, N being an integer greater than one, using different sets of characteristics, where products in each of the N product clusters have in common one of the sets of characteristics;\nanalyzing with said electronic data processing circuitry product transactions made by said consumers using said M consumer clusters and said N product clusters to determine cluster relationships between specific ones of said M consumer clusters and said N product clusters;\ndetermining consumer buying habits including specific types of products in which a consumer is interested using said cluster relationships; and\npreparing customized newsletters, the substantive content of one of the customized newsletters being personalized specifically for a specific one of the M consumer clusters and said specific types of products determined for that specific consumer cluster in the determining step.\n2. The method according to claim 1, wherein the number of products substantially exceeds the number of N product clusters.\n3. The method according to claim 1, wherein said product and consumer information includes product transactions and consumer parameters that define personal characteristics about each consumer including demographics and consumer preferences, respectively, said method further comprising:\nmaintaining a relational database for storing product transaction information, consumer parameters, said M consumer clusters and said N product clusters.\n4. The method according to claim 3, further comprising the steps of:\nquerying said database with one of said sets of consumer criteria to define one of said M consumer clusters;\naccumulating data relating to said one consumer cluster from said database in response to said query; and\noutputting said accumulated data.\n5. The method according to claim 3, further comprising:\nmodifying said database based on changing market conditions, and\nquerying said modified database with one of said sets of consumer criteria; and\nmodifying one or more of said consumer clusters based on specific consumer buying patterns, habits, demographics, cultural backgrounds obtained in the querying step.\n6. The method according to claim 1, wherein said grouping step includes:\nassigning product codes to a corresponding product cluster, and\nsummarizing product transactional data using corresponding product cluster information.\n7. The method according to claim 1, wherein said analyzing step includes:\ndetermining characteristics of consumers purchasing products included in particular ones of said N product clusters.\n8. The method according to claim 1, said analyzing step further comprising:\nanalyzing product promotions using transactional information relating to said product clusters.\n9. The method according to claim 1, further comprising:\nissuing a membership card to each consumer including consumer demographic information which is processed during product transactions involving the consumer.\n10. A method for electronically processing using electronic data processing circuitry transactional information involving plural consumer products and consumers, comprising:\ngathering and storing in electronic memory product and consumer information including an identification of a consumer, personal characteristics of the consumer including demographic information, and one or more products purchased by said consumer;\ngrouping in said electronic memory by said electronic data processing circuitry said consumer information into M different consumer clusters, M being an integer greater than one, using different sets of consumer criteria, where consumers in each of the M consumer clusters have in common one of the sets of consumer criteria,\ngrouping in said electronic memory by said electronic data processing circuitry said product information into N different product clusters, N being an integer greater than one, using different sets of characteristics, where products in each of the N product clusters have in common one of the sets of characteristics;\nmaintaining a relational database for storing transactional, consumer cluster, and product cluster information;\nusing the relational database, analyzing with the electronic data processing circuitry product transactions made by said consumers using said M consumer and N product clusters to determine one or more relationships between one of the M consumer clusters and a certain one of the N product clusters;\ngenerating customized informational materials for consumers in the one consumer cluster, where the content of the customized informational materials includes information that is only relevant to the one or more relationships determined for consumers in the one consumer cluster and to the personal characteristics of consumers in the one consumer cluster; and\ndistributing the customized informational materials to consumers in the one consumer cluster.\n11. The method according to claim 10, wherein the number of consumers is substantially larger than the number M consumer clusters.\n12. The method according to claim 10, wherein said purchase transactions are stored and analyzed in terms of said clusters.\n13. The method according to claim 10, further comprising:\nmodifying said selected parameters defining consumer clusters without changing said received consumer information, and\nanalyzing said purchase transactions in terms of said modified selected parameters.\n14. The method according to claim 10, further comprising:\ndetermining purchasing behavior of consumers based on queries to said relational database.\n15. The method according to claim 10, further comprising:\nissuing a membership card to each consumer including consumer demographic information which is processed during product transactions involving the consumer.\n16. A method for electronically monitoring promotional and advertising efforts using electronic storage and data processing circuitry, wherein the electronic processing circuitry performs the steps comprising:\ngenerating a product database associating each product of a plurality of related products into N different product clusters, N being an integer greater than one, using different sets of characteristics, where products in each of the N product clusters have in common one of the sets of characteristics;\ngenerating a consumer database associating each of plural consumers into M different consumer clusters, M being an integer greater than one, using different sets of consumer criteria, where consumers in each of the M consumer clusters have in common one of the sets of consumer criteria,\nmonitoring sales of products in one of the N product clusters for a predetermined time period;\ninitiating a promotional campaign for the specific products in the one product cluster during said time period; and\nanalyzing said promotional campaign after said time period using said sales of products in the one product cluster to consumers in one or more of the M consumer clusters.\n17. The method according to claim 16, further comprising:\nissuing a membership card to each consumer including consumer demographic information which is processed during product transactions involving the consumer.\n18. A method for electronically processing retail transactional information using a computer involving plural products and consumers, comprising the computer-implemented and automatically performed steps of:\nreceiving product information uniquely identifying a specific product;\ngrouping said product information into M different product categories, M being an integer greater than one, using different sets of product characteristics, where products in each of the M product categories have in common one of the sets of product characteristics;\nreceiving consumer information describing consumer characteristics including demographic characteristics of said consumers;\ngrouping said consumers into N different consumer categories, N being an integer greater than one, using different sets of consumer characteristics, where consumers in each of the N consumer categories have in common one of the sets of consumer characteristics,\nanalyzing retail transactions using both the M product and N consumer categories to determine product preference relationships between consumers from one of the N consumer categories and products from one of the M product categories;\nprinting promotional literature where the content of the promotional literature is adapted so as to be directed to the consumer characteristics of the consumers from the one consumer category and to the products in the one product category using said product preference relationships; and\ndirectly mailing said promotional literature to the consumers from the one consumer category.\n19. The method according to claim 18, further comprising:\nstoring said retail transactions information in a database, and\nupdating said database with current transactional, product, and consumer information for subsequent data retrieval and processing.\n20. The method according to claim 18, further comprising:\nissuing a membership card to each consumer including consumer demographic information which is processed during product transactions involving the consumer.\n21. A system for optimizing retail marketing operations based on purchase transactions of consumer products, comprising:\na relational database;\nmeans for receiving consumer identifying data including consumer demographic data and product data;\nmeans for grouping said consumer identifying data into M different consumer clusters, M being an integer seater than one using different sets of consumer criteria, where consumers in each of the M consumer clusters have in common one of the sets of consumer criteria, and product data into N product clusters, N being an integer greater than one, using different sets of characteristics, where products in each of the N product clusters have in common one of the sets of characteristics;\nmeans for storing said consumer and product cluster information corresponding to the M consumer clusters and the N product clusters in said relational database;\nmeans for analyzing said M consumer clusters and N product clusters to determine buying behaviors of consumers and establishing a relationship between products from a specific one of the N product clusters and consumers from a specific one of the M consumer clusters; and\nprinting means connected to said analyzing means for printing personalized promotional information including a personalized newsletter directed specifically to consumers from the one consumer cluster, wherein the content of the personalized promotional information is directed specifically to the products from the one product cluster and personal characteristics of the consumers from the one consumer cluster.\n22. The system according to claim 21, further comprising:\npoint of sale terminals for recording consumer purchase transactions including transmission means for transmitting transactional information from said point of sale terminals to said means for receiving.\n23. The system according to claim 22, wherein said point of sale terminals include code readers for detecting coded consumer and product information.\n24. The system according to claim 22, wherein said code readers optically detect said coded information.\n25. The system according to claim 22, wherein said point of sale terminals are remotely located at retail sales stores, said system further comprising:\na supervisory retail processor for receiving transactional data from plural point of sales terminals including:\nmemory for storing a master product list containing valid product codes;\nmeans for checking product codes included in said transactional data against said master product list to ensure valid product codes; and\nmeans, connected to said means for checking, for transmitting validated transactional data and a list of product codes determined not to be on said master product list to said receiving means.\n26. The system according to claim 21, further including a user interface terminal used by a retailer to query information from said database.\n27. The system according to claim 26, wherein said queries relate to one, some or all of the purchasing behaviors of consumers, promotional efforts for particular products, and common characteristics of consumers purchasing particular products.\n28. The system according to claim 21, further comprising:\nmeans for gathering consumer demographics data;\nmeans for encoding said consumer demographics data into digital format; and\nmeans for providing said encoded consumer data to said receiving means.\n29. The system according to claim 28, wherein said consumer identifying data includes one or more of consumer demographics, health concerns, and product preferences.\n30. The system according to claim 28, wherein membership cards are issued to consumers which include a coded identifier for uniquely identifying a consumer and identifying data associated with that consumer, said cards being read by said means for receiving.\n31. The system according to claim 30, wherein a dynamic memory and a microprocessor are included on said membership cards for storing consumer identification data and for restricting access to that identification data unless an authorization code is first received by the microprocessor.\n32. The system according to claim 30, further comprising:\npoint of sale terminals remotely located at retail stores for detecting a consumer coded identifier and associating that identifier with products purchased by that consumer.\n33. The system according to claim 21, wherein said printing means includes:\nmeans for storing packages of print information, each package having different contents relating to consumer products, and\nmeans for selecting certain ones of said print packages to be included in said customized promotional information to be printed based on cluster information.\n34. The system according to claim 21, wherein said promotional literature includes advertisements, and the content and layout of said advertisements are selected for said consumers by said printing means to be primarily directed to products preferred by said consumers.\n35. The system according to claim 21, wherein said promotional literature includes newsletters and the content and layout of said newsletters are selected for particular consumers.\n36. The system according to claim 21, wherein said promotional literature includes coupons selected for particular consumers.\n37. The system according to claim 21, further comprising:\nmeans for directly mailing said customized information only to said particular consumers based on said particular consumers' demographics and buying behaviors.\n38. A system for processing information, comprising:\nan electronic device for receiving product information identifying specific products and consumer information identifying personal characteristics of consumers who purchase said products, and\nelectronic data processing circuitry for performing the tasks of:\ngrouping said consumer information into M different consumer clusters, M being an integer greater than one, using different sets of consumer criteria, where consumers in each of the M consumer clusters have in common one of the sets of consumer criteria;\ngrouping said product information into N different product clusters, N being an integer greater than one, using different sets of characteristics, where products in each of the N product clusters have in common one of the sets of characteristics;\nanalyzing transactions where products are purchased by said consumers using said N product clusters and said M consumer clusters to determine relationships between various ones of the M consumer clusters and N product clusters;\ndetermining product preferences of said consumers according to said relationships; and\nproviding consumers in one of the M consumer clusters having similar product preferences with marketing or informational literature including a newsletter, the content of the newsletter specifically addressing said product preferences and personal characteristics of said consumers in the one consumer cluster.\n39. The system according to claim 38, wherein said electronic input device includes a relational database for storing transactional, product cluster, and consumer cluster information, said electronic data processing circuitry further performing the task of:\ndetermining purchasing behaviors of consumers using the relational database.\n40. The system according to claim 39, further comprising:\na user interface for querying said relational database based on selected criteria, wherein product cluster data are accumulated from said database based on a user-generated query, and\nan output device for outputting said accumulated data.\n41. The system according to claim 39, said electronic data processing circuitry further performing the task of:\nmodifying said relational database based on changing market conditions and querying said modified relational database to extract specific consumer buying patterns, habits, demographics, cultural backgrounds, or other personal characteristics.\n42. A system for processing transactions involving plural products and consumers, comprising:\na product database associating products in M different product clusters, M being an integer greater than one, using different sets of characteristics, where products in each of the M product clusters have in common one of the sets of characteristics;\na consumer database associating into consumer clusters consumers in N different consumer clusters, N being an integer greater than one, using different sets of consumer criteria, where consumers in each of the N consumer clusters have in common one of the sets of consumer criteria including demographics or other variables that identify individual characteristics about specific consumers;\nan electronic data processor analyzing said transactions using the M product clusters and the N consumer clusters to determine a relationship between consumers in one of the N consumer clusters and particular products in one of the M product clusters to establish a product cluster preference for consumers in the one consumer cluster;\na printer printing personalized promotional literature directed to consumers in said one consumer cluster, the content of said promotional literature describing features relevant to the relationship between said consumers in one consumer cluster and the particular products in the one product cluster; and\nmeans for directly mailing said promotional literature to said consumers in said one consumer cluster.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4355372A",
        "US4752675A",
        "US4872113A",
        "US4908761A",
        "WO1990011587A1",
        "US5227874A",
        "US5430644A",
        "US5615342A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6098048A",
        "KR20000054816A",
        "US6122648A",
        "WO2000062223A1",
        "WO2000067191A2",
        "US6169989B1",
        "WO2001013304A1",
        "WO2001027713A2",
        "US20010001145A1",
        "US6249790B1",
        "WO2001044888A2",
        "WO2001046896A1",
        "WO2001046887A1",
        "WO2001065453A1",
        "EP1132846A1",
        "GB2360372A",
        "US6298330B1",
        "US20010032443A1",
        "US20010037279A1",
        "US20010037242A1",
        "US20010039532A1",
        "US6321221B1",
        "WO2001088799A1",
        "US20010047413A1",
        "US20010047299A1",
        "US6334110B1",
        "US6334127B1",
        "US20010056381A1",
        "US20010054275A1",
        "US6338043B1",
        "US20020004740A1",
        "US20020010744A1",
        "US6343274B1",
        "WO2002013112A1",
        "GB2366882A",
        "US20020035504A1",
        "US20020038230A1",
        "US20020042733A1",
        "US20020042736A1",
        "US20020046070A1",
        "US6377993B1",
        "US20020049649A1",
        "US6381644B2",
        "US6390376B2",
        "US20020065725A1",
        "WO2002048903A1",
        "US20020077857A1",
        "US6412012B1",
        "US6415262B1",
        "US20020087388A1",
        "US20020087385A1",
        "US20020087554A1",
        "US6419161B1",
        "US20020099598A1",
        "US20020099580A1",
        "US20020116249A1",
        "US20020123957A1",
        "US20020123928A1",
        "US6457010B1",
        "US20020138332A1",
        "US20020143651A1",
        "US20020143565A1",
        "US20020143603A1",
        "US20020143782A1",
        "US6466970B1",
        "US20020152104A1",
        "US6473407B1",
        "US20020161779A1",
        "US20020161670A1",
        "WO2002086655A2",
        "US20020161643A1",
        "US20020161651A1",
        "WO2002091123A2",
        "US20020169655A1",
        "US20020178049A1",
        "US20020178109A1",
        "US20020194058A1",
        "US20020194038A1",
        "US20020194055A1",
        "US20020198775A1",
        "US20030004781A1",
        "US20030004787A1",
        "US20030009368A1",
        "US20030018550A1",
        "US20030023492A1",
        "US20030020753A1",
        "US20030023475A1",
        "US6515968B1",
        "US20030028437A1",
        "US20030028451A1",
        "US6519572B1",
        "US20030033199A1",
        "US20030033195A1",
        "US6523064B1",
        "US20030040952A1",
        "US20030040973A1",
        "WO2003032123A2",
        "US20030088457A1",
        "WO2003040892A2",
        "US20030093387A1",
        "US20030101325A1",
        "US6578003B1",
        "US20030126006A1",
        "US20030130933A1",
        "US20030135414A1",
        "US20030135442A1",
        "US20030144867A1",
        "US20030144933A1",
        "US20030162523A1",
        "US20030173118A1",
        "US20030177045A1",
        "US20030182176A1",
        "US6633851B1",
        "US20030204417A1",
        "US6647417B1",
        "US20030212619A1",
        "US20030225644A1",
        "US20030225651A1",
        "US20030229502A1",
        "US6674357B1",
        "US20040015424A1",
        "US6684194B1",
        "US20040024671A1",
        "US20040034599A1",
        "US6704930B1",
        "US20040059610A1",
        "US6714979B1",
        "US6721748B1",
        "US20040093262A1",
        "US6745229B1",
        "US20040128236A1",
        "US6763376B1",
        "US20040143491A1",
        "US20040148241A1",
        "US20040148625A1",
        "US6778982B1",
        "US20040162752A1",
        "US20040167689A1",
        "US20040196311A1",
        "US6804675B1",
        "US20040204982A1",
        "US20040211600A1",
        "US20040225555A1",
        "US6820277B1",
        "US20040236649A1",
        "US20040243527A1",
        "US20040244029A1",
        "US20040243604A1",
        "US20040243570A1",
        "US20040260581A1",
        "US20040267621A1",
        "US20050004808A1",
        "US6845363B1",
        "WO2005006140A2",
        "US20050021365A1",
        "US20050021364A1",
        "US20050027621A1",
        "US20050038581A1",
        "US6859783B2",
        "US20050044008A1",
        "US20050060742A1",
        "US6889201B1",
        "US6892238B2",
        "US6910017B1",
        "US20050137938A1",
        "US20050144066A1",
        "US20050149466A1",
        "US20050149460A1",
        "US20050154629A1",
        "US6922672B1",
        "US6925441B1",
        "US6925444B1",
        "US20050177401A1",
        "US20050203807A1",
        "US6957189B2",
        "US6959281B1",
        "US6960135B2",
        "US20050261987A1",
        "US20050273380A1",
        "US20050278211A1",
        "US20050278217A1",
        "US20050278218A1",
        "US20050278236A1",
        "US6980999B1",
        "US20050288974A1",
        "US20060005192A1",
        "US20060010030A1",
        "US20060026081A1",
        "US7003476B1",
        "US7006981B2",
        "US7006982B2",
        "US7010495B1",
        "US20060059154A1",
        "US7020623B1",
        "US20060069585A1",
        "US7028000B1",
        "US20060080265A1",
        "US7035855B1",
        "US20060095344A1",
        "US7062510B1",
        "US7072858B1",
        "US20060149616A1",
        "US20060155620A1",
        "US7089322B1",
        "US20060200378A1",
        "US7113917B2",
        "US20060242050A1",
        "US20060242047A1",
        "US20060242049A1",
        "US20060242051A1",
        "US20060241923A1",
        "US20060242046A1",
        "US20060242048A1",
        "US20060242039A1",
        "US20060242011A1",
        "US20060253486A1",
        "US20060266675A1",
        "US7150030B1",
        "US7159011B1",
        "US20070006250A1",
        "US20070011173A1",
        "US7171376B2",
        "US20070043621A1",
        "US20070055708A1",
        "US20070061188A1",
        "US20070067206A1",
        "US20070067207A1",
        "US20070067209A1",
        "US20070078741A1",
        "US7212996B1",
        "US20070100719A1",
        "US20070106623A1",
        "US20070112864A1",
        "US20070150351A1",
        "US7240355B1",
        "US20070156531A1",
        "US20070157231A1",
        "US7243129B1",
        "US20070168246A1",
        "US20070185764A1",
        "US20070192121A1",
        "US20070192165A1",
        "US7269567B1",
        "US7272617B1",
        "US20070226114A1",
        "WO2007114788A1",
        "US20070252381A1",
        "US7299194B1",
        "US20070271146A1",
        "US20070276721A1",
        "US20080010131A1",
        "US7324953B1",
        "US20080077471A1",
        "US20080077488A1",
        "US20080082397A1",
        "US20080082399A1",
        "US20080091508A1",
        "US20080120292A1",
        "US20080177619A1",
        "US7406436B1",
        "US20080183577A1",
        "US20080195445A1",
        "US20080195444A1",
        "US20080195425A1",
        "US20080201237A1",
        "US7424440B1",
        "US20080228571A1",
        "US7428531B2",
        "US7433832B1",
        "GB2448136A",
        "US7437306B1",
        "US20080263000A1",
        "US20080263065A1",
        "US20080270163A1",
        "US20080281700A1",
        "US20080294617A1",
        "US7467109B1",
        "US20080313017A1",
        "WO2008154056A1",
        "US20080319829A1",
        "US20090006267A1",
        "US7478054B1",
        "US20090018996A1",
        "US20090018919A1",
        "US7480631B1",
        "US20090049076A1",
        "US7500258B1",
        "US7509279B2",
        "US20090094158A1",
        "US7542921B1",
        "US20090182615A1",
        "SG153646A1",
        "US7571127B1",
        "US7580890B2",
        "US7613631B2",
        "US20090287536A1",
        "US7624055B1",
        "US7624068B1",
        "US7624056B1",
        "US7647618B1",
        "US7650304B1",
        "US7649827B2",
        "US20100017333A1",
        "US20100030644A1",
        "US20100030567A1",
        "US7660764B2",
        "US7676418B1",
        "US7690013B1",
        "US20100088175A1",
        "US7707089B1",
        "US7707192B1",
        "US20100106586A1",
        "US20100125547A1",
        "US7725423B1",
        "US7734520B1",
        "US20100161379A1",
        "US7756896B1",
        "AU2005201055B2",
        "US7769650B2",
        "US7774230B2",
        "US20100211445A1",
        "US7783515B1",
        "US20100217654A1",
        "US7788358B2",
        "US7797196B1",
        "USRE41754E1",
        "US20100250338A1",
        "US20100257006A1",
        "US20100257066A1",
        "US7822629B2",
        "US20100274739A1",
        "US20100274601A1",
        "US20100280881A1",
        "US7831467B1",
        "US20100293165A1",
        "US20100306029A1",
        "US7853630B2",
        "US7856359B2",
        "US7870592B2",
        "US20110016010A1",
        "US7877311B1",
        "US20110029430A1",
        "US20110035280A1",
        "US7890343B1",
        "US7895088B2",
        "US7895098B2",
        "US20110047072A1",
        "US7908159B1",
        "US20110087546A1",
        "US20110087550A1",
        "US20110087519A1",
        "US20110087531A1",
        "US20110087530A1",
        "US20110087547A1",
        "US20110093324A1",
        "US20110093335A1",
        "US20110093327A1",
        "US20110106840A1",
        "US7949565B1",
        "US20110125565A1",
        "US7962396B1",
        "US7962404B1",
        "US7960005B2",
        "US7970788B2",
        "US7973800B2",
        "US7974895B1",
        "USRE42577E1",
        "US7987111B1",
        "US7991649B2",
        "US7991689B1",
        "US7996247B1",
        "US7996521B2",
        "US8001003B1",
        "US20110202400A1",
        "US8010402B1",
        "US20110213650A1",
        "US8019688B2",
        "US8024264B2",
        "US20110231258A1",
        "US20110231235A1",
        "US20110231227A1",
        "US20110231257A1",
        "US20110231305A1",
        "US20110231223A1",
        "US20110231225A1",
        "US20110231224A1",
        "US8032714B2",
        "US8050969B2",
        "US20110270700A1",
        "US20110270699A1",
        "US8055536B1",
        "US20110282734A1",
        "US20110302038A1",
        "US20110313830A1",
        "US8090619B1",
        "US20120005019A1",
        "US8095431B1",
        "US8108255B1",
        "US8112311B2",
        "US8121830B2",
        "US8141100B2",
        "US20120109673A1",
        "US8175908B1",
        "US8200535B1",
        "US8249942B2",
        "US8255820B2",
        "US8261326B2",
        "US8271332B2",
        "US8285598B2",
        "US8285590B2",
        "US8290824B1",
        "US8296183B2",
        "US8301574B2",
        "US8306975B1",
        "US8335716B2",
        "US8335715B2",
        "US8359205B2",
        "US8359274B2",
        "US8364588B2",
        "US8364518B1",
        "US8386381B1",
        "US8392334B2",
        "US8412147B2",
        "US8412656B1",
        "US8429006B1",
        "US8438075B2",
        "US8473342B1",
        "US8473410B1",
        "US8478637B1",
        "US8489532B2",
        "US8495367B2",
        "US8505813B2",
        "US8508357B2",
        "US8521769B2",
        "US8538869B1",
        "US8554631B1",
        "US8567672B2",
        "US20130311282A1",
        "US8590785B1",
        "US8606626B1",
        "US8615458B2",
        "US20130346352A1",
        "US8626579B2",
        "US8626560B1",
        "US8626605B2",
        "US8630929B2",
        "US8656423B2",
        "US8666528B2",
        "US8676639B2",
        "US20140122229A1",
        "US8732004B1",
        "US8732005B2",
        "US8732018B2",
        "US8738732B2",
        "US8751298B1",
        "US8751391B2",
        "US8762313B2",
        "US8775245B2",
        "US8781954B2",
        "US8799193B2",
        "US8799200B2",
        "US20140222511A1",
        "US8805844B2",
        "US8805941B2",
        "US8875196B2",
        "US20140337095A1",
        "US8918465B2",
        "US8935198B1",
        "US8943002B2",
        "US8966649B2",
        "US8972287B1",
        "US9021543B2",
        "US9026591B2",
        "US9031866B1",
        "US20150134437A1",
        "US20150149243A1",
        "US9055336B2",
        "US9064281B2",
        "US9100132B2",
        "US9152727B1",
        "US9197421B2",
        "US9210208B2",
        "US9252898B2",
        "US9256884B2",
        "US20160063511A1",
        "US9313544B2",
        "US9332035B2",
        "US9336784B2",
        "US9350598B2",
        "US20160148316A1",
        "US9380356B2",
        "US9432715B2",
        "US9432468B2",
        "US9436770B2",
        "US9443253B2",
        "US9454758B2",
        "US9466075B2",
        "US9471926B2",
        "US9477988B2",
        "US9477967B2",
        "US9483606B1",
        "US20160335673A1",
        "US9519928B2",
        "US9519915B1",
        "US9551588B2",
        "US9558502B2",
        "US9563336B2",
        "US9563916B1",
        "US9576030B1",
        "US9600839B2",
        "US9609034B2",
        "US9619806B2",
        "US20170109431A1",
        "US9635405B2",
        "US9659285B2",
        "US9667365B2",
        "US9672196B2",
        "US9679299B2",
        "US20170178310A1",
        "US9690820B1",
        "US9691085B2",
        "US9711152B2",
        "US9721271B2",
        "US9762965B2",
        "US9760905B2",
        "US9767309B1",
        "US9767212B2",
        "US9819561B2",
        "US9841282B2",
        "US9853959B1",
        "US9886691B2",
        "US9892417B2",
        "US9892419B1",
        "US9898772B1",
        "US10007915B2",
        "US10019757B2",
        "US10055745B2",
        "US10062103B2",
        "US10074118B1",
        "US10078868B1",
        "US10102287B2",
        "US10102536B1",
        "US10147108B2",
        "US10223707B2",
        "US10242019B1",
        "US10262362B1",
        "US10269081B1",
        "US10278065B2",
        "US10290018B2",
        "US10313480B2",
        "US10354262B1",
        "US10354268B2",
        "US10360627B2",
        "US10360394B2",
        "US10373464B2",
        "US10380617B2",
        "US10419379B2",
        "US10430817B2",
        "US10438299B2",
        "US10438226B2",
        "CN110428284A",
        "US10489754B2",
        "US10497022B2",
        "US10511692B2",
        "US10510055B2",
        "US10521404B2",
        "US10524165B2",
        "US10546332B2",
        "US10546262B2",
        "US10580019B2",
        "US10592959B2",
        "US10614504B2",
        "US10650398B2",
        "US10672018B2",
        "US10679230B2",
        "US10678894B2",
        "US10713670B1",
        "US10755291B1",
        "US10762515B2",
        "US10810654B1",
        "US10810605B2",
        "US10832015B2",
        "US10853891B2",
        "US10869253B2",
        "US10872350B1",
        "US10904624B2",
        "US10902442B2",
        "US10956438B2",
        "US10970463B2",
        "US10970769B2",
        "US10977666B2",
        "US11023947B1",
        "US11080654B2",
        "US11144933B2",
        "US11169959B2",
        "US11205179B1",
        "US11210669B2",
        "US11257117B1",
        "US11263222B2",
        "US11321735B2",
        "US11386442B2",
        "US11403656B1",
        "US11449880B2",
        "US11463578B1",
        "US11475484B1",
        "US11514493B1",
        "WO2023036665A1",
        "US11676192B1",
        "US11682041B1",
        "US11734368B1",
        "US11823225B2"
    ],
    "citedby_ftf": [
        "AU714855B2",
        "AUPO339396A0",
        "CA2293747A1",
        "US6285983B1",
        "AUPP794398A0",
        "AU766555B2"
    ]
}