{
    "patent_id": "US-11451578-B2",
    "title": "Analyzing encrypted traffic behavior using contextual traffic data ",
    "assignee": "Cisco Technology, Inc.",
    "publication_date": "2022-09-20",
    "patent_link": "https://patents.google.com/patent/US11451578B2/en",
    "inventors": [
        "Jan KOHOUT",
        "Blake Harrell Anderson",
        "Martin Grill",
        "David McGrew",
        "Martin Kopp",
        "Tomas Pevny"
    ],
    "classifications": [
        "H04L63/1441",
        "G06N20/00",
        "H04L41/0686",
        "H04L47/2441",
        "H04L63/0428",
        "H04L63/1416",
        "H04L63/1425",
        "H04L63/145",
        "H04L63/168",
        "G06N20/20"
    ],
    "abstract": "In one embodiment, a device in a network detects an encrypted traffic flow associated with a client in the network. The device captures contextual traffic data regarding the encrypted traffic flow from one or more unencrypted packets associated with the client. The device performs a classification of the encrypted traffic flow by using the contextual traffic data as input to a machine learning-based classifier. The device generates an alert based on the classification of the encrypted traffic flow.",
    "claims": "\n1. A method, comprising:\ndetecting, at a device in a network, an encrypted traffic flow associated with a client in the network;\nreceiving, at the device, a sequence of packets sent by the client associated with the encrypted traffic flow, the sequence of packets including 1) an encrypted request packet of the encrypted traffic flow and 2) one or more unencrypted packets sent by the client sequentially before or after the encrypted request packet;\ncapturing, by the device, contextual traffic data regarding the encrypted traffic flow from the one or more unencrypted packets;\nperforming, by the device, a classification of the encrypted traffic flow by using the captured contextual traffic data as input to a machine learning-based classifier; and\ngenerating, by the device, an alert based on the classification of the encrypted traffic flow wherein capturing the contextual traffic data further comprises:\nanalyzing, by the device, the encrypted traffic flow to infer a header field of the encrypted traffic flow; and\ncomparing, by the device, the inferred header field of the encrypted traffic flow with a header field of the one or more unencrypted packets.\n2. The method as in claim 1, wherein the machine learning-based classifier is configured to infer the header field of the encrypted traffic flow based on a cipher suite that is advertised in one or more other header fields of the encrypted traffic flow.\n3. The method as in claim 1, wherein the one or more unencrypted packets are Hypertext Transfer Protocol (HTTP) packets, and the encrypted traffic flow comprises one or more HTTP Secure (HTTPS) packets.\n4. The method as in claim 1, wherein capturing the contextual traffic data for the encrypted traffic flow further comprises:\nextracting, by the device, header information from the one or more unencrypted packets; and\nconstructing, by the device, a feature vector for input to the machine learning-based classifier based on the extracted header information.\n5. The method as in claim 4, wherein the header information is extracted from one or more of: a content-type header field, a user-agent header field, an accept-language header field, a server header field, or a status-code header field.\n6. The method as in claim 1, wherein the header field of the encrypted traffic flow is a user-agent header field of the encrypted traffic flow, and the header field of the one or more unencrypted packets is a user-agent header field of the one or more unencrypted packets.\n7. The method as in claim 1, wherein capturing the contextual traffic data further comprises:\nselecting, by the device, the one or more unencrypted packets for analysis based on the client having sent the one or more unencrypted packets within a predefined timespan of a request packet of the encrypted traffic flow.\n8. The method as in claim 1, wherein capturing the contextual traffic data further comprises:\ngenerating, by the device, a fixed-size set of the one or more unencrypted packets.\n9. The method as in claim 1, wherein the one or more unencrypted packets are included among a plurality of unencrypted packets, and capturing the contextual traffic data comprises:\ngenerating, by the device, two or more groups of the plurality of unencrypted packets, wherein each group indicates micro-activity by the client.\n10. An apparatus, comprising:\none or more network interfaces to communicate with a network;\na processor coupled to the network interfaces and configured to execute one or more processes; and\na memory configured to store a process executable by the processor, the process when executed operable to:\ndetect an encrypted traffic flow associated with a client in the network;\nreceive a sequence of packets sent by the client associated with the encrypted traffic flow, the sequence of packets including 1) an encrypted request packet of the encrypted traffic flow and 2) one or more unencrypted packets sent by the client sequentially before or after the encrypted request packet;\ncapture contextual traffic data regarding the encrypted traffic flow from the one or more unencrypted packets;\nperform a classification of the encrypted traffic flow by using the captured contextual traffic data as input to a machine learning-based classifier; and\ngenerate an alert based on the classification of the encrypted traffic flow,\nwherein the apparatus further captures the contextual traffic data by:\nanalyzing the encrypted traffic flow to infer a header field of the encrypted traffic flow; and\ncomparing the inferred header field of the encrypted traffic flow with a header field of the one or more unencrypted packets.\n11. The apparatus as in claim 10, wherein the machine learning-based classifier is configured to infer the header field of the encrypted traffic flow based on a cipher suite that is advertised in one or more other header fields of the encrypted traffic flow.\n12. The apparatus as in claim 10, wherein the one or more unencrypted packets are Hypertext Transfer Protocol (HTTP) packets, and the encrypted traffic flow comprises one or more HTTP Secure (HTTPS) packets.\n13. The apparatus as in claim 10, wherein the apparatus further captures the contextual traffic data for the encrypted traffic flow by:\nextracting header information from the one or more unencrypted packets; and\nconstructing a feature vector for input to the machine learning-based classifier based on the extracted header information.\n14. The apparatus as in claim 13, wherein the header information is extracted from one or more of: a content-type header field, a user-agent header field, an accept-language header field, a server header field, or a status-code header field.\n15. The apparatus as in claim 10, wherein the header field of the encrypted traffic flow is a user-agent header field of the encrypted traffic flow, and the header field of the one or more unencrypted packets is a user-agent header field of the one or more unencrypted packets.\n16. The apparatus as in claim 10, wherein the apparatus further captures the contextual traffic data by:\nselecting the one or more unencrypted packets for analysis based on the client having sent the one or more unencrypted packets within a predefined timespan of a request packet of the encrypted traffic flow.\n17. The apparatus as in claim 10, wherein the apparatus further captures the contextual traffic data by:\ngenerating a fixed-size set of the one or more unencrypted packets.\n18. The apparatus as in claim 10, wherein the process when executed is further operable to:\nperform anomaly detection on the encrypted traffic flow by using the contextual traffic data as input to a machine learning-based anomaly detector.\n19. A tangible, non-transitory, computer-readable medium storing program instructions that cause a networking device in a network to execute a process comprising:\ndetecting, at the device, an encrypted traffic flow associated with a client in the network;\nreceiving, at the device, a sequence of packets sent by the client associated with the encrypted traffic flow, the sequence of packets including 1) an encrypted request packet of the encrypted traffic flow and 2) one or more unencrypted packets sent by the client sequentially before or after the encrypted request packet;\ncapturing, by the device, contextual traffic data regarding the encrypted traffic flow from the one or more unencrypted packets;\nperforming, by the device, a classification of the encrypted traffic flow by using the captured contextual traffic data as input to a machine learning-based classifier; and\ngenerating, at the device, an alert based on the classification of the encrypted traffic flow wherein capturing the contextual traffic data further comprises:\nanalyzing, by the device, the encrypted traffic flow to infer a header field of the encrypted traffic flow; and\ncomparing, by the device, the inferred header field of the encrypted traffic flow with a header field of the one or more unencrypted packets.\n20. The computer-readable medium as in claim 19, wherein the machine learning-based classifier is configured to infer the header field of the encrypted traffic flow based on a cipher suite that is advertised in one or more other header fields of the encrypted traffic flow.",
    "status": "Active",
    "citations_own": [
        "US7634811B1",
        "US7778194B1",
        "US8549645B2",
        "US8699357B2",
        "US8832007B2",
        "US9038178B1",
        "US9043919B2",
        "US9055093B2",
        "WO2015128609A1",
        "US9374385B1",
        "US10212176B2",
        "US10361931B2",
        "US10805338B2"
    ],
    "citations_ftf": [
        "US9886581B2",
        "US11698990B2"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US10848508B2",
        "US10367841B2",
        "US10805338B2",
        "US10579942B2",
        "US10581915B2",
        "US10476673B2",
        "US10917419B2",
        "US10594725B2",
        "US10536268B2",
        "US9967292B1",
        "US10673901B2",
        "US10389574B1",
        "US10270794B1",
        "CN110363293A",
        "US10868834B2",
        "CN110710187B",
        "GB2579260B",
        "US10411978B1",
        "EP3637718B1",
        "US11032314B2",
        "US11233703B2",
        "US11003790B2",
        "US10772016B2",
        "US11201877B2",
        "WO2020118377A1",
        "US11570070B2",
        "TW201921893A",
        "WO2020118375A1",
        "TWI735829B",
        "CN109831392B",
        "CN111917694B",
        "US11368487B2",
        "US10965702B2",
        "US11388072B2",
        "US10742530B1",
        "US11444878B2",
        "US10742677B1",
        "TWI783229B",
        "US11463466B2",
        "US11310256B2",
        "CN112381119B",
        "US11558424B2",
        "US11606273B1",
        "US11349861B1"
    ]
}