{
    "patent_link": "https://patents.google.com/patent/US6163604A/en",
    "patent_id": "US6163604A",
    "title": "Automated fraud management in transaction-based networks",
    "abstract": "Fraud losses in a communication network are substantially reduced by automatically generating fraud management recommendations in response to suspected fraud and by deriving the recommendations as a function of selected attributes of the fraudulent activity. More specifically, a programmable rules engine automatically generates recommendations based on call-by-call fraud scoring so that the recommendations correspond directly to the type and amount of suspected fraudulent activity. Using telecommunications fraud as an example, an automated fraud management system receives call detail records that have been previously scored to identify potentially fraudulent calls. Fraud scoring estimates the probability of fraud for each call based on the learned behavior of an individual subscriber as well as that of fraud perpetrators. Scoring also provides an indication of the contribution of various elements of the call detail record to the fraud score for that call. A case analysis is initiated and previously scored call detail records are separated into innocuous and suspicious groups based on fraud scores. Each group is then characterized according to selected variables and scoring for its member calls. These characterizations are combined with subscriber information to generate a set of decision variables. A set of rules is then applied to determine if the current set of decision variables meets definable conditions. When a condition is met, prevention measures associated with that condition are recommended for the account. As one example, recommended prevention measures may be automatically implemented via provisioning functions in the telecommunications network.",
    "inventors": [
        "Gerald Donald Baulier",
        "Michael H. Cahill",
        "Virginia Kay Ferrara",
        "Diane Lambert"
    ],
    "assignee": "Nokia of America Corp",
    "classifications": [
        "H04M15/47",
        "H04M15/00",
        "H04M15/58",
        "H04M3/36",
        "H04M3/382",
        "H04W12/126",
        "H04M2203/6027",
        "H04M2215/0148",
        "H04M2215/0188",
        "H04M3/2218"
    ],
    "claims": "\n1. A computer-implemented method for managing fraud in a telecommunications network, comprising the step of:\nautomatically generating one or more recommendations for responding to suspected fraudulent activity in the telecommunications network, wherein the recommendations are derived as a function of calls scored for the likelihood of fraud, and wherein the recommendations correspond to attributes of the suspected fraudulent activity so that a recommended response to the suspected fraudulent activity is targeted to the type of fraud that is occurring.\n2. The computer-implemented method of claim 1, wherein scoring is done on a call-by-call basis.\n3. The computer-implemented method of claim 2, further comprising the steps of:\nreceiving call detail records which have been scored to identify potentially fraudulent activity, wherein a scored call detail record provides an indication of the contribution of a plurality of predetermined call variables to the fraud score; and\ninitiating a case analysis based on predetermined criteria relating to changes in fraud scores.\n4. The computer-implemented method of claim 3, wherein the step of initiating a case analysis comprises the steps of:\na) separating a plurality of scored call detail records, based on fraud scores, into at least a first group representative of non-suspicious activity and a second group representative of suspicious activity;\nb) characterizing each group according to predetermined variables and fraud scores for individual calls in the respective groups;\nc) generating one or more decision variables based on step b) and subscriber information;\nd) applying one or more rules to the one or more decision variables to determine if a predefined condition is met; and\ne) when a predefined condition is met, recommending one or more prescribed fraud responses corresponding to that condition.\n5. The computer-implemented method of claim 4, wherein a fraud score of an individual call is representative of the likelihood of fraud based on the learned behavior of a subscriber comprising a subscriber signature and the learned behavior of fraudulent calling activity comprising a fraud signature.\n6. The computer-implemented method of claim 5, wherein the one or more prescribed fraud responses includes prevention measures.\n7. The computer-implemented method of claim 6, wherein one of the prevention measures includes implementing provisioning-based fraud prevention.\n8. The computer-implemented method of claim 1, wherein the recommendations further correspond to attributes of legitimate activity.\n9. The computer-implemented method of claim 8, wherein the recommendations further correspond to subscriber information and attributes associated with a case.\n10. The computer-implemented method according to claim 3, wherein the plurality of predetermined call variables are variables selected from the group consisting of day of week, time of day, duration of call, time between consecutive calls, origination, destination, use of special call features, appearance of network security alert, carrier selection, and use of international completion services.\n11. The method according to claim 4, wherein a case is capable of being updated on a iterative and adaptive basis as a function of newly scored calls and newly generated fraud response recommendations.\n12. The computer-implemented method according to claim 5, wherein the subscriber signature is derived from attributes of calling behavior selected from the group consisting of calling rate, day of week timing, hour of day timing, call duration, method of billing, and geographical associations.\n13. The computer-implemented method according to claim 5, wherein the attributes of calling behavior are derived from information in call detail records.\n14. The computer-implemented method according to claim 5, wherein the fraud signature is derived from attributes of calling behavior associated with suspected and confirmed fraudulent calls.\n15. The computer-implemented method of claim 5, wherein suspected fraudulent activity is indicated by factors selected from the group consisting of a fraud score that exceeds a predetermined value, a fraud score indicative of a change in fraud score of a prescribed amount over a prescribed number of calls, a collision event indicated by an overlap in time for two or more calls, and a velocity violation event indicated by an inconsistent change in origination point for each of two or more calls given the amount of time between the two or more calls.\n16. A computer-implemented method for managing fraud in a network where transactions occur, comprising the step of:\nautomatically generating one or more recommendations for responding to suspected fraudulent activity in the network, wherein the recommendations are derived as a function of transactions scored for the likelihood of fraud, and wherein the recommendations correspond to selected attributes of the suspected fraudulent activity so that a recommended response to the suspected fraudulent activity is targeted to the type of fraud that is occurring.\n17. The computer-implemented method of claim 16, further comprising the steps of:\nreceiving transaction records which have been scored to identify potentially fraudulent activity, wherein a scored transaction record provides an indication of the contribution of a plurality of predetermined transaction variables to the fraud score; and\ninitiating a case analysis based on predetermined criteria relating to changes in fraud scores.\n18. The computer-implemented method of claim 17, wherein the step of initiating a case analysis comprises the steps of:\na) separating a plurality of scored transaction records, based on fraud scores, into at least a first group representative of non-suspicious activity and a second group representative of suspicious activity;\nb) characterizing each group according to predetermined variables and fraud scores for individual transactions in the respective groups;\nc) generating one or more decision variables based on step b) and subscriber information;\nd) applying one or more rules to the one or more decision variables to determine if a predefined condition is met; and\ne) when a predefined condition is met, recommending one or more prescribed fraud responses corresponding to that condition.\n19. The computer-implemented method of claim 18, wherein a fraud score of an individual transaction is representative of the likelihood of fraud based on the learned behavior of a subscriber comprising a subscriber signature and the learned behavior of fraudulent activity comprising a fraud signature.\n20. The computer-implemented method of claim 19, wherein the one or more prescribed fraud responses includes prevention measures.\n21. The computer-implemented method of claim 20, wherein one of the prevention measures includes implementing provisioning-based fraud prevention in the network.\n22. The computer-implemented method of claim 16, wherein scoring is done on a transaction-by-transaction basis.\n23. The computer-implemented method of claim 16, wherein the recommendations further correspond to attributes of legitimate transaction activity.\n24. The computer-implemented method of claim 23, wherein the recommendations further correspond to subscriber information.\n25. The computer-implemented method of claim 24, wherein the recommendations further correspond to attributes associated with a case.\n26. A system for managing fraud in a network where transactions occur, comprising:\nmeans for deriving one or more recommendations for responding to suspected fraudulent activity in the network as a function of transactions scored for the likelihood of fraud; and\nmeans for automatically generating the one or more recommendations,\nwherein the recommendations correspond to selected attributes of the suspected fraudulent activity so that a recommended response to the suspected fraudulent activity is targeted to the type of fraud that is occurring.\n27. A system for managing fraud in a telecommunications network, comprising:\nat least one memory device for receiving, storing, and supplying call detail records that have been scored to identify potentially fraudulent activity, wherein a scored call detail record provides an indication of the contribution to the fraud score of a plurality of predetermined call variables; and\na computer processor, coupled to the at least one memory device, for executing programmed instructions to automatically generate one or more recommendations for responding to suspected fraudulent activity in the telecommunications network, wherein the recommendations are derived as a function of the scored call detail records, and wherein the recommendations correspond to selected attributes of the suspected fraudulent activity so that a recommended response to the suspected fraudulent activity is targeted to the type of fraud that is occurring.\n28. A system for managing fraud in a telecommunication network, comprising:\na call scoring element responsive to call detail records generated within the network for scoring a call to determine the likelihood of fraud; and\na case analysis element responsive to scored call detail records and subscriber account information for analyzing a case of suspected fraud and for automatically generating recommendations for responding to the suspected fraud, wherein recommended fraud responses correspond to attributes of the suspected fraud so that management of the suspected fraud is targeted to the type of fraud that is occurring.\n29. The computer-implemented method according to claim 28, wherein the case analysis element includes a programmable rules-based engine for generating recommendations.\n30. The system according to claim 28, further comprising a provisioning function for implementing one or more of the recommended fraud responses.\n31. The system according to claim 30, wherein the one or more recommended fraud responses are selected from the group of responses consisting of blocking the call, disabling one or more call features for a particular account associated with the suspected fraud, and forwarding a next call on the particular account to an attendant.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4799255A",
        "US5345595A",
        "EP0618713A2",
        "US5357564A",
        "US5375244A",
        "EP0653868A2",
        "EP0661863A2",
        "US5448760A",
        "US5504810A",
        "US5506893A",
        "US5566234A",
        "US5602906A",
        "GB2303275A",
        "US5627886A",
        "WO1997037486A1",
        "US5768354A",
        "US5819226A",
        "WO1999005844A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6307926B1",
        "US6335971B1",
        "WO2002037219A2",
        "US6396915B1",
        "US6404865B1",
        "US6404871B1",
        "US6437812B1",
        "US20020133371A1",
        "US20020136439A1",
        "US20020161711A1",
        "US20030033228A1",
        "US20030050882A1",
        "US6542729B1",
        "US6546545B1",
        "WO2003030430A2",
        "US6570968B1",
        "US20030112942A1",
        "US6597775B2",
        "US6601034B1",
        "US20030153299A1",
        "US6609120B1",
        "US20030204426A1",
        "US20030208684A1",
        "US20030233331A1",
        "US6708155B1",
        "US6714918B2",
        "US20040064401A1",
        "US6763098B1",
        "US20040139081A1",
        "US6782371B2",
        "US20040218045A1",
        "US6850606B2",
        "US20050125280A1",
        "US20050160280A1",
        "US20050192895A1",
        "US20050192897A1",
        "US20050222806A1",
        "US20050243984A1",
        "US20050249341A1",
        "US20050278270A1",
        "US20050278550A1",
        "US20050286686A1",
        "US20060041464A1",
        "US7013296B1",
        "US20060095963A1",
        "US7103357B2",
        "US20060253907A1",
        "US7140039B1",
        "US20070112656A1",
        "US20070112512A1",
        "US20070111707A1",
        "US20070150330A1",
        "US20070152849A1",
        "US20070186284A1",
        "US20070204033A1",
        "US20070203826A1",
        "US7272855B1",
        "US7277863B1",
        "US20080080691A1",
        "US7369161B2",
        "US7372485B1",
        "US20080162556A1",
        "US7403922B1",
        "WO2008141168A1",
        "US20090044279A1",
        "WO2009052296A1",
        "US20090106134A1",
        "US20090178120A1",
        "US20090222243A1",
        "US20090265211A1",
        "US7653742B1",
        "US7724281B2",
        "US7752084B2",
        "US7760861B1",
        "US7783745B1",
        "US7792876B2",
        "US20100235909A1",
        "US20100235908A1",
        "US7802722B1",
        "US7865427B2",
        "US20110016363A1",
        "US20110093786A1",
        "US7970722B1",
        "US20110184861A1",
        "WO2011133814A2",
        "US8082349B1",
        "US8091130B1",
        "US8135388B1",
        "US8212893B2",
        "US8321288B1",
        "US8364578B1",
        "US8564683B2",
        "US8775284B1",
        "US20140376705A1",
        "CN104572615A",
        "US20150281431A1",
        "US20160012544A1",
        "US9361597B2",
        "US9521551B2",
        "US9633201B1",
        "CN106779675A",
        "US9703983B2",
        "US9729727B1",
        "US9754311B2",
        "US9774726B1",
        "US9948629B2",
        "US9990631B2",
        "US10091312B1",
        "US10111102B2",
        "US20190141183A1",
        "US10397402B1",
        "US10417637B2",
        "US10453066B2",
        "US20200128126A1",
        "US10785214B2",
        "US10798126B2",
        "US10805459B1",
        "US10805458B1",
        "US20200364366A1",
        "US10855666B2",
        "US10902327B1",
        "US10902054B1",
        "US10951770B2",
        "US10972472B2",
        "US10999298B2",
        "US11153435B2",
        "US20210329125A1",
        "US11164206B2",
        "US11301585B2",
        "US11314838B2",
        "US11323560B2",
        "US11336646B2",
        "US11343381B2",
        "US20220182490A1",
        "US11483428B2"
    ],
    "citedby_ftf": [
        "US20030195974A1",
        "US7058597B1"
    ]
}