{
    "patent_id": "US-11406899-B2",
    "title": "Virtual character generation from image or video data ",
    "assignee": "Electronic Arts Inc.",
    "publication_date": "2022-08-09",
    "patent_link": "https://patents.google.com/patent/US11406899B2/en",
    "inventors": [
        "John Kolen",
        "Harold Henry Chaput",
        "Navid Aghdaie",
        "Kazi Atif-Uz Zaman",
        "Kenneth Alan Moss"
    ],
    "classifications": [
        "G06T13/40",
        "A63F13/655",
        "A63F13/213",
        "A63F13/40",
        "A63F13/63",
        "A63F13/67",
        "G06N20/20",
        "G06N3/047",
        "G06N3/08",
        "G06N3/088",
        "G06N7/01",
        "G06T15/005",
        "G06T15/04",
        "G06T17/205",
        "G06T19/00",
        "G06V20/20",
        "G06V40/10",
        "A63F13/428",
        "A63F2300/5553",
        "A63F2300/695",
        "G06N20/00",
        "G06N3/045",
        "G06N3/0454",
        "G06T17/20",
        "G06T2200/08",
        "G06T2207/20081",
        "G06T2210/16",
        "G06V40/20"
    ],
    "abstract": "Systems and methods for generating a customized virtual character are disclosed. A system may obtain video data or other media depicting a real person, and then may provide the obtained media to one or more machine learning models configured to learn visual appearance and behavior information regarding the particular person depicted in the video or other media. The system may then generate a custom visual appearance model and a custom behavior model corresponding to the real person, which may subsequently be used to render, within a virtual environment of a video game, a virtual character that resembles the real person in appearance and in-game behavior.",
    "claims": "\n1. A system comprising:\na data store that stores three-dimensional (3D) model data for virtual characters of a video game, wherein the 3D model data includes a human base model, wherein the human base model comprises 3D mesh data defining body shape of a generic human figure; and\na computing system in electronic communication with the data store and configured to execute computer-readable instructions that configure the computing system to:\nobtain input media depicting a real person, wherein the input media comprises at least a video recording of the real person as captured by a camera;\nprovide at least a portion of the input media to a machine learning model configured to extract visual information regarding one or more humans depicted in image or video data;\nalter the 3D mesh data of the human base model based on visual information extracted by the machine learning model to generate custom 3D model data corresponding to the real person;\nextract, from the input media, visual information regarding a first item worn by the real person as depicted in the input media, wherein the first item comprises a clothing item or an accessory;\ngenerate a virtual item corresponding to the first item worn by the real person, wherein the virtual item includes a texture generated based on the visual information; and\nrender, within a 3D virtual environment of the video game, a series of frames for display that depict a virtual character that resembles the real person performing one or more actions, wherein a visual appearance of the virtual character as rendered is based at least in part on the custom 3D model data and includes depiction of the virtual character wearing the virtual item.\n2. The system of claim 1, wherein the computer-readable instructions further configure the computing system to generate a virtual clothing selection interface for display to a user, wherein the virtual clothing selection interface identifies a subset of virtual clothing items from a catalog that are available for application to the virtual character, wherein the subset of virtual clothing items are selected from the catalog by the computing system based at least in part on one or more clothing styles of the real person as determined from an automated analysis of the input media.\n3. The system of claim 1, wherein the computer-readable instructions further configure the computing system to:\nstore, in the data store, custom virtual character data corresponding to the real person, wherein the custom virtual character data includes at least the custom 3D model.\n4. The system of claim 3, wherein the computer-readable instructions further configure the computing system to:\nprovide the custom virtual character data to two or more video game applications for incorporation of the virtual character into virtual worlds associated with each of the two or more video game applications.\n5. The system of claim 1, wherein the custom 3D model data corresponding to the real person comprises a custom texture extracted from the input media.\n6. The system of claim 1, wherein the machine learning model comprises a generative adversarial network that includes a generator and a discriminator.\n7. The system of claim 1, wherein the machine learning model comprises a convolutional neural network.\n8. A computer-implemented method comprising:\nunder the control of a computer system comprising computer hardware, the computer system configured with computer executable instructions:\nobtaining input media depicting a real person as captured by a camera;\nobtaining base three-dimensional (3D) model data associated with a generic human figure;\nproviding at least a portion of the input media to a machine learning model configured to extract visual information regarding one or more humans depicted in image or video data;\nmodifying the base 3D model data based on visual information extracted by the machine learning model to generate custom 3D model data corresponding to the real person;\nextracting, from the input media, visual information regarding a first item worn by the real person as depicted in the input media, wherein the first item comprises a clothing item or an accessory;\ngenerating or selecting a virtual item corresponding to the first item worn by the real person; and\nstoring, in a data store that stores virtual character data for virtual characters that populate a virtual world in at least one video game, data defining a custom virtual character, wherein the data defining the custom virtual character comprises at least the custom 3D model, wherein the data store further includes an association between the virtual item and the custom virtual character.\n9. The computer-implemented method of claim 8, further comprising rendering, within a 3D virtual environment of a video game, a series of frames for display that depict the custom virtual character performing one or more actions, wherein a visual appearance of the custom virtual character as rendered is based at least in part on the custom 3D model data and includes depiction of the virtual character wearing the virtual item.\n10. The computer-implemented method of claim 8, wherein the machine learning model applies an image-to-image translation using a conditional generative adversarial network (cGAN).\n11. The computer-implemented method of claim 8, wherein modifying the base 3D model data based on the visual information extracted by the machine learning model includes:\napplying a gradient descent technique comprising repeatedly adjusting a position and pose of a virtual camera until a rendered 3D virtual character based on the base 3D model data is positioned and posed similarly to a position and pose of the real person within a particular image or video frame of the input media; and\nadjusting one or more model parameters of the base 3D model data such that a subsequently rendered 3D virtual character based on adjusted base 3D model data appears similar to the real person depicted in the particular image or video frame of the input media.\n12. The computer-implemented method of claim 8, wherein the extracting the visual information regarding the first item worn by the real person comprises applying a classifier trained to classify one or more objects detected in an image as one of a plurality of predefined types of clothing items.\n13. The computer-implemented method of claim 12, wherein each of the predefined types of clothing items are associated with (a) corresponding 3D model data of a generic clothing item in an electronic data store and (b) a visual style extraction model trained to customize at least one of a texture or 3D mesh of the corresponding 3D model data based on the input media.\n14. The computer-implemented method of claim 12, wherein the plurality of predefined types of clothing items comprise two or more of a shirt, a jacket, a hat, short pants, long pants, boots or shoes.\n15. The computer-implemented method of claim 8, wherein the extracting the visual information regarding the first item worn by the real person comprises applying a classifier trained to classify one or more objects detected in an image as one of a plurality of predefined types of accessories.\n16. The computer-implemented method of claim 15, wherein the plurality of predefined types of accessories comprise two or more of glasses, a belt, gloves, earrings, a necklace or a watch.\n17. A non-transitory computer-readable storage medium having stored thereon computer-readable instructions that, when executed, configure a computing system to:\nobtain input media depicting a real person as captured by a camera;\nobtain base three-dimensional (3D) model data associated with a generic human figure;\nprovide at least a portion of the input media to a first machine learning model configured to extract visual information regarding one or more humans depicted in image or video data;\nmodify the base 3D model data based on visual information extracted by the machine learning model to generate custom 3D model data corresponding to the real person;\nextract, from the input media, visual information regarding a first item worn by the real person as depicted in the input media, wherein the first item comprises a clothing item or an accessory;\ngenerate or select a virtual item corresponding to the first item worn by the real person; and\nstore, in a data store that stores virtual character data for virtual characters that populate a virtual world in at least one video game, data defining a custom virtual character, wherein the data defining the custom virtual character comprises at least the custom 3D model, wherein the data store further includes an association between the virtual item and the custom virtual character.\n18. The non-transitory computer-readable storage medium of claim 17, wherein the instructions further configure the computing system to render, within a 3D virtual environment of a video game, a series of frames for display that depict the custom virtual character performing one or more actions, wherein a visual appearance of the custom virtual character as rendered is based at least in part on the custom 3D model data and includes depiction of the virtual character wearing the virtual item.\n19. The non-transitory computer-readable storage medium of claim 17, wherein the real person is a player of the at least one video game, and wherein the input media is obtained from at least one of (a) a computing device of the player or (b) a third party media account associated with the player.",
    "status": "Active",
    "citations_own": [
        "US5274801A",
        "US5683082A",
        "US6106395A",
        "US6253193B1",
        "US6285380B1",
        "US20040067788A1",
        "US20040152512A1",
        "US20050130725A1",
        "US20070054717A1",
        "US20070060364A1",
        "US20070066403A1",
        "US20070260567A1",
        "US7390254B2",
        "US20080268961A1",
        "US20080266250A1",
        "US20090202114A1",
        "KR20090092007A",
        "US20090307671A1",
        "US20100144444A1",
        "US20100302257A1",
        "US20110007079A1",
        "US20110035280A1",
        "US20110295649A1",
        "US8100770B2",
        "US8142282B2",
        "US20120083330A1",
        "US20120115580A1",
        "US20120220376A1",
        "US20120233105A1",
        "US8267764B1",
        "US20120244941A1",
        "US20120276964A1",
        "US20120295708A1",
        "US20120309520A1",
        "US8398476B1",
        "US20130178281A1",
        "US8540560B2",
        "KR20130118433A",
        "US20130316795A1",
        "US20130342527A1",
        "US20140235346A1",
        "US8821290B2",
        "US20140249961A1",
        "US20140274370A1",
        "US8907193B2",
        "US8914251B2",
        "US20150105161A1",
        "US9033796B2",
        "CN104657412A",
        "US20150213646A1",
        "US20150302505A1",
        "US20150339532A1",
        "US20160005270A1",
        "US20160067612A1",
        "KR101603681B1",
        "US20170061685A1",
        "US20170064284A1",
        "US9616329B2",
        "US20170124753A1",
        "US20170259177A1",
        "US20170312634A1",
        "US20170365102A1",
        "US20180001216A1",
        "US20180117465A1",
        "US20180161682A1",
        "US20180161673A1",
        "US20180243656A1",
        "US10105603B2",
        "US20190087965A1",
        "US20190184286A1",
        "US20190197402A1",
        "US20190294881A1",
        "US10478730B1",
        "US20190354759A1",
        "US20190381407A1",
        "US10569176B2",
        "US20200098173A1",
        "US20200193671A1",
        "US10713543B1",
        "US20200306640A1",
        "US20200342677A1",
        "CN112169339A",
        "US20210008456A1",
        "US11276216B2"
    ],
    "citations_ftf": [
        "MA41117A",
        "US20180308281A1",
        "CN106600667B",
        "CN107274466A"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US8584031B2",
        "US9940637B2",
        "US10445425B2",
        "US9919217B2",
        "US11580608B2",
        "US10384133B1",
        "US10357718B2",
        "US10678244B2",
        "KR20230144661A",
        "US11157441B2",
        "US10671349B2",
        "US11409692B2",
        "US11113887B2",
        "US11561791B2",
        "DK201870374A1",
        "US10713543B1",
        "US11215999B2",
        "US11636333B2",
        "US11562231B2",
        "US11196678B2",
        "US11537811B2",
        "US11610117B2",
        "US11107261B2",
        "US10997461B2",
        "US11567514B2",
        "US10956755B2",
        "US11276216B2",
        "US10953334B2",
        "US11302080B1",
        "US10902618B2",
        "US11110353B2",
        "KR20210030147A",
        "US11217036B1",
        "US11250572B2",
        "US11475639B2",
        "US11436830B2",
        "US11648480B2",
        "US11452940B2",
        "US10991142B1",
        "US20210405831A1",
        "US11463657B1",
        "US11582424B1",
        "US11140360B1",
        "US20220180585A1",
        "US11663764B2",
        "US20230050535A1",
        "WO2022169289A2",
        "KR102531789B1",
        "US20220309280A1",
        "KR20220144689A",
        "GB2606344A",
        "CN113327311A",
        "US11769346B2",
        "US11769289B2",
        "US11295503B1",
        "US11726553B2",
        "US11786816B2",
        "CN113554760A",
        "US20230053308A1",
        "CN113633971B",
        "KR102529290B1",
        "KR102525975B1",
        "KR102529291B1",
        "KR102529292B1",
        "CN113784167B",
        "CN114049417A",
        "KR20230076004A",
        "US20230182005A1",
        "KR20230108869A",
        "KR102550973B1",
        "KR102479195B1",
        "CN114821675B",
        "CN115168745B",
        "CN115375809B"
    ]
}