{
    "patent_id": "US-10824478-B2",
    "title": "Methods and systems for quantum ready and quantum enabled computations ",
    "assignee": "1Qb Information Technologies Inc.",
    "publication_date": "2020-11-03",
    "patent_link": "https://patents.google.com/patent/US10824478B2/en",
    "inventors": [
        "Majid Dadashikelayeh",
        "Arman ZARIBAFIYAN"
    ],
    "classifications": [
        "H04L63/20",
        "G06F9/5083",
        "G06F16/25",
        "G06F16/951",
        "G06F21/44",
        "G06F9/4806",
        "G06F9/5044",
        "G06F9/5066",
        "G06F9/54",
        "G06N10/00",
        "G06N3/006",
        "G06N5/003",
        "G06N5/01",
        "H04L41/046",
        "H04L67/2823",
        "H04L67/565",
        "G06N5/043",
        "H04L63/08",
        "H04L67/10"
    ],
    "abstract": "The present disclosure provides methods, systems, and media for allowing access to quantum ready and/or quantum enabled computers in a distributed computing environment (e.g., the cloud). Such methods and systems may provide optimization and computational services on the cloud. Methods and systems of the present disclosure may enable quantum computing to be relatively and readily scaled across various types of quantum computers and users at various locations, in some cases without the need for users to have a deep understanding of the resources, implementation or the knowledge that may be required for solving optimization problems using a quantum computer. Systems provided herein may include user interfaces that enable users to perform data analysis in a distributed computing environment while taking advantage of quantum technology in the backend.",
    "claims": "\n1. A computing system for providing a user of a digital computer remote access to a computing platform comprising at least one non-classical computer over a distributed computing environment, wherein the digital computer comprises at least one computer processor and computer memory comprising a computer program executable by the at least one computer processor to generate a request, and wherein the computing platform comprising the at least one non-classical computer is configured to execute one or more instructions in response to the request to generate one or more solutions, the computing system comprising:\na communications interface configured to receive the request from the digital computer over the distributed computing environment;\na cluster manager configured to (i) in response to the request, divide the request into two or more computational components, wherein each of a first computational component and a second computational component of the two or more computational components comprises a non-classical algorithm or a non-classical machine instruction, and provide the one or more instructions comprising the two or more computational components for delivery to the computing platform comprising the at least one non-classical computer, which computing platform comprising the at least one non-classical computer is configured to execute the two or more computational components in parallel to generate the one or more solutions, and (ii) receive the one or more solutions generated by the computing platform comprising the at least one non-classical computer; and\nmemory configured to store the one or more solutions generated by the computing platform comprising the at least one non-classical computer.\n2. The computing system of claim 1, wherein the cluster manager is configured to control a start of termination of the one or more instructions, or to monitor a lifetime of the one or more instructions.\n3. The computing system of claim 1, wherein the cluster manager is configured to (i) place the request in a queue and (ii) maintain an order of the request in the queue.\n4. The computing system of claim 1, further comprising an application programming interface (API) that is usable for different architectures of the computing platform comprising the at least one non-classical computer, wherein the API is configured to hide architectural or technological details of the computing platform comprising the at least one non-classical computer.\n5. The computing system of claim 1, wherein the at least one non-classical computer comprises a quantum-ready computer or a quantum-enabled computer, and wherein the one or more instructions comprise a quantum algorithm.\n6. The computing system of claim 1, wherein the communications interface is configured to provide the one or more solutions generated by the computing platform comprising the at least one non-classical computer to the digital computer.\n7. The computing system of claim 1, further comprising a transactional unit configured to receive an item of value in exchange for executing the one or more instructions to generate the one or more solutions.\n8. The computing system of claim 7, wherein the transactional unit determines a cost for executing the one or more instructions to generate the one or more solutions, wherein the transactional unit determines the cost before or after executing the one or more instructions, and wherein the one or more instructions are executed upon receiving authorization to execute the one or more instructions.\n9. The computing system of claim 8, wherein the authorization is received from the user of the digital computer, and wherein the item of value is equal to the cost.\n10. A computer-implemented method for providing a user of a digital computer remote access to a computing platform comprising at least one non-classical computer over a distributed computing environment, wherein the digital computer comprises at least one computer processor and computer memory comprising a computer program executable by the at least one computer processor to generate a request, and wherein the computing platform comprising the at least one non-classical computer is configured to execute one or more instructions in response to the request to generate one or more solutions, the method comprising:\n(a) using a communications interface to receive the request from the digital computer over the distributed computing environment;\n(b) in response to the request, dividing the request into two or more computational components, wherein each of a first computational component and a second computational component comprises a non-classical algorithm or non-classical machine instructions and providing the one or more instructions comprising the two or more computational components for delivery to the computing platform comprising the at least one non-classical computer, which computing platform comprising the at least one non-classical computer executes the two or more computational components in parallel to generate the one or more solutions;\n(c) receiving the one or more solutions generated by the computing platform comprising the at least one non-classical computer; and\n(d) storing the one or more solutions generated by the computing platform comprising the at least one non-classical computer in memory.\n11. The method of claim 10, further comprising controlling a start or termination of the one or more instructions, or monitoring a lifetime of the one or more instructions.\n12. The method of claim 10, further comprising (i) placing the request in a queue and (ii) maintaining an order of the request in the queue.\n13. The method of claim 10, further comprising using an application programming interface (API) that is usable for different architectures of the computing platform comprising the at least one non-classical computer, wherein the API hides architectural or technological details of the computing platform comprising the at least one non-classical computer.\n14. The method of claim 10, wherein the at least one non-classical computer comprises a quantum-ready computer or a quantum-enabled computer, and wherein the one or more instructions comprise a quantum algorithm.\n15. The method of claim 10, further comprising providing the one or more solutions generated by the computing platform comprising the at least one non-classical computer to the digital computer.\n16. The method of claim 10, further comprising receiving an item of value in exchange for executing the one or more instructions to generate the one or more solutions.\n17. The method of claim 16, further comprising determining a cost for executing the one or more instructions to generate the one or more solutions after or prior to executing the one or more instructions, wherein the one or more instructions are executed upon receiving authorization to execute the one or more instructions.\n18. The method of claim 17, wherein the authorization is received from the user of the digital computer, and wherein the item of value is equal to the cost."
}