{
    "patent_link": "https://patents.google.com/patent/US5517495A/en",
    "patent_id": "US5517495A",
    "title": "Fair prioritized scheduling in an input-buffered switch",
    "abstract": "A Fair Arbitrated Round Robin (FARR) method is disclosed for scheduling the crossbar of an input-buffered asynchronous transfer mode (ATM) switch using an arbiter. Per-virtual-circuit queuing of ATM cells is performed.",
    "inventors": [
        "Carsten Lund",
        "Steven Phillips",
        "Nicholas F. Reingold"
    ],
    "assignee": "Sound View Innovations LLC",
    "classifications": [
        "H04L12/5601",
        "H04L49/1576",
        "H04L49/3081",
        "H04L2012/5632",
        "H04L2012/5649",
        "H04L2012/5651",
        "H04L2012/5679",
        "H04L2012/5681"
    ],
    "claims": "\n1. An apparatus for scheduling input buffers of fixed size packet switches, including asynchronous transfer mode (ATM) switches, having input and output ports, the apparatus comprising:\na plurality of input buffers having associate virtual circuits for receiving the arriving cells, each input buffer associated with a respective input port;\na cell switching fabric for processing the received cells from the input buffers to the output ports; and\na scheduling control circuit which uses timestamps associated with the virtual circuits for controlling the processing of the received cells through the cell switching fabric using fair arbitration round robin (FARR) to allow each virtual circuit to receive a fair share of bandwidth.\n2. An apparatus for scheduling input buffers of fixed size packet switches, including asynchronous transfer mode (ATM) switches, having input ad output ports, the apparatus comprising:\na plurality of input buffers for receiving arriving cells, each input buffer is associated with a respective input port and includes a service list associated with each priority level for each output port;\na cell switching fabric for processing the received cells from the input buffers to the output ports;\na plurality of queues, each queue associated with a virtual circuit connecting the input buffer with at least one output port and having an associated timestamp; and\na scheduling control circuit which uses the timestamps to generate a matching of input buffers to output ports to control the processing of the received cells through the cell switching fabric using a fair arbitration round robin (FARR) program.\n3. A method for scheduling input buffers of fixed size packet switches, including asynchronous transfer mode (ATM) switches, having input and output ports, the method comprising the steps of:\nreceiving cells in the input buffers;\npre-selecting at each input buffer a virtual circuit for each output port;\nperforming request processing to send a timestamp associated with each pre-selected virtual circuit to a scheduling control circuit;\ngenerating a matching of the input buffers to the output ports from the scheduling control circuit using the timestamps; and\nprocessing the received cells through a cell switching fabric to the output ports using the matching.\n4. The method of claim 3 wherein the step of matching includes the step of using an arbiter unit operating a fair arbitration round robin (FARR) program.\n5. The method of claim 3 wherein the step of generating a matching includes the steps of:\ngranting, for each unmatched output port, the request having a minimum timestamp;\naccepting, for each unmatched input buffer, the granted request with a minimum timestamp; and\nincorporating the accepted granted request in the matching.\n6. The method of claim 5 wherein the steps of granting requests, accepting granted requests, and incorporating the accepted granted requests are performed for a predetermined number of rounds.\n7. The method of claim 3 including the step of using timestamps and a central arbiter to fairly arbitrate between input buffers in an input-buffered switch.\n8. The method of claim 3 including the step of using timestamps and a central arbiter to fairly arbitrate between ports in an input-buffered switch.\n9. The method of claim 3 including the step of using timestamps and a central arbiter to fairly arbitrate between virtual circuits in an input-buffered switch.\n10. The apparatus of claim 1 wherein the scheduling control circuit pre-selects at each input buffer a respective virtual circuit for each output port.\n11. The apparatus of claim 1 further comprising:\nmeans for pre-selecting at each input buffer a respective virtual circuit for each output port; and\nmeans for performing request processing to send a respective timestamp associated with each pre-selected virtual circuit to the scheduling control circuit.\n12. The apparatus of claim 1 further comprising:\nan arbiter unit operating a FARR program to process the received cells.\n13. The apparatus of claim 1 further comprising:\nthe scheduling control circuit which uses the timestamps to generate a matching of input buffers to output ports, wherein each unmatched output buffer is associated with a respective input buffer as an unmatched input buffer;\nmeans for pre-selecting at each input buffer a virtual circuit for each output port;\nmeans for performing request processing on at least one request to send a timestamp associated with each pre-selected virtual circuit to the scheduling control circuit;\nmeans for granting, for each unmatched output port, the request having a minimum timestamp;\nmeans for accepting, for each unmatched input buffer, the granted request with a minimum timestamp; and\nmeans for incorporating the accepted granted request in the matching.\n14. The apparatus of claim 1 further comprising:\na central arbiter using the timestamps to fairly arbitrate between input buffers in an input-buffered switch.\n15. The apparatus of claim 1 further comprising:\na central arbiter using the timestamps to fairly arbitrate between ports in an input-buffered switch.\n16. The apparatus of claim 1 further comprising:\na central arbiter using the timestamps to fairly arbitrate between the virtual circuits in an input-buffered switch.\n17. The apparatus of claim 2 wherein the scheduling control circuit pre-selects at each input buffer the virtual circuit for each output port.\n18. The apparatus of claim 2 further comprising:\nmeans for pre-selecting at each input buffer the virtual circuit for each output port; and\nmeans for performing request processing to send a respective timestamp associated with each pre-selected virtual circuit to the scheduling control circuit.\n19. The apparatus of claim 2 further comprising:\nan arbiter unit operating the FARR program to process the received cells.\n20. The apparatus of claim 2 further comprising:\nmeans for performing request processing on at least one request to send a timestamp associated with each circuit to the scheduling control circuit;\nmeans for granting, for each unmatched output port, the request having a minimum timestamp;\nmeans for accepting, for each unmatched input buffer, the granted request with a minimum timestamp; and\nmeans for incorporating the accepted granted request in the matching.\n21. The apparatus of claim 2 further comprising:\na central arbiter using the timestamps to fairly arbitrate between input buffers in an input-buffered switch.\n22. The apparatus of claim 2 further comprising:\na central arbiter using the timestamps to fairly arbitrate between ports in an input-buffered switch.\n23. The apparatus of claim 2 further comprising:\na central arbiter using the timestamps to fairly arbitrate between the virtual circuits in an input-buffered switch.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5166926A",
        "US5255265A",
        "US5287182A",
        "US5325356A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "EP0744879A2",
        "US5631908A",
        "US5719865A",
        "GB2316573A",
        "US5742601A",
        "US5748629A",
        "US5774463A",
        "WO1998038771A2",
        "US5813040A",
        "US5831980A",
        "US5835491A",
        "US5838684A",
        "GB2326054A",
        "US5862128A",
        "US5881065A",
        "US5901147A",
        "US5905710A",
        "US5912889A",
        "EP0931396A1",
        "WO1999046903A1",
        "US5982777A",
        "WO1999057857A1",
        "US5991296A",
        "US6014367A",
        "EP0977404A2",
        "US6031820A",
        "US6041059A",
        "US6046982A",
        "WO2000028701A1",
        "EP1009189A2",
        "US6118783A",
        "US6124878A",
        "US6128278A",
        "US6157654A",
        "US6185222B1",
        "US6192039B1",
        "US6208661B1",
        "US6249511B1",
        "US6249819B1",
        "US20010007562A1",
        "US6278711B1",
        "US20010021191A1",
        "US6295295B1",
        "US6307860B1",
        "US6314487B1",
        "US6317416B1",
        "US20010043606A1",
        "US6330584B1",
        "US6330248B1",
        "US20010053157A1",
        "GB2364469A",
        "US6343066B2",
        "US20020021667A1",
        "US20020027914A1",
        "US6359861B1",
        "US20020054574A1",
        "US6430181B1",
        "US20020116503A1",
        "US6445708B1",
        "US20020133733A1",
        "US6456593B1",
        "US6466579B1",
        "US20020172156A1",
        "US20030002493A1",
        "US20030035427A1",
        "EP1289209A2",
        "EP1297657A1",
        "US6563837B2",
        "US20030112797A1",
        "US20030112750A1",
        "US20030118054A1",
        "US6594261B1",
        "US20030146073A1",
        "US20030163595A1",
        "US6633568B1",
        "WO2003094536A2",
        "US20030225737A1",
        "US20030223448A1",
        "US6667984B1",
        "US20040024954A1",
        "US6721323B1",
        "US6724766B2",
        "US20040085897A1",
        "US6735212B1",
        "US20040103231A1",
        "US6757246B2",
        "US20040151209A1",
        "US6791992B1",
        "US6795442B1",
        "US20040199916A1",
        "US6804731B1",
        "KR100454506B1",
        "US6836514B2",
        "EP1115065A3",
        "US20050013292A1",
        "US20050013311A1",
        "US6865154B1",
        "US20050059405A1",
        "US20050059406A1",
        "US6904045B1",
        "US20050163127A1",
        "US20050180358A1",
        "US6952419B1",
        "US6963577B1",
        "US7020161B1",
        "US7042837B1",
        "US20060101178A1",
        "US20060171381A1",
        "US7106728B1",
        "US20060248331A1",
        "US20070086398A1",
        "US20070106722A1",
        "US20070106998A1",
        "US7266123B1",
        "US7283471B2",
        "US20070260720A1",
        "US20070258448A1",
        "US20070268516A1",
        "US20070268514A1",
        "US20070268515A1",
        "US20070268506A1",
        "US20070281711A1",
        "US20070287500A1",
        "US20080013481A1",
        "US7352741B2",
        "US20080096575A1",
        "US20080107077A1",
        "US20080117822A1",
        "US7394815B1",
        "US20080162921A1",
        "US7397796B1",
        "US20080212472A1",
        "US20080212517A1",
        "US20090028500A1",
        "US20090073905A1",
        "US20090075665A1",
        "US20090080451A1",
        "DE10105935B4",
        "US7573859B2",
        "US20090207859A1",
        "US20090293106A1",
        "US20100024007A1",
        "US7701949B1",
        "US20100118768A1",
        "US7724703B2",
        "US20100329177A1",
        "US7873061B2",
        "US20110051742A1",
        "US8150357B2",
        "US8218449B2",
        "US8238298B2",
        "US8238942B2",
        "US8340110B2",
        "US8474023B2",
        "US8542836B2",
        "US8638762B2",
        "US8818322B2",
        "US8902904B2",
        "US8964771B2",
        "US8966018B2",
        "US9191799B2",
        "US20150333897A1"
    ],
    "citedby_ftf": []
}