{
    "patent_link": "https://patents.google.com/patent/US5924090A/en",
    "patent_id": "US5924090A",
    "title": "Method and apparatus for searching a database of records",
    "abstract": "A method and search apparatus for searching a database of records organizes results of the search into a set of most relevant categories enabling a user to obtain with a few mouse clicks only those records that are most relevant. In response to a search instruction from the user, the search apparatus searches the database, which can include Internet records and premium content records, to generate a search result list corresponding to a selected set of the records. The search apparatus processes the search result list to dynamically create a set of search result categories. Each search result category is associated with a subset of the records within the search result list having one or more common characteristics. The categories can be displayed as a plurality of folders on the user's display. For the foregoing categorization method and apparatus to work, each record within the database is classified according to various meta-data attributes (e.g., subject, type, source, and language characteristics). Because such a task is too much to do manually, substantially all of the records are automatically classified by a classification system into the proper categories. The classification system automatically determines the various meta-data attributes when such attributes are not editorially available from source.",
    "inventors": [
        "Marc F. Krellenstein"
    ],
    "assignee": "WHITTEN GREGORY F",
    "classifications": [
        "G06F16/338",
        "G06F16/951",
        "Y10S707/99933",
        "Y10S707/99934",
        "Y10S707/99935"
    ],
    "claims": "\n1. A method for searching a database of records, comprising:\nsearching the database, in response to a search instruction, to generate a search result list which includes a selected set of the records;\nprocessing at least a portion of the search result list to dynamically (i) identify common characteristics associated with the records within the search result list, (ii) group records in the search result list having common characteristics into candidate categories, and (iii) compile a list of candidate categories, each candidate category being representative of a possible search result category; and\nweighting each candidate category as a function of the identified common characteristics of the records within the candidate category.\n2. A method according to claim 1 further comprising ranking the records within the search results list according to preselected relevancy criteria.\n3. A method according to claim 1 further comprising identifying subject, type, source and language characteristics associated with each record within the search result list.\n4. A method according to claim 3 further comprising grouping the search result categories in response to a user-selected value for one of the characteristics.\n5. A method according to claim 1 further comprising selecting candidate categories as a function of the identified common characteristics of the records.\n6. A method according to claim 5 further comprising selecting between about five to ten search result categories from the candidate categories.\n7. A method according to claim 1 wherein the database includes Internet records and premium content records.\n8. A method according to claim 1 further comprising providing a graphical representation of the categories.\n9. A method according to claim 1 further comprising identifying meta-data characteristics associated with records within the search result list.\n10. A search apparatus for searching a database of records, comprising\na search processor, responsive to a search instruction, for searching the database to generate a search result list which includes a selected set of the records;\na grouping processor for processing at least a portion of the search result list to dynamically (i) identify common characteristics associated with the records within the search result list, (ii) group records having common characteristics into candidate categories, (iii) compile a list of candidate categories, each candidate category being representative of a possible search result category; and\na weighting processor for weighting each candidate category as a function of the identified common characteristics of the records within the candidate category.\n11. An apparatus according to claim 10 further comprising means for ranking the records within the search result list according to preselected relevancy criteria.\n12. An apparatus according to claim 11 further comprising means for grouping the records within the search result list in response to a user-selected value for one of the characteristics.\n13. An apparatus according to claim 10 further comprising a record processor for identifying subject, type, source and language characteristics associated with each record within the search result list.\n14. An apparatus according to claim 13 further comprising means for ranking the identified common characteristics of the records into a hierarchical order.\n15. An apparatus according to claim 10 further comprising means for selecting between about five to ten search result categories from the candidate categories.\n16. An apparatus according to claim 10 further comprising a display processor for providing a graphical representation of the categories.\n17. An apparatus according to claim 10 further comprising means for generating, as a function of one of the categories, a refine instruction being representative of an additional instruction for searching the database for records associated with the category and the additional instruction.\n18. An apparatus according to claim 10 wherein the database includes Internet records and premium content records.\n19. A search apparatus comprising:\na database for storing a plurality of records, including Internet records and premium content records;\na search processor for searching the database, in response to a search instruction from a user, to generate a search result list which includes a selected set of the records;\na grouping processor for processing at least a portion of the search result list to dynamically (i) identify common characteristics associated with the records within the search result list, (ii) group records having common characteristics into candidate categories, (iii) compile a list of candidate categories, each candidate category being representative of a possible search result category;\na weighting processor for weighting each candidate category as a function of the identified common characteristics of the records within the candidate category; and\na display processor for providing a graphical representation of the categories to the user.\n20. A method for automatically classifying a database of records, comprising:\nexecuting a query for each attribute value associated with each of a plurality of query attributes against each of talk records in the database;\nselectively matching the format of at least one of the records to each of a plurality of attribute formats;\ndetermining a classification score which represents the relative strength of the match for each query and each record;\ndetermining a classification score which represents the relative strength of the match for each attribute formats and at least one of the records; and\nclassifying each record under selected attribute values for each attribute for which the record has highest classification scores.\n21. The method of claim 20 further comprising arranging the attribute values for each attribute hierarchically.\n22. A method for searching a database of records, comprising:\nsearching the database, in response to a search instruction, to generate a search result list which includes a selected set of the records;\nprocessing at least a portion of the search result list to dynamically (i) group records in the search result list into candidate categories based on identified common characteristics associated with such records, and (ii) compile a list of candidate categories, each candidate category being representative of a possible search result category; and\nweighting each candidate category as a function of characteristics of the records within the candidate category.\n23. The method of claim 22 wherein the weighting step further comprises weighting each candidate category as a function of the identified common characteristics of the records within the candidate category.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5463773A",
        "US5640553A",
        "US5659742A",
        "US5675788A",
        "US5717914A",
        "US5721902A",
        "US5737734A",
        "US5742816A",
        "US5754939A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6021411A",
        "KR20000012520A",
        "US6044375A",
        "WO2000041090A1",
        "WO2000067161A2",
        "US6167397A",
        "US6175830B1",
        "US6182063B1",
        "US6182065B1",
        "US6195651B1",
        "US6195652B1",
        "US6199061B1",
        "US6236991B1",
        "US6236365B1",
        "US6243699B1",
        "WO2001040966A2",
        "EP1107124A2",
        "US6249252B1",
        "EP1120722A2",
        "US6272492B1",
        "EP1126712A2",
        "WO2001061571A2",
        "WO2001063465A1",
        "WO2001069428A1",
        "US6295533B2",
        "US20010025288A1",
        "WO2001075664A1",
        "US6304874B1",
        "US20010037334A1",
        "US6321224B1",
        "US6324534B1",
        "EP1158422A2",
        "US6330564B1",
        "US20020007373A1",
        "DE10038494A1",
        "EP1182580A1",
        "US20020026386A1",
        "US20020032740A1",
        "US20020035499A1",
        "US6363377B1",
        "US20020040311A1",
        "US20020040384A1",
        "US6370527B1",
        "US20020046157A1",
        "WO2002035316A2",
        "US20020052894A1",
        "US6385602B1",
        "US20020054092A1",
        "US20020055903A1",
        "WO2002041190A2",
        "US6401118B1",
        "US20020069134A1",
        "WO2002048921A1",
        "US20020083468A1",
        "US20020087987A1",
        "US20020087532A1",
        "US6418434B1",
        "US20020091836A1",
        "US20020103797A1",
        "US20020103788A1",
        "US20020107707A1",
        "US6442555B1",
        "US20020120604A1",
        "US20020133503A1",
        "US20020145623A1",
        "US20020152463A1",
        "US20020156830A1",
        "US20020156917A1",
        "US6473659B1",
        "US20020169770A1",
        "US20020194161A1",
        "US20020194178A1",
        "US6501469B1",
        "US20030004941A1",
        "US6507343B1",
        "WO2003005235A1",
        "EP1277117A1",
        "US20030018659A1",
        "US6517587B2",
        "US20030037038A1",
        "US20030050967A1",
        "US20030061013A1",
        "US20030061209A1",
        "US20030061161A1",
        "US6542888B2",
        "US6549940B1",
        "US20030074301A1",
        "US20030074352A1",
        "US6556225B1",
        "US20030091176A1",
        "US6567850B1",
        "US6567805B1",
        "US20030097312A1",
        "US20030120653A1",
        "US6594670B1",
        "US6593943B1",
        "US20030172063A1",
        "EP1345132A1",
        "US20030177111A1",
        "US6625595B1",
        "US6633903B1",
        "US6647396B2",
        "US20030217159A1",
        "US6654749B1",
        "KR100407081B1",
        "FR2840088A1",
        "US20040002993A1",
        "US6678694B1",
        "US20040020121A1",
        "US20040034650A1",
        "US6697799B1",
        "US6704729B1",
        "US20040049514A1",
        "US20040049496A1",
        "US20040054662A1",
        "US6711570B1",
        "US20040068514A1",
        "US20040068486A1",
        "US6721729B2",
        "US20040083213A1",
        "US6748376B1",
        "US20040111386A1",
        "US6754660B1",
        "US6760720B1",
        "US6760721B1",
        "US20040139426A1",
        "EP1459530A2",
        "US20040186824A1",
        "US20040186833A1",
        "US20040193870A1",
        "US6802042B2",
        "US20040220902A1",
        "US20040230564A1",
        "EP1482735A1",
        "US20040243627A1",
        "US20040243536A1",
        "US20040243494A1",
        "US6834276B1",
        "US20040260636A1",
        "US20040267717A1",
        "US6850906B1",
        "US20050027699A1",
        "US20050034070A1",
        "US20050044060A1",
        "US6868525B1",
        "US6871220B1",
        "US20050071310A1",
        "US6876997B1",
        "US20050076021A1",
        "US20050080770A1",
        "US20050096897A1",
        "US20050120006A1",
        "US6907424B1",
        "US20050132305A1",
        "US20050138656A1",
        "EP1548615A1",
        "US20050141028A1",
        "US6914625B1",
        "US20050149507A1",
        "US6920448B2",
        "WO2005066844A2",
        "US6924797B1",
        "US20050172010A1",
        "US20050177562A1",
        "US20050177555A1",
        "US20050187923A1",
        "US20050187976A1",
        "US6938046B2",
        "US20050198077A1",
        "US6944612B2",
        "US6957206B2",
        "US20050231610A1",
        "US20050234893A1",
        "US6963863B1",
        "US20050250439A1",
        "US20050248453A1",
        "US20050251496A1",
        "US20050261962A1",
        "US20050278207A1",
        "US6983288B1",
        "US6983270B2",
        "WO2005111868A3",
        "US6990482B1",
        "US20060031214A1",
        "US20060036581A1",
        "US7007018B1",
        "US7007008B2",
        "US20060059143A1",
        "US7016853B1",
        "US7016892B1",
        "WO2006033055A2",
        "US20060069699A1",
        "WO2006035196A1",
        "US7043492B1",
        "US7047229B2",
        "US20060122987A1",
        "US7062705B1",
        "US20060129540A1",
        "US20060129517A1",
        "US7076504B1",
        "US20060155694A1",
        "US7080059B1",
        "US20060167803A1",
        "US7085753B2",
        "WO2006082410A1",
        "US7103607B1",
        "US20060200422A1",
        "US20060242152A1",
        "US7134082B1",
        "US20060253462A1",
        "US7139973B1",
        "US20060265364A1",
        "US20070011159A1",
        "WO2007011129A1",
        "WO2007011140A1",
        "US20070027672A1",
        "US7181438B1",
        "US7194483B1",
        "US7203725B1",
        "US20070156651A1",
        "US20070156655A1",
        "US7249315B2",
        "US20070192272A1",
        "US20070192300A1",
        "US7262778B1",
        "US20070208740A1",
        "US7272604B1",
        "US7272597B2",
        "US20070219962A1",
        "US20070219964A1",
        "US20070226640A1",
        "US20070244922A1",
        "US20070244871A1",
        "US20070291923A1",
        "US7315848B2",
        "US20080005099A1",
        "US20080010251A1",
        "US20080010250A1",
        "US20080059485A1",
        "US20080065603A1",
        "WO2008034383A1",
        "US20080086452A1",
        "US7376709B1",
        "US7379949B2",
        "US20080132214A1",
        "US7386599B1",
        "US20080162533A1",
        "US7418410B2",
        "US20080215522A1",
        "US20080222561A1",
        "US20080228800A1",
        "US20080243777A1",
        "US7444660B2",
        "US20080306921A1",
        "US20080313159A1",
        "US7483918B2",
        "US7490092B2",
        "US7493301B2",
        "US20090089257A1",
        "US7516149B2",
        "US20090094205A1",
        "US7519605B2",
        "US20090099993A1",
        "US7536413B1",
        "US20090171983A1",
        "US20090177648A1",
        "US7571157B2",
        "US20090228825A1",
        "US7627588B1",
        "US7640336B1",
        "US20100030886A1",
        "US7672879B1",
        "US7672985B2",
        "US20100070473A1",
        "US20100083131A1",
        "US7698333B2",
        "US7707197B2",
        "US7711622B2",
        "US7714778B2",
        "US7725565B2",
        "US20100161660A1",
        "US20100158470A1",
        "US20100161580A1",
        "US20100169385A1",
        "US7752535B2",
        "US7764231B1",
        "US7765378B1",
        "US7769794B2",
        "US20100231533A1",
        "US7818314B2",
        "US7823077B2",
        "US20100293195A1",
        "US7853890B2",
        "US7856386B2",
        "US20110004462A1",
        "US20110025713A1",
        "US20110042824A1",
        "US7903029B2",
        "US20110113385A1",
        "US7966328B2",
        "US20110213783A1",
        "US8024335B2",
        "US20110238664A1",
        "US20110264657A1",
        "US8069407B1",
        "US8082096B2",
        "US8082355B1",
        "US20110313990A1",
        "US8121891B2",
        "US8127217B2",
        "US8135413B2",
        "US8190629B2",
        "US8195646B2",
        "WO2012109083A1",
        "USRE43633E1",
        "US8261334B2",
        "US8271484B1",
        "US8380875B1",
        "EP2563014A3",
        "US20130073586A1",
        "US8423541B1",
        "US8423555B2",
        "US8438487B1",
        "US8473532B1",
        "US8504561B2",
        "US8555359B2",
        "US20130290324A1",
        "US8589413B1",
        "US8595146B1",
        "US20130326060A1",
        "US8676695B2",
        "US8776222B2",
        "CN104050213A",
        "US8843469B2",
        "US8881040B2",
        "CN104169950A",
        "US8918649B2",
        "US8972342B2",
        "US9043352B1",
        "US9047386B2",
        "US9058395B2",
        "US9069443B2",
        "US9098881B2",
        "US9134398B2",
        "US20150331915A1",
        "US9235620B2",
        "US9239835B1",
        "US9245243B2",
        "US9275132B2",
        "US9323844B2",
        "US9348915B2",
        "AU2012378630B2",
        "US9443015B1",
        "US9477726B2",
        "US9529974B2",
        "US9538493B2",
        "US9575961B2",
        "US9805373B1",
        "US9858342B2",
        "US9875492B2",
        "US10019520B1",
        "USRE46973E1",
        "US10224026B2",
        "US10467289B2",
        "US10489044B2",
        "US10503347B2",
        "US10534783B1",
        "US10641861B2",
        "US10684350B2",
        "US10713312B2",
        "US10754905B2",
        "US10839021B2",
        "US20210233112A1",
        "US11226946B2",
        "US11321408B2",
        "CN113157996B",
        "US11544306B2"
    ],
    "citedby_ftf": [
        "GB2380577B",
        "EP1006467A3",
        "CA2288444A1",
        "JP2002539531A",
        "KR20000075203A",
        "AU6186200A",
        "US7734680B1",
        "JP2002063180A",
        "EP1256887A1",
        "AU785452B2",
        "AU2001290494A1",
        "AU2003246956A1",
        "WO2007028013A1",
        "US8024338B2",
        "US10223907B2",
        "US8694505B2",
        "JP6533876B2",
        "JP7067109B2"
    ]
}