{
    "patent_link": "https://patents.google.com/patent/US5594552A/en",
    "patent_id": "US5594552A",
    "title": "Apparatus and method for producing downwards compatible video signals with increased vertical resolution, and apparatus for reproducing and displaying same",
    "abstract": "Apparatus for deriving from a motion picture film for transfer to a video recording medium a video signal having increased vertical resolution for display using progressive scanning. In the apparatus, a deriving system derives the video signal from the motion picture film; a flag signal generating circuit generates a flag signal indicating that the video signal is for display using progressive scanning; and a recording system records the video signal and the flag signal in the recording medium. In a method of deriving from an interlaced high-definition video signal an interlaced standard-definition video signal having increased vertical resolution, the interlaced high-definition video signal is converted into a progressive high-definition video signal. The number of pixels in the progressive high-definition video signal is reduced to provide a progressive standard-definition video signal, which is converted into the interlaced standard-definition video signal. An apparatus for reproducing a video signal recorded on a recording medium includes a system for reproducing the video signal from the recording medium, and a circuit for extracting from the reproduced video signal a flag signal indicating a display scanning mode for the video signal. A display apparatus includes a circuit for receiving a flag signal indicating a display scanning mode for the video signal, and for generating a control signal; and a circuit, responsive to the control signal, for displaying the video signal in the display scanning mode.",
    "inventors": [
        "Yasushi Fujinami",
        "Jun Yonemitsu"
    ],
    "assignee": "Sony Corp",
    "classifications": [
        "H04N7/0125",
        "G11B27/031",
        "G11B27/032",
        "H04N19/40",
        "H04N19/85",
        "H04N5/9206",
        "H04N7/0112",
        "H04N7/012",
        "G11B2220/20",
        "G11B2220/90",
        "H04N5/775",
        "H04N5/91"
    ],
    "claims": "\n1. Apparatus for reproducing a video signal recorded on a recording medium, the apparatus comprising:\nreproducing means for reproducing the video signal from the recording medium; and\nextracting means for extracting from the video signal reproduced from the recording medium a flag signal indicating a scanning mode with which the video signal is to be displayed,\nwherein the flag signal indicates that the video signal is to be displayed using a progressive scanning mode\nand the apparatus further comprising:\ndisplay means for displaying a motion picture in response to the video signal reproduced by the reproducing means; and\nscanning means for scanning the display means in the scanning mode indicated by the flag signal, wherein\nthe video signal reproduced from the recording medium has a scanning mode different from the scanning mode indicated by the flag signal; and\nthe apparatus additionally comprises means, receiving the video signal reproduced from the recording medium, and operating in response to the flag signal, for converting the scanning mode of the video signal reproduced from the recording medium into the scanning mode indicated by the flag signal.\n2. The apparatus of claim 1, wherein:\nthe video signal recorded on the recording medium includes a table of contents containing the flag signal;\nthe reproducing means reproduces the video signal including the table of contents; and\nthe extracting means extracts the flag signal from the table of contents reproduced by the reproducing means.\n3. The apparatus of claim 1, wherein:\nthe video signal recorded on the recording medium is an MPEG-encoded video signal including a non-- interlace-- frame flag as the flag signal;\nthe reproducing means reproduces the MPEG-encoded video signal including the non-- interlace-- frame flag from the recording medium; and\nthe extracting means includes:\ndecoding means for decoding the MPEG-encoded signal to extract the video signal and the non-- interlace-- frame flag, and\nmeans for generating the flag signal in response to the non-- interlace-- frame flag extracted by the decoding means.\n4. Apparatus for reproducing a video signal recorded on a recording medium, the apparatus comprising:\nreproducing means for reproducing the video signal from the recording medium;\nextracting means for extracting from the video signal reproduced from the recording medium a flag signal indicating a scanning mode with which the video signal is to be displayed;\ndisplay means for displaying a motion picture in response to the video signal reproduced by the reproducing means; and\nscanning means for scanning the display means in the scanning mode indicated by the flag signal, wherein:\nthe video signal reproduced from the recording medium has a scanning mode different from the scanning mode indicated by the flag signal; and\nthe apparatus additionally comprises means, receiving the video signal reproduced from the recording medium, and operating in response to the flag signal, for converting the scanning mode of the video signal reproduced from the recording medium into the scanning mode indicated by the flag signal.\n5. Apparatus for reproducing a video signal recorded on a recording medium, the apparatus comprising:\nreproducing means for reproducing the video signal from the recording medium; and\nextracting means for extracting from the video signal reproduced from the recording medium a flag signal indicating a scanning mode with which the video signal is to be displayed\nwherein:\nthe video signal reproduced from the recording medium has a scanning mode different from the scanning mode indicated by the flag signal; and\nthe apparatus additionally comprises converting means, receiving the video signal reproduced from the recording medium, and operating in response to the flag signal, for converting the scanning mode of the video signal reproduced from the recording medium into the scanning mode indicated by the flag signal,\nthe input video signal reproduced from the recording medium being an interlaced, standard-definition video signal including plural frames, each of the frames including an odd field and an even field, each field including plural lines, and the flag signal indicating a scanning mode of a progressive video signal having a greater vertical resolution than a conventional interlaced, standard-definition video signal having an equal number of lines, the converting means including:\na first odd field memory and a first even field memory,\nmeans for writing the odd field of each one of the frames of the input video signal into the first odd field memory and for writing the even field of the one of the frames of the input video signal into the first even field memory;\nmeans for feeding the odd lines of each one of the frames of the progressive video signal from the first odd field memory, and for feeding the even lines of the one of the frames of the progressive video signal from the first even field memory.\n6. The apparatus of claim 5, the input video signal reproduced from the recording medium being an interlaced, standard-definition video signal including plural frames, each of the frames including an odd field and an even field, each field including plural lines, and the flag signal indicating a scanning mode of a progressive video signal having a greater vertical resolution than a conventional interlaced, standard-definition video signal having an equal number of lines, the converting means including:\na first odd field memory and a first even field memory,\nmeans for writing the odd field of each one of the frames of the input video signal into the first odd field memory and for writing the even field of the one of the frames of the input video signal into the first even field memory;\nmeans for feeding the odd lines of each one of the frames of the progressive video signal from the first odd field memory, and for feeding the even lines of the one of the frames of the progressive video signal from the first even field memory.\n7. Apparatus for displaying a motion picture in response to a video signal, the video signal having a scanning mode, the apparatus comprising:\nreceiving means for receiving a flag signal indicating a scanning mode in which the video signal is to be displayed, and for providing a control signal indicating the scanning mode in which the video signal is to be displayed; and\nmeans, responsive to the video signal and the control signal, for displaying the motion picture in the scanning mode in which the video signal is to be displayed, wherein:\nthe video signal has a scanning mode different from the scanning mode in which the video signal is to be displayed;\nthe apparatus additionally comprises means, receiving the video signal and responsive to the control signal, for converting the scanning mode of the video signal to provide a scan-converted video signal having the scanning mode in which the video signal is to be displayed; and\ndisplay means for displaying the motion picture in response to the scan-converted video signal.\n8. Apparatus for displaying a motion picture in response to a video signal, the video signal having a scanning mode, the apparatus comprising:\nreceiving means for receiving a flag signal indicating a scanning mode in which the video signal is to be displayed, and for providing a control signal indicating the scanning mode in which the video signal is to be displayed; and\nmeans, responsive to the video signal and the control signal, foe displaying the motion picture in the scanning mode in which the video signal is to be displayed, wherein:\nthe means for displaying the motion picture comprises:\ndisplay means for displaying the motion picture in response to the video signal; and\nscanning means for scanning the display means in a scanning mode determined by the control signal,\nthe video signal has a scanning mode different from the scanning mode in which the video signal is to be displayed; and\nthe apparatus additionally comprises converting means, receiving the video signal and responsive to the control signal, for converting the scanning mode of the video signal to provide a scan-converted video signal having the scanning mode in which the video signal is to be displayed;\nthe display means displays the motion picture in response to the scan-converted video signal.\n9. The apparatus of claim 8, the video signal being an interlaced, standard-definition video signal including plural frames, each of the frames including an odd field and an even field, each field including plural lines, and the flag signal indicating a scanning mode of a progressive video signal having a greater vertical resolution than a conventional interlaced, standard-definition video signal having an equal number of lines, the converting means including:\na first odd field memory and a first even field memory,\nmeans for writing the odd field of each one of the frames of the input video signal into the first odd field memory and for writing the even field of the one of the frames of the input video signal into the first even field memory;\nmeans for feeding the odd lines of each one of the frames of the progressive video signal from the first odd field memory, and for feeding the even lines of the one of the frames of the progressive video signal from the first even field memory,\nwherein the display means displays the motion picture in response to the progressive video signal.\n10. Apparatus for displaying a motion picture in response to a video signal, the video signal having a scanning mode, the apparatus comprising:\nreceiving means for receiving a flag signal indicating a scanning mode in which the video signal is to be displayed, and for providing a control signal indicating the scanning mode in which the video signal is to be displayed; and\nmeans, responsive to the video signal and the control signal, for displaying the motion picture in the scanning mode in which the video signal is to be displayed, wherein:\nthe scanning mode of the video signal is interlaced scanning; and\nthe scanning mode in which the video signal is to be displayed is progressive scanning.\n11. The apparatus of claim 10, wherein:\nthe apparatus additionally comprises means, receiving the video signal and responsive to the control signal, for converting the scanning mode of the video signal to provide a scan-converted video signal having the scanning mode in which the video signal is to be displayed; and\nthe means for displaying the motion picture displays the motion picture in response to the scan-converted video signal.\n12. The apparatus of claim 10, wherein the means for displaying the motion picture comprises:\ndisplay means for displaying the motion picture in response to the video signal; and\nscanning means for scanning the display means in a scanning mode determined by the control signal.\n13. The apparatus of claim 12, wherein:\nthe video signal has a scanning mode different from the scanning mode in which the video signal is to be displayed; and\nthe apparatus additionally comprises means, receiving the video signal and responsive to the control signal, for converting the scanning mode of the video signal to provide a scan-converted video signal having the scanning mode in which the video signal is to be displayed;\nthe display means displays the motion picture in response to the scan-converted video signal.\n14. The apparatus of claim 10, wherein:\nthe video signal is reproduced from a recording medium; and\nthe receiving means receives the flag signal reproduced from the recording medium.\n15. The apparatus of claim 14, wherein:\nthe video signal includes a table of contents including the flag signal; and\nthe receiving means is for receiving the table of contents and for generating the control signal in response to the flag signal in the table of contents.\n16. The apparatus of claim 14, wherein:\nthe video signal is a component of an MPEG-encoded signal including a non-- interlace-- frame flag as the flag signal;\nthe receiving means includes:\nmeans for receiving the MPEG-encoded signal, and\nmeans for decoding the video signal from the MPEG-encoded signal; and\nthe receiving means provides the control signal in response to the non-- interlace-- frame flag.\n17. Apparatus for reproducing a video signal recorded on a recording medium, the apparatus comprising:\nreproducing means for reproducing the video signal from the recording medium; and\nextracting means for extracting from the video signal reproduced from the recording medium a flag signal indicating a scanning mode with which the video signal is to be displayed,\nwherein:\nthe flag signal indicates that the video signal is to be displayed using a progressive scanning mode, and\nthe video signal reproduced from the recording medium has a scanning mode different from the scanning mode indicated by the flag signal; and\nthe apparatus additionally comprises convening means, receiving the video signal reproduced from the recording medium, and operating in response to the flag signal, for convening the scanning mode of the video signal reproduced from the recording medium into the scanning mode indicated by the flag signal.\n18. The apparatus of claim 17, wherein:\nthe video signal recorded on the recording medium includes a table of contents containing the flag signal;\nthe reproducing means reproduces the video signal including the table of contents; and\nthe extracting means extracts the flag signal from the table of contents reproduced by the reproducing means.\n19. The apparatus of claim 17, wherein:\nthe video signal recorded on the recording medium is an MPEG-encoded video signal including a non-- interlace-- frame flag as the flag signal;\nthe reproducing means reproduces the MPEG-encoded video signal including the non-- interlace-- frame flag from the recording medium; and\nthe extracting means includes:\ndecoding means for decoding the MPEG-encoded signal to extract the video signal and the non-- interlace-- frame flag, and\nmeans for generating the flag signal in response to the non-- interlace-- frame flag extracted by the decoding means.\n20. The apparatus of claim 19, additionally comprising:\ndisplay means for displaying a motion picture in response to the video signal reproduced by the reproducing means; and\nscanning means for scanning the display means in the scanning mode indicated by the flag signal.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4496997A",
        "US4837626A",
        "US5122885A",
        "US5305113A"
    ],
    "citations_ftf": [
        "US4641188A",
        "US4881125A",
        "US4982280A",
        "US5049993A",
        "GB2249899B",
        "AU8905591A",
        "DE69206833T2",
        "US5170251A"
    ],
    "citedby_own": [
        "US5757435A",
        "US5841512A",
        "US5881205A",
        "EP0917361A1",
        "EP0962936A2",
        "US6011900A",
        "EP1050162A1",
        "US6222589B1",
        "US6327306B1",
        "US6385240B2",
        "US6392691B1",
        "US6400895B1",
        "US6418273B1",
        "US6434319B1",
        "US6437787B1",
        "US6441813B1",
        "US20030035645A1",
        "US20030043344A1",
        "US20030048419A1",
        "US6535688B1",
        "USRE38079E1",
        "US20030093800A1",
        "US6670996B2",
        "US20040263688A1",
        "EP1443761A3",
        "US6873368B1",
        "US20060023084A1"
    ],
    "citedby_ftf": [
        "DE69427054T2",
        "US5963154A",
        "EP0710033A3",
        "JP3608582B2",
        "EP0847199B1",
        "TW303569B",
        "US5818530A",
        "JPH1079915A",
        "US6069664A",
        "DE19742183A1",
        "US6108041A",
        "US6014182A",
        "AU767848B2",
        "US6124893A",
        "US6356921B1",
        "US6230162B1",
        "JP3821415B2",
        "US6448980B1",
        "US6229852B1",
        "US6658056B1",
        "JP2003514460A",
        "US8429699B2",
        "US6940911B2",
        "US20030190144A1",
        "EP1299796A1",
        "TW488163B",
        "CN1299501C",
        "JP2002185980A",
        "JP3921680B2",
        "US7057627B2",
        "US7020197B2",
        "US6707984B2",
        "US7274857B2",
        "US7428008B2",
        "JP2003289512A",
        "WO2004028160A1",
        "KR100376060B1",
        "KR100548440B1",
        "US7970056B2",
        "US7966642B2",
        "US20050106362A1",
        "WO2005104543A1",
        "US8600217B2",
        "US8300696B2",
        "US9998750B2"
    ]
}