{
    "patent_id": "US-11750538-B2",
    "title": "System and method for chatbot generation and implementation ",
    "assignee": "Smartbothub, Inc.",
    "publication_date": "2023-09-05",
    "patent_link": "https://patents.google.com/patent/US11750538B2/en",
    "inventors": [
        "Alkarim “Al” Lalji",
        "Andrew Alan Wells"
    ],
    "classifications": [
        "H04L51/02",
        "G06F40/30",
        "G06N20/00",
        "G06N3/006",
        "H04L63/083",
        "H04L67/53"
    ],
    "abstract": "The flexibility of a communication with a chatbot can be increased using a chatbot platform that can be integrated with a plurality of chat channels as well as facilitate communication between users of different chat channels. The platform can host chatbots that can leverage a plurality of resources, including internal and external natural language processors, machine learning, analytics services, and third party services to generate a response to user communications and take actions on behalf of the user. The use of the natural language processing and other additional information allows to generate an appropriate response to user queries, and to thus increase the speed with which user concerns are address. Further, the platform includes a chatbot creation program that allows a quick way to create a large number of customized chatbots without requiring advanced programming skills from the chatbot creator.",
    "claims": "\n1. A system for chatbot generation and implementation, comprising:\na platform comprising a plurality of servers and configured to communicate with a plurality of chat channels, each of the servers comprising a processor and memory, the platform configured to:\nprovide a user interface for generating a chatbot;\nreceive via the user interface data comprising a name of the chatbot, a workflow associated with the chatbot, a selection of the chat channels with which the chatbot is to be registered, and chat channel configuration preferences comprising a representation of the chatbot within each of the selected chat channels and elements of a further user interface to be used in each of the selected channels;\ngenerate the chatbot based on the received data;\nassign one of the servers comprised in the platform as an endpoint associated with the chatbot at which communications directed to the chatbot are received and from which response communications from the chatbot are sent;\nregister the chatbot with the selected chat channels based on the configuration preferences comprising providing to the selected chat channels an address of the endpoint server and a portion of the received data;\nreceive at the end point server the communications via at least some of the selected chat channels, generate the response communications using the workflow associated with the chatbot based on at least one of the communications, and provide the response communications from the endpoint server via at least some of the selected chat channels, wherein each response communication is provided via the same chat channel via which the at least one communication on which that response communication was based is received.\n2. A system according to claim 1, wherein the data further comprises a selection of one or more modules, each of the modules associated with a functionality of the chatbot, and the chatbot is generated to comprise the selected modules.\n3. A system according to claim 1, wherein the data further includes an image associated with the chatbot and a description of the chatbot.\n4. A system according to claim 1, wherein the chatbot comprises one or more application programming interfaces (APIs) communicating with third party services and the chat channel configuration preferences comprise whether additional APIs can be called via each of the selected chat channels.\n5. A system according to claim 1, the platform further configured to generate credentials for the chatbot, the credentials comprising an identifier of the chatbot and a password for making changes to the chatbot.\n6. A system according to claim 1, the endpoint server configured to:\nretrieve metadata necessary for operation of the chatbot;\nlog into one or more third party services necessary for an execution of the workflow; and\nstore persistent data generated by the chatbot into a persistent data storage.\n7. A system according to claim 6, wherein the metadata comprises one or more of an address of a natural language processor employed by the chatbot and a token necessary for logging into the third party service.\n8. A system according to claim 7, wherein the endpoint server is further configured to send a request for the token to a token service outside the platform, to provide a request to log-in into the third party service and the token to a log-in service, and to receive a further token confirming that the chatbot has logged into the third party service from the log-in service.\n9. A system according to claim 1, the platform further configured to assign a classification to a user associated with or more of the communications, wherein the response communications directed to that user are generated using the workflow based on the classification.\n10. A system according to claim 9, wherein the classification is assigned based on at least one of the one or more communications associated with that user and data about the user obtained from an analytics service.\n11. A method for chatbot generation and implementation, comprising:\nproviding by a platform a user interface for generating a chatbot, the platform comprising a plurality of servers and configured to communicate with a plurality of chat channels;\nreceiving by the platform via the user interface data comprising a name of the chatbot, a workflow associated with the chatbot, a selection of the chat channels with which the chatbot is to be registered, and chat channel configuration preferences comprising a representation of the chatbot within each of the selected chat channels and elements of a further user interface to be used in each of the selected channels;\ngenerating by the platform the chatbot based on the received data;\nassigning by the platform one of the servers comprised in the platform as an endpoint associated with the chatbot at which communications directed to the chatbot are received and from which response communications from the chatbot are sent;\nregistering by the platform the chatbot with the selected chat channels based on the configuration preferences comprising providing to the selected chat channels an address of the endpoint server and a portion of the received data;\nreceiving by the platform at the end point server the communications via at least some of the selected chat channels, generating by the platform the response communications using the workflow associated with the chatbot based on at least one of the communications, and providing by the platform the response communications from the endpoint server via at least some of the selected chat channels, wherein each response communication is provided via the same chat channel via which the at least one communication on which that response communication was based is received.\n12. A method according to claim 11, wherein the data further comprises a selection of one or more modules, each of the modules associated with a functionality of the chatbot, and the chatbot is generated to comprise the selected modules.\n13. A method according to claim 11, wherein the data further includes an image associated with the chatbot and a description of the chatbot.\n14. A method according to claim 11, wherein the chatbot comprises one or more application programming interfaces (APIs) communicating with third party services and the chat channel configuration preferences comprise whether additional APIs can be called via each of the selected chat channels.\n15. A method according to claim 11, further comprising generating by the platform credentials for the chatbot, the credentials comprising an identifier of the chatbot and a password for making changes to the chatbot.\n16. A method according to claim 11, further comprising:\nretrieving by the endpoint server metadata necessary for operation of the chatbot;\nlogging into one or more third party services necessary for an execution of the workflow by the endpoint server; and\nstoring by the endpoint server persistent data generated by the chatbot into a persistent data storage.\n17. A method according to claim 16, wherein the metadata comprises one or more of an address of a natural language processor employed by the chatbot and a token necessary for logging into the third party service.\n18. A method according to claim 17, further comprising:\nsending by the endpoint server a request for the token to a token service outside the platform;\nproviding by the endpoint server a request to log-in into the third party service and the token to a log-in service; and\nreceiving by the endpoint server a further token confirming that the chatbot has logged into the third party service from the log-in service.\n19. A method according to claim 11, further comprising:\nassigning by the platform a classification to a user associated with or more of the communications, wherein the response communications directed to that user are generated using the workflow based on the classification.\n20. A method according to claim 19, wherein the classification is assigned based on at least one of the one or more communications associated with that user and data about the user obtained from an analytics service.",
    "status": "Active",
    "citations_own": [
        "US20120041903A1",
        "US20160021039A1",
        "US20160094507A1"
    ],
    "citations_ftf": [
        "GB0004178D0",
        "US20120260263A1",
        "US9769216B2",
        "WO2015126954A1",
        "US20150350436A1",
        "US10706432B2",
        "US10356567B2",
        "WO2016154603A1",
        "US9647968B2",
        "US10452816B2",
        "US10587708B2"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US11087410B2",
        "US10225216B2",
        "US11128579B2",
        "US20180131642A1",
        "US10474673B2",
        "CN109416695B",
        "US11018998B1",
        "US11394667B2",
        "US20190103111A1",
        "US10698581B2",
        "US10776411B2",
        "US11144811B2",
        "WO2019100319A1",
        "US20190180206A1",
        "US11200506B2",
        "CN109962834B",
        "US10771407B2",
        "US11080485B2",
        "US20190268288A1",
        "KR102574593B1",
        "US10594635B2",
        "US10148601B1",
        "KR102060486B1",
        "US11189267B2",
        "US11164065B2",
        "US11461863B2",
        "US11081113B2",
        "US11379770B2",
        "US10659400B2",
        "US11240224B2",
        "US20200142719A1",
        "US11416785B2",
        "US11455151B2",
        "JP6712039B1",
        "US11121987B1",
        "US10878008B1",
        "US10929781B1",
        "US11329932B2",
        "US11423235B2",
        "US11394668B1",
        "US11356390B1"
    ]
}