{
    "patent_id": "US-11716347-B2",
    "title": "Malicious site detection for a cyber threat response system ",
    "assignee": "Darktrace Holdings Limited",
    "publication_date": "2023-08-01",
    "patent_link": "https://patents.google.com/patent/US11716347B2/en",
    "inventors": [
        "John Anthony Boyer",
        "Matthew Dunn"
    ],
    "classifications": [
        "H04L63/1441",
        "G06F16/2455",
        "G06F18/23",
        "G06F18/232",
        "G06F21/36",
        "G06F21/554",
        "G06F21/556",
        "G06F3/04842",
        "G06F3/0486",
        "G06F40/40",
        "G06N20/00",
        "G06N20/10",
        "G06V30/10",
        "H04L41/22",
        "H04L43/045",
        "H04L51/212",
        "H04L51/224",
        "H04L51/42",
        "H04L63/0209",
        "H04L63/0428",
        "H04L63/101",
        "H04L63/14",
        "H04L63/1416",
        "H04L63/1425",
        "H04L63/1433",
        "H04L63/1483",
        "H04L63/20",
        "H04L67/12",
        "G06N20/20",
        "H04L51/18"
    ],
    "abstract": "The cyber security appliance can have at least the following components. A phishing site detector that has a segmentation module to break up an image of a page of a site under analysis into multiple segments and then analyze each segment of the image to determine visually whether a key text-like feature exists in that segment. A signature creator creates a digital signature for each segment containing a particular key text-like feature. The digital signature for that segment is indicative of a visual appearance of the particular key text-like feature. Trained AI models compare digital signatures from a set of key text-like features detected in the image of that page under analysis to digital signatures of a set of key text-like features from known bad phishing sites in order to output a likelihood of maliciousness of the unknown site under analysis.",
    "claims": "\n1. A cyber security appliance, comprising:\none or more memory storage devices;\none or more processors, coupled to the one or more memory storage devices, the one or more processors configured to cause:\na phishing site detector having a segmentation module to break up an image of a page of a site under analysis into multiple segments, transform each segment of the multiple segments into a fixed rendered size, and analyze each transformed segment of the multiple segments of the image of the page to determine visually whether a key text-like feature exists in each transformed segment of the multiple segments;\na signature creator to create a digital signature for each transformed segment containing a particular key text-like feature, wherein the digital signature for the transformed segment containing the particular key text-like feature is at least indicative of a visual appearance of the particular key text-like feature;\na trained AI model to compare digital signatures from a first set of key text-like features detected in the image of the page from an unknown site under analysis to digital signatures of a second set of key text-like features from a plurality of known bad phishing sites to output a likelihood of maliciousness of the unknown site under analysis;\nwherein the segmentation module is configured to use a machine learning algorithm for breaking up and segmenting the image of the site under analysis, and wherein the machine learning algorithm is implemented in Neural Networks, where when any software instructions are implemented in the cyber security appliance, then the software instructions are stored in an executable form in the one or more memories and are configured to be executed by the one or more processors.\n2. The cyber security appliance of claim 1, wherein the phishing site detector has a categorizing module to use a blended approach to analyze at least a first transformed segment of the multiple segments in the image determined to have a first key text-like feature via i) OCR text recognition and with ii) analysis of a literal visual representation from the image of that page under analysis to determine what does the first key text-like feature on the page visually look like, and then iii) use both of resulting text from the OCR text recognition and the visual appearance of the key text-like feature to determine a category that the first key text-like feature in the first transformed segment of the multiple segments of the image of the page under analysis belongs to, wherein the image of the page of the unknown site under analysis is a page that harvests log-in credentials for the unknown site.\n3. The cyber security appliance of claim 1, wherein the trained AI model is trained to compare i) one or more key text-like features from the first set of key text-like features detected in the image under analysis in a particular category of features to ii) digital signatures in the same category for key text-like features from the second set of key text-like features from the known bad phishing sites stored in a library of digital signatures.\n4. The cyber security appliance of claim 3, wherein the phishing site detector includes an autonomous response module configured to, upon a determination that enough key text-like features from the first set of key text-like features closely match digital signatures in the second set of key text-like features from known bad phishing sites, lock out a user's ability to access the unknown site under analysis, and generate a notice to the user that the unknown site is likely a malicious phishing site.\n5. The cyber security appliance of claim 1, wherein the segmentation module is configured to detect the first set of key text-like features in the multiple segments of the image and determine coordinates around each key text-like feature.\n6. The cyber security appliance of claim 5, wherein the machine learning algorithm implemented in the Neural Networks is configured to analyze the image to look for specific key features that appear text-like, including any of actual text and logos on the image of the page under analysis, by detecting gradients in color change in one or more areas and a ratio to a background color to establish a beginning and an end of each specific key feature that appears text-like, wherein these key text-like features will then have a bounding box formed around the coordinates of each key text-like feature.\n7. The cyber security appliance of claim 6, wherein the phishing site detector includes a categorizing module to perform OCR text analysis on a first key text-like feature in the first set of key text-like features and an analysis of a literal visual representation on the first key text-like feature to determine the meaning the first key text-like feature is trying to convey to help catalog the first key text-like feature for a comparison, wherein each key text-like feature has its own bounding box.\n8. The cyber security appliance of claim 1, wherein the trained AI model is configured to compare the digital signatures from the first set of key text-like features detected in the unknown site under analysis to the digital signatures of the second set of key text-like features of known bad phishing sites, wherein each key text-like feature is compared to another key text-like feature in that same category, to output the likelihood of maliciousness of the unknown site under analysis, wherein the page is a login page of the site under analysis.\n9. The cyber security appliance of claim 1, wherein the trained AI model is configured to compare the digital signatures from the first set of key text-like features detected in the unknown site under analysis to the digital signatures of the second set of key text-like features of known bad phishing sites, wherein the phishing site detector includes has an access module that is configured to access, when an email under analysis is checked, a link in the email to capture the image of at least a login page associated with the unknown site accessed through the link.\n10. The cyber security appliance of claim 9, wherein the access module is further configured to capture one or more screenshots of the page of the unknown site under analysis to create the image of at least the login page and feed the one or more screenshots to the segmentation module.\n11. A method for a cyber security appliance, comprising:\nbreaking up an image of a page of a site under analysis into multiple segments, transforming each segment of the multiple segments into a fixed rendered size, and analyzing each transformed segment of the multiple segments of the image of the page to determine visually whether a key text-like feature exists in each transformed segment of the multiple segments;\ncreating a digital signature for each transformed segment containing a particular key text-like feature, wherein the digital signature for the transformed segment containing the particular key text-like feature is at least indicative of a visual appearance of the particular key text-like feature;\ncomparing digital signatures from a first set of key text-like features detected in the image of that page of an unknown site under analysis to digital signatures of a second set of key text-like features from a plurality of known bad phishing sites to output a likelihood of maliciousness of the unknown site under analysis;\nwherein a machine learning algorithm is used for breaking up and segmenting the image of the unknown site under analysis, and wherein the machine learning algorithm is implemented in Neural Networks, where when any software instructions are implemented in the cyber security appliance, then the software instructions are stored in an executable form in one or more memories and are configured to be executed by one or more processors.\n12. The method for the cyber security appliance of claim 11, further comprising:\nusing a blended approach to analyze at least a first transformed segment of the multiple segments in the image determined to have a first key text-like feature via i) OCR text recognition and with ii) analysis of a literal visual representation from the image of that page under analysis to determine what does the first key text-like feature on the page visually look like, and then iii) use both of resulting text from the OCR text recognition and the visual appearance of the key text-like feature to determine a category that the first key text-like feature in the first transformed segment of the multiple segments of the image of the page under analysis belongs to, wherein the image of the page of the unknown site under analysis is a log-in page for the unknown site.\n13. The method for the cyber security appliance of claim 11, further comprising:\ncomparing i) one or more key text-like features from the first set of key text-like features detected in the image under analysis in a particular category of features to ii) digital signatures in the same category for key text-like features from the second set of key text-like features from the known bad phishing sites stored in a library of digital signatures.\n14. The method for the cyber security appliance of claim 13, further comprising:\nautonomously responding, upon a determination that enough key text-like features from the first set of key text-like features closely match digital signatures in the second set of key text-like features from known bad phishing sites, by locking out a user's ability to access the unknown site under analysis, and generate a notice to the user that the unknown site is likely a malicious phishing site.\n15. The method for the cyber security appliance of claim 11, further comprising: detecting the first set of key text-like features in the multiple segments of the image, and determining coordinates around each key text-like feature.\n16. The method for the cyber security appliance of claim 15, wherein the machine learning algorithm is configured to analyze the image to look for specific key features that appear text-like, including any of actual text and logos on the image of the page under analysis, by detecting gradients in color change in one or more areas and a ratio to a background color to establish a beginning and an end of each specific key feature that appears text-like, wherein these key text-like features will then have a bounding box formed around the coordinates of each key text-like feature.\n17. The method for the cyber security appliance of claim 16, further comprising:\nperforming OCR text analysis on a first key text-like feature in the first set of key text-like features and an analysis of a literal visual representation on the first key text-like feature to determine the meaning the first key text-like feature is trying to convey to help catalog the first key text-like feature for a comparison, wherein each key text-like feature has its own bounding box.\n18. The method for the cyber security appliance of claim 11, further comprising:\ncomparing the digital signatures from the first set of key text-like features detected in the unknown site under analysis to the digital signatures of the second set of key text-like features of known bad phishing sites, wherein each key text-like feature is compared to another key text-like feature in that same category, to output the likelihood of maliciousness of the unknown site under analysis, wherein the page is a login page of the site under analysis, and wherein the comparison uses an L2 norm.\n19. The method for the cyber security appliance of claim 11, further comprising:\ncomparing the digital signatures from the first set of key text-like features detected in the unknown site under analysis to the digital signatures of the second set of key text-like features of known bad phishing sites; and\naccessing, when an email under analysis is checked, a link in the email to capture the image of at least a login page associated with the unknown site accessed through the link.\n20. The method for the cyber security appliance of claim 19, further comprising:\ncapturing one or more screenshots of the page of the unknown site under analysis to create the image of at least the login page and feeding the one or more screenshots for segmentation.",
    "status": "Active",
    "citations_own": [
        "US6154844A",
        "WO2001031420A2",
        "US20020174217A1",
        "US20020186698A1",
        "US20030070003A1",
        "US20040083129A1",
        "US20040167893A1",
        "US20050065754A1",
        "US6965968B1",
        "US20070118909A1",
        "US7307999B1",
        "US20070294187A1",
        "US20080002893A1",
        "US20080005137A1",
        "US20080002916A1",
        "US20080077358A1",
        "US20080109730A1",
        "US7418731B2",
        "WO2008121945A2",
        "US7448084B1",
        "US20090106174A1",
        "US20090220166A1",
        "US20090254971A1",
        "US20100009357A1",
        "US20100095374A1",
        "US20100107254A1",
        "US20100125908A1",
        "US20100235908A1",
        "US20100239163A1",
        "US20100299292A1",
        "US7890869B1",
        "US20110093428A1",
        "US20110213742A1",
        "US20110261710A1",
        "US20120096549A1",
        "US20120137367A1",
        "US8220047B1",
        "US20120210388A1",
        "US20120209575A1",
        "US8306332B2",
        "US20120284791A1",
        "US8312540B1",
        "US20120304288A1",
        "US8356076B1",
        "US20130091539A1",
        "WO2013053407A1",
        "US20130198840A1",
        "US20130198119A1",
        "US20130254885A1",
        "US8661538B2",
        "US20140074762A1",
        "WO2014088912A1",
        "US20140165207A1",
        "US20140215618A1",
        "US8806622B2",
        "US8819803B1",
        "US20140325643A1",
        "US8879803B2",
        "US20150033340A1",
        "US8966036B1",
        "WO2015027828A1",
        "US20150067835A1",
        "US20150081431A1",
        "US9043905B1",
        "US20150161394A1",
        "US20150163121A1",
        "US20150172300A1",
        "US20150180893A1",
        "US20150213358A1",
        "US9106687B1",
        "EP2922268A1",
        "US20150286819A1",
        "US20150310195A1",
        "US20150319185A1",
        "US9185095B1",
        "US20150341379A1",
        "US9213990B2",
        "US20150363699A1",
        "US20150379110A1",
        "WO2016020660A1",
        "US20160062950A1",
        "US9348742B1",
        "US20160149941A1",
        "US20160164902A1",
        "US20160173509A1",
        "US9401925B1",
        "US20160241576A1",
        "US20160337401A1",
        "US9516053B1",
        "US9516039B1",
        "US20160359695A1",
        "US20160373476A1",
        "US20170054745A1",
        "US9641544B1",
        "US20170169360A1",
        "US9712548B2",
        "US9727723B1",
        "US20170270422A1",
        "US20180027006A1",
        "US20180167402A1",
        "US20180300855A1",
        "US20190019020A1",
        "US20190036948A1",
        "US20190044963A1",
        "US10237298B1",
        "US20190114743A1",
        "US10419466B2",
        "US20190334947A1",
        "US10516693B2",
        "US20200067861A1",
        "US10701093B2",
        "US20200244673A1",
        "WO2020183267A1",
        "US10834128B1",
        "US10997463B2",
        "US20210273958A1",
        "US11301560B2",
        "US20220150279A1",
        "US11388193B2"
    ],
    "citations_ftf": [
        "US7159237B2",
        "US20020138636A1",
        "US7657935B2",
        "US20030084349A1",
        "US7246156B2",
        "GB0410180D0",
        "US7490356B2",
        "GB2416879B",
        "US9160755B2",
        "US20060190419A1",
        "US20080229415A1",
        "US8438643B2",
        "US8903920B1",
        "US20070169021A1",
        "US8266697B2",
        "US7530105B2",
        "US7890612B2",
        "US8799448B2",
        "US20100287246A1",
        "US8707431B2",
        "US20090293121A1",
        "US20100043066A1",
        "US8631081B2",
        "US20100192222A1",
        "US20100205136A1",
        "JP2011090442A",
        "US8924569B2",
        "JP2011180869A",
        "WO2012009678A1",
        "US9215244B2",
        "US9552470B2",
        "US10404729B2",
        "WO2012109633A2",
        "US20130247192A1",
        "US8688601B2",
        "US20120311562A1",
        "US8452871B2",
        "US8776241B2",
        "US20140189870A1",
        "US9106691B1",
        "US8712921B2",
        "US10616272B2",
        "US8973147B2",
        "US9178995B2",
        "US9418083B2",
        "US9503463B2",
        "US20130332194A1",
        "US9049235B2",
        "JP5344654B2",
        "US9258321B2",
        "US11126720B2",
        "US9146895B2",
        "US8566938B1",
        "US9165250B2",
        "US20140259095A1",
        "US20140259171A1",
        "US9773405B2",
        "US9965937B2",
        "US9413781B2",
        "US9736147B1",
        "IL226747B",
        "US9142102B2",
        "US8966074B1",
        "CN105556526B",
        "EP4221076A3",
        "US9578052B2",
        "US9692789B2",
        "US9830450B2",
        "US20150188949A1",
        "US9565208B2",
        "US9749344B2",
        "US10419457B2",
        "US9367694B2",
        "US10496927B2",
        "WO2015191052A1",
        "US10447733B2",
        "US10452992B2",
        "US9565204B2",
        "US9118714B1",
        "US10049222B1",
        "US9773112B1",
        "US10505825B1",
        "US10592093B2",
        "US9754106B2",
        "US9473504B2",
        "IL235423A0",
        "US9210185B1",
        "US9584536B2",
        "US9917860B2",
        "US10050868B2",
        "US9800605B2",
        "US10021125B2",
        "US20160182544A1",
        "US10412106B2",
        "EP3065076A1",
        "US9762585B2",
        "CN107409436B",
        "US9749310B2",
        "US9367877B1",
        "US9906539B2",
        "US10476753B2",
        "US10225268B2",
        "US9836598B2",
        "US20160308898A1",
        "US20160314447A1",
        "EP3311301B1",
        "US20160381049A1",
        "US9825986B1",
        "US9729571B1",
        "US9516052B1",
        "US9756067B2",
        "US10193919B2",
        "IN2015CH04673A",
        "US10902114B1",
        "US10148679B2",
        "US10630706B2",
        "US10594714B2",
        "US11089045B2",
        "US10320827B2",
        "US11184401B2",
        "US10326772B2",
        "EP3387517A4",
        "EP3387814A1",
        "US10050998B1",
        "US9717101B1",
        "US10394802B1",
        "US10148686B2",
        "US10552615B2",
        "US9467401B1",
        "US10536478B2",
        "WO2017160913A1",
        "US10313382B2",
        "CN109154965B",
        "US20210157312A1",
        "US20170329972A1",
        "US10686792B1",
        "CA2968710A1",
        "US10498605B2",
        "US20170353475A1",
        "US10270788B2",
        "US11038925B2",
        "US10032361B2",
        "US20170374076A1",
        "US10135705B2",
        "US10324609B2",
        "US20180034837A1",
        "US20180077190A1",
        "US10567415B2",
        "US10496831B2",
        "US11238350B2",
        "US10425442B2",
        "US10673880B1",
        "US11049039B2",
        "US10445523B2",
        "US10530749B1",
        "US10977316B2",
        "US10366219B2",
        "US10298605B2",
        "US11722513B2",
        "US10348758B1",
        "US10397257B2",
        "US10204226B2",
        "US10699181B2",
        "US10699012B2",
        "US20180234302A1",
        "US10505953B2",
        "US11277420B2",
        "US20180255076A1",
        "US10922716B2",
        "US10050987B1",
        "US10362046B1",
        "RU2670030C2",
        "US10979455B2",
        "US10880332B2",
        "US10476902B2",
        "US20180314833A1",
        "US10367839B2",
        "US11032307B2",
        "US20180324207A1",
        "US10778702B1",
        "US10623431B2",
        "US10554669B2",
        "US10983753B2",
        "US20180367561A1",
        "JP6906700B2",
        "US20190014149A1",
        "US11343276B2",
        "US10181032B1",
        "US10574696B2",
        "US10212043B1",
        "IL254573A0",
        "WO2019051507A1",
        "US10476912B2",
        "US10693758B2",
        "US10713365B2",
        "US10574676B2",
        "CN111373376A",
        "US10812499B2",
        "CN108055256A",
        "US11132660B2",
        "US10681064B2",
        "US10686830B2",
        "US10740568B2",
        "US11036715B2",
        "US10834111B2",
        "US10862906B2"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "KR101877655B1",
        "US10671470B2",
        "US10607004B2",
        "US10999296B2",
        "US10903985B2",
        "US10992652B2",
        "US10769306B2",
        "US10635822B2",
        "US10616260B2",
        "US10826929B2",
        "US10666666B1",
        "US10735272B1",
        "US11403958B2",
        "WO2019139595A1",
        "US10834111B2",
        "US10862912B2",
        "US11003773B1",
        "RU2715025C2",
        "US10749882B2",
        "US11575688B2",
        "US20210194909A1",
        "US11544374B2",
        "US10397272B1",
        "US11586711B2",
        "US11438357B2",
        "GB201810294D0",
        "GB2602254B",
        "US11483313B2",
        "US11157834B2",
        "US10893030B2",
        "US11386304B2",
        "US11431725B2",
        "US11012421B2",
        "US10972461B2",
        "US11297073B2",
        "US10574512B1",
        "US10778689B2",
        "IL281410B1",
        "JP7121276B2",
        "CN110943961B",
        "US11070632B2",
        "US11010472B1",
        "WO2020087039A1",
        "US11258817B2",
        "US11388040B2",
        "US11126957B2",
        "US10992701B2",
        "US11128667B2",
        "US20220060492A1",
        "US11645293B2",
        "US10958677B2",
        "US11050793B2",
        "GB201820853D0",
        "BR112021010468A2",
        "US11416641B2",
        "US10909174B1",
        "US11483212B2",
        "US10958673B1",
        "US10764386B1",
        "US11630896B1",
        "US20200293654A1",
        "US11281629B2",
        "US11438361B2",
        "US11258811B2",
        "US11620408B2",
        "US11037428B2",
        "US10686826B1",
        "US11201890B1",
        "US11140103B2",
        "US11681831B2",
        "US10609578B1",
        "US11323463B2",
        "US11163889B2",
        "US11258813B2",
        "US11727265B2",
        "US11233770B2",
        "US11308428B2",
        "CN110138627B",
        "US11138163B2",
        "WO2021021733A1",
        "US20210034767A1",
        "US11588832B2",
        "US11582246B2",
        "US11516237B2",
        "US11792210B2",
        "US11381459B2",
        "US11036488B2",
        "US11119895B2",
        "KR102221726B1",
        "US11367342B2",
        "US11356462B2",
        "US11330006B2",
        "US20210194924A1",
        "CA3150288A1",
        "US10776686B1",
        "US11080352B2",
        "US11157776B2",
        "US11216268B2",
        "US11188320B2",
        "US11329861B2",
        "US11356316B2",
        "US11665044B2",
        "US10623233B1",
        "GB2587355B",
        "US11621965B2",
        "US11799890B2",
        "US11509667B2",
        "GB201915265D0",
        "US11165815B2",
        "US11586685B2",
        "CN113557515A",
        "US20210133346A1",
        "US11394733B2",
        "US11290475B2",
        "WO2021095051A1",
        "US11481678B2",
        "US11579928B2",
        "US11582260B2",
        "US11574032B2",
        "US11308205B2",
        "US20210152596A1",
        "CA3100378A1",
        "US11399041B1",
        "CN111031006A",
        "US11055652B1",
        "US11528297B1",
        "US10897479B1",
        "WO2021120010A1",
        "FR3104776B1",
        "TWI783195B",
        "CN111212035A",
        "US11763217B2",
        "US11461534B2",
        "CN111224966B",
        "US11477228B2",
        "US11190417B2",
        "EP3866395A1",
        "US11416504B2",
        "WO2021160499A1",
        "US11757918B2",
        "US11257090B2",
        "US20210264033A1",
        "WO2021165933A1",
        "US20210264054A1",
        "US11620481B2",
        "US11790060B2",
        "US11595435B2",
        "SG10202002125QA",
        "JP7092939B2",
        "US11503047B2",
        "US20210286879A1",
        "IL273321A",
        "WO2021188315A1",
        "GB2593735B",
        "US11431751B2",
        "EP4107923A1",
        "US11651222B2",
        "US11290483B1",
        "US11677775B2",
        "CA3115326C",
        "US11070982B1",
        "US11444980B2",
        "US11799878B2",
        "US20210326744A1",
        "US11455587B2",
        "US11470108B2",
        "US11449674B2",
        "US11217223B2",
        "US11651074B2",
        "CN111526156B",
        "US20210342441A1",
        "US11558403B2",
        "US11645558B2",
        "US11115824B1",
        "US11206542B2",
        "US11057774B1",
        "JP7322806B2",
        "US11477244B2",
        "JP2021189794A",
        "CN111857681B",
        "US11756112B2",
        "US20210397903A1",
        "US11310117B2",
        "CN111818047B",
        "US11366834B2",
        "US11522880B2",
        "US11715046B2",
        "US11438370B2",
        "US11595418B2",
        "US11595282B2",
        "CN111865999A",
        "US11539735B2",
        "US11715007B2",
        "CN112367289B",
        "CN112202736B",
        "US11496522B2",
        "US20220100868A1",
        "US11546368B2",
        "CN112235367B",
        "US20220124104A1",
        "US11528242B2",
        "US20220156396A1",
        "CN112583793B",
        "WO2022115419A1",
        "EP4256758A1",
        "US11514173B2",
        "US11687648B2",
        "US11539521B2",
        "US20220191234A1",
        "US11416369B1",
        "US20220198015A1",
        "US20220207414A1",
        "US11386197B1",
        "US11641366B2",
        "US11757904B2",
        "US20220232016A1",
        "US11683335B2",
        "US11734453B2",
        "US11663329B2",
        "WO2022189849A1",
        "IL281754B",
        "US11526617B2",
        "US20220321581A1",
        "US11588835B2",
        "US20220377105A1",
        "US11792213B2",
        "US11799879B2",
        "CN113259369B",
        "US20220398323A1",
        "WO2022265619A1",
        "US11349861B1",
        "US11508234B1",
        "CN113572781A",
        "US20230033134A1",
        "US11698858B2",
        "WO2023031804A1",
        "CN113486050A",
        "US20230086827A1",
        "CN113596065B",
        "CN113992371B",
        "CN114095208A",
        "WO2023076919A1",
        "US11514162B1",
        "WO2023137371A1",
        "US20230231909A1",
        "WO2023144805A1",
        "US20230247042A1",
        "CN114611127B",
        "US20230308468A1",
        "EP4254228A1",
        "WO2023196471A1",
        "US20230342267A1",
        "CN114978617B",
        "US11544460B1"
    ]
}