{
    "patent_id": "US-11259260-B2",
    "title": "Learning communication systems using channel approximation ",
    "assignee": "DeepSig Inc.",
    "publication_date": "2022-02-22",
    "patent_link": "https://patents.google.com/patent/US11259260B2/en",
    "inventors": [
        "Timothy J. O'Shea",
        "Ben Hilburn",
        "Tamoghna Roy",
        "Nathan West"
    ],
    "classifications": [
        "H04W56/0035",
        "G06N20/00",
        "G06N3/044",
        "G06N3/0445",
        "G06N3/045",
        "G06N3/047",
        "G06N3/08",
        "G06N3/084",
        "H04B17/391",
        "H04B17/3912",
        "H04L41/145",
        "H04L5/0005",
        "H04W16/22",
        "H04W72/0453",
        "G06N3/006",
        "G06N3/048",
        "G06N3/126"
    ],
    "abstract": "Methods, systems, and apparatus, including computer programs encoded on computer storage media, for training and deploying machine-learned communication over RF channels. In some implementations, information is obtained. An encoder network is used to process the information and generate a first RF signal. The first RF signal is transmitted through a first channel. A second RF signal is determined that represents the first RF signal having been altered by transmission through the first channel. Transmission of the first RF signal is simulated over a second channel implementing a machine-learning network, the second channel representing a model of the first channel. A simulated RF signal that represents the first RF signal having been altered by simulated transmission through the second channel is determined. A measure of distance between the second RF signal and the simulated RF signal is calculated. The machine-learning network is updated using the measure of distance.",
    "claims": "\n1. A method performed by at least one processor to train at least one machine-learning network to communicate over a communication channel, the method comprising:\ntransmitting input information through a first communication channel;\nobtaining first information as an output of the first communication channel;\ntransmitting the input information through a second communication channel implementing a channel machine-learning network, the second communication channel representing a model of the first communication channel;\nobtaining second information as an output of the second communication channel;\nproviding the first information or the second information to a discriminator machine-learning network as an input;\nobtaining an output of the discriminator machine-learning network;\nupdating the channel machine-learning network using the output of the discriminator machine-learning network;\nusing the channel machine-learning network to predict a channel response; and\nusing the channel response to determine a candidate location for at least one of a cell tower, an antenna, a remote radio head, or an antenna array.\n2. The method of claim 1, wherein the output of the discriminator machine-learning network indicates a decision by the discriminator machine-learning network whether the input provided to the discriminator machine-learning network was the output of the first communication channel or the second communication channel.\n3. The method of claim 2, wherein the output of the discriminator machine-learning network is a binary output.\n4. The method of claim 1 wherein the output of the discriminator machine-learning network indicates a degree of similarity between the first communication channel and the second communication channel.\n5. The method of claim 1, wherein the channel machine-learning network includes one or more variational layers or neurons containing a random sampling operation using at least one of inputs or weights to define a particular aspect of a probability distribution.\n6. The method of claim 1, wherein the channel machine-learning network is conditioned on one or more inputs.\n7. The method of claim 6, wherein conditioning the channel machine-learning network on the one or more inputs comprises conditioning the channel machine-learning network using historical measurements.\n8. The method of claim 1, wherein the channel machine-learning network is conditioned on one or more locations of one or more radios transceiving the input information or the first information.\n9. The method of claim 8, wherein transceiving the input information or the first information comprises transceiving a radio-frequency signal generated from the input information or the first information.\n10. The method of claim 1, further comprising using the channel response to determine signal coverage in an area based on one or more performance metrics.\n11. The method of claim 1, further comprising using the channel response to determine an estimate of signal coverage in an area based on one or more performance metrics.\n12. The method of claim 1, wherein using the channel response to determine the candidate location comprises using the channel response to predict a location of a cell tower.\n13. The method of claim 12, wherein the channel response indicates that signal quality at the location is higher than the signal quality at adjacent locations, and\nwherein using the channel response to predict the location of the cell tower comprises determining that the signal quality at the location is higher than the signal quality at the adjacent locations.\n14. The method of claim 13, wherein the signal quality is determined using one or more performance metrics.\n15. The method of claim 14, wherein the performance metrics comprise one or more of a signal strength, a bit error rate, a signal-to-noise ratio, a communication bandwidth, a communication power, a spectral efficiency, a level of interference, a level of fading, a level of distortion, a mean squared error, or an error vector magnitude.\n16. The method of claim 1, wherein determining the candidate location comprises:\npredicting performance of the least one cell tower, antenna, remote radio head, or antenna array at the candidate location; and\ndetermining that the performance of the least one cell tower, antenna, remote radio head, or antenna array at the candidate location meets selected criteria.\n17. The method of claim 1, wherein the channel response indicates that signal quality at the candidate location is less than the signal quality at adjacent locations, and\nwherein using the channel response to determine the candidate location of the at least one cell tower, antenna, remote radio head, or antenna array comprises determining that the signal quality at the candidate location is less than the signal quality at the adjacent locations.\n18. The method of claim 17, wherein signal quality is determined using one or more performance metrics.\n19. The method of claim 18, wherein the performance metrics comprise one or more of a signal strength, a bit error rate, a signal-to-noise ratio, a communication bandwidth, a communication power, a spectral efficiency, a level of interference, a level of fading, a level of distortion, a mean squared error, or an error vector magnitude.\n20. The method of claim 1, wherein the channel response indicates signal interference in a first band of frequencies corresponding to the transmission of the input information through the second communication channel, and\nthe method further comprises updating the channel machine-learning network to use a second band of frequencies that is different from the first band of frequencies.\n21. The method of claim 1, wherein the input information is a first radio-frequency signal generated by an encoder machine-learning network, and\nwherein the first information or the second information is a second radio-frequency signal that is sent to a decoder machine-learning network for processing.\n22. The method of claim 21, comprising training at least one of the channel machine-learning network, the encoder machine-learning network, the decoder machine-learning network, or the discriminator machine-learning network using a propagation model,\nwherein the propagation model corresponds to a real-world propagation environment.\n23. The method of claim 1, wherein using the channel response to determine the candidate location comprises using the channel response to determine a candidate location for an antenna or antenna array.\n24. The method of claim 1, wherein using the channel response to determine the candidate location comprises using the channel response to determine a candidate location for a remote radio head.\n25. A system comprising:\nat least one processor; and\nat least one computer memory coupled to the at least one processor having stored thereon instructions which, when executed by the at least one processor, cause the at least one processor to perform operations comprising:\ntransmitting input information through a first communication channel;\nobtaining first information as an output of the first communication channel;\ntransmitting the input information through a second communication channel implementing a channel machine-learning network, the second communication channel representing a model of the first communication channel;\nobtaining second information as an output of the second communication channel;\nproviding the first information or the second information to a discriminator machine-learning network as an input;\nobtaining an output of the discriminator machine-learning network;\nupdating the channel machine-learning network using the output of the discriminator machine-learning network;\nusing the channel machine-learning network to predict a channel response; and\nusing the channel response to determine a candidate location for at least one of a cell tower, an antenna, a remote radio head, or an antenna array.\n26. One or more non-transitory computer-readable media, storing a computer program, the program comprising instructions that when executed by one or more processing devices cause the one or more processing devices to perform operations comprising:\ntransmitting input information through a first communication channel;\nobtaining first information as an output of the first communication channel;\ntransmitting the input information through a second communication channel implementing a channel machine-learning network, the second communication channel representing a model of the first communication channel;\nobtaining second information as an output of the second communication channel;\nproviding the first information or the second information to a discriminator machine-learning network as an input;\nobtaining an output of the discriminator machine-learning network;\nupdating the channel machine-learning network using the output of the discriminator machine-learning network;\nusing the channel machine-learning network to predict a channel response; and\nusing the channel response to determine a candidate location for at least one of a cell tower, an antenna, a remote radio head, or an antenna array.",
    "status": "Active",
    "citations_own": [
        "US7133809B1",
        "US20110150113A1",
        "US20170163465A1",
        "US20180174050A1",
        "US20180367192A1",
        "US10396919B1",
        "US20190274108A1"
    ],
    "citations_ftf": [
        "CA2977300A1"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US10749594B1",
        "US10802489B1",
        "EP3759654A4",
        "US10652567B2",
        "JP7230521B2",
        "US20200257985A1",
        "US11704573B2",
        "JP7254649B2",
        "US11514322B2",
        "US11502779B2",
        "US10979202B2",
        "US10956807B1",
        "US11366434B2",
        "US11367290B2",
        "CN110971314B",
        "CN111144542B",
        "US20210235407A1",
        "US11507803B2",
        "US11646838B2",
        "US11804998B2",
        "US11356305B2",
        "US11737106B2",
        "WO2021228353A1",
        "US11387859B2",
        "CN111835366A",
        "US20230318691A1",
        "CN114501353A",
        "CN112422208B",
        "CN114599056A",
        "CN112472048B",
        "US11523404B2",
        "US20220383118A1",
        "US11765011B2",
        "WO2023004638A1",
        "WO2023068399A1",
        "WO2023097636A1",
        "WO2023123062A1",
        "US11716641B1",
        "CN114499723B",
        "WO2023164056A1",
        "CN114584230B",
        "CN116567800B"
    ]
}