{
    "patent_link": "https://patents.google.com/patent/US5502759A/en",
    "patent_id": "US5502759A",
    "title": "Apparatus and accompanying methods for preventing toll fraud through use of centralized caller voice verification",
    "abstract": "An apparatus and accompanying methods for preventing telephone toll fraud that relies on the use of centralized voice verification to authenticate a party claiming a particular identity and requesting service, i.e. access to a telephone network. A voice verification intelligent peripheral (VVIP) (300) is interposed between, e.g., a tandem switch (40) and a voice service node (VSN) (250) both used to provide alternate automated billing service (AABS). The VVIP intercepts all call processing messages that occur between these two components and, at a pre-defined point during the processing of an AABS call, holds a call processing message, specifically a successful line information database (LIDB) query response message, until a voice verification of a caller is complete. While the message is held, the VVIP prompts the caller, who is claiming to be a subscriber, to speak a pre-defined password, obtains a voice template of the resulting speech and attempts to match this template against a template previously stored, within the VVIP, for the subscriber, during a prior enrollment process and for the same password. If the templates match and hence the identity claimed by the caller is confirmed, the VVIP simply passes the message, then being held, onward to its destination, such as the VSN, to then allow the normal processing for this call to proceed and eventually result in the call being extended through public switching network to a dialed destination number.",
    "inventors": [
        "Jane Cheng",
        "Edgar Martinez",
        "Jayant Naik"
    ],
    "assignee": "Google LLC",
    "classifications": [
        "H04M15/47",
        "H04M17/00",
        "H04M3/382",
        "H04Q3/0029",
        "H04M2201/40",
        "H04M2203/6027",
        "H04M2215/0148",
        "H04M7/00"
    ],
    "claims": "\n1. In a public switched telephone network, apparatus for selectively extending a call through the network from a caller placing the call via an access facility connected to the network, to a destination number, said apparatus comprising:\na switching network connected to the caller and the destination number by the public switched telephone network, responsive to an instruction, for selectively routing a call therethrough so as to connect a caller to a destination number;\nan indicia validator, connected to said switching network, for determining, in response to a first message containing a query to a line information database (LIDB), whether a pre-defined indicia for said caller signifies that said call should be routed through said switching network means and, in response thereto, generating a second message responsive to said query, said indicia validator having a common channel signaling network and a service control point, said common channel signaling network being connected to said service control point and to both said switching network and a voice processor, said service control point including:\na database;\nmeans for storing said database; and\na database processor, connected to said storing means and to said common channel signaling network, for interrogating said database in response to said first message and, in response to a result of said interrogation, generating said second message, the contents of said second message being determined by an indication stored within said database and associated with an indicia contained within said first message; and\nsaid voice processor, connected to said switching network and to said indicia validator, for obtaining said indicia from said caller and, in response thereto, producing said first message containing the indicia and, in response to said second message, generating said instruction to said switching network; said voice processor comprising:\na tandem switch connected to said switching network and to said common channel signaling network;\na voice service node for verbally communicating with a caller and obtaining voice responses therefrom so as to extract said indicia from said caller;\na voice verifier, connected in series, both in a voice path and a data path, between said tandem switch and said voice service node, for verifying the voice of said caller before the call is completed; and\nwherein in said voice processor:\nsaid voice service node generates, in response to said indicia, said first message and passes said first message through said voice verifier to said tandem switch for subsequent application to said common channel signaling network;\nsaid tandem switch receives said second message from said common channel signaling network;\nsaid voice verifier intercepts all call processing messages flowing between said tandem switch and said voice service node and holds said second message from the tandem switch until said voice verifier has completed a successful voice verification of the caller; and\nsaid voice verifier passes said second message onward to said voice service node to generate said instruction, said instruction subsequently being passed through said voice verifier to said tandem switch and onward thereby to said switching network.\n2. The apparatus in claim 1 wherein said indicia is a calling card number and said indicia validator means comprises a database having a plurality of calling card numbers and a corresponding indication of the validity of each of said numbers.\n3. The apparatus in claim 1 wherein said voice verifier comprises:\na voice verification system for verifying the voice of the caller;\na computer controlled switch, connected to said voice service node and to said tandem switch, for selectively connecting and disconnecting a voice connection, through said tandem switch, between said voice service node and said caller, and for selectively connecting and disconnecting a voice path, through said tandem switch, between said voice verification system and the caller; and\nan application processor, connected to and for controlling both said voice verification system and said computer controlled switch and, connected to said voice service node and said tandem switch, for intercepting call processing messages occurring therebetween and holding said second message from the tandem switch until successful voice verification of the caller is complete.\n4. The apparatus in claim 3 wherein said voice verification system, during a pre-defined enrollment procedure, obtains and stores an initial voice template for a subscriber, and, during a voice verification procedure, obtains a subsequent voice template from a caller claiming to be the subscriber and compares the subsequent voice template against the initial voice template to determine whether a match exists therebetween so as to verify the identity of the caller to be that of the subscriber.\n5. The apparatus in claim 4 wherein said predefined indicia is a password.\n6. The apparatus in claim 4 wherein said initial and subsequent voice templates are compared using Hidden Markov Modeling or Dynamic Time Warping.\n7. The apparatus in claim 3 wherein said voice verifier comprises means, operative in response to the second message and if the voice verification system has not successfully verified the voice of the caller to be a corresponding subscriber, for changing said second message from a passed LIDB response message to a failed LIDB response message so as to form a changed message and forwarding said changed message, as said second message, to said voice service node so as to prevent said call from being routed through said switching network.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4757525A",
        "US4761807A",
        "US4896346A",
        "US4935956A",
        "US4961212A",
        "US4979206A",
        "US5003574A",
        "US5054083A",
        "US5073921A",
        "US5084816A",
        "US5125022A",
        "US5163084A",
        "US5163083A",
        "US5164981A",
        "US5165095A",
        "US5166971A",
        "US5274695A",
        "US5365574A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5617470A",
        "US5666405A",
        "US5668856A",
        "US5802251A",
        "US5913196A",
        "EP0974091A1",
        "US6055306A",
        "US6067347A",
        "US6088433A",
        "US6122357A",
        "USD433413S",
        "US6157707A",
        "WO2001003110A2",
        "US6188752B1",
        "WO2001016892A1",
        "US6256737B1",
        "US6282304B1",
        "US20010021198A1",
        "US6314112B1",
        "US6314171B1",
        "US6324507B1",
        "US6327345B1",
        "US6470451B1",
        "US6510415B1",
        "US6553108B1",
        "US6618703B1",
        "US6618588B1",
        "US20030195847A1",
        "US20030228012A1",
        "US20030228011A1",
        "US20040005045A1",
        "US20040015355A1",
        "WO2004012387A1",
        "US20040029564A1",
        "US6704405B1",
        "US6748069B1",
        "US20040120481A1",
        "US20040161084A1",
        "US20040177097A1",
        "US6795543B1",
        "US20050060157A1",
        "US20050097131A1",
        "US6896182B2",
        "US20050152598A1",
        "US20050288930A1",
        "DE102004026349A1",
        "US20060020816A1",
        "US7013001B1",
        "US7035386B1",
        "US20060147014A1",
        "US20060188076A1",
        "US20060251226A1",
        "US20060285650A1",
        "US7167544B1",
        "US20070071227A1",
        "US20070093249A1",
        "US20070155366A1",
        "WO2007107083A1",
        "US7305562B1",
        "US7386107B2",
        "US7441263B1",
        "US20090055315A1",
        "US7555458B1",
        "US20090190737A1",
        "US20110286585A1",
        "US8094800B1",
        "US8494144B2",
        "US10063694B1",
        "US10084909B2",
        "US10091350B2",
        "US10397402B1",
        "US10462285B2"
    ],
    "citedby_ftf": []
}