{
    "patent_link": "https://patents.google.com/patent/US5323315A/en",
    "patent_id": "US5323315A",
    "title": "Computer system for monitoring the status of individual items of personal property which serve as collateral for securing financing",
    "abstract": "A system for monitoring the status of individual items of personal property which serve as collateral for securing financing. The system receives financing information from a first financing source and a second financing source. A unique identification code is associated with each individual item of personal property which serves as collateral for securing financing from the first and second financing sources. The financing information from the first financing source is compared with the financing information from the second financing source based at least in part upon the identification codes of the items of personal property to identify particular items of personal property that simultaneously serve as collateral to secure financing from both the first and second financing sources. The affected first and second financing sources are notified about the identified item of personal property.",
    "inventors": [
        "Lawrence Highbloom"
    ],
    "assignee": "Vintek Inc",
    "classifications": [
        "G06Q40/02",
        "G06Q40/03"
    ],
    "claims": "\n1. A computer system for monitoring the status of individual items of personal property which serve as collateral for securing financing comprising:\na data input device for receiving financing information records from first and second financing sources, each financing information record from the first source including an identification code uniquely associated with an individual item of personal property which serves as collateral for securing financing by the first source, each financing information record from the second source including an identification code uniquely associated with an individual item of personal property which serves as collateral for securing financing by the second source;\na storage device for storing the financing information records from the first and second sources;\na processor for retrieving the stored financing information records from the first and second sources and for comparing the financing information records from the first source with the financing information records from the second source based at least in part upon the identification codes uniquely associated with the items of personal property to determine whether a particular individual item of personal property simultaneously serves as collateral to secure financing from both the first and second financing sources;\nthe processor for identifying a particular individual item of personal property which simultaneously serves as collateral to secure financing from both the first and second financing sources; and\nthe processor providing an output to notify at least one of the first and second financing sources about the identified item of personal property.\n2. The computer system according to claim 1, wherein the records from the first financing source and the second financing source are stored in the storage device in a relational database.\n3. The computer system according to claim 2, wherein the financing information from the first financing source is electronically transferred to the computer system.\n4. The computer system according to claim 2, wherein the financing information from the second financing source is electronically transferred to the computer system.\n5. The computer system according to claim 2, wherein each financing information record from the first financing source is transmitted over a telecommunications system.\n6. The computer system according to claim 2, wherein each financing information record from the second financing source is transmitted over a telecommunications system.\n7. The computer system according to claim 2, wherein the output notifying at least one of the first and second financing sources comprises means for electronically transferring financing information records from the computer system to the first and second financing sources.\n8. The computer system according to claim 1, wherein the financing information from the first financing source is transmitted to the data input device from a first financing source by a personal computer.\n9. The computer system according to claim 1, wherein the financing information records from the first financing source are transmitted to the data input device from a first financing source by a main frame computer.\n10. The computer system according to claim 1, wherein the financing information from the second financing source is transmitted to the data input device from a second financing source by a personal computer.\n11. The computer system according to claim 1, wherein the financing information from the second financing source is transmitted to the data input device from a second financing source by a main frame computer.\n12. The computer system according to claim 1, wherein the personal property which serves as collateral is a vehicle and where the identification code comprises a vehicle identification member (VIN).\n13. The computer system according to claim 12, wherein each financing information record includes the year, made and model of the vehicle.\n14. The computer system according to claim 1, wherein each financing information record is generally received from the first financing source and the second financing source on at least a daily basis.\n15. The computer system according to claim 1, wherein the output notifying at least one of the first and second financing sources comprised a printed report.\n16. The computer system according to claim 1, wherein each financing information record transmitted from the first financing source comprises information used to prepare floor plan credit loans for the purchase of inventory.\n17. The computer system according to claim 1, wherein each financing information record transmitted from the second financing source comprises information used to prepare consumer credit loans for the purchase of a particular item of personal property.\n18. A computer system for monitoring the status of vehicles which serve as collateral for securing inventory financing of vehicles comprising:\na data input device for receiving financing information records from first and second financing sources, each financing information record from the first source including a vehicle identification code uniquely associated with an individual vehicle which serves as collateral for securing dealer inventory financing by any of said first financing sources, each financing information record from the second source including a vehicle identification code uniquely associated with an individual vehicle which serves as collateral for securing financing from any of said second financing sources;\na storage device for storing the financing information records from the first and second sources;\na processor for retrieving the stored financing information records from the first and second sources, for comparing the received financing information records based at least in part upon the vehicle identification codes, and for identifying individual vehicles which simultaneously serve as collateral to secure financing from two of said financing sources;\nthe processor providing an output to notify at least one of the financing sources for which an identified vehicle serves as collateral that the identified vehicle also serves as collateral for another financing source.\n19. The computer system according to claim 18, wherein each financing information record from the first financing source is electronically transferred to the computer system.\n20. The computer system according to claim 18, wherein each financing information record from the second financing source is electronically transferred to the computer system.\n21. The computer system according to claim 18, wherein each financing information record from at least one of the plurality of first financing sources is transmitted by a personal computer.\n22. The computer system according to claim 18, wherein each financing information record from at least one of the plurality of second financing sources is transmitted by a personal computer.\n23. The computer system according to claim 18, wherein each financing information record transmitted from the plurality of first financing sources comprises information used to prepare floor plan credit loans for the purchase of vehicle inventory.\n24. The computer system according to claim 18, wherein each financing information record from the plurality of second financing sources comprises information used to prepare consumer credit loans for the purchase of vehicles.\n25. The computer system according to claim 18, wherein the output comprises a report which is transmitted to the affected first financing source and second financing source.\n26. The computer system according to claim 25, wherein the report is electronically transferred from the computer system to the first and second financing system.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4714995A",
        "US4718009A",
        "US4727243A",
        "US4736294A",
        "US4774664A",
        "US4799156A",
        "US5025138A",
        "US5063507A",
        "US5241466A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5623403A",
        "US5802501A",
        "US5845265A",
        "US5870720A",
        "US5878405A",
        "US6018723A",
        "US6025774A",
        "US6085176A",
        "US6119103A",
        "WO2000073962A1",
        "US6188993B1",
        "WO2001029735A1",
        "WO2001033485A1",
        "EP1102192A1",
        "EP1103908A2",
        "US20010007981A1",
        "US6323894B1",
        "US6393126B1",
        "US20020069167A1",
        "US20020138417A1",
        "US6460021B1",
        "US6477513B1",
        "US6598087B1",
        "US20030177087A1",
        "US20030236742A1",
        "US20040006533A1",
        "US20040024693A1",
        "WO2004031901A2",
        "US20040078321A1",
        "US20040083165A1",
        "US20040128229A1",
        "US20040126779A1",
        "US20040133512A1",
        "US20040138998A1",
        "US20040134369A1",
        "US20040177032A1",
        "US20040215555A1",
        "US20040215554A1",
        "US20040220874A1",
        "US20040225597A1",
        "US20040225594A1",
        "US6850908B1",
        "US6850643B1",
        "US20050086084A1",
        "US20050102229A1",
        "US20050102226A1",
        "US6898574B1",
        "US20050165660A1",
        "US20050177492A1",
        "US20050216402A1",
        "US20050235008A1",
        "US20050256747A1",
        "US6975996B2",
        "US20050283429A1",
        "US6980963B1",
        "US20050289051A1",
        "US6988082B1",
        "US6999943B1",
        "US7003489B1",
        "US20060080241A1",
        "US7035821B1",
        "US20060161486A1",
        "US20060178975A1",
        "US20060178965A1",
        "US20060178217A1",
        "US20060178966A1",
        "US20060178967A1",
        "US20060178218A1",
        "US20060190394A1",
        "US20060195377A1",
        "US20060195378A1",
        "US20060195394A1",
        "US20060224480A1",
        "US20060229976A1",
        "US20060235790A1",
        "US20070013692A1",
        "US20070016520A1",
        "US20070016519A1",
        "US20070036328A1",
        "US20070073601A1",
        "US20070073600A1",
        "US20070078737A1",
        "US20070078771A1",
        "US20070088656A1",
        "US20070106526A1",
        "US20070106576A1",
        "US20070112660A1",
        "US20070124239A1",
        "US20070124270A1",
        "US20070136185A1",
        "US20070156509A1",
        "US20070164102A1",
        "US20070168214A1",
        "US20070203725A1",
        "US20070203817A1",
        "US7275046B1",
        "US7287008B1",
        "US20070250350A1",
        "US7302413B1",
        "US20070282738A1",
        "US20070288361A1",
        "US20080046350A1",
        "US20080092065A1",
        "US20080103951A1",
        "US20080103800A1",
        "US20080120211A1",
        "US20080126234A1",
        "US20080133392A1",
        "US20080154669A1",
        "US7398245B1",
        "US20080177650A1",
        "US20080195527A1",
        "US7415471B1",
        "US20080215434A1",
        "US20080270165A1",
        "US20090012886A1",
        "US20090018910A1",
        "US20090037364A1",
        "US20090043604A1",
        "US20090043683A1",
        "US20090055246A1",
        "US20090083130A1",
        "US20090094129A1",
        "US20090099930A1",
        "US20090106673A1",
        "US20090138355A1",
        "US20090138333A1",
        "US20090144148A1",
        "US20090144073A1",
        "US7593893B1",
        "US7653592B1",
        "US7657475B1",
        "US7702580B1",
        "US7742980B1",
        "US7747526B1",
        "US7756778B1",
        "US20100179837A1",
        "US7801809B1",
        "US7822680B1",
        "US20100280869A1",
        "US7835508B1",
        "US7860781B1",
        "US7865416B1",
        "US7885889B2",
        "US7899722B1",
        "US7917436B2",
        "US20110106694A1",
        "US7970722B1",
        "US8046298B1",
        "US20110276467A1",
        "US8095431B1",
        "US8121937B2",
        "US8140415B2",
        "US8285615B2",
        "US8315364B2",
        "US8359278B2",
        "US20130066736A1",
        "US20130066757A1",
        "US8433631B1",
        "US8510190B1",
        "US8626649B1",
        "US8666879B1",
        "US8762191B2",
        "US8996481B2",
        "US9058581B2",
        "US9063985B2",
        "US9307884B1",
        "US9460441B2",
        "US9595067B2",
        "US20180217942A1",
        "US10332208B1",
        "US10339527B1",
        "US10491478B2",
        "US10593004B2",
        "US10592982B2",
        "US10672000B1",
        "US10699028B1",
        "US10896472B1",
        "US10909617B2",
        "US11030562B1",
        "US11151468B1"
    ],
    "citedby_ftf": [
        "WO2009071985A2"
    ]
}