{
    "patent_link": "https://patents.google.com/patent/US20020116313A1/en",
    "patent_id": "US20020116313A1",
    "title": "Method of auctioning advertising opportunities of uncertain availability",
    "abstract": "A method of quickly and efficiently determining pricing and allocation of advertising messages in a diversity of documents to be presented to a diversity of users with varying degrees of targeting information known about them. A database of individual users' profiles is maintained. Profiles may contain information about users' demographics, interests, and behavior patterns. Advertisers place bids on reaching users. Bids are collected and stored until a user requests a document that can be combined with an advertising message to be presented to user. Then, different bids of reaching that user are compared to determine the winning bid, serve the advertising message, and to determine the price to be paid by the winning advertiser. Means are provided to make bids react dynamically on the content of the requested documents and on the overall schedule of reaching users repeatedly, to discount bids if advertising message is likely to be undesirable, and to allocate advertising messages into documents provided by third parties.",
    "inventors": [
        "Dietmar Detering"
    ],
    "assignee": "Individual",
    "classifications": [
        "G06Q30/08",
        "G06Q30/0247",
        "G06Q30/0275",
        "G06Q30/0277",
        "G06Q40/04"
    ],
    "claims": "\n1. A method of selling advertising opportunities, said method comprising the steps of:\na) arranging a database of profiling information about users relating to their demographics, interests, and/or behavior patterns;\nb) offering to advertisers the opportunity to reach desired types of users from that data-base, each advertiser specifying the advertising message, his preferences for the number and desired criteria of users to be reached, and other conditions of the desired campaign;\nc) determining a choice of users who sufficiently match the criteria as specified by the advertiser and presenting at least a selection or a summary of data about said choice of users to said advertiser, said data also being able to indicate the degree to which a member of said choice matches the advertiser's preferences;\nd) eliciting and recording, from the advertiser, price bids of what he is willing to pay to reach each member of said choice with his message;\ne) aggregating and storing currently competing bids of all participating advertisers to reach a same user with an advertising message in that user's bid account;\nf) determining the advertising message with the highest bid each time that a corresponding user can be presented with an advertising message;\ng) exposing the winning advertising message to the user;\nh) billing the winning advertiser the due fee as calculated according to the applied auction rules; and\ni) updating the user's bid account according to the auction rules and the conditions of the campaign specified by the winning bidder.\n2. A method defined in claim 1, further comprising the step of forwarding all or part of the advertising revenue to the users who are exposed to the corresponding advertising messages.\n3. A method defined in claim 1, further comprising the step of placing a unique identifier on a user's computer, relating advertising opportunities of other parties to the recipient's known profiling information and bid account, and facilitating the other parties' participation in the auction process.\n4. A method defined in claim 1, wherein the choice of users determined in accordance to the advertisers preferences reflects uncertain assumptions that are based on other criteria.\n5. A method defined in claim 4, wherein the data indicating the degree to which a member of said choices matches the advertiser's preferences also reflects the uncertainty of said used information.\n6. A method defined in claim 1, further enabling the advertiser to combine two or more campaigns in a way that, if bids of two or more such campaigns are being placed on the same user, such bids do not compete with each other and either the higher or the lower one competes with bids of other advertisers or non-combined campaigns.\n7. A method defined in claim 1, wherein advertiser's bids can refer to criteria of the content being received by the users when receiving the advertising message, adjusting the bids competing in the automated bidding process accordingly.\n8. A method defined in claim 1, further comprising the step of setting a minimum price to be paid for reaching users in the database.\n9. A method defined in claim 1, further comprising the step of discriminating against different types of advertising messages by manipulating the relative weight of a corresponding bid in the bidding process and/or by charging for certain categories of messages a price that deviates from the price determined in the auction process.\n10. A method defined in claim 1, further comprising the step of the advertiser specifying differentiated bids or a rule to derive differentiated bids to reach a same user repeatedly during the time of the campaign.\n11. A method defined in claim 1, wherein the advertising message contains at least one unique identifier specifying the message, the user, or both.\n12. A method defined in claim 1, further comprising the step of recording the exposure of a user to a message of an advertiser and of preventing that user from being repeatedly exposed to a similar message of the same advertiser in a future campaign.\n13. A method defined in claim 12, further comprising the step of preventing a user from being repeatedly exposed to a similar message of the same advertiser, to which he had previously responded, as indicated by response data.\n14. A method defined in claim 1, further comprising the step of recording the exposure of a user to a message of an advertiser and of automatically discounting the advertiser's bid for future exposures of that user to the same or another specified advertising message.",
    "status": "Abandoned",
    "citations_own": [],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": []
}