{
    "patent_id": "US-11157244-B2",
    "title": "System and method for delivering interactive tutorial platform and related processes ",
    "assignee": "Kony, Inc.",
    "publication_date": "2021-10-26",
    "patent_link": "https://patents.google.com/patent/US11157244B2/en",
    "inventors": [
        "William K. Bodin",
        "Edward H. GROSS",
        "Komandur R. KUMAR",
        "Matthew A. TERRY",
        "Matthew B. TREVATHAN",
        "Mahendar YEDLA"
    ],
    "classifications": [
        "G06F8/30",
        "G06F8/33",
        "G06F11/302",
        "G06F11/3438",
        "G06F11/3466",
        "G06F21/31",
        "G06F3/1454",
        "G06F40/279",
        "G06F40/30",
        "G06F40/58",
        "G06F9/454",
        "G06N20/00",
        "G06N3/006",
        "G06Q10/101",
        "G06Q50/01",
        "G09B19/0053",
        "H04L67/53",
        "G06F2201/86",
        "G06Q30/016",
        "G06Q30/0201",
        "G06Q30/0203",
        "G06Q30/0245",
        "G06Q30/0255",
        "G06Q50/205",
        "H04L63/08",
        "H04L67/306"
    ],
    "abstract": "The present disclosure relates to digital experience development platforms and, more particularly, one or more components, systems and methods thereof of an intelligent digital experience development platform (IDXDP) configured to assist different users in the development, design and deployment of digital applications. A computer-implemented method comprises: reading, by a computing device, metadata of a component to be provided to a development tool; generating, by the computing device, an interactive tutorial using the metadata of the component; and presenting, by the computing device, the interactive tutorial in the development tool to a user.",
    "claims": "\n1. A system comprising:\na hardware processor, a computer readable memory, and a computer readable storage medium associated with a computing device;\nprogram instructions to receive a request to add a component to a project in a development tool;\nprogram instructions to add the component to the project;\nprogram instructions to read metadata of the component;\nprogram instructions to generate an interactive tutorial by analyzing the metadata of the component and using the analyzed metadata to represent the component syntactically in an open-standard file format that uses human readable text for the interactive tutorial; and\nprogram instructions to present the interactive tutorial in the development tool,\nwherein the program instructions are stored on the computer readable storage medium for execution by the hardware processor via the computer readable memory,\nwherein the program instructions to generate the interactive tutorial comprise:\nprogram instructions to analyze the metadata of the component including timing data, comments, and symbolic indicators; and\nprogram instructions to generate a video in the development tool using the analyzed metadata,\nwherein the interactive tutorial is presented using a chat bot, which includes a commentary box that provides commentary from a plurality of users related to the component that is automatically updated as the component is changed in a build process,\nwherein the commentary includes providing comparison and contrasting interpretations based on an analysis of the commentary from the plurality of users of the component, and\nwherein the generating of the interactive tutorial is further based on artificial intelligence configured to determine difficulties a user of the development tool encounters in using the development tool and to provide the user with a recommendation of a different way of using the development tool to overcome the difficulty, and\nfurther comprising program instructions to generate a ratings widget which allows for reflection of satisfaction levels of the user associated with the commentary from the plurality of users of the component; and\nprogram instructions to determine a method of construction of the component based on the analysis of the metadata,\nwherein the generating of the interactive tutorial includes using the determination of the method of construction together with the analyzed metadata in the generation of the interactive tutorial.\n2. The system according to claim 1, wherein the analyzed metadata is used to represent the component syntactically in JavaScript Object Notation.",
    "status": "Active",
    "citations_own": [
        "US5903859A",
        "US20020173934A1",
        "US20050114475A1",
        "US20060095276A1",
        "US20060184410A1",
        "US20080170575A1",
        "US20090030674A1",
        "US20090031170A1",
        "US20090030673A1",
        "US20090276824A1",
        "US20100075289A1",
        "US20100191602A1",
        "US8010578B2",
        "US20120079451A1",
        "US20130013536A1",
        "US20140026113A1",
        "US8667456B1",
        "US20140358944A1",
        "US20140365533A1",
        "US20150100409A1",
        "US20150100503A1",
        "US9043407B1",
        "US20150378692A1",
        "US20160132847A1",
        "US20160371591A1",
        "US20170017469A1",
        "US20170322782A1",
        "US20180024816A1",
        "US20180075513A1",
        "US20180089591A1",
        "US20180107478A1",
        "US20180164966A1",
        "US20180216946A1",
        "US20180218252A1",
        "US20180217983A1",
        "US20180285130A1",
        "US20190001188A1",
        "US20190034395A1",
        "US20190079741A1",
        "US20190079780A1",
        "US20190102078A1",
        "US20190171446A1",
        "US20190208112A1",
        "US20190303136A1",
        "US20190369969A1",
        "US20200064977A1",
        "US20200065891A1",
        "US20200104346A1",
        "US20200103876A1",
        "US20200104723A1",
        "US10628129B2",
        "US10635409B2",
        "US20200159502A1",
        "US20200249919A1",
        "US10740804B2"
    ],
    "citations_ftf": [
        "JP2004519114A",
        "US7861252B2",
        "US20030018705A1",
        "US7607066B2",
        "US20040031017A1",
        "US8453196B2",
        "US20060005169A1",
        "US7797673B2",
        "US7747785B2",
        "US8756094B2",
        "US8918834B1",
        "US9383973B2",
        "WO2014143755A1",
        "WO2014151061A2",
        "US9665593B2",
        "US10607165B2",
        "US10817791B1",
        "US9959296B1",
        "US9881010B1",
        "US20160043979A1",
        "US9934221B2",
        "KR20170019760A",
        "US10742649B1",
        "US10606658B2",
        "US20190258807A1",
        "US10671248B2",
        "US11593413B2",
        "US10977155B1"
    ],
    "citedby_own": [
        "US11321054B2"
    ],
    "citedby_ftf": [
        "US10977005B2",
        "WO2020061586A1",
        "US11409953B1",
        "US11080023B2",
        "US10275331B1",
        "US10282248B1",
        "US11432190B2",
        "US11461498B2",
        "US10839168B2",
        "US11301224B1",
        "US11210615B2",
        "US20210034946A1",
        "US11409507B1",
        "US10686645B1",
        "US11227583B2",
        "US11202273B2",
        "US10866872B1",
        "US20210158406A1",
        "US20220414163A1",
        "US11550552B2",
        "US11190399B2",
        "CN114253641A",
        "US11307881B1",
        "CN112527254A",
        "US11562410B2",
        "US20220261243A1",
        "US11726803B2",
        "US11405225B1",
        "US20220317985A1",
        "US11579958B2",
        "US20220351142A1",
        "WO2023282927A1",
        "CN113641346A",
        "US20230025698A1",
        "US11748075B2",
        "US11645095B2",
        "US20230105062A1",
        "US20230169560A1",
        "CN114168121B",
        "US20230239377A1",
        "EP4239422A1",
        "KR102432855B1"
    ]
}