{
    "patent_link": "https://patents.google.com/patent/US4430526A/en",
    "patent_id": "US4430526A",
    "title": "Interactive graphics transmission system employing an adaptive stylus for reduced bandwidth",
    "abstract": "An interactive graphics transmission system for use, illustratively, in video teleconferencing is described which advantageously reduces the amount of transmission bandwidth and user effort required to transmit changing graphical information. This is accomplished by first transmitting a full image of the graphic followed only by the changes which a conferee makes to that graphic. Those changes are determined by sensing the tilt of a light pen and the location of its tip, which is closest to the graphic, as a conferee manipulates the pen to change the graphic. The tilt of the pen primarily determines the mode in which the light pen is used. The mode information, in conjunction with the location of the pen's tip, is used to generate an instruction which specifies the way in which the graphic is to be changed, e.g., whether information is to be added to, deleted from or emphasized in a graphic. In addition, the location of the pen's tip specifies the address of that portion of the graphic that is to be changed. By transmitting just the instruction and address information while the user simultaneously manipulates the light pen to change a graphic, transmission bandwidth and user effort are both advantageously minimized.",
    "inventors": [
        "Earl F. Brown",
        "Arthur B. Larsen"
    ],
    "assignee": "NCR Voyix Corp",
    "classifications": [
        "H04N19/507",
        "G06F3/03542",
        "G06F3/03545",
        "H04N1/4177"
    ],
    "claims": "\n1. Apparatus for communicating modifications to an image of a previously transmitted graphic, comprising\nmeans responsive to locations of a tip of a stylus with respect to the graphic for specifying addresses of image portions which are to be changed,\nmeans for defining instructions for changing the image of the graphic,\nmeans responsive to said specified addresses and said defined instructions for forming a modification communication, and\nwherein said defining means includes means responsive to tilt of the stylus for controlling the production of at least a portion of the defined instructions.\n2. The invention in claim 1 wherein said controlling means further includes means for ascertaining whether an end of the stylus is tilted downward with respect to the other.\n3. The invention in claim 2 wherein said ascertaining means includes means responsive to inclination of each end of said stylus with respect to the other for determining which end of said stylus is tilted downward.\n4. The invention in claim 3 wherein said ascertaining means further includes means for generating a signal whenever the amount of inclination exceeds a predetermined threshold.\n5. The invention in claim 4 wherein said defining means further includes means responsive to locations of a portion of a surface over which said downward tilted end of said stylus is placed for further defining said instruction.\n6. The invention in claims 4 or 5 wherein said defining means further includes means responsive to depression of the downward tilted end of the stylus against the surface for further defining said instruction.\n7. The invention in claim 6 said specifying means includes means for determining whether the downward tilted end of said stylus is held an excessive distance above said image portions.\n8. The invention in claim 7 wherein said distance determining means further includes means for totaling the values of the addresses associated with picture elements comprising said surface and lying within a radiation pattern produced by light emitted from said stylus and striking said surface.\n9. The invention in claim 8 in which said distance determining means further includes means for counting the number of said picture elements.\n10. The invention in claim 9 in which said distance determining means further includes means for inhibiting the operation of said address specifying means in the event the value of said count exceeds a predetermined member.\n11. The invention in claim 10 in which said forming means further includes means for transmitting said modification communication as said instruction followed by at least one of said addresses.\n12. In a system for changing a displayed image of a previously transmitted graphic comprising\nmeans responsive to locations of a tip of a stylus with respect to the graphic for specifying addresses of image portions which are to be changed,\nmeans for defining instructions for changing the image of the graphic,\nmeans responsive to said specified addresses and said defined instructions for forming a modification communication,\nmeans for changing the displayed image in accordance with said modification communication, and\nwherein said defining means includes means responsive to tilt of said stylus for controlling the production of at least a portion of the defined instructions.\n13. The invention in claim 12 wherein said controlling means further includes means for ascertaining whether an end of the stylus is tilted downward with respect to the other.\n14. The invention in claim 13 wherein said ascertaining means includes means responsive to inclination of each end of said stylus with respect to the other for determining which end of said stylus is tilted downward.\n15. The invention in claim 14 wherein said ascertaining means further includes means for generating a signal whenever the amount of inclination exceeds a predetermined threshold.\n16. The invention in claim 15 wherein said defining means further includes means responsive to locations of a portion of a surface over which said downward tilted end of said stylus is placed for further defining said instruction.\n17. The invention in claim 16 wherein said defining means further includes means responsive to depression of the downward tilted end of the stylus against the surface for further defining said instruction.\n18. The invention in claim 17 wherein said specifying means includes means for determining whether the downward tilted end of said stylus is held an excessive distance above said image portions.\n19. The invention in claim 18 wherein said distance determining means further includes means for totaling the values of the addresses associated with picture elements comprising said surface and lying within a radiation pattern produced by light emitted from said stylus and striking said surface.\n20. The invention in claim 19 in which said distance determining means further includes means for counting the number of said picture elements.\n21. The invention in claim 20 in which said distance determining means further includes means for inhibiting the operation of said address specifying means in the event the value of said count exceeds a predetermined number.\n22. The invention in claim 21 in which said forming means further includes means for transmitting said modification communication as said instruction followed by at least one of said address.\n23. The invention in claim 22 in which said displaying means includes means for extracting said instruction and said addresses present in said modification communication.\n24. The invention in claim 23 in which said displaying means further includes means responsive to said addresses and said instructions for changing intensity values associated with those picture elements comprising said image portions, specified by said addresses, in a manner specified by said instructions.\n25. In a stylus, capable of being used in a variety of modes to provide input information to an electrical system, an input signal generating system comprising\nmeans for sensing whether an end of the stylus it tilted downward with respect to the other,\nmeans for determining whether an end of said stylus is depressed against a surface, and\nmeans responsive to said sensing and determining means for generating a plurality of signals indicative of which mode the stylus is being used.\n26. The invention in claim 25 wherein said sensing means further includes means responsive to inclination of each end of said stylus with respect to the other for ascertaining which end of said stylus is tilted downward.\n27. The invention in claim 26 wherein said sensing means further includes means for generating a signal whenever the amount of inclination exceeds a predetermined threshold.\n28. The invention in claim 27 in which said sensing means is a mercury switch having two ends and a pair of contacts, situated in at least one end, which provides a conduction path when that end is tilted downward with respect to the other end.\n29. The invention in claim 23 in which said determining means includes at least one pair of switch contacts situated in at least one end of the pen which closes whenever that end is depressed against a surface.\n30. The invention in claims 28 or 29 in which said generating means includes means for producing a source of light pulses at a selected one of a plurality of predetermined rates wherein said rate is determined by which end of the pen is tilted downward with respect to the other and whether the downward tilted end of the pen is depressed against the surface.\n31. The invention in claim 30 in which said producing means is comprised of at least one light illuminating device, which is located in a corresponding end of the pen.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3553362A",
        "US3761620A",
        "US4251800A",
        "US4263592A",
        "US4268730A",
        "US4289927A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4566036A",
        "EP0171747A2",
        "FR2584836A1",
        "US4695831A",
        "EP0243925A2",
        "US4739317A",
        "US4827410A",
        "EP0379354A2",
        "EP0411231A2",
        "US5060135A",
        "US5159187A",
        "US5159322A",
        "US5191411A",
        "US5194729A",
        "EP0535988A2",
        "US5239373A",
        "US5444476A",
        "US5459489A",
        "WO1995034881A1",
        "US5502514A",
        "US5525764A",
        "EP0689342A3",
        "US5604341A",
        "US5650608A",
        "US5699442A",
        "US5745688A",
        "US5802281A",
        "US5818037A",
        "US5847694A",
        "US5850250A",
        "US5892509A",
        "US5945992A",
        "US5959616A",
        "USRE36455E",
        "WO2001045384A1",
        "US20020002490A1",
        "US20020040817A1",
        "US20020042885A1",
        "EP1201081A1",
        "US6496206B1",
        "US6512507B1",
        "US6529189B1",
        "US6577311B1",
        "US20030187940A1",
        "US20030234291A1",
        "US6670952B2",
        "US6707434B1",
        "US20040070552A1",
        "EP1501016A1",
        "US6850248B1",
        "US6870547B1",
        "US6904185B1",
        "US20050144284A1",
        "US20050219225A1",
        "US20060028457A1",
        "US7042583B1",
        "US7062107B1",
        "US20070044028A1",
        "US20070097098A1",
        "US20070106950A1",
        "US20070233496A1",
        "US7319536B1",
        "US20090153525A1",
        "US20090284667A1",
        "WO2010109147A1",
        "US20100257586A1",
        "US20110055325A1",
        "US20110083109A1",
        "US20120228039A1",
        "US8296572B2",
        "US20160179280A1",
        "US10264213B1",
        "US11132074B2"
    ],
    "citedby_ftf": []
}