{
    "patent_link": "https://patents.google.com/patent/US20110119212A1/en",
    "patent_id": "US20110119212A1",
    "title": "Expert system for determining patient treatment response",
    "abstract": "A medical digital expert system to predict a patient's response to a variety of treatments (using pre-treatment information) is described. The system utilizes data fusion, advanced signal/information processing and machine learning/inference methodologies and technologies to integrate and explore diverse sets of attributes, parameters and information that are available to select the optimal treatment choice for an individual or for a subset of individuals suffering from any illness or disease including psychiatric, mental or neurological disorders and illnesses. The methodology and system can also be used to determine or confirm medical diagnosis, estimate the level, index, severity or critical medical parameters of the illness or condition, or provide a list of likely diagnoses for an individual suffering/experiencing any illness, disorder or condition.",
    "inventors": [
        "Hubert De Bruin",
        "Gary Hasey",
        "Ahmad Khodayari-Rostamabad",
        "Duncan Maccrimmon",
        "James Reilly"
    ],
    "assignee": "Digital Medical Experts Inc",
    "classifications": [
        "G16H50/20",
        "A61B5/00",
        "A61B5/369",
        "A61B5/372",
        "A61B5/7267",
        "G16H10/40",
        "G16H10/60",
        "G16H20/10",
        "G16H20/70",
        "G16H50/30",
        "G16H50/70",
        "A61B5/4088"
    ],
    "claims": "\n1. A method for predicting patient response to treatment for a subject patient, the method comprising:\ngenerating in memory of a computer, and storing on a system database, a first level training dataset comprising a plurality of records comprising measured patient related clinical and/or laboratory data from a large number of patients, the data including data relating to patient treatment response; wherein the measured patient related clinical and/or laboratory data is processed to extract features from the measured data;\nprocessing the extracted feature dataset to select a reduced feature data subset whose cardinality is less than that of the first level training data set containing the clinical and/or laboratory data features; the reduced feature data subset being derived by means of processing the data to select features appearing to discriminate for a useful prediction;\nprocessing the reduced feature data to derive a feature data scheme or model relating feature data and treatment response;\ngenerating a subject patient dataset including the features selected for the reduced feature data subset;\ncomparing the subject patient dataset to the feature data scheme or model to predict a response for the patient.\n2. A method according to claim 1, wherein processing the reduced feature data includes segregating the feature data to discriminate for treatment response.\n3. A method according to claim 1, wherein the feature data scheme or model allocates feature data values to a treatment response category.\n4. A method according to claim 1, wherein the reduced feature data scheme or model is determined by solving a multi-dimensional or joint optimization problem, according to a criterion of optimality.\n5. A method according to claim 4, wherein the optimization problem is constrained by the model structure.\n6. A method according to claim 1, wherein the feature data scheme or model is generated by means of defining one or more boundaries between data values to segregate or discriminate between response categories.\n7. A method according to claim 6, wherein the feature data scheme or model generation procedure comprises defining one or more non-linear boundaries between feature data values.\n8. A method according to claim 1, wherein the reduced feature data subset is selected by means of processing the first level training dataset according to a criterion of optimality.\n9. A method according to claim 1, wherein one or more of the clinical and/or laboratory data features are derived by means of a brain activity or brain structure monitoring system.\n10. A method according to claim 1, wherein one or more of the clinical and/or laboratory data features are derived by means of an electromagnetic monitoring system.\n11. A method according to claim 1 wherein one or more of the clinical data features are derived by means of an EEG system, preferably wherein the EEG data is derived from the patient(s) prior to undergoing the treatment for which response is being predicted.\n12. A method according to claim 1, wherein one or more of the clinical or laboratory data features relates to biological test results of the subject.\n13. A method according to claim 1, wherein one or more of the clinical or laboratory data features relates to one r more of demographic, mood, anxiety or other psychiatric or neurological symptomatology, medical co-morbidity, pharmacological, cognitive or personality assessment information derived from the subject patient.\n14. A method according to claim 1, wherein the feature data classification procedure comprises defining boundaries between feature data values to segregate the values into different classes.\n15. A method according to claim 1, wherein a joint or multivariate criterion of optimality is employed to establish boundaries to minimize classification error.\n16. A method according to claim 1, wherein the feature data processing procedure comprises a kernelization or other non-linear technique.\n17. A method according to claim 1, further comprising a feedback step in which the training dataset is updated with further training data from patients.\n18. A method according to claim 17, wherein the further training data comprises patient datasets in addition to patient response information.\n19. A method according to claim 1, wherein the feature selection procedure is such that the features selected can change in response to updating of the training dataset with further training data.\n20. A method according to claim 17, wherein follow-up information regarding the response outcome that is determined to be either unreliable or invalid after screening is excluded from further use as part of the updated training data set.\n21. A method according to claim 1, wherein the feature selection process reduces the number of features selected to less than 50 from a number of training dataset candidate features in excess of 100.\n22. A method according to claim 1, wherein the feature selection process reduces the number of features selected to less than 20 from a number of training dataset candidate features in excess of 500.\n23. A method according to claim 1, wherein the feature selection procedure utilises a kernelization or other non-linear procedure.\n24. A method according to claim 1, wherein the feature selection procedure utilizes a maximum mutual information technique.\n25. A method according to claim 1, wherein the feature selection procedure includes a procedure for ensuring features selected have minimum mutual redundancy.\n26. A method according to claim 1, in which one or more of the clinical and laboratory data features are derived by means of a brain activity or structure monitoring system, and one or more of the clinical and laboratory data features relates to biological test results or demographic, mood, anxiety or other psychiatric symptomatology, medical co-morbidity, pharmacological, cognitive or personality assessment information derived from the subject patient.\n27. A medical system comprising:\na computer;\na training database coupled to the computer and holding a first level training dataset comprising a multiplicity of patient data records each patient data record including a patient dataset comprising a multiplicity of clinical and/or laboratory data features and including data relating to patient treatment response;\nmeans disposed within the computer for processing data held on the training database in a feature selection process to select a feature data subset whose cardinality is less than that of the first level training data set containing the clinical and/or laboratory data features; the feature data subset being derived by means of processing the data to select features appearing to discriminate for a useful prediction; and processing the reduced feature data to derive a feature data scheme or model relating feature data and treatment response.\n28. A medical system according to claim 27, wherein the system also includes means for processing a subject patient dataset including the features extracted then selected for the feature data subset; and comparing the subject patient dataset to the feature data scheme or model to predict a treatment response for the patient.\n29. A medical system according to claim 27, wherein the system includes a feedback arrangement in which the training database is updated with further training data.\n30. A medical system according to claim 27, further including means for inputting patient derived data.\n31. A medical system according to claim 27, further comprising a brain activity or brain structure monitoring device for inputting patient derived feature data preferably wherein the brain derived data is derived from the patient(s) prior to undergoing the treatment for which response is being predicted.\n32. A method for assessment of status of a patient, the method comprising:\ngenerating in memory of a computer, a first level training dataset comprising a plurality of records comprising patient related clinical and/or laboratory data feature information from a large number of patients on a system database;\nprocessing by the computer the first level training dataset in a feature selection process to select a reduced feature data subset whose cardinality is less than that of the first level training data set containing the clinical and/or laboratory data features; the reduced feature data subset being derived by means of processing the data to select features appearing to discriminate for a useful assessment of the patient status;\nprocessing the reduced feature data to derive a feature data scheme or model relating feature data and an assessment status;\ngenerating a subject patient dataset including the features selected for the related feature data subset;\ncomparing the subject patient dataset to the feature data scheme or model to allocate an assessment status for the patient.\n33. A method according to claim 32, wherein the patient related clinical and/or laboratory data is measure data and is processed (or pre-processed) to extract features from the measured data;\n34. A method according to claim 33, wherein processing the reduced feature data includes segregating the feature data to discriminate between assessment status.\n35. A method according to claim 32, wherein the feature data scheme allocates feature data values to an assessment status category.\n36. A method according to claim 32, wherein the feature data scheme is generated by means of defining one or more boundaries between data values to segregate or discriminate between assessment status categories.\n37. A method according to claim 36, wherein the feature data scheme generation procedure comprises defining one or more non-linear boundaries between feature data values.\n38. A method according to claim 32, wherein the reduced feature data subset is selected by means of processing the first level training dataset according to a criterion of optimality.\n39. A medical system comprising:\na computer;\na training database coupled to the computer and holding a first level training dataset comprising a multiplicity of patient data records each patient data record including patient dataset comprising a multiplicity of clinical and/or laboratory data features and including data relating to patient assessment status (for diagnosis, treatment selection, severity assessment, disease progression or otherwise);\nmeans in the computer for processing data held on the training database to select a feature data subset whose cardinality is less than that of the first level training data set; the feature data subset being derived by means of processing the data to select features appearing to discriminate for a useful prediction; and processing the reduced feature data to derive a feature data scheme or model relating feature data and patient assessment status.\n40. (canceled)\n41. (canceled)\n42. (canceled)",
    "status": "Active",
    "citations_own": [
        "US5860917A",
        "US6063028A",
        "US20020143563A1",
        "US6463321B2",
        "US6622036B1",
        "US6714925B1",
        "US20060047616A1",
        "US20060064415A1",
        "US7177675B2",
        "US7231245B2",
        "US20080233576A1",
        "US20100280403A1"
    ],
    "citations_ftf": [
        "US20050021240A1",
        "CA2589176A1",
        "US20060129324A1",
        "US7558771B2",
        "WO2009103156A1"
    ],
    "citedby_own": [
        "US20100198571A1",
        "US20100305964A1",
        "US20110038515A1",
        "US20110166883A1",
        "US20110191277A1",
        "US20110295567A1",
        "US20120124051A1",
        "US20130019285A1",
        "US20130085773A1",
        "US20130132311A1",
        "US20130151563A1",
        "US20130179389A1",
        "US8495060B1",
        "US20130246330A1",
        "US8554712B1",
        "US20130268469A1",
        "US20130324861A1",
        "US20140019161A1",
        "US20140095426A1",
        "US20140114890A1",
        "US20140122381A1",
        "WO2014100672A1",
        "US20140187973A1",
        "WO2015018517A1",
        "WO2015044945A1",
        "WO2015051040A1",
        "US9047567B2",
        "US20150199646A1",
        "US9111334B2",
        "WO2014120348A3",
        "US20150257712A1",
        "US20150302155A1",
        "US20150339451A1",
        "US20150356252A1",
        "US20150352363A1",
        "US20150379432A1",
        "US20160045128A1",
        "US9282330B1",
        "US20160098519A1",
        "WO2016061283A1",
        "US20160148529A1",
        "US9386936B2",
        "CN105868519A",
        "US20160283680A1",
        "WO2016193824A1",
        "US20170017769A1",
        "TWI566746B",
        "US20170061324A1",
        "US20170177834A1",
        "WO2017106770A1",
        "US20170235908A1",
        "US20170242879A1",
        "US20170277840A1",
        "CN107430644A",
        "US20170357760A1",
        "KR20170140757A",
        "US9869641B2",
        "US9948501B2",
        "US20180181720A1",
        "US20180190381A1",
        "US20180211725A1",
        "US20180211012A1",
        "WO2018148365A1",
        "US10062456B2",
        "WO2018158385A1",
        "US20180260426A1",
        "US20180262584A1",
        "US20180315494A1",
        "US20180330808A1",
        "CN108962397A",
        "CN109032107A",
        "CN109074420A",
        "TWI647626B",
        "US20190051405A1",
        "US20190057284A1",
        "CN109549644A",
        "US10265028B2",
        "US10268989B2",
        "US10269448B2",
        "US20190148007A1",
        "JP2019517064A",
        "CN110021386A",
        "US10361981B2",
        "US20190246968A1",
        "CN110168665A",
        "WO2019203824A1",
        "US10460074B2",
        "US10468136B2",
        "US10579663B2",
        "WO2020051272A1",
        "WO2020053849A1",
        "AU2018202678B2",
        "CN110931129A",
        "US10602940B1",
        "US10614725B2",
        "CN110974242A",
        "US20200118458A1",
        "WO2020082086A1",
        "US10650916B2",
        "US10650920B2",
        "WO2020113237A1",
        "US10740438B2",
        "US10741285B2",
        "WO2020210673A1",
        "CN111801046A",
        "US20200349434A1",
        "CN111937085A",
        "US20200402668A1",
        "US10874355B2",
        "US20200411199A1",
        "US10886026B2",
        "US10898125B2",
        "US20210057098A1",
        "US10949607B2",
        "US20210082554A1",
        "CN112530584A",
        "US10977292B2",
        "US10984387B2",
        "US10996173B2",
        "US20210174970A1",
        "US11061913B2",
        "US11068490B2",
        "US11074262B2",
        "US20210241910A1",
        "US11087864B2",
        "WO2021162953A1",
        "CN113393940A",
        "US11120895B2",
        "CN113425312A",
        "CN113488183A",
        "CN113496779A",
        "US11151462B2",
        "US11157823B2",
        "US11176444B2",
        "US11195626B2",
        "US11195625B2",
        "US11200984B2",
        "US20210406298A1",
        "US11246524B2",
        "US11246523B1",
        "US11257593B2",
        "US11275791B2",
        "US11273283B2",
        "US11282606B2",
        "WO2022060409A1",
        "US11289197B1",
        "US11302431B2",
        "US20220130513A1",
        "CN114469102A",
        "US20220172836A1",
        "US11355240B2",
        "US11350864B2",
        "US11361848B2",
        "US11364361B2",
        "US20220199226A1",
        "CN114662390A",
        "WO2022147306A1",
        "US11386999B2",
        "US20220237157A1",
        "WO2022165366A1",
        "US11430558B2",
        "US11437145B2",
        "US11452839B2",
        "WO2022217051A1",
        "US11482335B2",
        "US11482327B2",
        "US11495343B2",
        "US11514329B2",
        "US20220382722A1",
        "US11521116B2",
        "WO2023278687A1",
        "WO2023288309A1",
        "US11562828B2",
        "US11586176B2",
        "US11627902B2",
        "US11676730B2",
        "US11710576B2",
        "US11717686B2",
        "US11721441B2",
        "US11723579B2",
        "CN116798646A",
        "US11786132B2",
        "US11786694B2"
    ],
    "citedby_ftf": [
        "US9183349B2",
        "WO2007075488A2",
        "WO2009103156A1",
        "WO2011025953A1",
        "US9089292B2",
        "US10321841B2",
        "US8706521B2",
        "WO2012025622A2",
        "WO2012033976A2",
        "RU2616985C2",
        "US8990054B1",
        "WO2012122096A2",
        "US8694333B2",
        "US8560342B2",
        "US20130166320A1",
        "WO2013044185A2",
        "US9443205B2",
        "US10839046B2",
        "US9092566B2",
        "JP5881048B2",
        "JP5668090B2",
        "US10289751B2",
        "CA2905072A1",
        "US11568982B1",
        "EP3146701A4",
        "WO2015200434A1",
        "US20170228507A1",
        "FR3026631B1",
        "US10572877B2",
        "WO2016076899A1",
        "JP6013438B2",
        "US20160188800A1",
        "US20180004915A1",
        "WO2016113717A1",
        "US10509800B2",
        "US10691774B2",
        "US11037070B2",
        "DE102015109853A1",
        "US10089977B2",
        "US10332028B2",
        "US10643745B2",
        "US9916194B2",
        "FR3042873A1",
        "US20170185730A1",
        "US10430716B2",
        "FR3049843A1",
        "US20190388002A1",
        "WO2017191642A1",
        "US10861604B2",
        "US10722164B2",
        "KR102449377B1",
        "WO2018027005A1",
        "CA3035122A1",
        "US11250950B1",
        "WO2018071845A1",
        "US10937548B2",
        "WO2018090009A1",
        "CN110199358B",
        "CA3053349A1",
        "JP7046499B2",
        "US20200179600A1",
        "US10950346B2",
        "US20180330059A1",
        "US20210082577A1",
        "US11164679B2",
        "JP6463572B1",
        "US10229092B2",
        "US11704790B2",
        "US10658076B2",
        "US10937551B2",
        "WO2019147257A1",
        "US11348688B2",
        "US10939806B2",
        "US11189364B1",
        "WO2019174898A1",
        "US11250951B2",
        "US20190237173A1",
        "WO2019207510A1",
        "US11715564B2",
        "US11610688B2",
        "US11694800B2",
        "US10991463B2",
        "EP3573068A1",
        "US11574718B2",
        "US11574075B2",
        "US20190371470A1",
        "US10978180B1",
        "WO2020047253A1",
        "WO2020047224A1",
        "US20210353224A1",
        "WO2020086729A1",
        "CN109785976B",
        "US11195620B2",
        "CA3126455A1",
        "US11302443B2",
        "US11475335B2",
        "CN110056348B",
        "US11157822B2",
        "CN110599442B",
        "US20220270757A1",
        "US20220313170A1",
        "EP3796241A1",
        "US20210090735A1",
        "US10832822B1",
        "US11348671B2",
        "US11594333B2",
        "AU2020358087A1",
        "US10936962B1",
        "WO2021101463A1",
        "WO2021108390A1",
        "US10734105B1",
        "US11625422B2",
        "US11423223B2",
        "US11728017B2",
        "US20210282668A1",
        "CA3174390A1",
        "US11355175B2",
        "US11726784B2",
        "US11461651B2",
        "US11610679B1",
        "WO2021229727A1",
        "US11275936B2",
        "WO2022043992A1",
        "CN112070150B",
        "KR102421110B1",
        "US20220181036A1",
        "WO2022128622A1",
        "US20220199260A1",
        "WO2022150765A1",
        "US11501873B2",
        "WO2022212765A1",
        "CN113705711B",
        "WO2023164206A1",
        "CN114863188A",
        "US11771377B1"
    ]
}