{
    "patent_id": "US-11596321-B2",
    "title": "Methods for training a model for use in radio wave based blood pressure monitoring ",
    "assignee": "Movano Inc.",
    "publication_date": "2023-03-07",
    "patent_link": "https://patents.google.com/patent/US11596321B2/en",
    "inventors": [
        "Michael A. Leabman"
    ],
    "classifications": [
        "A61B5/681",
        "A61B5/0245",
        "A61B5/021",
        "A61B5/02141",
        "A61B5/022",
        "A61B5/02438",
        "A61B5/05",
        "A61B5/0507",
        "A61B5/1114",
        "A61B5/1118",
        "A61B5/112",
        "A61B5/1126",
        "A61B5/14532",
        "A61B5/489",
        "A61B5/6898",
        "A61B5/725",
        "A61B5/7257",
        "A61B5/7267",
        "A61B5/742",
        "G01S13/53",
        "G01S13/58",
        "G01S13/87",
        "G01S13/88",
        "G01S7/025",
        "G06F1/163",
        "G06N20/00",
        "H01Q1/2283",
        "H01Q1/273",
        "H01Q21/061",
        "H01Q21/065",
        "A61B2503/10",
        "A61B2505/09",
        "A61B2562/0228",
        "A61B5/02108",
        "A61B5/02444",
        "G01S7/028",
        "G06N20/20",
        "G06N5/01"
    ],
    "abstract": "Methods for training a model for use in monitoring a health parameter in a person are disclosed. In an embodiment, a method involves monitoring a blood pressure of a person using a control blood pressure monitoring system, receiving control data that corresponds to the monitoring using the control blood pressure monitoring system, receiving stepped frequency scanning data that corresponds to radio waves that have reflected from blood in a blood vessel of the person, wherein the stepped frequency scanning data is collected through multiple receive antennas over a range of frequencies, generating training data by combining the control data with the stepped frequency scanning data in a time synchronous manner, and training a model using the training data to produce a trained model, wherein the trained model correlates stepped frequency scanning data to values that are indicative of a blood pressure of a person.",
    "claims": "\n1. A method for training a model for use in monitoring a health parameter in a person, the method comprising:\nmonitoring a blood pressure of a person using a control blood pressure monitoring system;\nreceiving control data that corresponds to the monitoring using the control blood pressure monitoring system;\nreceiving stepped frequency scanning data that corresponds to radio waves that have reflected from blood in a blood vessel of the person, wherein the stepped frequency scanning data is collected through multiple receive antennas over a range of frequencies;\ngenerating training data by combining the control data with the stepped frequency scanning data in a time synchronous manner; and\ntraining a model using the training data to produce a trained model, wherein the trained model correlates stepped frequency scanning data to values that are indicative of a blood pressure of a person;\nwherein the stepped frequency scanning data includes time, frequency, amplitude, phase, and antenna orientation data over a range of frequencies for each of a plurality of receive antennas in a two-dimensional array of receive antennas.\n2. The method of claim 1, wherein generating training data comprises deriving data from the stepped frequency scanning data.\n3. The method of claim 2, wherein deriving data from the stepped frequency scanning data comprises calculating a statistic from the stepped frequency scanning data.\n4. The method of claim 2, wherein deriving data from the stepped frequency scanning data comprises calculating a standard deviation from amplitude data of the stepped frequency scanning data.\n5. The method of claim 2, wherein deriving data from the stepped frequency scanning data comprises calculating a standard deviation from phase data of the stepped frequency scanning data.\n6. The method of claim 2, wherein training a model using the training data comprises training a model using the derived data.\n7. The method of claim 2, wherein the derived data comprises a statistic derived from the stepped frequency data and wherein training a model using the training data comprises training a model using the statistic.\n8. The method of claim 1, wherein the stepped frequency scanning data is generated by transmitting radio waves below the skin surface of the person and receiving radio waves on a two-dimensional array of receive antennas, the received radio waves including a reflected portion of the transmitted radio waves that is reflected from a blood vessel of the person.\n9. The method of claim 8, wherein the stepped frequency scanning data includes frequency and corresponding amplitude and phase data over a range of frequencies for each of a plurality of receive antennas in the two-dimensional array of receive antennas.\n10. The method of claim 1, wherein the stepped frequency scanning data includes frequency and corresponding amplitude and phase data over a range of frequencies for each of a plurality of receive antennas in a two-dimensional array of receive antennas.\n11. The method of claim 1, wherein the control blood pressure monitoring system is a clinically accepted blood pressure monitoring system.",
    "status": "Active",
    "citations_own": [
        "WO2006043774A1",
        "US20110221519A1",
        "US20130010849A1",
        "US20130297223A1",
        "US20140134959A1",
        "US20170065184A1",
        "US20170086672A1",
        "US20170286730A1",
        "US20190008422A1"
    ],
    "citations_ftf": [
        "GB9126944D0",
        "US6664920B1",
        "US5642733A",
        "US6128276A",
        "US8571624B2",
        "WO2006076488A2",
        "US7671784B2",
        "WO2007003955A1",
        "JP2010526646A",
        "US20100152600A1",
        "EP2265169A4",
        "US8179333B2",
        "GB0908043D0",
        "US20130300573A1",
        "GB201018413D0",
        "US20160317060A1",
        "US10921886B2",
        "US20170164878A1",
        "US20140012117A1",
        "US20150018660A1",
        "WO2015114626A1",
        "EP4233711A3",
        "US9372256B2",
        "US9662073B2",
        "US20150263777A1",
        "US9575560B2",
        "US9921660B2",
        "US9811164B2",
        "US11229383B2",
        "US9894192B2",
        "WO2016054079A1",
        "US20170303858A1",
        "US9924880B2",
        "US9817109B2",
        "CN107645922B",
        "US10139916B2",
        "US9915730B2",
        "US10209192B2",
        "WO2017066347A1",
        "WO2017123299A1",
        "US11106273B2",
        "KR20180085760A",
        "EP3386384A4",
        "GB201602773D0",
        "US10092207B1",
        "US10478099B2",
        "US20180103906A1",
        "IL248615B",
        "US11380118B2",
        "US20190219368A1",
        "CA2953984A1",
        "US10505255B2",
        "WO2018145042A1",
        "US20190064344A1",
        "US10845461B2",
        "US10398370B2",
        "EP3451117B1",
        "US20190097328A1",
        "US10817594B2",
        "US10775490B2",
        "US11278241B2",
        "US11346936B2",
        "US10895634B2",
        "CN111867458A",
        "US10631753B2",
        "US10849557B2",
        "CA3168472A1",
        "US11016574B2",
        "US11583199B2"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US20210156986A1",
        "US11063373B1",
        "US11234619B2",
        "US11058317B1",
        "US11031970B1",
        "US11330997B2",
        "US11193923B2",
        "US11058331B1",
        "USD942430S1",
        "US20210406419A1",
        "US11437147B2",
        "US11389091B2",
        "US11510597B2",
        "US11764488B2",
        "US11689274B2",
        "US11275595B1",
        "US20220192511A1",
        "US11786133B2",
        "WO2022133081A1",
        "US20220192493A1",
        "US11033208B1",
        "US11234618B1",
        "US11284820B1",
        "US11284819B1",
        "CN113576475B",
        "EP4144292A1",
        "CN116058832A",
        "USD991063S1",
        "US11529077B1",
        "US11802843B1",
        "US11696698B1"
    ]
}