{
    "patent_id": "US-10503386-B2",
    "title": "Messaging window overlay for a browser ",
    "assignee": "Please Don't Go, LLC.",
    "publication_date": "2019-12-10",
    "patent_link": "https://patents.google.com/patent/US10503386B2/en",
    "inventors": [
        "Pavel S. KILCHENKO",
        "Gene I. Kofman",
        "Michael G. Makar",
        "Tracy A. Tindall"
    ],
    "classifications": [
        "G06F3/04847",
        "G06F16/9535",
        "G06F16/9537",
        "G06F3/013",
        "G06F3/0485",
        "G06F3/0488",
        "G06F3/147",
        "G06N20/00",
        "G06N3/006",
        "G06N3/043",
        "G06N3/0436",
        "G06Q10/10",
        "G06Q30/02",
        "G06Q30/0255",
        "G06Q30/0269",
        "H04L51/02",
        "G06F9/453",
        "G06N7/005",
        "G06N7/01"
    ],
    "abstract": "Disclosed is a novel system and process for launching a messaging window such as a chat bot, especially in a mobile platforms such a smart phones and tablets. The process begins with displaying a web page with webpage contents in a browser window with a primary top bar and a display window. In response to receiving user input to scroll the webpage contents of the browser window are scrolled in a horizontal direction, a vertical direction, or a combination thereof. Also, a secondary top bar, as a previously invisible graphical element within the webpage contents of the web page is now displayed in substantial position and with the substantially the same appearance to look like the primary the top bar. In response to receiving user input in the vicinity of the secondary top bar, the system triggers a presentation of a messaging window or chat window.",
    "claims": "\n1. A computer-implemented method for presenting a message, the method comprising:\ndisplaying, on an electronic device, contents of at least one webpage with webpage contents in browser window with a primary top bar located at a primary position, and a display window within a single browser tab;\nin response to receiving an input to scroll the webpage contents, triggering a presentation of a previously invisible secondary top bar within the webpage contents of the webpage is now made visible within the browser window and displayed in the primary position of the primary top bar, thereby replacing the primary top bar of the browser window within the single browser tab; and\nin response to receiving user input in a vicinity of the previously invisible secondary top bar, triggering a presentation of a messaging window to appear within the browser window itself, another tab of the browser window, or a combination thereof and wherein the previously invisible secondary top bar is presented in the primary position of the primary top bar, thereby replacing the primary top bar of the browser window.\n2. The computer-implemented method of claim 1, wherein the electronic device is at least one of a hand-held device, a cellular telephone, a mobile phone, a smartphone, a tablet computer, a wireless communication devices, a laptop computer, a desktop computer, or an information processing system.\n3. The computer-implemented method of claim 1, wherein the primary top bar operates as a search bar.\n4. The computer-implemented method of claim 1, wherein the browser window includes a primary top bar located at a primary position, and wherein the previously invisible secondary top bar is presented with at least a secondary top bar which is displayed in the primary position of the primary top bar, thereby replacing the primary top bar of the browser window.\n5. The computer-implemented method of claim 4, wherein the browser window includes a primary title located at a primary position, and wherein the previously invisible secondary top bar is presented with at least a secondary title which is displayed in the primary position of the primary title, thereby replacing the primary title of the browser window.\n6. The computer-implemented method of claim 1, wherein the browser window includes a primary bottom bar located at a primary position, and wherein the previously invisible secondary top bar is presented with at least a secondary bottom bar which is displayed in the primary position of the primary bottom bar, thereby either replacing or overlaying the primary bottom bar of the browser window.\n7. The computer-implemented method of claim 1, wherein the browser window includes at least two primary tabs located at a primary position, and wherein the previously invisible secondary top bar is presented with at least two secondary tabs which are displayed in the primary position of the two primary tabs, thereby either replacing or overlaying the two primary tabs of the browser window.\n8. The computer-implemented method of claim 1, wherein the input to scroll the webpage contents is a user's tactile input.\n9. The computer-implemented method of claim 1, wherein the input to scroll the webpage contents is tracking a user's eye movement.\n10. The computer-implemented method of claim 1, wherein the input to scroll the webpage contents is a user's voice input.\n11. The computer-implemented method of claim 1, wherein the previously invisible secondary top bar is a new tab and the new tab has focus to receive further input.\n12. The computer-implemented method of claim 1, wherein the previously invisible secondary top bar is made visible to appear as a separate window within the browser window and the separate window has focus to receive further input.\n13. The computer-implemented method of claim 12, wherein the previously invisible secondary top bar includes a tool bar with user selectable icons.\n14. The computer-implemented method of claim 12, wherein the previously invisible secondary top bar includes displaying a web feed, a web channel feed, a rich site summary (RSS), or a combination thereof.\n15. The computer-implemented method of claim 1, wherein a handheld device is operated by a first party, the webpage contents displayed in the browser window is hosted by a second party, and the previously invisible secondary top bar is managed via a web-based management console by a third party, wherein each of the first party, the second party, and the third party are distinct and unrelated entities.\n16. A system for presenting a message, the system comprising:\na computer memory capable of storing machine instructions;\na processor in communication with said computer memory, said processor configured to access the computer memory, the processor performing\ndisplaying, on an electronic device, contents of at least one webpage with webpage contents in browser window with a primary top bar located at a primary position, and a display window within a single browser tab;\nin response to at receiving an input to scroll the webpage contents, triggering a presentation of a previously invisible secondary top bar within the webpage contents of the webpage is now made visible within the browser window and displayed in the primary position of the primary top bar, thereby replacing the primary top bar of the browser window within the single browser tab; and\nin response to receiving user input in a vicinity of the previously invisible secondary top bar, triggering a presentation of a messaging window to appear within the browser window itself, another tab of the browser window, or a combination thereof and wherein the previously invisible secondary top bar is presented in the primary position of the primary top bar, thereby replacing the primary top bar of the browser window.\n17. The system of claim 16, wherein the electronic device is at least one of a hand-held device, a cellular telephone, a mobile phone, a smartphone, a tablet computer, a wireless communication devices, a laptop computer, a desktop computer, or an information processing system.\n18. The system of claim 16, wherein the primary top bar operates as a search bar.\n19. A non-transitory computer program product tangibly embodying computer readable instructions which, when implemented, cause a computer to carry out the steps of a method for presenting a message, comprising:\ndisplaying, on a handheld device, contents of at least one webpage with webpage contents in browser window with a primary top bar located at a primary position, and a display window within a single browser tab;\nin response to receiving an input to scroll the webpage contents, triggering a presentation of a previously invisible secondary top bar within the webpage contents of the webpage is now made visible within the browser window and displayed in the primary position of the primary top bar, thereby replacing the primary top bar of the browser window within a single browser tab; and\nin response to receiving user input in a vicinity of the previously invisible secondary top bar, triggering a presentation of a messaging window to appear within the browser window itself, another tab of the browser window, or a combination thereof and wherein the previously invisible secondary top bar is presented in the primary position of the primary top bar, thereby replacing the primary top bar of the browser window.\n20. The non-transitory computer program product of claim 19, wherein the primary top bar operates as a search bar.",
    "status": "Active",
    "citations_own": [
        "US6032129A",
        "US20010042023A1",
        "US20020005865A1",
        "US6349290B1",
        "US20020022999A1",
        "US20020073208A1",
        "US20020133347A1",
        "US6604141B1",
        "US6606744B1",
        "US20030154120A1",
        "US20030167195A1",
        "US20030182391A1",
        "US20030195811A1",
        "US20040030750A1",
        "US20040153357A1",
        "US6876977B1",
        "US20060026071A1",
        "US20060036430A1",
        "US20060069546A1",
        "US20060080130A1",
        "US7039599B2",
        "US20060122917A1",
        "US20060150119A1",
        "US7113918B1",
        "US7170993B2",
        "US20070150830A1",
        "US20070198368A1",
        "US20070203693A1",
        "US20080147407A1",
        "US20080176655A1",
        "US20080189367A1",
        "US20080215995A1",
        "US20080221892A1",
        "US20080288349A1",
        "US20080288249A1",
        "US7468729B1",
        "US20090100160A1",
        "US20090125477A1",
        "US7552365B1",
        "US20090216691A1",
        "US20090245500A1",
        "US20090248399A1",
        "US20090254417A1",
        "US20090254836A1",
        "US7603413B1",
        "US20090276704A1",
        "US20090292778A1",
        "US7689432B2",
        "US7739329B2",
        "US20100211431A1",
        "US7814041B2",
        "US20100293560A1",
        "US20110055309A1",
        "US8086462B1",
        "US20120095835A1",
        "US20120159349A1",
        "US20130167004A1",
        "US20140244404A1",
        "US8949377B2",
        "US20150121257A1",
        "US20150346929A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US11418466B1"
    ],
    "citedby_ftf": [
        "US9318108B2",
        "US8977255B2",
        "US8676904B2",
        "US10706373B2",
        "US10276170B2",
        "US8682667B2",
        "US10417037B2",
        "WO2014124332A2",
        "US10652394B2",
        "US10748529B1",
        "US10176167B2",
        "EP3937002A1",
        "US10296160B2",
        "AU2015266863B2",
        "US9633004B2",
        "US9715875B2",
        "US10170123B2",
        "US9430463B2",
        "US9338493B2",
        "US10127911B2",
        "US9668121B2",
        "US10152299B2",
        "US9886953B2",
        "US9721566B2",
        "US10460227B2",
        "US10083688B2",
        "US10200824B2",
        "US9578173B2",
        "US20160378747A1",
        "US10671428B2",
        "US10747498B2",
        "US10691473B2",
        "US10956666B2",
        "US10223066B2",
        "US10482132B2",
        "US11227589B2",
        "US10586535B2",
        "DK201670540A1",
        "US10645037B2",
        "US11030623B2",
        "US10474753B2",
        "CA2962891A1",
        "US11442612B2",
        "US11204787B2",
        "US10476988B2",
        "US10594633B2",
        "DK201770383A1",
        "US10395654B2",
        "DK180048B1",
        "US10726832B2",
        "DK179496B1",
        "US11301477B2",
        "DK201770429A1",
        "DK179745B1",
        "DK179560B1",
        "US20180336892A1",
        "US10311144B2",
        "US10303715B2",
        "FR3067208A1",
        "US10614122B2",
        "US10600409B2",
        "US10657173B2",
        "US10652170B2",
        "EP3451175A1",
        "GB2569335B",
        "US11042602B2",
        "US20190266634A1",
        "US10592604B2",
        "US10818288B2",
        "US10594635B2",
        "US20190327191A1",
        "US10928918B2",
        "US10892996B2",
        "DK179822B1",
        "DK180639B1",
        "US10496705B1",
        "US11010561B2",
        "US11462215B2",
        "US10839159B2",
        "US11170166B2",
        "US11144961B1",
        "US11475898B2",
        "US20200142719A1",
        "FI129164B",
        "US11638059B2",
        "US11348573B2",
        "US10601740B1",
        "US11423908B2",
        "US11475884B2",
        "US11217251B2",
        "US11307752B2",
        "US11140099B2",
        "US11289073B2",
        "DK201970511A1",
        "US11496600B2",
        "DK180129B1",
        "US11468890B2",
        "US11360641B2",
        "CN110457623A",
        "US11327625B2",
        "US11657424B2",
        "WO2021022257A1",
        "WO2021022184A1",
        "US11645720B2",
        "US11636509B2",
        "WO2021056255A1",
        "US11183193B1",
        "US11755276B2",
        "US11438683B2",
        "US11568438B1",
        "CN112527172B",
        "CA3209355A1"
    ]
}