{
    "patent_link": "https://patents.google.com/patent/US20050283427A1/en",
    "patent_id": "US20050283427A1",
    "title": "Automated trading system and software for financial markets",
    "abstract": "A redundant and hosted automated trading system and software for financial markets which allows price speculators to create fully automated or partially automated trading systems or engines using technical and fundamental data-driven triggers for market entry, exit, and trade management is provided. The automated trading system can reside locally on the user's computer or reside and is actuated in a remote, hosted, redundant computing environment. The system allows the trader to create fully or partially automated simple or complex conditions for market entry, market exit, and in-trade management which are then executed by the automated system on behalf of the trader. The system also enables users to automate their in-trade decisions through use of contextual exits which allow users to optimize each trade by mapping different strategies for each level. The system also enables users to create, manage, buy, sell, license, or provide automated trading processes, signals, or engines including selling automated signals or engines to other users for financial gain.",
    "inventors": [
        "Joseph Owens",
        "Cord Awtry"
    ],
    "assignee": "FX Engines Inc",
    "classifications": [],
    "claims": "\n1. An automated trading system for financial markets comprising:\nat least one automated trading computer in communication with the Internet;\nat least one user computer in communication with said Internet;\nat least one financial market dealer computer in communication with said Internet;\nwhereby a user through said at least one user computer communicates with said at least one automated trading computer to identify at least one parameter and at least one parameter trigger point for creating an automated trade process;\nsaid automated trading computer, upon receiving said at least one parameter and said at least one parameter trigger point, monitors a plurality of real time data of said at least one parameter;\nwherein when said at least one parameter trigger point is obtained, said automated trading computer automatically communicates with said at least one financial market dealer computer to execute said automated trade process.\n2. The system of claim 1, wherein said at least one parameter is related to foreign exchange data.\n3. The system of claim 1, wherein said automated trade process is comprised of an entry order for entering a financial position.\n4. The system of claim 1, wherein said automated trade process is comprised of an exit order for exiting a financial position.\n5. The system of claim 1, where said automated trade process is comprised of an entry order for entering a financial position and an exit order for exiting a financial position.\n6. The system of claim 1, wherein said automated trade process is comprised of at least one contextual exit order for exiting a financial position.\n7. The system of claim 1, further comprising at least one database of a plurality of historical data related to said at least one parameter for enabling said user to test said automated trade process against said plurality of historical data.\n8. The system of claim 1, further comprising at least one database of at least one non-user created automated trading processes made available for use to said user through said at least one automated trading computer.\n9. A method of conducting an automatic trade through an automated trade system for financial markets comprising:\nconnecting at least one automated trading computer, in communication with a memory including a database defined by the memory, to a computer network for two way communication;\ncommunicating with a user computer connected to said computer network and providing a user interface for a user to create an automated trading process based on at least one trigger point of at least one parameter;\nsaving said automated trading process in said database;\nmonitoring a plurality of real time data related to said at least one parameter; and\nprocessing said automatic trade process when said at least one trigger point of at least one parameter is obtained.\n10. The method according to claim 9, further comprising the step of processing said automated trading process against a plurality of historical data related to said at least one parameter to determine historical performance perspective.\n11. The method according to claim 9, wherein said at least one parameter is related to foreign currency exchange\n12. The method according to claim 9, wherein said automated trading process is comprised of an entry order for entering a financial position.\n13. The method according to claim 9, wherein said automated trading process is comprised of an exit order for exiting a financial position.\n14. The method according to claim 9, where said automated trading process is comprised of an entry order for entering a financial position and an exit order for exiting a financial position.\n15. The method according to claim 9, wherein said automated trading process is comprised of at least one contextual exit order for exiting a financial position.\n16. The method of claim 9, further comprising the step of offering at least one non-user created automated trading processes available for use to said user through said at least one automated trading computer.\n17. A method of providing an automated trading system for financial market trading comprising:\nproviding a website on the Internet for access to said automated trading system;\nproviding an interface for a user, accessible from said website, to create at least one automatic trading process based upon at least one trigger point of at least one parameter\nproviding a process for automated monitoring of said at least one parameter;\nproviding a process for executing said at least one automated trading process when said at least one trigger point is obtained.\n18. The method according to claim 17, further comprising the steps of:\nprocessing said automated trading process against a plurality of historical data related to said at least one parameter to determine historical performance of said automated trading process.\n19. The method according to claim 17, wherein said at least one parameter is related to foreign currency exchange trading.\n20. The method according to claim 17, wherein said automated trading process is comprised of an entry order for entering a financial position.\n21. The method according to claim 17, wherein said automated trading process is comprised of an exit order for exiting a financial position.\n22. The method according to claim 17, where said automated trading process is comprised of an entry order for entering a financial position and an exit order for exiting a financial position.\n23. The method according to claim 17, wherein said automated trading process is comprised of at least one contextual exit order for exiting a financial position.\n24. The method of claim 17, further comprising the step of providing a process for offering at least one non-user created automated trading processes available for use by said user through said automatic trading system.",
    "status": "Abandoned",
    "citations_own": [
        "US20030236737A1",
        "US7177833B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20060190375A1",
        "US20060195380A1",
        "US20080015970A1",
        "WO2008013916A2",
        "US20080172318A1",
        "US20080172320A1",
        "US20080172319A1",
        "WO2008089213A2",
        "US20080319886A1",
        "US20090307121A1",
        "US20100057626A1",
        "US20100106636A1",
        "US7765137B1",
        "US20100191638A1",
        "US7873544B2",
        "US7873561B1",
        "US7877316B2",
        "US7908201B2",
        "US7912775B1",
        "US7917418B2",
        "US7937315B2",
        "US20110137785A1",
        "US20110264578A1",
        "US20110276456A1",
        "US20120221455A1",
        "US20120271748A1",
        "US20130103564A1",
        "US8712903B2",
        "US8799131B2",
        "US20140229358A1",
        "US8832211B1",
        "US20140330694A1",
        "US8977565B2",
        "US9792649B1",
        "US10169819B1",
        "US10380690B2",
        "US10614520B2",
        "US10885582B2",
        "US11367136B2",
        "US11489777B1"
    ],
    "citedby_ftf": []
}