{
    "patent_id": "US-11627160-B2",
    "title": "Intelligent-interaction honeypot for IoT devices ",
    "assignee": "Palo Alto Networks, Inc.",
    "publication_date": "2023-04-11",
    "patent_link": "https://patents.google.com/patent/US11627160B2/en",
    "inventors": [
        "Tongbo Luo",
        "Zhaoyan Xu",
        "Xing Jin",
        "Yanhui Jia",
        "Xin Ouyang"
    ],
    "classifications": [
        "H04L63/1491",
        "G06F21/53",
        "G06F21/566",
        "G06N20/00",
        "G06N7/005",
        "G06N7/01",
        "H04L63/0428",
        "H04W12/121",
        "H04W4/70",
        "H04L63/1425"
    ],
    "abstract": "Techniques for providing an intelligent-interaction honeypot for IoT devices in accordance with some embodiments. In some embodiments, a system/process/computer program product for providing an intelligent-interaction honeypot for IoT devices includes receiving a request from an attacker sent to an IP address that is associated with a honeypot instance for Internet of Things (IoT) devices; determining a response to the request using a data store that stores a plurality of responses and associated IoT device information, wherein the plurality of responses and associated IoT device information is generated based on automated machine learning of active probing of physical IoT devices on the Internet; and sending the response from the honeypot instance for IoT devices to the attacker, wherein the attacker is unable to detect that the response is associated with an emulated IoT device.",
    "claims": "\n1. A system, comprising:\na processor configured to:\ndetermine a response to a request from an attacker sent to an IP address that is associated with a honeypot instance for Internet of Things (IoT) devices using a data store that stores a plurality of responses and associated IoT device information, wherein the plurality of responses and associated IoT device information is generated based on automated machine learning of an active probing of physical IoT devices on the Internet comprising:\ncollect information for a plurality of physical IoT devices on the Internet including IP information for the plurality of physical IoT devices on the Internet, wherein the IP information further includes open port information for each of the plurality of physical IoT devices on the Internet that is collected using a port scanning tool to facilitate active probing of the plurality of physical IoT devices on the Internet;\nperform the active probing of a plurality of physical IoT devices on the Internet using the IP information and open port information for each of the plurality of physical IoT devices on the Internet and based on a plurality of distinct types of attacks that target one or more types of IoT devices to determine a plurality of responses that increase a probability of triggering an attacker to perform an exploitation; and\nselect one of the plurality of responses to the request based on the automated machine learning of active probing of physical IoT devices on the Internet, wherein selecting one of the plurality of responses to the request comprises:\ndetermine a set of responses for each of the plurality of distinct IoT devices in response to one or more requests received from the attacker, wherein the plurality of responses associated with the plurality of distinct IoT devices are selected based, at least in part, on an IoT device type, a firmware version associated with each of the distinct IoT devices, or a combination thereof; and\nsend the response from the honeypot instance for IoT devices to the attacker, wherein the attacker is unable to detect that the response is associated with an emulated IoT device; and\na memory coupled to the processor and configured to provide the processor with instructions.\n2. The system recited in claim 1, wherein the honeypot instance for IoT devices triggers the attacker to send a payload that is logged for malware analysis.\n3. The system recited in claim 1, wherein the honeypot instance for IoT devices captures an exploitation attempt by the attacker.\n4. The system recited in claim 1, wherein the honeypot instance for IoT devices is an intelligent-interaction honeypot for IoT devices.\n5. The system recited in claim 1, wherein the honeypot instance for IoT devices sends a distinct response for requests that are targeting distinct IoT devices.\n6. The system recited in claim 1, wherein the honeypot instance for IoT devices is implemented using a virtual machine (VM) instance executed on a server.\n7. The system recited in claim 1, wherein the processor is further configured to:\ncollect information for the plurality of physical IoT devices on the Internet.\n8. The system recited in claim 1, wherein the processor is further configured to:\ninitiate a virtual machine (VM) instance for implementing the honeypot instance for the IoT devices.\n9. The system recited in claim 1, wherein the processor is further configured to:\nreceive another request sent to the IP address that is associated with the honeypot instance for IoT devices;\ndetermine another response to the another request using the data store that stores the plurality of responses and associated IoT device information, wherein the honeypot instance for IoT devices sends a distinct response for requests that are targeting distinct IoT devices; and\nsend the another response from the honeypot instance for IoT devices to the attacker, wherein the attacker is unable to detect that the another response is associated with the emulated IoT device.\n10. The system recited in claim 1, wherein the processor is further configured to:\nstore a plurality of requests associated and a plurality of responses associated with a plurality of distinct IoT devices, wherein the plurality of distinct IoT devices comprises a subset of the plurality of the plurality of physical IoT devices on the Internet.\n11. A method, comprising:\ndetermining a response to a request from an attacker sent to an IP address that is associated with a honeypot instance for Internet of Things (IoT) devices using a data store that stores a plurality of responses and associated IoT device information, wherein the plurality of responses and associated IoT device information is generated based on automated machine learning of an active probing of physical IoT devices on the Internet comprising:\ncollecting information for a plurality of physical IoT devices on the Internet including IP information for the plurality of physical IoT devices on the Internet, wherein the IP information further includes open port information for each of the plurality of physical IoT devices on the Internet that is collected using a port scanning tool to facilitate active probing of the plurality of physical IoT devices on the Internet;\nperforming the active probing of a plurality of physical IoT devices on the Internet using the IP information and open port information for each of the plurality of physical IoT devices on the Internet and based on a plurality of distinct types of attacks that target one or more types of IoT devices to determine a plurality of responses that increase a probability of triggering an attacker to perform an exploitation; and\nselecting one of the plurality of responses to the request based on the automated machine learning of active probing of physical IoT devices on the Internet, wherein selecting one of the plurality of responses to the request comprises:\ndetermining a set of responses for each of the plurality of distinct IoT devices in response to one or more requests received from the attacker, wherein the plurality of responses associated with the plurality of distinct IoT devices are selected based, at least in part, on an IoT device type, a firmware version associated with each of the distinct IoT devices, or a combination thereof; and\nsending the response from the honeypot instance for IoT devices to the attacker, wherein the attacker is unable to detect that the response is associated with an emulated IoT device.\n12. The method of claim 11, wherein the honeypot instance for IoT devices triggers the attacker to send a payload that is logged for malware analysis.\n13. The method of claim 11, wherein the honeypot instance for IoT devices captures an exploitation attempt by the attacker.\n14. The method of claim 11, wherein the honeypot instance for IoT devices is an intelligent-interaction honeypot for IoT device.\n15. The method of claim 11, wherein the honeypot instance for IoT devices sends a distinct response for requests that are targeting distinct IoT devices.\n16. The method of claim 11, wherein the honeypot instance for IoT devices is implemented using a virtual machine (VM) instance executed on a server.\n17. The method of claim 11, further comprising:\ncollecting information for the plurality of physical IoT devices on the Internet.\n18. The method of claim 11, further comprising:\nreceiving another request sent to the IP address that is associated with the honeypot instance for IoT devices;\ndetermining another response to the another request using the data store that stores the plurality of responses and associated IoT device information, wherein the honeypot instance for IoT devices sends a distinct response for requests that are targeting distinct IoT devices; and\nsending the another response from the honeypot instance for IoT devices to the attacker, wherein the attacker is unable to detect that the another response is associated with the emulated IoT device.\n19. The method of claim 11, further comprising:\nstoring a plurality of requests associated and a plurality of responses associated with a plurality of distinct IoT devices, wherein the plurality of distinct IoT devices comprises a subset of the plurality of the plurality of physical IoT devices on the Internet.\n20. A computer program product, the computer program product being embodied in a non-transitory tangible computer readable storage medium and comprising computer instructions for:\ndetermining a response to a request from an attacker sent to an IP address that is associated with a honeypot instance for Internet of Things (IoT) devices using a data store that stores a plurality of responses and associated IoT device information, wherein the plurality of responses and associated IoT device information is generated based on automated machine learning of an active probing of physical IoT devices on the Internet comprising:\ncollecting information for a plurality of physical IoT devices on the Internet including IP information for the plurality of physical IoT devices on the Internet, wherein the IP information further includes open port information for each of the plurality of physical IoT devices on the Internet that is collected using a port scanning tool to facilitate active probing of the plurality of physical IoT devices on the Internet;\nperforming the active probing of a plurality of physical IoT devices on the Internet using the IP information and open port information for each of the plurality of physical IoT devices on the Internet and based on a plurality of distinct types of attacks that target one or more types of IoT devices to determine a plurality of responses that increase a probability of triggering an attacker to perform an exploitation; and\nselecting one of the plurality of responses to the request based on the automated machine learning of active probing of physical IoT devices on the Internet, wherein selecting one of the plurality of responses to the request comprises:\ndetermining a set of responses for each of the plurality of distinct IoT devices in response to one or more requests received from the attacker, wherein the plurality of responses associated with the plurality of distinct IoT devices are selected based, at least in part, on an IoT device type, a firmware version associated with each of the distinct IoT devices, or a combination thereof; and\nsending the response from the honeypot instance for IoT devices to the attacker, wherein the attacker is unable to detect that the response is associated with an emulated IoT device.",
    "status": "Active",
    "citations_own": [
        "US20160044054A1",
        "US20160065611A1",
        "US20170034193A1",
        "US20170093910A1",
        "US20170223037A1",
        "US20170310705A1",
        "US20170310706A1",
        "US20170318053A1",
        "US20170353491A1",
        "US20180145978A1",
        "US20180198801A1",
        "US20180219880A1",
        "US20180234302A1",
        "US20180332005A1",
        "US20180375897A1",
        "US20190020683A1",
        "US20190043054A1",
        "US10326796B1",
        "US10362057B1",
        "US20200053567A1"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "US10681058B2",
        "US10938854B2",
        "EP3711261B1",
        "EP3711274A4",
        "US11297103B2",
        "US11588838B2",
        "US11709946B2",
        "US11374958B2",
        "US11005870B2",
        "US11171960B2",
        "US11570190B2",
        "KR20190096853A",
        "US11750651B2",
        "US11233823B1",
        "CN111181998B",
        "CN111211948B",
        "CN111400703B",
        "US20210344690A1",
        "US11483346B2",
        "US11652842B2",
        "CN111885076A",
        "CN114070575A",
        "CN112118577B",
        "CN113098905B",
        "CN113765883B",
        "CN114157450A",
        "CN114063542B",
        "CN114422285B",
        "CN114363093B",
        "CN114726600B",
        "CN114978942A",
        "CN114978731B"
    ]
}