{
    "patent_id": "US-10921782-B2",
    "title": "Real-time adaptive control of additive manufacturing processes using machine learning ",
    "assignee": "Relativity Space, Inc.",
    "publication_date": "2021-02-16",
    "patent_link": "https://patents.google.com/patent/US10921782B2/en",
    "inventors": [
        "Edward MEHR",
        "Tim Ellis",
        "Jordan NOONE"
    ],
    "classifications": [
        "B29C64/393",
        "G05B19/4099",
        "B22F10/00",
        "B22F10/12",
        "B22F10/18",
        "B22F10/25",
        "B22F10/28",
        "B22F10/38",
        "B22F10/80",
        "B22F10/85",
        "B22F12/90",
        "B22F3/1055",
        "B33Y50/02",
        "G05B13/048",
        "G06N20/00",
        "G06N20/10",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/08",
        "G06N7/02",
        "B22F2003/1057",
        "G05B2219/35134",
        "G05B2219/45165",
        "G05B2219/49011",
        "G05B2219/49017",
        "G05B2219/49018",
        "G05B2219/49023",
        "G06N3/084",
        "G06N5/003",
        "G06N5/01",
        "G06N7/005",
        "G06N7/01",
        "Y02P10/25"
    ],
    "abstract": "Methods for control of post-design free form deposition processes or joining processes are described that utilize machine learning algorithms to improve fabrication outcomes. The machine learning algorithms use real-time object property data from one or more sensors as input, and are trained using training data sets that comprise: i) past process simulation data, past process characterization data, past in-process physical inspection data, or past post-build physical inspection data, for a plurality of objects that comprise at least one object that is different from the object to be fabricated; and ii) training data generated through a repetitive process of randomly choosing values for each of one or more input process control parameters and scoring adjustments to process control parameters as leading to either undesirable or desirable outcomes, the outcomes based respectively on the presence or absence of defects detected in a fabricated object arising from the process control parameter adjustments.",
    "claims": "\n1. A method for real-time adaptive control of a post-design free form deposition process or a post-design joining process, the method comprising:\na) providing an input design geometry for an object;\nb) providing a training data set, wherein the training data set comprises:\n(i) past process simulation data, past process characterization data, past in-process physical inspection data, or past post-build physical inspection data, for a plurality of objects that comprise at least one object that is different from the object to be physically fabricated that is provided in step (a); and\n(ii) training data generated through a repetitive process of randomly choosing values for each of one or more input process control parameters and scoring adjustments to the input process control parameters as leading to either undesirable or desirable outcomes, the outcomes based respectively on the presence or absence of defects detected in a fabricated object arising from the process control parameter adjustments;\nc) providing one or more sensors, wherein the one or more sensors provide real-time data for one or more object properties as the object is being physically fabricated; and\nd) providing a processor programmed to:\n(i) predict an optimal set of one or more process control parameters for initiating the free form deposition process or joining process, wherein the predicted optimal set of one or more process control parameters are derived using a machine learning algorithm that has been trained using the training data set of step (b);\n(ii) provide a real-time classification of detected object defects using the machine learning algorithm that has been trained using the training data set of step (b), wherein the real-time data from the one or more sensors is provided as input to the machine learning algorithm, and wherein the real-time classification of detected object defects is output from the machine learning algorithm; and\n(iii) provide instructions to perform the post-design free form deposition process or post-design joining process to fabricate the object, wherein the machine learning algorithm adjusts the one or more process control parameters in real-time while physically performing the free form deposition process or the joining process.\n2. The method of claim 1, wherein steps (b) through (d) are performed iteratively and process characterization data, in-process inspection data, or post-build inspection data for each iteration is incorporated into the training data set.\n3. The method of claim 1, wherein the free form deposition process or joining process is a stereolithography (SLA), digital light processing (DLP), fused deposition modeling (FDM), selective laser sintering (SLS), selective laser melting (SLM), electronic beam melting (EBM), or welding process.\n4. The method of claim 1, wherein the machine learning algorithm comprises an artificial neural network algorithm, a Gaussian process regression algorithm, a logistical model tree algorithm, a random forest algorithm, a fuzzy classifier algorithm, a decision tree algorithm, a hierarchical clustering algorithm, a k-means algorithm, a fuzzy clustering algorithm, a deep Boltzmann machine learning algorithm, a deep convolutional neural network algorithm, a deep recurrent neural network, or any combination thereof.\n5. The method of claim 1, wherein the method is implemented using either: (i) a single integrated system comprising a deposition or joining apparatus, a sensor, and a processor; or (ii) a distributed, modular system comprising a first deposition or joining apparatus, a first sensor, and a first processor, wherein the first deposition or joining apparatus, the first sensor, and the first processor are configured to share training data and real-time process characterization data via a local area network (LAN), an intranet, an extranet, or an internet.\n6. The method of claim 1, wherein the training data set further comprises process characterization data, in-process inspection data, or post-build inspection data that is generated by an operator while manually adjusting the input process control parameters.\n7. The method of claim 1, wherein the one or more sensors comprise at least one laser interferometer, machine vision system, or sensor that detects electromagnetic radiation that is reflected, scattered, absorbed, transmitted, or emitted by the object.\n8. The method of claim 1, wherein the one or more sensors provide data on acoustic energy or mechanical energy that is reflected, scattered, absorbed, transmitted, or emitted by the object.\n9. The method of claim 1, wherein the object defects are detected as differences between object property data and a reference data set that are larger than a specified threshold, and are classified using a one-class support vector machine (SVM) or autoencoder algorithm.\n10. The method of claim 1, wherein the object defects are detected and classified using an unsupervised one-class support vector machine (SVM), autoencoder, clustering, or nearest neighbor (kNN) machine learning algorithm and a training data set that comprises object property data for defective and defect-free objects.\n11. A system for controlling a post-design free form deposition process or a post-design joining process, the system comprising:\na) a first deposition or joining apparatus for physically fabricating an object based on an input design geometry;\nb) one or more process characterization sensors, wherein the one or more process characterization sensors provide real-time data for one or more process parameters or object properties; and\nc) a processor programmed to:\n(i) provide a predicted optimal set of one or more process control parameters for initiating the free form deposition process or joining process using a machine learning algorithm;\n(ii) provide a real-time classification of object defects using the machine learning algorithm, wherein the real-time object property data from the one or more process characterization sensors is provided as input to the machine learning algorithm, and wherein the real-time classification of detected object defects is output from the machine learning algorithm; and\n(iii) provide instructions to perform the post-design free form deposition process or post-design joining process to fabricate the object, wherein the machine learning algorithm adjusts the one or more process control parameters in real-time while physically performing the free form deposition process or the joining process, and wherein the machine learning algorithm has been trained using a training data set that comprises:\ni) past process simulation data, past process characterization data, past in-process physical inspection data, or past post-build physical inspection data, for a plurality of objects that comprise at least one object that is different from the object to be physically fabricated that is provided in step (a); and\nii) training data generated through a repetitive process of randomly choosing values for each of one or more input process control parameters and scoring adjustments to the input process control parameters as leading to either undesirable or desirable outcomes, the outcomes based respectively on the presence or absence of defects detected in a fabricated object arising from the process control parameter adjustments.\n12. The system of claim 11, wherein the first deposition or joining apparatus, the one or more process characterization sensors, and the processor are configured as: (i) a single integrated system; or (ii) as distributed system modules that share training data and real-time process characterization data via a local area network (LAN), an intranet, an extranet, or an internet.\n13. The system of claim 11, wherein the one or more process characterization sensors comprise at least one laser interferometer, machine vision system, or sensor that detects electromagnetic radiation that is reflected, scattered, absorbed, transmitted, or emitted by the object.\n14. The system of claim 11, wherein the one or more process characterization sensors provide data on acoustic energy or mechanical energy that is reflected, scattered, absorbed, transmitted, or emitted by the object.\n15. The system of claim 11, wherein the object defects are detected as differences between object property data and a reference data set that are larger than a specified threshold, and are classified using a one-class support vector machine (SVM) or autoencoder algorithm.\n16. The system of claim 11, wherein the object defects are detected and classified using an unsupervised one-class support vector machine (SVM), autoencoder, clustering, or nearest neighbor (kNN) machine learning algorithm and a training data set that comprises object property data for defective and defect-free objects.\n17. The system of claim 11, wherein the first deposition or joining apparatus is a stereolithography (SLA) apparatus, digital light processing (DLP) apparatus, fused deposition modeling (FDM) apparatus, selective laser sintering (SLS) apparatus, selective laser melting (SLM) apparatus, electronic beam melting (EBM) apparatus, or welding apparatus.\n18. The system of claim 11, wherein the machine learning algorithm comprises an artificial neural network algorithm, a Gaussian process regression algorithm, a logistical model tree algorithm, a random forest algorithm, a fuzzy classifier algorithm, a decision tree algorithm, a hierarchical clustering algorithm, a k-means algorithm, a fuzzy clustering algorithm, a deep Boltzmann machine learning algorithm, a deep convolutional neural network algorithm, a deep recurrent neural network, or any combination thereof.\n19. The system of claim 11, wherein the training data set further comprises process characterization data, in-process inspection data, or post-build inspection data that is generated by an operator while manually adjusting the process control parameters.",
    "status": "Active",
    "citations_own": [
        "JPH03107470A",
        "US5751910A",
        "US6122564A",
        "US6553275B1",
        "US20030127431A1",
        "US6680456B2",
        "US6710280B2",
        "US20040060639A1",
        "US6793140B2",
        "US6822194B2",
        "US6859681B1",
        "US6925346B1",
        "US6937921B1",
        "US7139633B2",
        "US7286893B1",
        "US7326377B2",
        "US20080155442A1",
        "WO2009154484A2",
        "US7765022B2",
        "US7965754B1",
        "US8153183B2",
        "US8419996B2",
        "US8461474B2",
        "US8467978B2",
        "US20130223724A1",
        "US8546717B2",
        "US8598523B2",
        "US8613846B2",
        "US8629368B2",
        "US8663533B2",
        "US8665479B2",
        "US8678535B2",
        "US8781615B2",
        "US8836934B1",
        "US20150004046A1",
        "US20150024233A1",
        "US20150045928A1",
        "US20150040364A1",
        "US20150048209A1",
        "US20150055085A1",
        "US20150063903A1",
        "US20150064299A1",
        "US20150060422A1",
        "US20150081080A1",
        "US20150097746A1",
        "US9038368B2",
        "US9044827B2",
        "US20150158244A1",
        "US20150217520A1",
        "US20150219444A1",
        "US20150240746A1",
        "US9120151B2",
        "US20150286201A1",
        "US20150294032A1",
        "US20150298213A1",
        "US20150321427A1",
        "US20150331402A1",
        "US20150328842A1",
        "US9192990B2",
        "US20150367579A1",
        "WO2015198352A2",
        "US20150378348A1",
        "US20160010863A1",
        "US20160018320A1",
        "US20160039147A1",
        "US20160039146A1",
        "US20160056555A1",
        "WO2016029424A1",
        "US20160084578A1",
        "WO2016047874A1",
        "US20160108483A1",
        "US9327350B2",
        "US20160125594A1",
        "US20160136759A1",
        "US20160136891A1",
        "US20160144574A1",
        "US20160144567A1",
        "WO2016085965A1",
        "US9365021B2",
        "US20160170387A1",
        "US20160169821A1",
        "US20160184893A1",
        "US9399320B2",
        "US9417627B2",
        "US20160243649A1",
        "US20160243762A1",
        "US20160251093A1",
        "US20160257033A1",
        "US20160275670A1",
        "US20160297148A1",
        "US20160318130A1",
        "WO2016179121A1",
        "US20160340060A1",
        "US9507555B2",
        "US20160356245A1",
        "US9522501B2",
        "US20170032281A1",
        "US20170182595A1",
        "US20170304896A1",
        "US20170326681A1",
        "US20180341248A1",
        "US20190094842A1"
    ],
    "citations_ftf": [
        "US5394509A",
        "US9269043B2",
        "US20110103656A1",
        "WO2016196382A1",
        "US10816491B2",
        "US20180104742A1"
    ],
    "citedby_own": [
        "US11454956B2",
        "US11487271B2",
        "US11648706B2"
    ],
    "citedby_ftf": [
        "US11125655B2",
        "US10547949B2",
        "DE102016211313A1",
        "WO2018130283A1",
        "US10857735B1",
        "US10234848B2",
        "US10635085B2",
        "US10824137B2",
        "US10875125B2",
        "JP6549644B2",
        "US20190001658A1",
        "US20190070787A1",
        "US10373598B2",
        "US10444196B2",
        "US10551297B2",
        "US11475337B1",
        "EP3511122B1",
        "EP3483808A1",
        "US11112771B2",
        "TWI653605B",
        "TWI798314B",
        "US11043006B1",
        "US10891335B2",
        "US20190211072A1",
        "WO2019145795A2",
        "US10518356B2",
        "US10073440B1",
        "JP6791182B2",
        "US10857738B2",
        "JP7265318B2",
        "US11084225B2",
        "US11561690B2",
        "US11194940B2",
        "US11009863B2",
        "EP3591592A1",
        "US10732521B2",
        "WO2020032963A1",
        "KR102220029B1",
        "AU2019418729A1",
        "US11354466B1",
        "EP3856494A1",
        "EP3651081B1",
        "WO2020102614A2",
        "EP3659718B1",
        "DE102018221002A1",
        "US20200189199A1",
        "US11020907B2",
        "US11491650B2",
        "DE102018133092B3",
        "EP3671387A1",
        "TWI709922B",
        "JP7321624B2",
        "EP3674983A1",
        "EP3674984A1",
        "US11681280B2",
        "US11077620B2",
        "JP2022522945A",
        "CN109871011B",
        "JP7056592B2",
        "EP3924906B1",
        "JP6705519B1",
        "US20200265270A1",
        "US11256231B2",
        "EP3702130B1",
        "US10884396B2",
        "JP7060535B2",
        "CN111766253A",
        "US11407179B2",
        "CN110097075B",
        "CN109967741B",
        "JP2022527091A",
        "US11110667B2",
        "DE102019110360A1",
        "KR102584982B1",
        "WO2020216458A1",
        "EP3736645A1",
        "US20200368815A1",
        "EP3980269A1",
        "WO2020251550A1",
        "JP6848010B2",
        "CN110376457B",
        "US11373108B2",
        "EP3767414A1",
        "KR20230047214A",
        "US11181888B2",
        "EP3772411A1",
        "JP7365168B2",
        "JP2021037716A",
        "US11117328B2",
        "JP2021059045A",
        "WO2021081666A1",
        "US10994477B1",
        "US11712837B2",
        "TWI765403B",
        "US11760005B2",
        "WO2021112859A1",
        "US11727284B2",
        "US11285673B2",
        "WO2021128343A1",
        "US11610153B1",
        "CN113126481A",
        "DE102020100345B4",
        "DE102020000880A1",
        "DE102020104484A1",
        "US11701832B2",
        "US11604456B2",
        "US20210283717A1",
        "US11571740B2",
        "US11580455B2",
        "US20230141266A1",
        "EP3925760A3",
        "DE102020204522A1",
        "US11544464B1",
        "US11301980B2",
        "EP3900857A1",
        "US11531920B2",
        "DE102020111747A1",
        "DE102020112116A1",
        "US11772330B2",
        "US11493906B2",
        "WO2021232149A1",
        "US11741273B2",
        "US11524463B2",
        "US11782396B2",
        "US11513925B2",
        "JP7353245B2",
        "JP2022026568A",
        "US10994490B1",
        "US11536671B2",
        "US20230185256A1",
        "WO2022038338A1",
        "WO2022046073A1",
        "EP4189504A1",
        "US11562467B2",
        "CN112132796A",
        "KR20230070215A",
        "EP4214585A1",
        "CN112296357B",
        "US20220134647A1",
        "US20220168953A1",
        "CN114846414A",
        "CN112643053B",
        "CN112651080A",
        "AU2021401816A1",
        "CN112329275B",
        "WO2022150501A1",
        "US20220219381A1",
        "CN112651968B",
        "WO2022157914A1",
        "CN112801091B",
        "IL299917A",
        "US11797744B1",
        "CN116887942A",
        "CN112883518B",
        "WO2022211434A1",
        "WO2022215056A1",
        "CN113325068A",
        "BE1029294B1",
        "WO2022235261A1",
        "WO2022233991A2",
        "DE102021116167A1",
        "EP4113229A1",
        "EP4116064A1",
        "WO2023283308A1",
        "EP4116697A1",
        "DE102021207503A1",
        "WO2023287430A1",
        "CN113442442B",
        "CN113592813B",
        "WO2023009137A1",
        "CN113732557B",
        "CN113751920B",
        "WO2023038844A1",
        "WO2023042387A1",
        "CN113962091B",
        "CN113987828B",
        "WO2023122004A1",
        "JP2023098237A",
        "WO2023140860A1",
        "US20230281439A1",
        "EP4245440A1",
        "CN115180461B",
        "CN115307731B",
        "CN116441554A",
        "CN116561706B"
    ]
}