{
    "patent_link": "https://patents.google.com/patent/US5291597A/en",
    "patent_id": "US5291597A",
    "title": "Method to provide concurrent execution of distributed application programs by a host computer and an intelligent work station on an SNA network",
    "abstract": "A method for processing distributed application programs in SNA type networks employing LU 6.2 protocols, including an information processing system having a host processor, a virtual machine type Operating System, and a plurality of Intelligent Work Stations (IWSs). The Operating System is provided with a Virtual Machine Pool Manager (VMPM). The function of the VMPM is to create and dynamically manage the assignment of a plurality of virtual machines in the pool to process requested individual LU 6.2 conversations, to permit the transfer of information between Parts A and B of a distributed Application, which parts are stored respectively at one IWS and the host processor. In response to a conversation request, an idle Virtual Machine (VM) in the pool is assigned by the VMPM to process one LU 6.2 conversation. At the termination of the conversation the VMPM returns the assigned VM to the pool with an idle status so that it can be assigned to process another conversation requested by the same IWS or a different IWS. An LU 6.2 \"session\" between Part A of a DAP executing on one IWS and Part B executing on the Host Processor, involving a plurality of sequential conversations spaced apart in time, involves only the assignment of VM resources from the pool at the host for the actual conversation time of the \"session\", and not the total session time. As a result, VM resources at the host can service a larger number of IWSs.",
    "inventors": [
        "David U. Shorter",
        "John S. Kapernick"
    ],
    "assignee": "International Business Machines Corp",
    "classifications": [
        "G06F9/4843",
        "G06F9/5027",
        "G06F9/5077",
        "G06F2209/5011",
        "G06F2209/5018"
    ],
    "claims": "\n1. A method to conserve system resources during execution of a Distributed Application Program (DAP) in an SNA network having a host processor and a plurality of terminals in which information is transferred in accordance with LU 6.2 protocols between one said terminal and said host by concurrent execution of respective parts of said DAP respectively at said one terminal and at said host processor, said host processor having a virtual machine type Operating System including a programming module to automatically setup a plurality of virtual machines each with a predefined name during the starting up of said host processor, said method comprising the following steps,\nA) creating with said host processor a pool of unassigned idle virtual machines at said host processor, including the further steps of;\n1) providing a data structure for use by said module in the creation and management of said virtual machines in said pool, including the further step of,\n(a) defining a control block having a plurality of fields, in said data structure for each said virtual machine that is automatically created including the steps of,\n(i) designating one said field for storing said name assigned to said virtual machine, and\n(ii) designating a second field for indicating the current status of said virtual machine.\n2) storing in said data structure a plurality of names for the virtual machines to be created by said programming module, and\n3) automatically creating each said virtual machine for said pool during said starting up with said programming module, including referencing said data structure for said names to be assigned to said virtual machines,\nB) transmitting to said host processor an LU 6.2 \"Allocate \" verb from said one terminal during execution of one part of a DAP stored at said terminal requesting a conversation with another part of said DAP stored at said host processor,\nC) assigning one of said idle virtual machines in said pool to process said conversation between respective said parts of said DAP, and\nD) returning said virtual machine to said pool at the end of said conversation.\n1) providing a data structure for use by said module in the creation and management of said virtual machines in said pool, including the further step of,\n(a) defining a control block having a plurality of fields, in said data structure for each said virtual machine that is automatically created including the steps of,\n(i) designating one said field for storing said name assigned to said virtual machine, and\n(ii) designating a second field for indicating the current status of said virtual machine.\n2) storing in said data structure a plurality of names for the virtual machines to be created by said programming module, and\n3) automatically creating each said virtual machine for said pool during said starting up with said programming module, including referencing said data structure for said names to be assigned to said virtual machines,\n2. The method set forth in claim 1 in which said step of automatically creating includes the further step of:\nA) setting an indicator in said status field to indicate an IDLE status during said step of automatically creating.\n3. The method recited in claim 2 including the further step of,\nA) issuing a first request from said terminal to said host for an LU 6.2 conversation between said parts of said DAP, said first request including a USERID, an identification of said DAP, and an identification of the LU 6.2 Logical Unit to process said request.\n4. The method set forth in claim 3 including the further step of\nA) determining at said host processor if said first request is to be assigned to an idle virtual machine in said pool manager including the step of,\n(1) referencing said Logical Unit identification.\n5. The method Bet forth in claim 4 including the further step of,\na) assigning one idle virtual machine to process said request in response to said step of determining,\nb) initiating a conversation between said parts of said DAP in response to an LU 6.2 \"ALLOCATE\" verb being received by said virtual machine assigned in step a),\nc) terminating said conversation in response to the first LU 6.2 \"DEALLOCATE\" verb received by said assigned virtual machine, and\nd) returing said assigned virtual machine to said pool with an idle status at the end of said step of terminating.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4400769A",
        "US4694396A",
        "US4849880A",
        "US4893307A"
    ],
    "citations_ftf": [
        "US4625081A",
        "JPH0619747B2",
        "JPS616760A",
        "US4835685A",
        "US4916608A",
        "JP2585535B2",
        "US4768150A",
        "JPS63163656A",
        "US4918595A",
        "US4862349A",
        "DE3854323T2",
        "US4949254A"
    ],
    "citedby_own": [
        "US5519833A",
        "US5727142A",
        "US5774668A",
        "US5812846A",
        "US5872929A",
        "US5933599A",
        "US5941947A",
        "US5956509A",
        "US5956489A",
        "US5978594A",
        "US6009398A",
        "US6061807A",
        "US6163797A",
        "US6289390B1",
        "US20020103882A1",
        "US20040226023A1",
        "US20040226017A1",
        "US20040226019A1",
        "US20040226015A1",
        "US20050021660A1",
        "US20050021788A1",
        "US20050027795A1",
        "US20050108709A1",
        "US20050240737A1",
        "US20050257219A1",
        "US20050262513A1",
        "US20050262313A1",
        "US20050283673A1",
        "US20060020913A1",
        "US20060095483A1",
        "US20060253844A1",
        "US20060271931A1",
        "US20070101080A1",
        "US20070126750A1",
        "US20070174734A1",
        "US20070245348A1",
        "US7337445B1",
        "US20080082977A1",
        "US20080114945A1",
        "US20080114896A1",
        "US20080114853A1",
        "US20080114943A1",
        "US20080120477A1",
        "US20080120478A1",
        "US20080126721A1",
        "US20080126503A1",
        "US20080126502A1",
        "US20080126322A1",
        "US20080126506A1",
        "US20080126516A1",
        "US20080123642A1",
        "US20080126703A1",
        "US20080133869A1",
        "US20080133861A1",
        "US20080133859A1",
        "US20080133871A1",
        "US20080134189A1",
        "US20080130652A1",
        "US20080140975A1",
        "US20080140805A1",
        "US20080155127A1",
        "US20080195617A1",
        "US20080201711A1",
        "US20080215701A1",
        "US20080250213A1",
        "US20080250221A1",
        "US7461080B1",
        "US20090055234A1",
        "US20100121935A1",
        "US8122198B2",
        "US8181182B1",
        "WO2013106256A1",
        "US8904008B2",
        "US9043391B2",
        "US9372735B2"
    ],
    "citedby_ftf": [
        "US5187787B1",
        "US5257369A",
        "US5557798A",
        "US5392426A",
        "US5363121A",
        "EP0473913A3",
        "US5175679A",
        "US5390302A",
        "JP2945498B2",
        "US5283888A",
        "US5257384A",
        "JP2870254B2",
        "US5341508A",
        "US5590281A",
        "WO1993018464A1",
        "US5673403A",
        "CA2095311A1",
        "JP3454947B2",
        "US6330583B1",
        "US5630757A",
        "US5761507A",
        "US5893911A",
        "US5916307A",
        "US6073139A",
        "US6694370B1",
        "US6546431B1",
        "US20030149967A1",
        "US9525696B2",
        "US20020165947A1",
        "US20100042565A1",
        "US20110213869A1",
        "US20070192863A1",
        "US9800608B2",
        "US20110214157A1",
        "US8010469B2",
        "US20110219035A1",
        "US7146602B2",
        "US6880002B2",
        "US7574496B2",
        "US6990666B2",
        "US7257584B2",
        "US7287186B2",
        "US7769004B2",
        "US7643484B2",
        "CN1324470C",
        "SE529676C2",
        "US8078728B1",
        "JP2009048386A",
        "US8194674B1",
        "KR101495862B1",
        "JP5134149B1",
        "TWI454949B",
        "GB201802486D0"
    ]
}