{
    "patent_link": "https://patents.google.com/patent/US20040177035A1/en",
    "patent_id": "US20040177035A1",
    "title": "Method and system for monitoring transactions",
    "abstract": "A method for monitoring financial accounts to determine the possibility of money laundering and other attempts at fraud includes monitoring the financial accounts owned by a person or entity. Data regarding withdrawals and deposits are extracted from a computer database and analyzed. The analysis includes determining the amount of time between a large deposit and the withdrawal (in one or more transactions) of a large portion of the deposit. A further analysis may include determining the amount of time between a large withdrawal and the time of the earliest deposit, wherein multiple deposits may be combined. Using the above-described data, accounts that are more likely to be used for money laundering and other fraudulent activities.",
    "inventors": [
        "Simon Silva"
    ],
    "assignee": "Standard Chartered UK Holdings Ltd",
    "classifications": [
        "G06Q40/02",
        "G06Q20/10",
        "G06Q40/00"
    ],
    "claims": "\n1. A method of monitoring financial transactions comprising:\nselecting an account;\nanalyzing transactions performed on said account; and\ndetermining if the transactions performed are indicative of suspicious behavior.\n2. The method of claim 1 wherein said transactions comprises withdrawals and deposits.\n3. The method of claim 1 wherein said selecting step comprises:\nsearching a database to find an account owned by said account holder.\n4. The method of claim 3 wherein said analyzing step comprises:\nsearching said database to find data regarding a deposit over a first threshold amount, wherein said data includes an amount of said deposit, and a date of said deposit;\nextracting data regarding one or more withdrawals wherein said data includes an amount of said withdrawal, and a date of said withdrawal and further wherein the total amount of said withdrawals is equal to or greater than a predetermined percentage of the amount of said deposit;\ndetermining the number of days between the deposit and the withdrawal of a predetermined percentage of the amount of said deposit; and\ncalculating a constant by dividing said number of days by said deposit.\n5. The method of claim 1 wherein said method is performed using a computer.\n6. The method of claim 4 further comprising:\nfinding one or more additional accounts owned by said account holder; and further wherein,\nsaid filtering, extracting, determining, and calculating steps are performed for each of said one or more additional accounts.\n7. The method of claim 4 wherein said predetermined percentage is greater than or equal to approximately 90%.\n8. The method of claim 4 further comprising:\nflagging the account if said constant is below a second threshold amount.\n9. A method of monitoring financial transactions comprising:\nselecting an account holder;\nsearching a database to find an account owned by said account holder;\nfiltering said database to extract data regarding a withdrawal over a first threshold amount, wherein said data includes an amount of said withdrawal, and a date of said withdrawal;\nextracting data regarding one or more deposits wherein said data includes an amount of said deposit, and a date of said deposit and further wherein the total amount of said one or more deposits is equal to or greater than a predetermined percentage of the amount of said withdrawal;\ncalculating the number of days between the earliest of said one or more deposits and the withdrawal;\nformulating a constant by dividing said number of days by said amount of said withdrawal.\n10. The method of claim 9 wherein said method is performed using a computer.\n11. The method of claim 9 further comprising:\nfinding one or more additional accounts owned by said account holder; and further wherein,\nsaid filtering and extracting steps are performed for each of said one or more additional accounts.\n12. The method of claim 9 wherein said predetermined percentage is greater than or equal to approximately 90%.\n13. A system for monitoring financial accounts comprising:\na computer system configured to access various financial data;\nstorage for various financial data;\na program configured to find and extract certain pieces of financial data and analyze the data for suspicious behavior; and\noutput capabilities to transmit results of said analysis in a variety of different manners.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4774663A",
        "US4994964A",
        "US5210687A",
        "US5420405A",
        "US5457305A",
        "US5615110A",
        "US5627886A",
        "US5724488A",
        "US5790645A",
        "US5794178A",
        "US5819226A",
        "US5822741A",
        "US5842185A",
        "US5884289A",
        "US5889862A",
        "US5901229A",
        "US5913203A",
        "US5924084A",
        "US5963922A",
        "US5963648A",
        "US6016480A",
        "US6016482A",
        "US6035295A",
        "US6047174A",
        "US6072894A",
        "US6128602A",
        "US6154731A",
        "US6188753B1",
        "US6253186B1",
        "US6254000B1",
        "US6263335B1",
        "US6266664B1",
        "US6307926B1",
        "US20010034635A1",
        "US6324523B1",
        "US20020069084A1",
        "US6402027B1",
        "US6418436B1",
        "US6430274B1",
        "US6430305B1",
        "US6442533B1",
        "US20020133371A1",
        "US20020138417A1",
        "US20030033228A1"
    ],
    "citations_ftf": [
        "AU6279896A",
        "US5872844A"
    ],
    "citedby_own": [
        "US20050149527A1",
        "US20070192240A1",
        "US20070288313A1",
        "US20080021801A1",
        "US20080077515A1",
        "US20080172316A1",
        "US20080235063A1",
        "US20090106115A1",
        "US20090125369A1",
        "US20090319414A1",
        "US20100114747A1",
        "US20110071933A1",
        "US20110087575A1",
        "US20120143649A1",
        "US8229815B1",
        "US8412593B1",
        "US8464939B1",
        "US20130325574A1",
        "US8781953B2",
        "US8799148B2",
        "CN104025094A",
        "US8856894B1",
        "US9147042B1",
        "US9256904B1",
        "USD759689S1",
        "USD759690S1",
        "USD760256S1",
        "US9400589B1",
        "US9406085B1",
        "US9443268B1",
        "US9477737B1",
        "US9536263B1",
        "US9542553B1",
        "US9654541B1",
        "US9665854B1",
        "US9710852B1",
        "US9830646B1",
        "US9853959B1",
        "US9870589B1",
        "US9892457B1",
        "US10049155B2",
        "US10075446B2",
        "US10102570B1",
        "US10176233B1",
        "US10255598B1",
        "US10262364B2",
        "US10325314B1",
        "US10565645B1",
        "US10579982B2",
        "CN111091664A",
        "US10671749B2",
        "US10685398B1",
        "US10719816B1",
        "US10909509B1",
        "US10949863B1",
        "US10970684B1",
        "US20210150532A1",
        "US11037110B1",
        "US11062278B1",
        "US11170351B1",
        "US11176524B1",
        "US11238656B1",
        "US11270274B1",
        "US11315179B1"
    ],
    "citedby_ftf": [
        "US7801811B1",
        "US7805362B1",
        "US8544727B1",
        "US20080249933A1",
        "US8600872B1",
        "US8275683B2",
        "US8417630B2",
        "US8352315B2",
        "US8290868B2",
        "US8265998B2",
        "US20110010254A1",
        "US8439274B2",
        "US8762276B2",
        "US10460296B2",
        "US10437778B2",
        "US9823958B2",
        "US10437880B2",
        "US10067869B2",
        "US9952942B2",
        "US11321653B2"
    ]
}