{
    "patent_id": "US-11240181-B1",
    "title": "Artificial intelligence assisted service provisioning and modification for delivering message-based services ",
    "assignee": "Jiseki Health, Inc.",
    "publication_date": "2022-02-01",
    "patent_link": "https://patents.google.com/patent/US11240181B1/en",
    "inventors": [
        "Chandra Nagaraja",
        "Tushar Vasisht"
    ],
    "classifications": [
        "H04L51/02",
        "G16H80/00",
        "G06N20/00",
        "G06N3/006",
        "G06N5/02",
        "G06N5/027",
        "G06N5/041",
        "G16H10/20",
        "G16H10/60",
        "G16H40/20",
        "G16H40/67",
        "G16H50/20",
        "G16H50/30",
        "H04L41/16",
        "H04L67/16",
        "H04L67/306",
        "H04L67/51",
        "G06N20/10",
        "G06N3/043",
        "G06N3/044",
        "G06N3/045",
        "G06N3/049",
        "G06N3/084",
        "G06N3/088",
        "G06N3/126",
        "G06N7/01",
        "G06N7/023",
        "H04L51/18",
        "H04L51/222"
    ],
    "abstract": "Systems and methods involving AI-assisted service provisioning and modification for delivering message-based services. One exemplary method includes: receiving an input sequence from a user in relation to a request for a service, the input sequence including one or more inputs; processing the input sequence to determine a service type; associating a workflow with the request based at least in part on the service type and a profile of the user, the workflow including a set of one or more steps, a step of the set of one or more steps corresponding to a set of attributes including at least one of: a communication mode, a communication type, or a communication priority, the workflow being performed by at least one of: a chatbot, an AI assistant, or a service professional; modifying the workflow based on a new input sequent from the user using a workflow engine comprising at least one of: an AI model, a machine learning model, and a ruleset; and interacting with the user based at least in part on the workflow to deliver the service.",
    "claims": "\n1. A method for AI-assisted service provisioning and modification for delivering message-based services, comprising:\nreceiving an input sequence from a user in relation to a request for a service, the input sequence including one or more input items;\nprocessing the input sequence to determine a service type;\nassociating a workflow with the request based on the service type and a profile of the user, the workflow including a set of one or more steps, a step of the set of one or more steps corresponding to a set of attributes including at least one of: a communication mode, a communication type, or a communication priority, the workflow being performed by at least one of: a chatbot, an AI assistant, or a service professional;\nmodifying the workflow based on a new input sequence from the user using a workflow engine comprising at least one of: an AI model, a machine learning model, and a ruleset,\nwherein the workflow engine is configured to perform at least one action to workflows selected from a group of actions composed of: starting, pausing, resuming, switching, updating, and stopping one or more of the workflows; and\ninteracting with the user based at least in part on the workflow to deliver the service.\n2. The method of claim 1, wherein the modifying of the workflow further comprises modifying the workflow based at least in part on communication with another user.\n3. The method of claim 1, wherein the profile of the user is updated based at least in part on previous communication with the user to deliver a service of the same service type, and/or communication with the user to deliver a service of a type other than the service type.\n4. The method of claim 1, wherein the workflow is generated by a rule engine evaluating a ruleset corresponding to the service type.\n5. The method of claim 4, wherein a rule of the ruleset corresponding to the service type is modified using an artificial intelligence model trained based at least in part on communication related to delivering services of the service type.\n6. The method of claim 1, wherein the input sequence from the user comprises a token indicating a service type.\n7. The method of claim 6, wherein the token is a hashtag.\n8. The method of claim 1, wherein the modifying of the workflow further comprises modifying the workflow based at least in part on the profile of the user.\n9. The method of claim 1, wherein one or both of the input sequence and the new input sequence comprise at least one of: textual data, symbolic data, audio data, video data, AR data, and VR data.\n10. The method of claim 1, wherein the interacting with the user based at least in part on the workflow to deliver the service comprises messaging the user via at least one of: text communication, audio communication, video communication, AR communication, and VR communication.\n11. The method of claim 1, wherein the modifying the workflow comprises modifying and managing the workflow based on a parameter associated with the service.\n12. The method of claim 1, wherein the parameter comprises a time constraint.\n13. The method of claim 1, wherein the workflow manager is configured to allow a human operator to perform at least one action selected from a group of actions to workflows composed of: start, pause, resume, switch, update, and stop the workflows.\n14. The method of claim 1, wherein the modifying the workflow comprises cross-communications with a separate workflow via outputting to and taking input from the separate workflow.\n15. The method of claim 14, wherein the cross-communications with the separate workflow comprise modifying at least one of: a prioritization factor, a timing factor, a number of message limit, message content for one or both of the workflow and the separate workflow.\n16. The method of claim 1, further comprising at least one of: storing the workflow, configuring an input mode, channel management, instruction management, rule management, and capability management.\n17. The method of claim 1, wherein the workflow engine is trained based at least in part on one or more of: historical communication with the user to deliver a service of the same service type, historical communication with the user to deliver a service of a type other than the service type, historical communication with another user to deliver a service of the same service type, historical communication with the another user to deliver a service of a type other than the service type, and/or third-party data relating to the same service type and/or a service of a type other than the service type, the third-party data including data supplied from at least one of: a data service company, a partner, a public entity, a government entity, and a client.\n18. A method to establish a workflow engine, comprising:\nobtaining at least one of: historical data associated with historical interactions between a platform and a plurality of users, current data associated with ongoing interactions between the platform and the plurality of users, third-party data, priorities associated with issues, time constraints, data gathered via input from entities performing workflows;\ntraining the workflow engine to associate a workflow with an incoming request from a user;\ntraining the workflow engine to detect cross-communication triggers in workflows;\ntraining the workflow engine to modify workflows based at least in part on at least one of: an AI model, a machine learning model, and a ruleset; and\nexecuting the workflow engine to delivery services to the user.\n19. The method of claim 18, wherein workflow engine is configured to start, pause, stop, and modify the workflow.\n20. The method of claim 18, wherein workflow engine is configured to update a profile associated with the user.\n21. A method for managing a plurality of workflow associated with a user, comprising:\nmonitoring a first workflow associated with the user, the first workflow initiated in response to a first new input sequence from the user;\nmonitoring a second workflow associated with the user, the second workflow initiated in response to a second new input sequence from the user;\ndetecting an interaction between the first workflow and the second workflow; and\nmodifying at least one of the first workflow and the second workflow based on the detected interaction, wherein the modification comprises modifying content delivered to the user by combining content generated in association with the first workflow and the content generated in association with the second workflow.\n22. The method of claim 21, wherein the modifying at least one of the first workflow and the second workflow based on the detected interaction comprises:\ndetermining at least one of a priority, a timing, and a message limit associated with the interaction; and\nmodifying at least one of the first workflow and the second workflow based on at least in part on at least one of the a priority, a timing, and a message limit.\n23. The method of claim 21, wherein the modifying at least one of the first workflow and the second workflow based on the detected interaction comprises modifying a first number of messages generated in association with the first workflow and a second number of generated in association with the second workflow such that a sum of the first number and the second number does not exceed a preconfigured number."
}