{
    "patent_id": "US-10884598-B2",
    "title": "Analytics for a bot system ",
    "assignee": "Oracle International Corporation",
    "publication_date": "2021-01-05",
    "patent_link": "https://patents.google.com/patent/US10884598B2/en",
    "inventors": [
        "Neerja Bhatt",
        "Vinay K. Gandhi",
        "Ganesh Kumar"
    ],
    "classifications": [
        "G06F9/451",
        "G06F3/0481",
        "G06F3/0482",
        "G06F3/04847",
        "G06F3/167",
        "G06F40/30",
        "G06N20/00",
        "G06N3/006"
    ],
    "abstract": "The present disclosure relates generally to techniques for monitoring and improving a bot system. An analytic system is integrated with a bot system for monitoring, analyzing, visualize, and improving the performance of the bot system. The analytic system monitors events occurred in conversations between end users and the bot system, aggregates and analyzes the collected events, and provides information regarding the conversations graphically on a graphic user interface at different generalization levels. The analytic system can also provide suggestions, options, or other information for improving the bot system through the graphic user interface.",
    "claims": "\n1. A system comprising:\nan event collector configurable to collect one or more attributes for one or more events associated with a set of conversations with a bot system;\nan analytic engine configured to, using one or more filtering criteria selected by a user:\nselect one or more conversations from the set of conversations based upon the one or more attributes for the one or more events; and\ngenerate one or more reports for the selected one or more conversations; and\na graphic user interface (GUI) server communicatively coupled to the analytic engine and configured to:\ndisplay, graphically on a GUI, a first report from the one or more reports and one or more user-selectable items associated with the first report, wherein the one or more user-selectable items include at least one element of the first report, and wherein at least one of the one or more user-selectable items corresponds to a filtering criterion of the one or more filtering criteria;\nreceive a user selection of the one or more user-selectable items; and\ndisplay, graphically on the GUI based upon the user selection, a second report from the one or more reports,\nwherein the one or more reports include an aggregated path diagram for the selected one or more conversations, the aggregated path diagram including:\na plurality of nodes that includes a start node and an end node, each of the plurality of nodes corresponding to a respective state of the bot system; and\na plurality of connections among the plurality of nodes, each of the plurality of connections representing a transition from one state of the bot system to another state of the bot system.\n2. The system of claim 1, further comprising an interface with the bot system, wherein:\nthe one or more user-selectable items include a user-editable item;\nthe GUI server is further configured to receive a user input through the user-editable item; and\nthe interface with the bot system is configured to send the user input to the bot system for improving the bot system.\n3. The system of claim 2, wherein:\nthe user-editable item includes an end user utterance or an intent associated with the end user utterance;\nthe user input includes a revised end user utterance or a revised intent for the end user utterance; and\nimproving the bot system includes retraining the bot system based upon the user input.\n4. The system of claim 1, wherein the one or more user-selectable items include a user-selectable item, which, when selected, causes one or more individual conversations to be displayed on the GUI.\n5. The system of claim 1, wherein the one or more user-selectable items include a menu for selecting, from the set of conversations, conversations ended at a particular state.\n6. The system of claim 1, wherein the one or more user-selectable items include a menu for selecting, from the set of conversations, conversations started from a particular state.\n7. The system of claim 1, wherein the one or more user-selectable items include a menu for selecting, from the set of conversations, completed or incomplete conversations.\n8. The system of claim 1, wherein the one or more user-selectable items include a menu for selecting, from the set of conversations, conversations associated with a particular end user intent.\n9. The system of claim 1, wherein the aggregated path diagram includes a number associated with each respective connection, the number indicating a total number of conversations that include the transition represented by the respective connection.\n10. The system of claim 1, wherein each node of the plurality of nodes is a user-selectable item of the one or more user-selectable items.\n11. The system of claim 1, wherein each connection of the plurality of connections is a user-selectable item of the one or more user-selectable items.\n12. The system of claim 1, wherein the one or more reports include:\na report including statistics of the set of conversations;\na report including statistics of conversations associated with a particular end user intent;\na report including conversations associated with the particular end user intent;\na report including statistics of incomplete conversations;\na report including incomplete conversations;\na report including statistics of conversations for which no end user intent is determined;\na report including conversations for which no end user intent is determined; or\na report including options for improving the bot system.\n13. The system of claim 12, wherein the report including conversations for which no end user intent is determined comprises, for each conversation of the conversations for which no end user intent is determined, a score indicating a matching between the conversation and each respective end user intent in a set of end user intents.\n14. The system of claim 1, wherein the one or more events include at least one of a conversation event, a bot state event, an intent resolution event, an entity resolution event, an error event, a timeout event, or a custom event.\n15. The system of claim 1, further comprising:\na data store configured to store the one or more attributes for the one or more events; and\nan enrichment engine configured to:\ngenerate additional attributes based upon the one or more attributes for the one or more events; and\nsave the additional attributes and the one or more attributes for the one or more events to the data store.\n16. The system of claim 1, wherein the analytic engine comprises a representational state transfer (REST) server.\n17. A computer-implemented method comprising:\ncollecting, by an event collector of an analytic system, one or more attributes for one or more events associated with a set of conversations with a bot system;\nselecting, by an analytic engine of the analytic system using one or more filtering criteria selected by a user, one or more conversations from the set of conversations based upon the one or more attributes for the one or more events;\ngenerating, by the analytic engine of the analytic system, one or more reports for the selected one or more conversations;\ndisplaying, graphically on a GUI, a first report from the one or more reports and one or more user-selectable items associated with the first report, wherein the one or more user-selectable items include at least one element of the first report, and wherein at least one of the one or more user-selectable items corresponds to a filtering criterion of the one or more filtering criteria;\nreceiving, through the GUI, a user selection of the one or more user-selectable items; and\ndisplaying, graphically on the GUI based upon the user selection, a second report from the one or more reports,\nwherein the one or more reports include an aggregated path diagram for the selected one or more conversations, the aggregated path diagram including:\na plurality of nodes that includes a start node and an end node, each of the plurality of nodes corresponding to a respective state of the bot system; and\na plurality of connections among the plurality of nodes, each of the plurality of connections representing a transition from one state of the bot system to another state of the bot system.\n18. The computer-implemented method of claim 17, further comprising:\nreceiving a user input through a user-selectable item of the one or more user-selectable items; and\ntraining the bot system based upon the user input.\n19. A system comprising:\none or more processors; and\na memory coupled to the one or more processors, the memory storing instructions, which, when executed by the one or more processors, cause the system to:\ncollect, by an event collector of the system, one or more attributes for one or more events associated with a set of conversations with a bot system;\nselect, by an analytic engine of the system using one or more filtering criteria selected by a user, one or more conversations from the set of conversations based upon the one or more attributes for the one or more events;\ngenerate, by the analytic engine, one or more reports for the selected one or more conversations;\ndisplay, graphically on a GUI, a first report from the one or more reports and one or more user-selectable items associated with the first report, wherein the one or more user-selectable items include at least one element of the first report, and wherein at least one of the one or more user-selectable items corresponds to a filtering criterion of the one or more filtering criteria;\nreceive, through the GUI, a user selection of the one or more user-selectable items; and\ndisplay, graphically on the GUI based upon the user selection, a second report from the one or more reports,\nwherein the one or more reports include an aggregated path diagram for the selected one or more conversations, the aggregated path diagram including:\na plurality of nodes that includes a start node and an end node, each of the plurality of nodes corresponding to a respective state of the bot system; and\na plurality of connections among the plurality of nodes, each of the plurality of connections representing a transition from one state of the bot system to another state of the bot system.",
    "status": "Active",
    "citations_own": [
        "US20040162724A1",
        "US20090292778A1",
        "US20110213642A1",
        "US20120041903A1",
        "US20120323682A1",
        "US8577671B1",
        "US20140122619A1",
        "US20140122083A1",
        "US20140195378A1",
        "US20140200891A1",
        "US20150256675A1",
        "US20160117726A1",
        "US20160196820A1",
        "US20160284010A1",
        "US20160299973A1",
        "US20170124457A1",
        "US20170228366A1",
        "US20170293834A1",
        "US20170357638A1",
        "US20180203755A1",
        "US10037768B1",
        "US20180337872A1",
        "US20180358001A1",
        "US20190005023A1",
        "US20190068527A1",
        "US20190103095A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20210271673A1",
        "US20220368802A1",
        "US20230013842A1",
        "US11651033B2",
        "US11709989B1"
    ],
    "citedby_ftf": [
        "US10963903B1",
        "US11625741B2",
        "US10902323B2",
        "US10666583B2",
        "US10754885B2",
        "US10812417B2",
        "USD917546S1",
        "US11429725B1",
        "US10832002B2",
        "US10419934B1",
        "US10911396B2",
        "US20200142719A1",
        "US11080023B2",
        "US10977442B2",
        "US11087091B2",
        "US11176466B2",
        "US11310172B2",
        "US10834026B2",
        "US20200250265A1",
        "WO2020176353A1",
        "US11458622B2",
        "US11080490B2",
        "CN110347809A",
        "US20200394469A1",
        "US11184298B2",
        "US10891440B1",
        "US11507617B2",
        "US20210191821A1",
        "US11204760B2",
        "JP2021140260A",
        "US11604928B2",
        "US11539650B2",
        "USD988336S1",
        "USD988351S1",
        "US11756553B2",
        "WO2022081618A1",
        "CN112363789A",
        "US11804211B2",
        "US20220230000A1",
        "US20220255885A1",
        "US11545141B1",
        "US11676156B2",
        "US11803703B2",
        "US11782964B2",
        "CN114040427B"
    ]
}