{
    "patent_link": "https://patents.google.com/patent/US5839063A/en",
    "patent_id": "US5839063A",
    "title": "Authentication system and method for preventing wireless communication fraud",
    "abstract": "An improved wireless communication system including a process and apparatus for detecting and preventing fraudulent usage of wireless communication service. The improvement includes a central database in communication with wireless communication networks and paging networks, with the central database being capable of determining when a wireless terminal is being fraudulently used in a wireless communication network. The central database is further capable of sending a paged message to the subscriber notifying the subscriber of the suspected fraudulent usage.",
    "inventors": [
        "David Y. Lee"
    ],
    "assignee": "Nokia of America Corp",
    "classifications": [],
    "claims": "\n1. A wireless communication system comprising:\nat least one wireless communication network capable of providing wireless communication services to a plurality of subscribers;\na database in communication with said at least one wireless communication network capable of storing usage threshold data, said database including a processor for determining when current subscriber usage of any of said plurality of subscribers exceeds said stored usage threshold data; and\nat least one paging network in communication with said database capable of notifying any of said subscribers by sending a page to a pager associated with said subscribers when said usage threshold data is exceeded.\n2. A wireless communication system as recited in claim 1, wherein said at least one wireless communications network is operable to monitor current subscriber usage data, and further including a data transmission network for transmitting said current subscriber usage data from said at least one wireless communication network to said database.\n3. A wireless communication system as recited in claim 1, further including an interface for transmitting a command from said database to any of said paging networks so as to activate said paging network to notify a subscriber of fraudulent activity.\n4. A wireless communication system as recited in claim 1, wherein said database is operational to communicate with said at least one wireless communication network so as to deny service to a wireless terminal associated with a subscriber when said stored usage data is exceeded.\n5. A wireless communication system as recited in claim 1, wherein said usage data is selected from the group consisting of calling duration data, call frequency data, exclusion geographical site data and combinations thereof.\n6. A wireless communication system as recited in claim 5, wherein said database is operational to update said usage data in accordance with any one of said subscribers' average daily wireless terminal activity.\n7. A wireless communication system as recited in claim 1, further including a plurality of wireless communication networks and a plurality of paging systems.\n8. A wireless terminal fraud prevention apparatus comprising:\na database capable of storing usage data of at least one subscriber, said database being in communication with at least one wireless communication network;\na processor capable of determining when current subscriber usage exceeds a stored usage threshold related to said usage data; and\nan interface connecting said processor to at least one paging system capable of transmitting a paged message to a pager associated with said subscriber when said usage threshold is exceeded.\n9. A wireless terminal fraud prevention apparatus as recited in claim 8, wherein said at least one wireless communication network is operable to monitor current subscriber usage data, and further including a data transmission network for transmitting said current subscriber usage from said at least one wireless communication network to said database.\n10. A wireless terminal fraud prevention apparatus as recited in claim 8, wherein said database is operational to communicate with said at least one wireless communication network to deny wireless service to a fraudulent user when said current subscriber usage exceeds said stored usage threshold.\n11. A wireless terminal fraud prevention apparatus as recited in claim 8, wherein said usage threshold is selected from the group consisting of calling duration data, call frequency data, exclusion geographical site data and combinations thereof.\n12. A wireless terminal fraud prevention apparatus as recited in claim 11, wherein said database is operational to update said usage data in accordance with averaged daily wireless terminal activity of said at least one subscriber.\n13. A wireless terminal fraud prevention apparatus as recited in claim 8, wherein said database is in communication with a plurality of wireless communication networks and said interface is coupled to a plurality of paging systems.\n14. A process for preventing fraudulent usage of wireless communication service, comprising:\nstoring usage data of at least one subscriber;\ndetermining if said stored usage data is exceeded by current usage data; and\nsending a paged message to a pager associated with said subscriber when said usage data is exceeded.\n15. A process of preventing fraudulent usage of wireless communication service as recited in claim 14, wherein said storing of usage data includes storing said usage data in a central database.\n16. A process for preventing fraudulent usage of wireless communication service as recited in claim 15, further including transmitting said current usage data from at least one wireless communication network to said central database.\n17. A process for preventing fraudulent usage of wireless communication service as recited in claim 15, further including updating said usage data stored in said central database with data indicative of averaged daily wireless terminal activity of said at least one subscriber.\n18. A process for preventing fraudulent usage of wireless communication service as recited in claim 14, further including terminating wireless communication service to a wireless terminal associated with said subscriber when said usage data is exceeded.\n19. A process of preventing fraudulent usage of wireless communication service as recited in claim 14, further including selecting said usage data from the group consisting of calling duration data, call frequency data, exclusion geographical site data and combinations thereof.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4955049A",
        "US5335265A",
        "US5335278A",
        "US5337345A",
        "US5345595A",
        "US5420910A",
        "US5440758A",
        "US5535431A",
        "US5555192A"
    ],
    "citations_ftf": [
        "US4661972A"
    ],
    "citedby_own": [
        "US5995823A",
        "US6058301A",
        "US6064990A",
        "US6091946A",
        "US6266525B1",
        "US6335927B1",
        "US20020025797A1",
        "US20020025799A1",
        "KR20020048047A",
        "US6456594B1",
        "US6473404B1",
        "US20020173292A1",
        "US6542729B1",
        "GB2384398A",
        "US6690654B2",
        "US6731625B1",
        "US6754181B1",
        "US20050160280A1",
        "US20050243984A1",
        "US20050249341A1",
        "US20050278550A1",
        "US20060009195A1",
        "US7027809B1",
        "US20070071228A1",
        "US20070087737A1",
        "US20070111707A1",
        "US20090265177A1",
        "US20090286496A1",
        "US20090285113A1",
        "US20100118801A1",
        "US8255971B1",
        "US8274884B1",
        "US8559926B1",
        "US8718696B2",
        "US9235841B2",
        "US9246899B1",
        "US9245270B2",
        "US9911124B2",
        "US10165495B1",
        "US10368225B2",
        "CN110210653A",
        "US10524086B2"
    ],
    "citedby_ftf": [
        "US8411833B2",
        "RU2450284C2"
    ]
}