{
    "patent_link": "https://patents.google.com/patent/US6041287A/en",
    "patent_id": "US6041287A",
    "title": "System architecture for on-line machine diagnostics",
    "abstract": "A machine diagnostic system is provided which includes a host computer for determining a health state of a machine. The host computer is operatively coupled to a network backbone. The system also includes a machine diagnostic module adapted to be integrally mounted to a machine, the machine diagnostic module being operatively coupled to the network backbone. The machine diagnostic module collects data relating to operation of the machine and preprocesses the data, and the host computer analyzes the preprocessed data in determining the health state of the machine. The machine diagnostic system includes a system architecture which facilitates the machine diagnosis. The system architecture includes several software layers which provide for collecting and preprocessing machine data, transmitting the collected and/or preprocessed data over a network and analyzing such for machine diagnosis and process diagnosis.",
    "inventors": [
        "Carl J. Dister",
        "Frederick M. Discenzo"
    ],
    "assignee": "Reliance Electric Technologies LLC",
    "classifications": [
        "G01R31/343",
        "B60L3/0023",
        "G01R1/04",
        "G01R31/31707"
    ],
    "claims": "\n1. A machine diagnostic system, including:\na host computer for determining a health state of a machine, the host computer being operatively coupled to a network backbone;\na machine diagnostic module adapted to be integrally mounted to a machine, the machine diagnostic module being operatively coupled to the network backbone, the machine diagnostic module collecting data relating to operation of the machine;\na system architecture including a software based analysis layer, the analysis layer providing for preprocessing of the machine data, the analysis layer being operative to facilitate determining positive sequence and negative sequence relating to the machine;\nwherein the host computer analyzes the preprocessed data in making a determination as to the health state of the machine.\n2. The machine diagnostics system of claim 1, the analysis layer including an algorithm for producing an FFT of machine vibration data.\n3. The machine diagnostics system of claim 1, the analysis layer including an algorithm for producing an FFT of machine current data.\n4. The machine diagnostics system of claim 1, the analysis layer being operative to facilitate determining shaft torque and shaft speed of the machine.\n5. The machine diagnostics system of claim 1, the analysis layer being operative to facilitate determining machine temperature.\n6. The machine diagnostic system of claim 1, the analysis layer being operative to facilitate determining RMS current relating to the machine.\n7. The machine diagnostic system of claim 1, the analysis layer being resident on the machine diagnostic module.\n8. The machine diagnostic system of claim 1 having a system architecture including a software based communications layer, the communications layer providing for determining a type of communications protocol being employed by the machine diagnostic system, and providing for communication between the host computer and the machine diagnostic module via the commutations protocol.\n9. The machine diagnostic system of claim 8, the communications layer being resident on the host computer.\n10. The machine diagnostic system of claim 8, the communications layer being resident of the machine diagnostic module.\n11. The machine diagnostic system of claim 10, the machine diagnostic module adapted to be removed from a first machine of a first system and coupled to a second machine of a second system, wherein a communications protocol of the first system is different from the second system, the communications layer adapted to provide for communications between the first machine and a host computer of the first system, and the communications layer adapted to recognize the type of communication protocol being employed by the second system and provide for communications between the diagnostic module attached to the second machine and a host computer of the second system.\n12. The machine diagnostic system of claim 1 having a system architecture including a memory, the memory adapted to store preprocessed data from the diagnostic module and adapted to have the preprocessed data be retrieved by the host computer.\n13. The machine diagnostic system of claim 1 having a system architecture including an expert layer adapted to analyze the preprocessed data and to facilitate determining a health state of the machine.\n14. The machine diagnostic system of claim 13, the expert layer being resident on the host computer.\n15. The machine diagnostic system of claim 13, the expert layer providing for trending of the preprocessed data so as to trend a health state of the machine.\n16. The machine diagnostic system of claim 1 having a system architecture including a process layer, the process layer adapted to analyze the preprocessed data and to facilitate determining a health state of a process employing the machine.\n17. The machine diagnostic system of claim 1 having a system architecture that is platform independant.\n18. The machine diagnostic system of claim 1 having a system architecture including an object oriented framework.\n19. A system for on-line machine diagnosis, comprising:\na host computer for determining a health state of at least one machine of a plurality of machines, the host computer being operatively coupled to a network backbone;\na machine diagnostic module adapted to be integrally mounted to the at least one machine, the machine diagnostic module being operatively coupled to the network backbone, the machine diagnostic module including:\na set of stacked circuit boards, including:\na power board planarly spaced apart including power supply and power sensor inputs;\na signal conditioning board, operatively coupled to the power board, being planarly spaced apart and including a vibration sensor port; and\na processor and memory board operatively coupled to the signal conditioning board and including a microprocessor and memory,\nwherein the machine diagnostic module collects data relating to operation of the at least one machine,\na system architecture including a software based analysis layer, the analysis layer providing for preprocessing of the machine data and being operative to facilitate determining positive sequence and negative sequence relating to the machine, and wherein the host computer determines a health state of the at least one machine via analyzing the preprocessed data.\n20. The system of claim 19 including a system architecture which facilitates machine diagnosis, the system architecture including:\nan analysis layer for preprocessing data collected from the at least one machine;\na communications layer adapted to provide for communications between the diagnostic module and the host computer; and\nan expert layer for analyzing the preprocessed data and determining a health state of the at least one machine.\n21. The system of claim 20, further including a process layer for analyzing preprocessed data from a plurality of machine of a process, the process layer facilitating determining the health state of the process.\n22. The system of claim 20, the expert layer operatively coupled to a display, the expert layer providing for displaying the analyzed preprocessed data on the display.\n23. The system of claim 22, the expert layer displaying at least one of the following machine related data: (1) machine shaft torque and speed; (2) machine temperature; (3) RMS current; (4) positive and negative sequence; (5) FFT of vibration data; (6) RMS vibration data; (7) FFT of current data; (8) wavelet of vibration data; and (9) wavelet of current data.\n24. The system of claim 22, the expert layer generating an icon representative of the at least one machine, the icon being of a first color when the at least one motor is operating within a normal temperature range, the icon being of a second color when the at least one motor is operating within an undesired temperature range; and the icon being of a third color when the motor is overheated.\n25. The system of claim 22, the expert layer generating and displaying an icon for each of the plurality of machines, at least one of the icons being of a first color when the icon's respective machine is operating within a normal temperature range, the at least one icon being of a second color when the icon's respective machine is operating within an undesired temperature range; and the at least one icon being of a third color when the respective machine is overheated.\n26. A method for diagnosing the health state of a plurality of machines within a system including the steps of:\nusing a diagnostic module to collect data from at least one of the plurality of machines;\nusing a system architecture including a software based analysis layer to preprocess the collected data, the analysis layer being operative to facilitate determining positive sequence and negative sequence relating to the one of the plurality of machines;\nstoring the preprocessed data on a memory;\nusing a host computer to retrieve the preprocessed data;\nusing the host computer to analyze the preprocessed data to determine a health state of the at least one of the plurality of machines.\n27. The method of claim 26, further including the step of using the host computer to determine a health state of a process employing the at least one of the plurality of machines.\n28. The method of claim 26, further including the steps of:\nusing a software based analysis layer resident on the diagnostic module to perform the preprocessing of the machine data;\nusing a software based communications layer to provide for communications between the diagnostic module and the host computer;\nusing a software based expert layer resident on the host computer to analyze the preprocessed data and determine a health state of the at least one of the plurality of machines.\n29. A system for determining a health state of a motor, comprising:\na host computer for determining a health state of at least one motor of a plurality of motors, the host computer being operatively coupled to a network backbone;\na diagnostic module adapted to be integrally mounted to the at least one motor, the diagnostic module being operatively coupled to the network backbone, the diagnostic module collecting data relating to operation of the at least one motor, the diagnostic module being associated with a system architecture layer including a software based analysis layer for preprocessing the data, the analysis layer being operative to facilitate determining positive sequence and negative sequence relating to the machine, the diagnostic module further including a memory adapted to store design data relating to the motor, the diagnostic module storing the preprocessed data and motor design related data, on a system memory\nwherein the host computer determines a health state of the motor by retrieving the preprocessed data and motor design data from the system memory and analyzing the preprocessed data and motor design related data.\n30. A system architecture for employment in a system for diagnosing a health state of a motor, comprising:\nan analysis layer for collecting and preprocessing data related to the motor, the analysis layer being operative to facilitate determining positive sequence and negative sequence relating to the motor;\na communications layer for transmitting the preprocessed data over a network;\nan expert layer to process the preprocessed data and determine a health state of the motor.\n31. The system architecture of claim 30 further including a process layer for determining a health state of a process employing the motor via processing results from the expert layer.\n32. A system for determining a health state of a machine, including:\nmeans for collecting and preprocessing data related to the machine, the means for preprocessing data including a system architecture having an analysis layer for preprocessing the data, the analysis layer being operative to facilitate determining positive sequence and negative sequence relating to the machine;\nmeans for communicating at least one of the collected and preprocessed data over a network; and\nmeans for receiving and processing the at least one of the collected and preprocessed data over a network and determining a health state of the machine.\n33. The system of claim 32 further including means for determining a health state of a process employing the machine.\n34. The system of claim 32 further including means for displaying the health state determination of the machine.\n35. A system for displaying machine related information, comprising:\na first computer operatively coupled to a machine, the first computer collecting raw data relating to the operation of the machine, the first computer including a system architecture having a software based analysis layer, the analysis layer providing for preprocessing of the raw data and being operative to facilitate determining positive sequence and negative sequence relating to the machine, and storing the preprocessed data on a memory;\na second computer operative to receive the preprocessed data, the second computer being operatively coupled to a display;\nwherein the second computer analyzes the preprocessed data and displays on the display at least one of a first visual indicia representative of a first operating condition of the machine and a second visual indicia representative of a second operating condition of the machine.\n36. A machine diagnostic module adapted to be integrally mounted to a machine, the machine diagnostic module being operatively coupled to a network backbone, the machine diagnostic module including:\nmeans for collecting machine related data;\nmeans for preprocessing at least a portion of the machine related data, the means for preprocessing data including a system architecture having an analysis layer for preprocessing the machine related data, the analysis layer being operative to facilitate determining positive sequence and negative sequence relating to the machine;\nmeans for storing the machine related data and the preprocessed data; and\nmeans for determining the health of the at least one machine based on the machine related data and preprocessed data.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US34159A",
        "US3839628A",
        "US4057714A",
        "US4063112A",
        "US4194178A",
        "US4277772A",
        "US4292670A",
        "US4402054A",
        "US4408294A",
        "US4694390A",
        "US4748843A",
        "US4896101A",
        "US4965513A",
        "US5003490A",
        "US5049815A",
        "US5223207A",
        "US5270640A",
        "US5313407A",
        "US5329465A",
        "US5400246A",
        "US5416399A",
        "US5419197A",
        "US5461329A",
        "US5481481A",
        "US5485491A",
        "US5499196A",
        "US5508633A",
        "US5512883A",
        "US5530343A",
        "US5534759A",
        "US5571969A",
        "US5574387A",
        "US5576632A",
        "US5579232A",
        "US5602708A",
        "US5612629A",
        "US5629870A",
        "US5633800A",
        "US5684718A",
        "US5726911A"
    ],
    "citations_ftf": [
        "US3229757A",
        "US4840222A",
        "US4769557A",
        "CA2087763C",
        "USD360879S",
        "US5566092A",
        "US5563570A",
        "US5845230A",
        "JP3159071B2",
        "US5763969A",
        "US6011331A",
        "US6260004B1"
    ],
    "citedby_own": [
        "US6108616A",
        "US6157899A",
        "US6216118B1",
        "US6295510B1",
        "US6298308B1",
        "WO2001090713A1",
        "US6332116B1",
        "WO2002015458A2",
        "US6366862B1",
        "EP1202146A1",
        "US6405139B1",
        "US20020091972A1",
        "WO2002056039A1",
        "US20020099465A1",
        "US6431953B1",
        "US20020128731A1",
        "US20020161555A1",
        "US6480809B1",
        "WO2002095323A1",
        "US6549869B1",
        "US6560552B2",
        "US20030093204A1",
        "US20030099229A1",
        "US6584432B1",
        "US6591226B1",
        "US20030135349A1",
        "US6601183B1",
        "WO2003063020A1",
        "WO2003090091A1",
        "US20030212529A1",
        "US6671634B2",
        "US6694281B2",
        "US6711520B2",
        "US20040068677A1",
        "US6728658B1",
        "US6748341B2",
        "US20040117153A1",
        "US20040153788A1",
        "US20040158772A1",
        "US20040167731A1",
        "US20040210629A1",
        "US6810341B2",
        "US6826513B1",
        "US20040239713A1",
        "US20040267395A1",
        "US20050046414A1",
        "US20050096874A1",
        "US20050143957A1",
        "US20050174124A1",
        "US20050210337A1",
        "US20050229252A1",
        "US20050228781A1",
        "GB2413413A",
        "US20050240377A1",
        "US20050288898A1",
        "US7023795B1",
        "US7032029B1",
        "US20060116836A1",
        "US20060271311A1",
        "US20070078614A1",
        "US20070078629A1",
        "US20070093926A1",
        "US20070182359A1",
        "US20070282548A1",
        "US20070294002A1",
        "US20070294001A1",
        "US20070293998A1",
        "US7331512B2",
        "US20080183425A1",
        "US20080215291A1",
        "WO2008142386A1",
        "US20090037155A1",
        "US20090044181A1",
        "WO2009020591A1",
        "US20090049340A1",
        "US20090091289A1",
        "US20090204237A1",
        "US20090204234A1",
        "US20090204245A1",
        "US20090204267A1",
        "US20090210081A1",
        "US20090216401A1",
        "US20090216584A1",
        "US20090271239A1",
        "US20100079096A1",
        "US20100106458A1",
        "US20100117584A1",
        "US20100131242A1",
        "US20100194324A1",
        "US20100194323A1",
        "US20100293493A1",
        "US20100324376A1",
        "US20100321175A1",
        "US20120065939A1",
        "US8275577B2",
        "US20120325002A1",
        "US8412402B2",
        "US8428813B2",
        "US8587245B2",
        "US8600915B2",
        "US20140042876A1",
        "US20140049543A1",
        "US8719196B2",
        "US8762165B2",
        "CN104149628A",
        "US20140374475A1",
        "US20150084561A1",
        "CN104579026A",
        "US9052240B2",
        "US9081883B2",
        "US9207670B2",
        "US20160069933A1",
        "US9395268B2",
        "US9465387B2",
        "CN106364322A",
        "US9602122B2",
        "US20170248493A1",
        "US20180351499A1",
        "US10295965B2",
        "US20190346823A1",
        "US10511238B2",
        "US10670657B2",
        "US10907722B2",
        "EP3787165A1",
        "US11007101B2",
        "US11114968B2",
        "US20210341901A1",
        "US11231729B2",
        "US11309674B2",
        "US11311958B1",
        "US11333690B2",
        "CN114594721A",
        "US11566675B2",
        "US20230163713A1"
    ],
    "citedby_ftf": [
        "US7923875B2",
        "DE102009038806A1",
        "EP2526300B1",
        "MX353980B",
        "US9839379B2",
        "US11147518B1",
        "US11139718B2"
    ]
}