{
    "patent_id": "US-11321774-B2",
    "title": "Risk-based machine learning classifier ",
    "assignee": "Pointpredictive, Inc.",
    "publication_date": "2022-05-03",
    "patent_link": "https://patents.google.com/patent/US11321774B2/en",
    "inventors": [
        "Frank J. McKenna",
        "Timothy J. Grace",
        "Gregory Gancarz",
        "Michael J. Kennedy"
    ],
    "classifications": [
        "G06Q40/025",
        "G06N20/20",
        "G06F21/577",
        "G06N20/00",
        "G06N5/025",
        "G06N7/005",
        "G06N7/01",
        "G06Q40/03",
        "G06F2221/034",
        "G06F3/013",
        "G06N3/04",
        "G06N3/045",
        "G06N3/08",
        "G06N5/01",
        "G10L15/22",
        "G10L2015/223"
    ],
    "abstract": "The present disclosure relates generally to a risk-based fraud identification and risk analysis system. For example, the system may receive application data from a first borrower user, determine a segment associated with the application data, apply application data to one or more machine learning (ML) models, and receive a score based at least in part upon output of the ML model.",
    "claims": "\n1. A method for computing an application score for a loan, the method comprising:\nreceiving, by a computer system, application data identifying a plurality of attributes of: a first borrower, and of collateral;\ngenerating, by the computer system, a plurality of input features based upon the application data, wherein at least one of the plurality of input features are generated based on at least one attribute of the collateral;\napplying the plurality of input features to a trained machine learning (ML) model to generate an output;\ndetermining an application score based on the output of the trained ML model;\ngrouping each of the plurality of input features into one of a plurality of factor groups, wherein each of the plurality of factor groups is related to a different type of fraud;\ndetermining a reason for how each of the input features in a factor group affects the application score;\ndetermining, by the computer system, one or more actions for the application data based at least in part on the application score, the plurality of factor groups, and the determined reason; and\nproviding, by the computer system, the application score and the one or more actions to a dealer user device or to a lender user device.\n2. The method of claim 1, wherein the application data is received from a borrower user device.\n3. The method of claim 1, wherein the application data is received from a borrower user device and from the dealer user device.\n4. The method of claim 3, wherein the plurality of attributes of collateral are received in application data from the dealer user device.\n5. The method of claim 1, wherein the at least one of the one or more input features generated based on the at least one attribute of the collateral is generated based on a value discrepancy between a value of collateral and a loan amount.\n6. The method of claim 5, wherein the collateral comprises an automobile.\n7. The method of claim 6, wherein the application data identifies a value of the automobile.\n8. The method of claim 7, further comprising: identifying an expected value for the automobile based on attributes of the automobile; and comparing the expected value for the automobile with the identified value of the automobile in the application data.\n9. The method of claim 8, further comprising generating a feature characterizing the comparison of the expected value for the automobile with the identified value of the automobile in the application data.\n10. The method of claim 9, further comprising: determining a second action based on the comparison of the expected value for the automobile with the identified value of the automobile in the application data; and providing the second action to the dealer user device or to the lender user device.\n11. A system comprising:\none or more processors; and\na non-transitory computer-readable medium including instructions that, when executed by the one or more processors, cause the one or more processors to:\nreceive application data identifying a plurality of attributes of: a first borrower, and of collateral;\ngenerate a plurality of input features based upon the application data, wherein at least one of the a plurality of input features are generated based on at least one attribute of the collateral;\napply the a plurality of input features to a trained machine learning (ML) model to generate an output;\ndetermine an application score based on the output of the trained ML model;\ngroup each of the plurality of input features into one of a plurality of factor groups, wherein each of the plurality of factor groups is related to a different type of fraud;\ndetermine a reason for how each of the input features in a factor group affects the application score;\ndetermine one or more actions for the application data based at least in part on the application score, the plurality of factor groups, and the determined reason; and\nprovide the application score and the one or more actions to a dealer user device or to a lender user device.\n12. The system of claim 11, wherein the application data is received from a borrower user device.\n13. The system of claim 11, wherein the application data is received from a borrower user device and from the dealer user device.\n14. The system of claim 13, wherein the plurality of attributes of collateral are received in application data from the dealer user device.\n15. The system of claim 11, wherein the at least one of the one or more input features generated based on the at least one attribute of the collateral is generated based on a value discrepancy between a value of collateral and a loan amount.\n16. The system of claim 15, wherein the collateral comprises an automobile.\n17. The system of claim 16, wherein the application data identifies a value of the automobile.\n18. The system of claim 17, wherein the non-transitory computer-readable medium further includes instructions that, when executed by the one or more processors, cause the one or more processors to: identify an expected value for the automobile based on attributes of the automobile; and compare the expected value for the automobile with the identified value of the automobile in the application data.\n19. The system of claim 18, wherein the non-transitory computer-readable medium further includes instructions that, when executed by the one or more processors, cause the one or more processors to generate a feature characterizing the comparison of the expected value for the automobile with the identified value of the automobile in the application data.\n20. The system of claim 19, wherein the non-transitory computer-readable medium further includes instructions that, when executed by the one or more processors, cause the one or more processors to: determine a second action based on the comparison of the expected value for the automobile with the identified value of the automobile in the application data; and provide the second action to the dealer user device or to the lender user device.",
    "status": "Active",
    "citations_own": [
        "US5679940A",
        "US5745654A",
        "US5819226A",
        "US20030052768A1",
        "US20030099379A1",
        "US20030115459A1",
        "US20030216988A1",
        "US20040059953A1",
        "US20040064415A1",
        "US20040153663A1",
        "US20040230527A1",
        "US20040245330A1",
        "US20050039057A1",
        "US20050132235A1",
        "US20050171851A1",
        "US20070162761A1",
        "US7587348B2",
        "US7668769B2",
        "US7908210B2",
        "US20110173116A1",
        "US20110238566A1",
        "US8567669B2",
        "US20140081832A1",
        "US20150032598A1",
        "US20150339769A1",
        "US20160006749A1",
        "US20160048766A1",
        "US9294497B1",
        "US20160203490A1",
        "US20170178063A1",
        "US20180040064A1",
        "US20180113742A1",
        "US20180122004A1",
        "US20180204173A1",
        "US20180218176A1",
        "US20180300398A1",
        "US10127234B1",
        "US10157347B1",
        "US20190130216A1",
        "US20190279363A1",
        "US10424011B2",
        "US10467690B2",
        "US10586280B2",
        "US20200167798A1",
        "US20200226476A1",
        "US20200234143A1",
        "US20200265336A1",
        "US10783578B1",
        "US10963958B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20230070546A1"
    ],
    "citedby_ftf": [
        "US10896421B2",
        "US20150032589A1",
        "US20160055427A1",
        "US20150066771A1",
        "US20150339673A1",
        "US20160071017A1",
        "US11080709B2",
        "US20160078367A1",
        "US20160063502A1",
        "US10546099B2",
        "US10127240B2",
        "US10290001B2",
        "US10671915B2",
        "US10678244B2",
        "US11157441B2",
        "US11409692B2",
        "US10671349B2",
        "US10733668B2",
        "US11561791B2",
        "US20190311310A1",
        "US20190311428A1",
        "US20190342297A1",
        "US11215999B2",
        "US11636333B2",
        "US20210374619A1",
        "US11562231B2",
        "US11196678B2",
        "US11537811B2",
        "US11610117B2",
        "US11734754B1",
        "US10997461B2",
        "US11567514B2",
        "US10956755B2",
        "US11321634B2",
        "US11037238B1",
        "CN112308233A",
        "US10991231B1",
        "US20220366490A1",
        "US20210140775A1",
        "US11647030B2",
        "US20230177601A1",
        "US20220103589A1",
        "US11693897B2",
        "US11720962B2",
        "US11645711B2",
        "WO2023097353A1"
    ]
}