{
    "patent_link": "https://patents.google.com/patent/US6203987B1/en",
    "patent_id": "US6203987B1",
    "title": "Methods for using co-regulated genesets to enhance detection and classification of gene expression patterns",
    "abstract": "The present invention provides methods for enhanced detection of biological response patterns. In one embodiment of the invention, genes are grouped into basis genesets according to the co-regulation of their expression. Expression of individual genes within a geneset is indicated with a single gene expression value for the geneset by a projection process. The expression values of genesets, rather than the expression of individual genes are then used as the basis for comparison and detection of biological responses with greatly enhanced sensitivity.",
    "inventors": [
        "Stephen H. Friend",
        "Roland Stoughton"
    ],
    "assignee": "Microsoft Technology Licensing LLC",
    "classifications": [
        "C12Q1/6809",
        "G01N33/6803",
        "G16B25/10",
        "G16B40/00",
        "G16B40/30",
        "G16B25/00"
    ],
    "claims": "\n1. A method for analyzing the values of cellular constituents in a biological sample comprising converting a first profile comprising measurements of a plurality of cellular constituents in said biological sample into a projected profile comprising a plurality of cellular constituent set values according to a definition of co-varying basis cellular constituent sets; wherein said definition is based upon co-variation of measurements of cellular constituents that comprise at least a portion of said plurality of cellular constituents, under a plurality of different perturbations; and wherein said converting comprises projecting said first profile onto said co-varying basis cellular constituent sets, thereby analyzing the values of cellular constituents in said biological sample.\n2. The method of claim 1 further comprising the step of indicating the state of said biological sample with said projected profile.\n3. The method of claim 1 further comprises the steps of comparing said projected profile with a reference projected profile; and indicating similarity or difference between said projected profile and said reference profile.\n4. The method of claim 1 wherein said definition is defined by a similarity tree derived by a cluster analysis of said measurements of cellular constituents comprising at least a portion of said plurality of cellular constituents, under said plurality of perturbations.\n5. The method of claim 4 wherein said cellular constituent sets are defined as branches of said similarity tree.\n6. The method of claim 5 wherein said branches are selected by applying a cutting level across said tree, wherein said cutting level is determined by expected number of biological pathways represented by said cellular constituents.\n7. The method of claim 5 wherein distinction among said branches achieves a statistical significance at 95% confidence level.\n8. The method of claim 7 wherein said statistical significance is evaluated with a test using Monte Carlo randomization of an index of said perturbations.\n9. The method of claim 5, 6, 7, or 8 wherein said defined co-varying basis cellular constituent sets are refined based upon biological relationships among said cellular constituents comprising at least a portion of said plurality of cellular constituents.\n10. The method of claim 1 wherein said definition is:\nV\n=\n[\nV\n1\n(\n1\n)\n.\nV\n1\n(\nn\n)\n.\n.\n.\nV\nk\n(\n1\n)\n.\nV\nk\n(\nn\n)\n]\n11. The method of claim 10 wherein said step of converting comprises the execution of the operation:\n12. The method of claim 1 wherein each of said cellular constituent set values is the average value of the level of cellular constituents within a corresponding co-varying basis cellular constituent set.\n13. The method of claim 1 wherein each of said cellular set values is a weighted average of the level of cellular constituents within a corresponding co-varying basis cellular constituent set.\n14. The method of claim 1 wherein said plurality of measurements is normalized to a unity vector size.\n15. The method of claim 1 wherein said measurements of cellular constituents are measurements of responses of said biological sample to a perturbation.\n16. A method for defining co-varying cellular constituent sets comprising defining co-varying cellular constituent sets based upon the co-variation of a plurality of measurements of cellular constituents in a biological sample under a plurality of perturbations.\n17. The method of claim 16 comprising the step of forming a clustering tree derived by a cluster analysis of similarity of said cellular constituents' behaviors under said plurality of perturbations.\n18. The method of claim 17 wherein said cellular constituent sets are defined as branches of said clustering tree.\n19. The method of claim 18, wherein said branches are selected by applying a cutting level across said tree, wherein said cutting level is determined by expected number of biological pathways represented by said cellular constituents.\n20. The method of claim 19 wherein distinction among said branches achieves a statistical significance at 95% confidence level.\n21. The method of claim 20 wherein said statistical significance is evaluated with a test using Monte Carlo randomization of an index of said perturbations.\n22. A method for analyzing expression data from a biological sample comprising converting a first expression profile of a plurality of genes in said sample into a projected expression profile containing a plurality of geneset expression values according to a definition of basis genesets, wherein each of said basis genesets comprises genes having co-varying transcript levels under a plurality of different perturbations, and wherein said converting comprises projecting said first expression profile onto said basis genesets, thereby analyzing said expression data.\n23. The method of claim 22 further comprises the step of indicating the state of said biological sample with said projected profile.\n24. The method of claim 22 further comprising the steps of comparing said projected expression profile with a reference projected profile; and indicating similarity between said projected expression profile and reference profile.\n25. The method of claim 22 wherein said definition is defined by a similarity tree derived by a cluster analysis of the expression of said genes under said plurality of perturbations.\n26. The method of claim 25 wherein said basis genesets are defined as branches of said similarity tree.\n27. The method of claim 26 wherein said branches are selected by applying a cutting level across said tree, wherein said cutting level is determined by expected number of biological pathways represented by said genes.\n28. The method of claim 26 wherein distinction among said branches achieves a statistical significance at 95% confidence level.\n29. The method of claim 22 wherein said definition is:\nV\n=\n[\nV\n1\n(\n1\n)\n.\nV\n1\n(\nn\n)\n.\n.\n.\nV\nk\n(\n1\n)\n.\nV\nk\n(\nn\n)\n]\n30. The method of claim 22 wherein said step of converting comprises the execution of the operation:\n31. The method of claim 22 wherein each of said geneset expression values is the average value of the level of expression of said genes within a corresponding basis geneset.\n32. The method of claim 22 wherein each of said geneset expression values is a weighted average of the expression of said genes within a corresponding basis geneset.\n33. The method of claim 22 wherein said expression profile is a profile of responses of said biological sample to a perturbation.\n34. A method for comparing two expression profiles comprising\n35. The method of claim 34 further comprising the step of determining the statistical significance of said similarity metric.\n36. The method of claim 35 wherein said statistical significance is assessed using an empirical probability distribution generated under the null hypothesis of no correlation.\n37. A method for determining the type of an unknown perturbation comprising:\n38. A method for analyzing expression data from a biological sample comprising:\n39. A computer system comprising\n40. A computer-usable medium having computer readable program code embodied thereon for effecting the following steps within a computer system:\n41. A method for analyzing expression data from a biological sample comprising causing a computer system to execute the following steps:\n42. The method of claim 1, wherein the plurality of different perturbations are independently selected from the group consisting of expression of a gene under the control of an exogenous titratable promoter, expression of a gene introduced into a cell by transfection or transduction, exposure to ribozymes or antisense nucleic acids or neutralizing antibodies, expression of a dominant negative mutant, and exposure to an exogenous drug.\n43. A method for analyzing the values of cellular constituents in a biological sample comprising:\n44. A method for analyzing the values of cellular constituents in a biological sample comprising:\n45. A computer system comprising\n46. A computer-usable medium having computer readable program code embodied thereon for effecting the following steps within a computer system:\n47. A method for analyzing the values of cellular constituents in a biological sample comprising causing a computer system to execute the following steps:\n48. A method for identifying the cellular pathway affected by a drug comprising\n49. A method for determining whether a drug candidate has an activity similar to a known drug comprising:\n50. A method for identifying the cellular pathway affected by a drug comprising\n51. A method for determining whether a drug candidate has an activity similar to a known drug comprising:\n52. The method of claim 1, wherein the plurality of different perturbations is at least five different perturbations.\n53. The method of any one of claims 1, 22, 34, 37, 38, 41-44, 45-48, or 47-51 , wherein the plurality of different perturbations is more than ten different perturbations.\n54. The method of any one of claims 1, 22, 34, 37, 38, 41-44, or 47-51, wherein the plurality of different perturbations is more than 50 different perturbations.\n55. The method of any one of claims 1, 22, 34, 37, 38, 41-44 or 47-51, wherein the plurality of different perturbations is more than 100 different perturbations.\n56. The method of claim 1, 43, 44, 47, 50, or 51, wherein said measurements of a plurality of cellular constituents are measurements of abundances of a plurality of RNA species.\n57. The method of claim 1, 43, 44, 47, 50, or 51, wherein said measurements of a plurality of cellular constituents are measurements of abundances of a plurality of protein species.\n58. The method of claim 1 wherein said measurements of a plurality of cellular constituents are measurements of activities of a plurality of protein species.\n59. The computer system of claim 39 or 45 wherein the plurality of different perturbations is more than 50 different perturbations.\n60. The computer-usable medium of claim 40 or 46 wherein the plurality of different perturbations is more than 50 different perturbations.\n61. The method of claim 28 wherein said statistical significance is evaluated with a test using Monte Carlo randomization of an index of said perturbations.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "WO1988009810A1",
        "US4946778A",
        "WO1990011364A1",
        "EP0534858A1",
        "WO1994017208A1",
        "US5445934A",
        "US5539083A",
        "US5556752A",
        "US5569588A",
        "US5578832A",
        "WO1997010365A1",
        "US5645988A",
        "WO1997027317A1",
        "EP0816511A1",
        "WO1998006874A1",
        "US5744305A",
        "US5800992A",
        "WO1998038329A1",
        "WO1999058720A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20010012983A1",
        "US20020095259A1",
        "US20020111742A1",
        "US20020119462A1",
        "US6453241B1",
        "US6456942B1",
        "WO2002095654A1",
        "WO2002099382A2",
        "US20020194201A1",
        "US20020194154A1",
        "US20020198677A1",
        "US6502039B1",
        "US20030013137A1",
        "US20030054387A1",
        "US20030068610A1",
        "WO2003033744A1",
        "US20030093226A1",
        "US20030093225A1",
        "WO2003040992A1",
        "US20030093227A1",
        "WO2003042780A2",
        "US20030104426A1",
        "US20030104393A1",
        "WO2003050312A1",
        "US20030130991A1",
        "US20030143520A1",
        "WO2003076928A1",
        "US20030182082A1",
        "US20030180808A1",
        "US20030194725A1",
        "WO2003091450A1",
        "US20030215786A1",
        "US20030219771A1",
        "US20030224374A1",
        "WO2003102589A1",
        "US20030229451A1",
        "WO2003104389A2",
        "WO2004003168A2",
        "US20040014040A1",
        "US20040018527A1",
        "US6692916B2",
        "US20040048264A1",
        "US6713257B2",
        "US20040072160A1",
        "US20040133352A1",
        "US20040157229A1",
        "US6801859B1",
        "US20040213446A1",
        "US20040225449A1",
        "US20040235019A1",
        "US20040259764A1",
        "US20040259111A1",
        "US20050037369A1",
        "WO2005017804A2",
        "US20050048564A1",
        "US20050060101A1",
        "US20050153304A1",
        "US20050250125A1",
        "US20050281484A1",
        "US20060002636A1",
        "US20060020439A1",
        "US20060026702A1",
        "US20060035250A1",
        "US20060051803A1",
        "US7020561B1",
        "US20060088836A1",
        "US20060115826A1",
        "US20060263813A1",
        "US20070015146A1",
        "US20070015147A1",
        "US20070021918A1",
        "US20070027634A1",
        "US20070037166A1",
        "US20070037167A1",
        "US20070043515A1",
        "US20070048782A1",
        "US20070054269A1",
        "US20070055448A1",
        "US20070082332A1",
        "US20070112802A1",
        "US20070135997A1",
        "US20070149468A1",
        "US20070153159A1",
        "US20070174019A1",
        "US7251642B1",
        "US20070248978A1",
        "US7294478B1",
        "US20070270504A1",
        "US20080038746A1",
        "EP1892306A2",
        "US20080059513A1",
        "EP1900827A2",
        "US7396645B1",
        "US7422854B1",
        "WO2008121717A1",
        "US20080281526A1",
        "US20080312199A1",
        "US7512496B2",
        "EP2044247A2",
        "US7519519B1",
        "US20090098538A1",
        "US20090138251A1",
        "US20090170091A1",
        "US7567870B1",
        "US20090233279A1",
        "US7599799B2",
        "US20090299646A1",
        "US20090298060A1",
        "US20100028900A1",
        "US20100042330A1",
        "US20100070904A1",
        "US20100112602A1",
        "US20100151467A1",
        "US7778782B1",
        "US7807447B1",
        "US20110071767A1",
        "US8105777B1",
        "US8114615B2",
        "CN102505757A",
        "US20130266967A1",
        "EP2762886A1",
        "US9057109B2",
        "EP2977469A1",
        "US9336302B1",
        "CN105740651A",
        "US9536043B2",
        "US9569585B2",
        "US10018631B2",
        "EP3715846A1",
        "US11205103B2",
        "US11578373B2"
    ],
    "citedby_ftf": []
}