{
    "patent_link": "https://patents.google.com/patent/US20080267069A1/en",
    "patent_id": "US20080267069A1",
    "title": "Method for signal adjustment through latency control",
    "abstract": "Various embodiments of a method for signal adjustment through control of latency are disclosed.",
    "inventors": [
        "Jeffrey Thielman",
        "Mark Gorzynski"
    ],
    "assignee": "Hewlett Packard Development Co LP",
    "classifications": [
        "H04N7/142",
        "H04N7/148",
        "H04N7/15"
    ],
    "claims": "\n1. A method for adjusting latency in a video conference signal originating from a video conference camera and encoder, comprising the steps of:\na) measuring latency in a video conference connection;\nb) comparing the latency with a latency threshold; and\nc) adjusting parameters of the video conference camera and encoder to modify the image quality of the video signal if the measured latency is below the threshold.\n2. A method in accordance with claim 1, further comprising the step of periodically repeating steps (a) through (c).\n3. A method in accordance with claim 1, wherein the remote video conference connection includes connections between more than two video conference sites, and further comprising the step of performing steps (a) through (c) for the connections between each of the more than two conference sites.\n4. A method in accordance with claim 3, further comprising the step of periodically repeating steps (a) through (c) for each connection.\n5. A method in accordance with claim 1, wherein the step of adjusting parameters of the video conference camera and encoder comprises maintaining image quality, increasing latency, and decreasing bandwidth.\n6. A method in accordance with claim 1, wherein the step of adjusting parameters of the video conference camera and encoder includes at least one step selected from the group consisting of adjusting a video resolution, applying an image-smoothing algorithm, adjusting a camera frame rate, adjusting a video scanning mode, and adjusting bandwidth of the video conference signal.\n7. A method in accordance with claim 6, wherein the step of adjusting the video resolution comprises adjusting the video resolution between high definition (HD) and standard definition (SD), and the step of adjusting a video scanning mode comprises switching between progressive and interlaced scanning.\n8. A method in accordance with claim 1, wherein the step of adjusting parameters of the video conference camera and encoder comprises applying an optimization algorithm to modify settings of a video encoder to obtain a best possible video signal at a desired latency level that is below the threshold.\n9. A method in accordance with claim 8, wherein the optimization algorithm is configured to perform at least one of the steps of adjusting the video resolution, applying an image-smoothing algorithm, adjusting a camera frame rate, adjusting a video scanning mode and adjusting bandwidth.\n10. A method in accordance with claim 8, wherein the step of adjusting parameters of the video conference camera and encoder comprises programming the encoder to perform at least one step selected from the group consisting of minimizing bandwidth, maximizing video image quality, minimizing latency, and minimizing a function that is a combination of bandwidth, image quality and latency.\n11. A method for adjusting a video signal originating from a video conference camera and encoder system, comprising the steps of:\na) establishing a latency budget, defining a latency threshold for a video conference connection between at least two video conference locations;\nb) measuring latency in the video conference connection;\nc) comparing the latency with the latency threshold; and\nd) adjusting parameters of the video conference camera and encoder system to improve image quality of the video signal if the measured latency is below the threshold.\n12. A method in accordance with claim 11, wherein the step of establishing the latency budget comprises programming the video conference camera and encoder system with a single maximum latency level that is considered acceptable.\n13. A method in accordance with claim 11, wherein the step of establishing the latency budget comprises programming the video conference camera and encoder system with multiple selectable latency levels.\n14. A method in accordance with claim 11, wherein the step of adjusting parameters of the video conference camera and encoder system includes at least one step selected from the group consisting of adjusting a video resolution, applying an image-smoothing algorithm, adjusting a camera frame rate, adjusting a video scanning mode, and adjusting bandwidth of the video conference signal.\n15. A video conference system in accordance with claim 11, wherein the step of adjusting parameters of the video conference camera and encoder comprises adjusting the parameters to maintain image quality, increase latency, and decrease bandwidth.\n16. A computer program comprising machine readable program code for causing a video conference system having a video conference camera and encoder associated with each of at least two video conference locations to perform the steps of:\na) measuring latency in a connection between the at least two video conference locations;\nb) comparing the latency with a latency threshold; and\nc) adjusting parameters of the video conference camera and encoder to modify the video quality if the measured latency is below the threshold.\n17. A computer program in accordance with claim 16, further comprising program code for causing the video conference camera and encoder to periodically repeat steps (a) through (c).\n18. A computer program in accordance with claim 16, further comprising program code for causing the video conference camera and encoder to perform at least one step selected from the group consisting of adjusting a video resolution, applying an image-smoothing algorithm, adjusting a camera frame rate, adjusting a video scanning mode, and adjusting bandwidth of the video conference signal.\n19. A computer program in accordance with claim 16, further comprising program code for adjusting parameters of the video conference camera and encoder to apply an optimization algorithm to modify settings of a video encoder to obtain a best possible video signal at a desired latency level that is below the threshold.\n20. A computer program in accordance with claim 16, further comprising program code for causing the encoder to adjust parameters of the video conference camera to maintain image quality, increase latency, and decrease bandwidth.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4449143A",
        "US5434913A",
        "US5991443A",
        "US5995518A",
        "US6104392A",
        "US6182125B1",
        "US6466248B1",
        "US20020172153A1",
        "US20030035645A1",
        "US6654825B2",
        "US20030223497A1",
        "US6665872B1",
        "US6741563B2",
        "US6760749B1",
        "US20040131067A1",
        "US20040148423A1",
        "US20040184523A1",
        "US20040208388A1",
        "US6829391B2",
        "US20050073575A1",
        "US20050132264A1",
        "US6940826B1",
        "US20050232151A1",
        "US20050237931A1",
        "US20050243923A1",
        "US6963353B1",
        "US7007098B1",
        "US7016407B2",
        "US7024045B2",
        "US20060077902A1",
        "US7039241B1",
        "US7042843B2",
        "US7092002B2",
        "US20060230176A1",
        "US20070024705A1",
        "US20070091815A1",
        "US20070183493A1",
        "US20080043643A1",
        "US20080084900A1",
        "US20080109368A1"
    ],
    "citations_ftf": [
        "GB9817082D0"
    ],
    "citedby_own": [
        "US20080045338A1",
        "US7830814B1",
        "US20110274053A1",
        "US20120144336A1",
        "US20120142433A1",
        "WO2012075951A1",
        "CN102595093A",
        "US20120226691A1",
        "US20130101002A1",
        "US20130100228A1",
        "WO2013063056A1",
        "US20130286227A1",
        "US20130343250A1",
        "US20140126626A1",
        "US8723913B2",
        "US8768924B2",
        "US20140189846A1",
        "TWI449418B",
        "WO2014133977A1",
        "US8839336B2",
        "US8840475B2",
        "US8893207B2",
        "US8898253B2",
        "US20150016278A1",
        "US8949922B2",
        "US8965288B2",
        "US8998719B1",
        "US9003461B2",
        "US20150100622A1",
        "US9015784B2",
        "US9032465B2",
        "US9089972B2",
        "US9098611B2",
        "US9108107B2",
        "US9138891B2",
        "US20150289028A1",
        "US9160783B2",
        "US9174342B2",
        "US9193065B2",
        "US9198728B2",
        "US9224181B2",
        "US9251313B2",
        "US9288248B2",
        "US9296107B2",
        "JP2016048902A",
        "US9323250B2",
        "US9361021B2",
        "US9373358B2",
        "US9381654B2",
        "US9429934B2",
        "US9451394B2",
        "US20160285720A1",
        "US9469030B2",
        "US9596584B2",
        "US9602765B2",
        "US9616576B2",
        "US9635605B2",
        "US9693214B2",
        "EP3188479A4",
        "US9706060B2",
        "US9706382B2",
        "US9713013B2",
        "US9715337B2",
        "US9766624B2",
        "US9781664B2",
        "US9781554B2",
        "US9807582B2",
        "US9813887B2",
        "US9832628B2",
        "US9843917B2",
        "US9842192B2",
        "US9849593B2",
        "US9866706B2",
        "US9980114B2",
        "US9974612B2",
        "US9983571B2",
        "US20180189674A1",
        "US10073950B2",
        "US10286315B2",
        "US10343283B2",
        "US10375426B2",
        "US10471588B2",
        "DE102013114633B4",
        "US10769739B2",
        "US10808882B2",
        "US10875182B2",
        "US20210203519A1",
        "US11154981B2",
        "US20210392179A1",
        "US11389064B2",
        "US11398307B2",
        "US11399153B2",
        "US20220255981A1",
        "US11636944B2",
        "US11742094B2"
    ],
    "citedby_ftf": [
        "US8446452B2",
        "US9030536B2",
        "CN102300043B",
        "US9787974B2",
        "US8918831B2",
        "US9049426B2",
        "US9560406B2",
        "US9032470B2",
        "US9232274B2",
        "US8994716B2",
        "US8438502B2",
        "US8947511B2",
        "US9445046B2",
        "US8947497B2",
        "US9030522B2",
        "US9602766B2",
        "US8587635B2",
        "US9082018B1",
        "US10140827B2",
        "US9361011B1",
        "US10506237B1",
        "US10957171B2",
        "US20200092803A1",
        "CN109525802A"
    ]
}