{
    "patent_id": "US-11120348-B2",
    "title": "System and methods for predicting probable relationships between items ",
    "assignee": "University Of Massachusetts",
    "publication_date": "2021-09-14",
    "patent_link": "https://patents.google.com/patent/US11120348B2/en",
    "inventors": [
        "Hong Yu"
    ],
    "classifications": [
        "G06N20/00",
        "G06F18/00",
        "G06F18/214",
        "G06F18/24765",
        "G06K9/00",
        "G06K9/6256",
        "G06K9/626",
        "G06N5/041",
        "G06N7/005",
        "G06N7/01"
    ],
    "abstract": "The present invention relates generally to identifying relationships between items. Certain embodiments of the present invention are configurable to identify the probability that a certain event will occur by identifying relationships between items. Certain embodiments of the present invention provide an improved supervised machine learning system.",
    "claims": "\n1. A system for automatically predicting an interaction between information items comprising:\na processor:\na memory in communication with said processor via a communication infrastructure and storing instructions that, when executed by said processor, cause the processor to:\naccess a collection including at least two or more information items;\ndevelop a training set from the at least two or more information items in the collection;\nanalyze the training set using one or more machine learning models selected from the group consisting of a Naive Bayes, a Naive Bayes Multinomial, and a support vector machine, identify one or more interactions between pairs of information items, and extract two or more features of the one or more interactions, one of the two or more extracted features being a content feature, and the other of the two or more extracted features being selected from the group consisting of Adamic, numCommonNeighbor, Jaccard, and sum Neighbor;\nproduce a classifier element based upon the analysis of the training set wherein the classifier element is selected from the group consisting of a Naive Bayes classifier that assumes features are generated independently from each other, a Naive Bayes Multinomial classifier that assumes a conditional probability of features follows multinomial distribution, and a support vector machine classifier defining decision boundaries of features;\nestablish an evaluation set comprising new pairs of information items;\napply the classifier element to the new pairs of information items in the evaluation set, thereby producing a probability value for each of the new pairs of information items;\nrank each classified pair of information items in a data set from a high probability value to a low probability value;\npredict a likelihood of interaction between the information items of each ranked pair; and\ndeliver an output comprising the likelihood of interaction, wherein delivery of the output includes display of a graphical representation configured to convey relationships between information items.\n2. The system of claim 1, wherein the graphical representation includes node symbols representing the at least two or more information items and link symbols representing relationships between the at least two or more information items.\n3. The system of claim 2, wherein the graphical representation includes link symbols representing at least known relationships between the at least two or more information items.\n4. The system of claim 2, wherein the graphical representation includes link symbols representing any predicted relationships between the at least two or more information items.\n5. The system of claim 2, wherein the processor is further configured to assign a degree for each node symbol.\n6. The system of claim 2, wherein the graphical representation is an interaction network.\n7. The system of claim 2, wherein the graphical representation is a map.\n8. The system of claim 1, wherein the content feature is an individual property of the information item.\n9. The system of claim 1, wherein the training set is indexed to facilitate analysis of the training set.\n10. The system of claim 1, wherein the evaluation set is indexed to facilitate analysis of the evaluation set.\n11. The system of claim 1, wherein the probability value indicates a likelihood of interaction between the classified pair of information items.\n12. The system of claim 1, wherein one of the at least two or more information items is a topic information item.\n13. The system of claim 1, wherein one of the at least two or more information items is a protein information item.\n14. The system of claim 1, wherein one of the at least two or more information items is a publication information item.\n15. The system of claim 1, wherein one of the at least two or more information items is a type of pharmaceutical drug information item."
}