{
    "patent_link": "https://patents.google.com/patent/US20070185656A1/en",
    "patent_id": "US20070185656A1",
    "title": "Computer systems and methods for identifying surrogate markers",
    "abstract": "Methods, computer program products and systems for identifying cellular constituents in a secondary tissue that serve as surrogate markers for a target gene expressed in a primary tissue of a species are provided. A classifier is constructed using cellular constituent abundances of cellular constituents in a first plurality of cellular constituents measured in the secondary tissue in a population. This population comprises a first and second subgroup. The classifier is based on a second plurality of cellular constituents that comprises all or a portion of the first plurality of cellular constituents. Abundance levels of each cellular constituent in the second plurality of cellular constituents varies between the first and second subgroup. All or portion of the population is classified into a plurality of subtypes using the classifier. Then, one or more cellular constituents that can discriminate members of the population between a first subtype and a second subtype in the plurality of subtypes are identified.",
    "inventors": [
        "Eric Schadt"
    ],
    "assignee": "Merck Sharp and Dohme LLC",
    "classifications": [
        "G01N33/5023",
        "G01N33/5082",
        "G01N33/6803",
        "G01N2500/00"
    ],
    "claims": "\n1. A method of identifying a set of cellular constituents in a secondary tissue of a species that serves as a surrogate marker for an activity of a target gene expressed in a primary tissue of said species, the method comprising:\n(a) constructing a classifier using a cellular constituent level of each cellular constituent in a first plurality of cellular constituents measured in said secondary tissue in each member of a population of said species, wherein said population comprises a first subgroup and a second subgroup, wherein\nsaid classifier is based on a second plurality of cellular constituents that comprises all or a portion of said first plurality of cellular constituents, and\nrespective abundance levels of each cellular constituent in said second plurality of cellular constituents varies between said first subgroup and said second subgroup;\n(b) classifying all or a portion of said population of said species into a plurality of subtypes using said classifier; and\n(c) identifying one or more cellular constituents that can discriminate members of said population between a first subtype in said plurality of subtypes and a second subtype in said plurality of subtypes, thereby identifying said one or more cellular constituents as said set of cellular constituents.\n2. The method of claim 1 wherein said target gene affects a clinical trait that does not exhibit classic Mendelian inheritance.\n3. The method of claim 2 wherein said clinical trait is an amount of the gene product of the target gene that is in the blood of said population of species.\n4. The method of claim 1 wherein said target gene affects a complex disease.\n5. The method of claim 4 wherein said complex disease is asthma, ataxia telangiectasia, bipolar disorder, cancer, common late-onset Alzheimer's disease, diabetes, heart disease, hereditary early-onset Alzheimer's disease, hereditary nonpolyposis colon cancer, hypertension, infection, maturity-onset diabetes of the young, mellitus, migraine, nonalcoholic fatty liver, nonalcoholic steatohepatitis, non-insulin-dependent diabetes mellitus, obesity, polycystic kidney disease, psoriases, schizophrenia, or xeroderma pigmentosum.\n6. The method of claim 1 wherein said first subgroup is exposed to a perturbation that affects said trait prior to said constructing step (a) and said second subgroup is not exposed to said perturbation.\n7. The method of claim 6 wherein said perturbation is environmental.\n8. The method of claim 6 wherein said perturbation is exposure to a compound, exposure to an allergen, exposure to pain, exposure to a hot temperature, exposure to a cold temperature, a diet, sleep deprivation, isolation, or an exercise regimen.\n9. The method of claim 6 wherein said perturbation is genetic.\n10. The method of claim 6 wherein said perturbation is a gene knockout, exposure to an inhibitor of a gene product, N-ethyl-N-nitrosourea mutagenesis, or siRNA knockdown of a gene.\n11. The method of claim 1 wherein said first plurality of cellular constituents is mRNA, cRNA or cDNA and each said cellular constituent level is obtained by measuring a transcriptional state of all or a portion of said first plurality of cellular constituents in said secondary tissue.\n12. The method of claim 1 wherein said first plurality of cellular constituents is proteins and each said cellular constituent level is obtained by measuring a translational state of all or a portion of said first plurality of cellular constituents in said secondary tissue.\n13-16. (canceled)\n17. The method of claim 1 wherein variance in abundance levels of a cellular constituent in said second plurality of cellular constituents between said first subgroup and said second subgroup is determined by a correlation analysis, a t-test, a paired t-test, an analysis of variance (ANOVA), a repeated measures ANOVA, a simple linear regression, a nonlinear regression, a multiple linear regression, a multiple nonlinear regression, a Wilcoxon signed-rank test, a MannWhitney test, a Kruskal-Wallis test, a Friedman test, a Spearman rank order correlation coefficient, a Kendall Tau analysis, or a nonparametric regression test.\n18. The method of claim 1 wherein\nsaid target gene affects a trait;\nsaid first subgroup does not exhibit said trait and said second subgroup exhibits said trait; and\nsaid constructing said classifier step (a) comprises determining those cellular constituents whose levels in said secondary tissue discriminate said first subgroup from said second subgroup.\n19. The method of claim 18 wherein discrimination between said first subgroup and said second subgroup based on respective abundance levels of cellular constituents in said first subgroup and said second subgroup is determined by a correlation analysis, a t-test, a paired t-test, an analysis of variance (ANOVA), a repeated measures ANOVA, a simple linear regression, a nonlinear regression, a multiple linear regression, a multiple nonlinear regression, a Wilcoxon signed-rank test, a MannWhitney test, a Kruskal- Wallis test, a Friedman test, a Spearman rank order correlation coefficient, a Kendall Tau analysis, or a nonparametric regression test.\n20. The method of claim 1 wherein said target gene affects a clinical trait that does not exhibit classic Mendelian inheritance and said first subgroup and said second subgroup exhibit variance with respect to said clinical trait.\n21. The method of claim 20 wherein a cellular constituent in said second plurality of cellular constituents is identified in said constructing step (a) by a correlation analysis, an analysis of variance (ANOVA), a repeated measures ANOVA, a simple linear regression, a nonlinear regression, a multiple linear regression, a multiple nonlinear regression, a Wilcoxon signed-rank test, a MannWhitney test, a Kruskal-Wallis test, a Friedman test, a Spearman rank order correlation coefficient, a Kendall Tau analysis, or a nonparametric regression test.\n22-31. (canceled)\n32. The method of claim 1, wherein said constructing said classifier step (a) comprises:\n(i) constructing a plurality of cellular constituent vectors, wherein\neach cellular constituent vector in said plurality of cellular constituent vectors represents a cellular constituent in said first plurality of cellular constituents, and\neach cellular constituent vector in said plurality of cellular constituent vectors comprises a plurality of cellular constituents levels, wherein each cellular constituent level in said plurality of cellular constituent levels is a level of the cellular constituent represented by the respective vector in the secondary tissue of a different organism in the population;\n(ii) clustering said plurality of cellular constituents vectors to form a cellular constituent vector cluster; and\n(iii) identifying cellular constituents in said cellular constituent vector cluster that discriminate between said first subgroup and said second subgroup as said classifier.\n33. The method of claim 32 wherein said identifying step (iii) comprises\n(A) constructing a respective phenotypic vector for each organism in all or a portion of said population, each phenotypic vector comprising a plurality of measured cellular constituents levels for said organism arranged in an order that is determined by said cellular constituent vector cluster;\n(B) clustering said phenotypic vectors to form a first phenotypic cluster and a second phenotypic cluster; and\n(C) identifying a group of cellular constituents represented in said respective phenotypic vectors that discriminates between said first phenotypic cluster and said second phenotypic cluster as said second plurality of cellular constituents.\n34-45. (canceled)\n46. The method of claim 1 wherein said constructing step (a) comprises classifying said population into a plurality of phenotypic groups based on one or more phenotypes measured for a plurality of members of said population, said plurality of phenotypic groups comprising said first subgroup and said second subgroup wherein said first subgroup represents a first phenotypic extreme with respect to a phenotype in said one or more phenotypes and said second subgroup represents a second phenotypic extreme with respect to a phenotype in said one or more phenotypes.\n47. The method of claim 46 wherein\na plurality of phenotypic vectors are created, each phenotypic vector in said plurality of phenotypic vectors corresponding to a member of said population, each said phenotypic vector comprising said one or more phenotypes measured for the corresponding member of said population; and\nsaid classifying comprises clustering said phenotypic vectors into said plurality of phenotypic groups.\n48-53. (canceled)\n54. The method of claim 46 wherein said first phenotypic extreme or said second phenotypic extreme is a top or a lowest fortieth percentile of said population with respect to said phenotype.\n55. The method of claim 46 wherein said first phenotypic extreme or said second phenotypic extreme is a top or a lowest twentieth percentile of said population with respect to said phenotype.\n56. The method of claim 1 wherein each respective cellular constituent in said second plurality of cellular constituents is assigned a metric based on an ability for said respective cellular constituent to discriminate between said first subgroup and said second subgroup and wherein said second plurality of cellular constituents is reduced to a reduced set of cellular constituents or principal components using a reducing algorithm that uses the respective metric of each cellular constituent in said second plurality of cellular constituents and wherein said classifier is based on said reduced set.\n57-59. (canceled)\n60. The method of claim 1, wherein a plurality of expression vectors are created, each expression vector in said plurality of expression vectors representing a cellular constituent in said second plurality of cellular constituents and each expression vector in said plurality of expression vectors comprising respective abundance levels from said first subgroup and said second subgroup, said constructing said classifier step (a) comprising:\nclustering said plurality of expression vectors in order to form a plurality of expression vector subgroups and wherein said classifier is based on an expression vector subgroup in said plurality of expression vector subgroups.\n61. The method of claim 1 wherein\neach respective cellular constituent in said second plurality of cellular constituents is assigned a respective metric based on an ability for said respective cellular constituent to discriminate between said first subgroup and said second subgroup, and\nsaid classifier is a neural network that is trained by each said cellular constituent in said second plurality of cellular constituents and the respective metric assigned to each said cellular constituent in said second plurality of cellular constituents.\n62. (canceled)\n63. The method of claim 56 wherein\neach respective cellular constituent or principal component in said reduced set is assigned a respective metric based on an ability for said respective cellular constituent or principal component to discriminate between said first subgroup and said second subgroup; and\nsaid classifier is a neural network that is trained by each said cellular constituent or principal component in said reduced set and the respective metric assigned to each said cellular constituent or principal component in said reduced set.\n64. (canceled)\n65. The method of claim 60 wherein\neach respective cellular constituent in said expression vector subgroup is assigned a respective metric based on an ability for said respective cellular constituent to discriminate between said first subgroup and said second subgroup; and\nsaid classifier is a neural network that is trained by each said cellular constituent in said expression vector subgroup and the respective metric assigned to each said cellular constituent in said expression vector subgroup.\n66. (canceled)\n67. The method of claim 1 wherein each respective cellular constituent in said second plurality of cellular constituents is assigned a respective metric based on an ability for said respective cellular constituent to discriminate between said first subgroup and said second subgroup, and said classifying step (b) comprises classifying all or a portion of said population into said plurality of subtypes using Bayesian decision theory in which each said cellular constituent in said second plurality of cellular constituents and the respective metric assigned to each said cellular constituent in said second plurality of cellular constituents serves as a priori information.\n68. The method of claim 56 wherein each respective cellular constituent or principal component in said reduced set is assigned a respective metric based on an ability for said respective cellular constituent or principal component to discriminate between said first subgroup and said second subgroup, and said classifying step (b) comprises classifying all or a portion of said population into said plurality of subtypes using Bayesian decision theory in which each said cellular constituent or principal component in said reduced set and the respective metric assigned to each said cellular constituent or principal component in said reduced set serves as a priori information.\n69. The method of claim 60 wherein each respective cellular constituent in said expression vector subgroup is assigned a respective metric based on an ability for said respective cellular constituent to discriminate between said first subgroup and said second subgroup, and said classifying step (b) comprises classifying all or a portion of said population into said plurality of subtypes using Bayesian decision theory in which each said cellular constituent in said expression vector subgroup and the respective metric assigned to each said cellular constituent in said expression vector subgroup serves as a priori information.\n70. The method of claim 1 wherein each respective cellular constituent in said second plurality of cellular constituents is assigned a respective metric based on an ability for said respective cellular constituent to discriminate between said first subgroup and said second subgroup, and said classifying step (b) comprises classifying all or a portion of said population into said plurality of subtypes using linear discriminate analysis, a linear programming algorithm, a support vector machine, or a simple decision tree.\n71. The method of claim 56 wherein each respective cellular constituent or principal component in said reduced set is assigned a respective metric based on an ability for said respective cellular constituent or principal component to discriminate between said first subgroup and said second subgroup, and said classifying step (b) comprises classifying all or a portion of said population into said plurality of subtypes using linear discriminate analysis, a linear programming algorithm, a support vector machine, or a simple decision tree.\n72. The method of claim 60 wherein each respective cellular constituent in said expression vector subgroup is assigned a respective metric based on an ability for said respective cellular constituent to discriminate between said first subgroup and said second subgroup, and said classifying step (b) comprises classifying all or a portion of said population into said plurality of subtypes using linear discriminate analysis, a linear programming algorithm, a support vector machine.\n73. The method of claim 1 wherein each respective cellular constituent in said expression vector subgroup is assigned a respective metric based on an ability for said respective cellular constituent to discriminate between said first subgroup and said second subgroup, and said classifying step (b) comprises classifying all or a portion of said population into said plurality of subtypes using a simple decision tree.\n74. The method of claim 1 wherein an identity of the target gene in the primary tissue of said species is not known, the method further comprising:\n(i) performing quantitative genetic analysis, for each cellular constituent in all or a portion of the cellular constituents in the set of cellular constituents, using an abundance statistic for the cellular constituent as a quantitative trait in the quantitative genetic analysis, the abundance statistic comprising a measurement of the level of said cellular constituent in the secondary tissue of each organism in said plurality of organisms, thereby identifying a hot spot chromosomal region of the genome of said species that links to one or more cellular constituents in said species;\n(ii) identifying a plurality of genes that are in said hot spot chromosomal region;\n(iii) for each gene in said plurality of genes in said hot spot region, performing quantitative genetic analysis using an abundance level of said gene or gene product as a quantitative trait; and\n(iv) ranking each gene identified in said hot spot based on the quantitative genetic analyses performed in step (iii) to form a ranked list of genes.\n75-77. (canceled)\n78. The method of claim 74 wherein said measurement of the level of said cellular constituent in the secondary tissue of each organism in said plurality of organisms that is used in step (i) to form said abundance statistic is a measurement of the translational state of said cellular constituent.\n79. The method of claim 74 wherein said measurement of the level of said cellular constituent in the secondary tissue of each organism in said plurality of organisms that is used in step (i) to form said abundance statistic is a measurement of the activity or post-translational modification of said cellular constituent.\n80. The method of claim 74 wherein each quantitative genetic analysis performed in step (i) comprises model-based linkage analysis.\n81. The method of claim 74 wherein each quantitative genetic analysis performed in step (i) comprises model-free linkage analysis.\n82. (canceled)\n83. The method of claim 74 wherein each quantitative genetic analysis performed in step (i) comprises association analysis.\n84. The method of claim 83 wherein said association analysis comprises population-based association analysis.\n85. The method of claim 83 wherein said association analysis comporises family-based association analysis.\n86. The method of claim 85 wherein said family-based association analysis comprises a haplotype relative risk test, a transmission equilibrium test, or a sibship-based test.\n87. The method of claim 74 wherein said measurement of the level of said cellular constituent in the secondary tissue of each organism in said plurality of organisms is a measurement of the activity of the gene or post-translational modification of the gene.\n88. The method of claim 74 wherein each said quantitative genetic analysis performed in step (iii) comprises:\n(A) testing for linkage or association between a position in the genome of said species and the quantitative trait, wherein the quantitative trait is a measurement of the level of the gene corresponding to the quantitative genetic analysis in each organism in said plurality of organisms;\n(B) advancing to another position in the genome; and\n(C) repeating steps (A) and (B) until an end of the genome is reached.\n89. The method of claim 88 wherein said measurement of the level of said gene in each organism in said plurality of organisms is a measurement of the transcriptional state of the gene.\n90. The method of claim 88 wherein said measurement of the level of said gene in each organism in said plurality of organisms is a measurement of the translational state of the gene.\n91-97. (canceled)\n98. The method of claim 74 wherein said method further comprises using a plurality of genes in said ranked list of genes in a multivariate analysis to determine whether said genes are genetically interacting.\n99. The method of claim 98 wherein said set of genetic markers comprise single nucleotide polymorphisms (SNPs), microsatellite markers, restriction fragment length polymorphisms, short tandem repeats, DNA methylation markers, sequence length polymorphisms, random amplified polymorphic DNA, amplified fragment length polymorphisms, or simple sequence repeats for each organism in said plurality of organisms.\n100. The method of claim 1 wherein said species is human, rat or mouse.\n101. The method of claim 1 wherein said population comprises an F2 population, an Ft population, an F2:3 population or a Design III population\n102. A computer program product for use in conjunction with a computer system, the computer program product comprising a computer readable storage medium and a computer program mechanism embedded therein, the computer program mechanism comprising:\na classification module for identifying a set of cellular constituents in a secondary tissue of a species that serves as a surrogate marker for an activity of a target gene expressed in a primary tissue of said species; the classification module comprising: (a) instructions for constructing a classifier using a cellular constituent level of each cellular constituent in a first plurality of cellular constituents measured in said secondary tissue in each member of a population of said species, wherein said population comprises a first subgroup and a second subgroup, wherein\nsaid classifier is based on a second plurality of cellular constituents that comprises all or a portion of said first plurality of cellular constituents, and\nrespective abundance levels of each cellular constituent in said second plurality of cellular constituents varies between said first subgroup and said second subgroup;\n(b) instructions for classifying all or a portion of said population of said species into a plurality of subtypes using said classifier; and\n(c) instructions for identifying one or more cellular constituents that can discriminate members of said population between a first subtype in said plurality of subtypes and a second subtype in said plurality of subtypes.\n103-185. (canceled)\n186. A computer system for identifying a set of cellular constituents in a secondary tissue of a species that serves as a surrogate marker for an activity of a target gene expressed in a primary tissue of said species, the computer system comprising:\na central processing unit;\na memory, coupled to the central processing unit, the memory storing a classification module, the classification module comprising:\n(a) instructions for constructing a classifier using a cellular constituent level of each cellular constituent in a first plurality of cellular constituents measured in said secondary tissue in each member of a population of said species, wherein said population comprises a first subgroup and a second subgroup, wherein\nsaid classifier is based on a second plurality of cellular constituents that comprises all or a portion of said first plurality of cellular constituents, and\nrespective abundance levels of each cellular constituent in said second plurality of cellular constituents varies between said first subgroup and said second subgroup;\n(b) instructions for classifying all or a portion of said population of said species into a plurality of subtypes using said classifier; and\n(c) instructions for identifying one or more cellular constituents that can discriminate members of said population between a first subtype in said plurality of subtypes and a second subtype in said plurality of subtypes.",
    "status": "Active",
    "citations_own": [],
    "citations_ftf": [
        "CA1323553C",
        "US5075217A",
        "US5143854A",
        "US5578832A",
        "US5569588A",
        "US6165709A",
        "KR20010023763A",
        "US5965352A",
        "US6324479B1",
        "US6218122B1",
        "US6132969A",
        "US6132997A",
        "US6271002B1",
        "EP1366184A2",
        "US6368806B1",
        "JP2005516310A",
        "EP1514213A2",
        "AU2003257082A1",
        "AU2003303502A1",
        "WO2004109447A2",
        "WO2005017652A2",
        "WO2005107412A2"
    ],
    "citedby_own": [
        "US20060050958A1",
        "US20060193538A1",
        "US20080079747A1",
        "US20080294403A1",
        "US20080294291A1",
        "US20090112917A1",
        "US20100070904A1",
        "US20100174670A1",
        "DE102009015945A1",
        "US20100217763A1",
        "US20100330577A1",
        "WO2011088098A1",
        "US8244654B1",
        "US20140122381A1",
        "WO2014089356A1",
        "US20140358830A1",
        "CN108648144A",
        "WO2019079360A1",
        "US11165512B2",
        "US11189362B2",
        "US11216742B2"
    ],
    "citedby_ftf": [
        "EP1514213A2",
        "AU2003303502A1",
        "WO2004109447A2",
        "US8580622B2",
        "US8285719B1",
        "US8203861B2",
        "WO2012158897A1",
        "CA2955374A1",
        "EP3553737A4"
    ]
}