{
    "patent_link": "https://patents.google.com/patent/US6334127B1/en",
    "patent_id": "US6334127B1",
    "title": "System, method and article of manufacture for making serendipity-weighted recommendations to a user",
    "abstract": "The invention includes an electronic processing system, a method and a computer readable storage device for generating a serendipity-weighted recommendation output set to a user based, at least in part, on a serendipity function. The system includes a processing system to receive user item preference data and community item popularity data. The processing system is also configured to produce an item recommendation set from the user item preference data, produce a set of item serendipity control values in response to the serendipity function and the community item popularity data, and combine the item recommendation set with the set of item serendipity control values to produce a serendipity-weighted and filtered recommendation output set. The method includes receiving item preference data and community item popularity data. The method further includes producing an item recommendation set from the user item preference data, using the processing system, and generating a set of item serendipity control values in response to the community item popularity data and a serendipity function, also using the processing system. The method also includes combining the item recommendation set and the set of item serendipity control values to produce a serendipity-weighted and filtered item recommendation output set, using the processing system. The computer readable storage device, has a set of program instructions physically embodied thereon, executable by a computer, to perform a method similar to that just described.",
    "inventors": [
        "Paul Bieganski",
        "Joseph A. Konstan",
        "John T. Riedl"
    ],
    "assignee": "NET PERCEPTION Inc",
    "classifications": [
        "G06Q30/02",
        "G06F16/9535",
        "Y10S707/99934",
        "Y10S707/99935"
    ],
    "claims": "\n1. An electronic processing system for generating a serendipity-weighted recommendation output set to a user based, at least in part, on a serendipity function, the system comprising a processing system of one or more processors configured to:\n2. A system as recited in claim 1, wherein the processing system is further configured to\n3. A system as recited in claim 1, wherein the processing system is further configured to\n4. A system as recited in claim 1, further comprising an input interface operatively coupled to the processing system in order to receive the applicable data and transmit the applicable data to the processing system.\n5. A system as recited in claim 4, wherein\n6. A system as recited in claim 4, wherein\n7. A system as recited in claim 4, wherein\n8. A system as recited in claim 1, further comprising an output interface operatively coupled to the processing system in order to receive the serendipity-weighted and filtered recommendation output set.\n9. A system as recited in claim 8, further comprising a display device operatively coupled to the output interface in order to display the serendipity-weighted recommendation output set.\n10. A system as recited in claim 8, further comprising a memory system operatively coupled to the output interface in order to receive and store the serendipity-weighted recommendation output set.\n11. A system as recited in claim 1, farther comprising\n12. A system as recited in claim 1, wherein the processing system includes a single processor configured to\n13. A system as recited in claim 1, wherein the processing system includes\n14. A system as recited in claim 1, wherein the processing system includes\n15. A system as recited in claim 1, wherein the processing system includes\n16. A system as recited in claim 1, wherein the processing system is configured to produce the serendipity-weighted recommendation output under real-time, interactive time constraints.\n17. A system as recited in claim 1, wherein the processing system is further configured to produce the serendipity-weighted and filtered recommendation output set as at least one of unary, unordered recommendations and priority-ordered recommendations.\n18. A system as recited in claim 1, wherein the serendipity function is at least one of:\n19. A system as recited in claim 1, wherein\n20. A system as recited in claim 1, wherein\n21. A method of producing a serendipity-weighted recommendation to a user, the method using a computer having a memory unit, a processing system having one or more processors and an input/output interface, the method comprising:\n22. A method as recited in claim 21, further comprising\n23. A method as recited in claim 21, further comprising\n24. A method as recited in claim 21, further comprising\n25. A method as recited in claim 21, further comprising receiving, by the input/output interface the applicable data and transmitting the applicable data, by the input/output interface, to the processing system.\n26. A method as recited in claim 21, further comprising controlling the serendipity function, using the processing system, with feedback data received through the input/output interface, the feedback data including one of a rate at which the user accepts serendipity-weighted and filtered recommended items, a rate at which the user requests additional serendipity-weighted and filtered recommendations, and a rate at which the user accepts non-recommended items.\n27. A method as recited in claim 21, farther comprising\n28. A method as recited in claim 27, further comprising\n29. A system as recited in claim 21, further comprising\n30. A method as recited in claim 21, further comprising outputting, using the processing system, the serendipity-weighted and filtered item recommendation output set to the input/output interface.\n31. A method as recited in claim 30, further comprising transmitting, using the input/output interface, the serendipity-weighted and filtered recommendation output set to a display device and displaying the serendipity-weighted and filtered recommendation output set on the display device.\n32. A method as recited in claim 30, further comprising transmitting, using processing system, the serendipity-weighted and filtered recommendation output set to the memory system for storage therein.\n33. A method as recited in claim 21, further comprising receiving, using the processing system, the community item popularity data from the memory system.\n34. A method as recited in claim 21, further comprising\n35. A method as recited in claim 21, further comprising\n36. A method as recited in claim 21, further comprising\n37. A method as recited in claim 21, further comprising producing, with the processing system, the serendipity-weighted and filtered item recommendation output set under real-time, interactive constraints.\n38. A method as recited in claim 21, further comprising producing, with the processing system, the serendipity-weighted and filtered recommendation output set as at least one of unary, unordered recommendations and priority-ordered recommendations.\n39. A method as recited in claim 21, further comprising receiving, with the processing system, the item recommendation data as at least one of unary values, binary values, and numerical values.\n40. A method as recited in claim 21, further comprising generating, using the processing system, the set of item serendipity control values in response to the community item popularity data and the serendipity function, where the serendipity function is at least one of:\n41. A method as recited in claim 21, wherein\n42. A computer-readable program storage device, having a set of program instructions physically embodied thereon, executable by a computer, to perform a method for providing a serendipity-weighted and filtered recommendation, the method comprising:\n43. A device as recited in claim 42, the method further comprising\n44. A device as recited in claim 42, the method further comprising\n45. A device as recited in claim 42, the method further comprising a receiving, through an input/output interface, a serendipity function selection control input from one of a recommender system administrator and the user, and\n46. A device as recited in claim 42, the method further comprising receiving, by an input/output interface the applicable data and transmitting the applicable data, by the input/output interface, to the processing system.\n47. A device as recited in claim 42, the method further comprising controlling the serendipity function, using the processing system, with feedback data received through an input/output interface, the feedback data including one of a rate at which the user accepts serendipity-weighted and filtered recommended items, a rate at which the user requests additional serendipity-weighted and filtered recommendations, and a rate at which the user accepts non-recommended items.\n48. A device as recited in claim 42, the method further comprising\n49. A device as recited in claim 48, the method further comprising\n50. A device as recited in claim 42, the method further comprising\n51. A device as recited in claim 42, the method further comprising outputting, using the processing system, the serendipity-weighted and filtered item recommendation output set to the input/output interface.\n52. A device as recited in claim 51, the method further comprising transmitting, using an input/output interface, the serendipity-weighted and filtered recommendation output set to a display device and displaying the serendipity-weighted and filtered recommendation output set on the display device.\n53. A device as recited in claim 51, the method further comprising transmitting, using the processing system, the serendipity-weighted and filtered recommendation output set to the memory system for storage therein.\n54. A device as recited in claim 42, the method further comprising receiving, using the processing system, the community item popularity data from the memory system.\n55. A device as recited in claim 42, the method further comprising\n56. A device as recited in claim 42, the method further comprising\n1) combining, with the second processor, the item recommendation set with the set of item serendipity control values to produce the serendipity-weighted and filtered recommendation output set.\n57. A device as recited in claim 42, the method further comprising\n58. A device as recited in claim 42, the method further comprising producing, with the processing system, the serendipity-weighted and filtered item recommendation output set under real-time, interactive constraints.\n59. A device as recited in claim 42, the method further comprising producing, with the processing system, the serendipity-weighted and filtered recommendation output set as at least one of unary, unordered recommendations and priority-ordered recommendations.\n60. A device as recited in claim 42, the method further comprising receiving, with the processing system, the item recommendation data as at least one of unary values, binary values, and numerical values.\n61. A device as recited in claim 42, the method further comprising generating, using the processing system, the set of item serendipity control values in response to the community item popularity data and the serendipity function, where the serendipity function is at least one of:\n62. A device as recited in claim 42, wherein",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4996642A",
        "US5201010A",
        "US5311424A",
        "US5353219A",
        "US5383111A",
        "EP0643359A2",
        "JPH07152771A",
        "US5459306A",
        "US5515269A",
        "JPH08331077A",
        "EP0751471A1",
        "JPH09153027A",
        "WO1997026729A2",
        "JPH09265475A",
        "US5704017A",
        "WO1998002835A1",
        "JPH1032797A",
        "JPH1063681A",
        "JPH1063749A",
        "JPH1063680A",
        "JPH1074206A",
        "JPH1091642A",
        "JPH1091686A",
        "JPH1091647A",
        "US5749081A",
        "JPH10143541A",
        "JPH10143540A",
        "US5768142A",
        "JPH10162027A",
        "JPH10162025A",
        "JPH10162028A",
        "WO1998033135A1",
        "JPH10198706A",
        "US5794209A",
        "JPH10228487A",
        "JPH10228482A",
        "JPH10240749A",
        "JPH10247198A",
        "JPH10257405A",
        "JPH10260955A",
        "US5825651A",
        "JPH10283403A",
        "JPH10289245A",
        "JPH10301950A",
        "JPH10307845A",
        "US5842199A",
        "JPH10320415A",
        "JPH10340270A",
        "JPH117472A",
        "JPH117453A",
        "JPH1115840A",
        "US5867799A",
        "JPH1145290A",
        "JPH1145286A",
        "JPH1145284A",
        "JPH1145289A",
        "JPH1145265A",
        "JPH1153394A",
        "JPH1166081A",
        "JPH1166097A",
        "JPH1166098A",
        "JPH1196164A",
        "JPH11110410A",
        "JPH11120189A",
        "JPH11124361A",
        "JPH11134345A",
        "JPH11143900A",
        "JPH11164217A",
        "JPH11161670A",
        "JPH11175546A",
        "JPH11184891A",
        "JPH11184890A",
        "JPH11195035A",
        "JPH11205706A",
        "JPH11212996A",
        "JPH11232278A",
        "JPH11232287A",
        "JPH11250091A",
        "JPH11259497A",
        "JPH11272574A",
        "JPH11282875A",
        "JPH11282874A",
        "US5974396A",
        "JPH11308547A",
        "JPH11312177A",
        "JPH11316759A",
        "JPH11328266A",
        "JPH11338872A",
        "JPH11338869A",
        "JPH11338879A",
        "JPH11345446A",
        "US6006218A",
        "JP2000013708A",
        "US6016475A",
        "JP2000023112A",
        "US6018738A",
        "JP2000048046A",
        "JP2000057090A",
        "US6049777A",
        "US6064980A",
        "US6092049A",
        "US6108493A",
        "US6112186A",
        "US6119101A",
        "US6161681A",
        "US6236990B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20010011234A1",
        "US20020049641A1",
        "US20020065733A1",
        "US20020091609A1",
        "US20020107758A1",
        "US6438579B1",
        "US20030097352A1",
        "US6618714B1",
        "US20030187835A1",
        "US20030204435A1",
        "US20030212594A1",
        "US20040015416A1",
        "US20040021685A1",
        "US20040058302A1",
        "US20040078214A1",
        "US6728706B2",
        "US20040088325A1",
        "US20040088275A1",
        "US20040088312A1",
        "US20040088287A1",
        "US20040088303A1",
        "US20040088323A1",
        "US20040088322A1",
        "US20040098320A1",
        "US20040138966A1",
        "US20040153413A1",
        "US20040158503A1",
        "US20040162783A1",
        "US20040168190A1",
        "US20040172274A1",
        "US20040172275A1",
        "US20040172342A1",
        "US20040230440A1",
        "US20040243527A1",
        "US20040243479A1",
        "US20040243570A1",
        "US20040244029A1",
        "US20040243604A1",
        "US20040243480A1",
        "US20040249719A1",
        "US20040260724A1",
        "US20040267669A1",
        "US20050004808A1",
        "US20050038893A1",
        "US20050086127A1",
        "US20050096997A1",
        "US20050102202A1",
        "US20050120015A1",
        "US20050171860A1",
        "US20050177401A1",
        "US20050193002A1",
        "US20050216460A1",
        "US20050234781A1",
        "US20050248444A1",
        "US20060015352A1",
        "US20060020995A1",
        "US6996560B1",
        "US20060036510A1",
        "US7024381B1",
        "US20060123014A1",
        "US7069271B1",
        "US7103609B2",
        "US20060212367A1",
        "US20060242269A1",
        "US20060272028A1",
        "US20060271548A1",
        "US7194477B1",
        "US20070106785A1",
        "US7231419B1",
        "US20070214488A1",
        "US20070214123A1",
        "US7295995B1",
        "US20070264982A1",
        "US20080147515A1",
        "US20080162431A1",
        "US7398270B1",
        "US7403910B1",
        "US7406436B1",
        "US20080183681A1",
        "US20080208839A1",
        "US20080235604A1",
        "US20080235219A1",
        "WO2008123720A1",
        "US7454509B2",
        "US7461058B1",
        "US20090094050A1",
        "US20090112848A1",
        "US20090133059A1",
        "US20090132459A1",
        "US20090164429A1",
        "US20090178081A1",
        "US7617127B2",
        "US20090281923A1",
        "US20090281895A1",
        "US20090281873A1",
        "US7650304B1",
        "US20100050211A1",
        "US7676034B1",
        "US20100070571A1",
        "US7703030B2",
        "US7711838B1",
        "US7729945B1",
        "US7739162B1",
        "US20100191619A1",
        "US7788123B1",
        "US7792702B1",
        "US7822647B1",
        "US7822631B1",
        "US20100280835A1",
        "US7831476B2",
        "US7836051B1",
        "US20100293053A1",
        "US7853488B1",
        "US20100324968A1",
        "US20100325004A1",
        "US7894595B1",
        "US7899712B2",
        "US7916858B1",
        "US7917612B2",
        "US7937725B1",
        "US8051040B2",
        "US8050998B2",
        "US20120005192A1",
        "US8115869B2",
        "US8165281B2",
        "US8180680B2",
        "US8200687B2",
        "US8200688B2",
        "US8200683B2",
        "US8201727B1",
        "US20120159329A1",
        "US8209724B2",
        "US8219447B1",
        "US8255325B2",
        "US8260656B1",
        "US8275673B1",
        "US8280030B2",
        "US8301623B2",
        "US8300798B1",
        "US8306908B1",
        "US8306975B1",
        "US8315909B1",
        "US8316015B2",
        "US8332414B2",
        "US20130031104A1",
        "US20130054743A1",
        "US20130066673A1",
        "CN103116581A",
        "US8494899B2",
        "US8510453B2",
        "US8554601B1",
        "US8560463B2",
        "JP2013257793A",
        "US8667161B2",
        "US8712857B1",
        "US8732154B2",
        "US20140157295A1",
        "US8751232B2",
        "US8755763B2",
        "US8769567B1",
        "US8824659B2",
        "US8843467B2",
        "US8863221B2",
        "US8892130B2",
        "US8935269B2",
        "US8938465B2",
        "US9015147B2",
        "US20150134476A1",
        "US9075136B1",
        "US9112972B2",
        "US20150278353A1",
        "US9270447B2",
        "US9286385B2",
        "US9516370B1",
        "US9547650B2",
        "CN107949843A",
        "US10011247B2",
        "US10118099B2",
        "US10284454B2",
        "US10286326B2",
        "US10315113B2",
        "US10324916B2",
        "US10376793B2",
        "US10445811B2",
        "US10462508B2",
        "US10471348B2",
        "US10500498B2",
        "US10546441B2",
        "US10567975B2",
        "US10561945B2",
        "US10562492B2",
        "US10627983B2",
        "US10657585B2",
        "US10765948B2",
        "US10796268B2",
        "US10893082B2",
        "US10943273B2",
        "US10974150B2",
        "US11040286B2",
        "US11097193B2",
        "US11351459B2",
        "US11388481B2",
        "US11524234B2",
        "US11679330B2",
        "US11712627B2",
        "US11760227B2"
    ],
    "citedby_ftf": [
        "GB2353112A",
        "EP1242948A1",
        "US8352331B2",
        "JP4378524B2",
        "EP1288795A1",
        "EP2145265A4",
        "JP2011065670A",
        "US10826862B1"
    ]
}