{
    "patent_link": "https://patents.google.com/patent/US5960097A/en",
    "patent_id": "US5960097A",
    "title": "Background adaptive target detection and tracking with multiple observation and processing stages",
    "abstract": "A computationally efficient missile detection and tracking system, operating on data samples from a focal plane assembly (FPA) of an electro-optical sensor which is observing the earth and space, detects missiles, aircraft, resident space objects or other objects in the presence of background clutter, determines missile types and estimates missile position and velocity components in an inertial reference frame. Digitized samples from an array of electro-optical detectors which are viewing the earth and/or space are processed to detect and track missiles, aircraft and resident space objects. Streak detection is used for this purpose, where the target is separated from a background scene by exploiting target motion relative to the background scene. This processing system provides superior performance and simplified implementation as compared to conventional methods. The weight and power of a computer which can implement the processing system is much reduced as compared to conventional implementation.",
    "inventors": [
        "Carl G. Pfeiffer",
        "Cheng-Chih Tsai",
        "D. Spyro Gumas",
        "Christopher Calingaert",
        "Danny D. Nguyen"
    ],
    "assignee": "Raytheon Co",
    "classifications": [],
    "claims": "\n1. A scanning electromagnetic sensor apparatus, comprising:\na focal plane assembly comprising a plurality of detectors arranged substantially radially and each producing an electrical signal in response to electromagnetic radiation;\nmeans for rotating an electromagnetic radiation emitting image with respect to the focal plane assembly;\nmeans for subtracting a background signal from each electrical signal,\nwherein the subtracting means includes a clutter-adaptive algorithm that varies as a function of background characteristics;\nmeans for filtering the electrical signal to produce a filtered signal from each detector after the background signal has been subtracted using an in-scan and cross-scan filtering algorithm to maximize signal-to-noise ratio;\nmeans for generating an adaptive threshold value as a function of residual noise standard deviation;\nmeans for determining whether each filtered signal exceeds the adaptive threshold value;\nmeans for determining whether each filtered signal that exceeds the adaptive threshold value is a peak.\n2. A system for detecting and tracking objects when given data from a focal plane assembly of an electro-optical sensor, comprising:\nan algorithm for rejecting spurious data spikes;\nan algorithm for correcting for detector responsivity error;\nan algorithm for correcting for detector offset error;\nan algorithm for performing time delay integration;\nan algorithm for correcting for focal plane geometry;\nan algorithm for correcting for non-uniform data sampling effects;\nan algorithm for performing clutter-adaptive estimation and subtraction of a scene background;\nan algorithm for performing matched filtering;\nan algorithm for performing target detection with a constant false alarm rate by setting a clutter-adaptive detection threshold;\nan algorithm for forming two-dimensional data packets of threshold-exceeding data for transmission to a programmable processor;\nan algorithm for specifying window parameters for scene windows;\nan algorithm for sending data from scene windows to an object dependent processor;\nan algorithm for rejecting clutter points using a pulse shape test;\none or more algorithms for calibrating sensors;\nan algorithm for correcting digital logic approximations;\nan algorithm for correcting sensor jitter using observed ground sources;\nan algorithm for converting line-of-sight measurements in sensor coordinates to line-of-sight measurements in inertial reference frame coordinates using sensor attitude measurements;\nan algorithm for classifying observed objects to distinguish earth-fixed clutter points from missiles;\nan algorithm for identifying missiles and rejecting false missile tracks by calculating energy per unit mass of observed objects;\nan algorithm for adaptively varying a threshold multiplier used in the target detection algorithm to maintain a constant false alarm rate in severe clutter;\nan algorithm for defining the scene windows, centered on selected objects being tracked for identifying extended objects;\nan algorithm for line-of-sight tracking of missiles, wherein the observations of a given missile are smoothed to produce, at a specified epoch time, a unit line-of-sight position, velocity and acceleration vectors;\nan algorithm for using a priori knowledge of missile boosting profiles of observed objects to calculate missile position and velocity at burnout;\nan initial orbit determination algorithm for calculating missile position and velocity during a post-boost phase of flight; and\nan algorithm for using the line-of-sight position, velocity and acceleration vectors to calculate commands for pointing a remote electro-optical sensor toward selected objects.\n3. The system of claim 2, wherein the electro-optical sensor and the remote electro-optical sensor are on a single platform.\n4. The system of claim 2, wherein the electro-optical sensor and the remote electro-optical sensor are on separate platforms.\n5. The system of claim 2, wherein the spike rejection algorithm identifies a spike in a given data sequence by using both a shape test and an amplitude test.\n6. The system of claim 2, wherein a steepest descent method is used to calculate one or more parameters of the background estimation algorithm.\n7. The system of claim 2, wherein clutter standard deviation is calculated as a constant times the absolute value of the variance of the difference between estimated and measured background signals.\n8. The system of claim 2, wherein the two-dimensional data packets comprise a plurality of 3 by 3 arrays and each 3 by 3 array is output as a peak packet.\n9. The system of claim 8, wherein each peak packet is curve-fit with a two-dimensional surface to obtain an improved estimate of object position and amplitude and to estimate curvature of the object signal versus time curve for the purpose of performing a shape test.\n10. The system of claim 8, wherein strips of threshold-exceeding data are sent in lieu of peak packets when a window is commanded by the object dependent processor.\n11. The system of claim 2, wherein effects of approximations introduced to simplify processing logic are curve fit from pre-flight simulation and stored as polynomial functions of focal plane assembly position.\n12. The system of claim 2, wherein time-varying predicted and measured values of persistent clutter points and other earth-fixed sources are used in a recursive filter to estimate sensor motion relative to the scene background.\n13. The system of claim 2, wherein the line-of-sight measurements in sensor coordinates are described in a sensor-fixed reference frame and the sensor attitude measurements as determined by external means are direction cosines describing the inertial orientation of the sensor-fixed reference frame which are used to transform sensor line-of-sight measurements into inertial line-of-sight measurements.\n14. The system of claim 2, wherein a criterion for declaring point to be earth-fixed is that the apparent line-of-sight velocity of the point is nearly equal to the line-of-sight velocity of the earth-point where the line-of-sight intersects a surface at a fixed altitude above the earth.\n15. The system of claim 2, wherein postulated missile altitude and altitude rate data is stored in a look-up table for each missile type and possible time-from-launch and is used to calculate from a curve fit of measured line-of-sight position data a parameter which describes how well a given postulated missile matches the measured data.\n16. The system of claim 15, wherein the estimated time from launch is used to extrapolate altitude and altitude rate polynomials to burnout.\n17. The system of claim 2, wherein the threshold multiplier is set by a recursive estimation algorithm operating on specific focal plane assembly regions that divides the focal plane into spatial bins and uses amplitude histograms to distinguish between earth-fixed false alarms and noise-like false alarms and either sets earth-fixed false alarm multipliers or noise-like false alarm multipliers accordingly.\n18. The system of claim 2, wherein the object dependent processor tests for extended objects at regular intervals and adaptively adjusts the scene window size by using last look data to ensure that the extended object is encompassed within the scene window.\n19. The system of claim 2, wherein a line-of-sight state vector comprises unit line-of-sight, line-of-sight velocity and line-of-sight acceleration vectors, with the line-of-sight velocity and line-of-sight acceleration vectors being normalized to satisfy the constraints implicit in the definition of a unit vector.\n20. The system of claim 19, wherein the velocity and acceleration components of the line-of-sight state vector are used to propagate the line-of-sight state vector to a nominal viewing time and to calculate line-of-sight slew commands as a function of the difference between the nominal viewing time and an actual viewing time.\n21. The system of claim 20, wherein the position and velocity calculated by the initial orbit determination algorithm is used to calculate the line-of-sight slew commands for a second sensor platform.\n22. The system of claim 2, wherein the initial orbit determination algorithm is initialized with the calculated missile position and velocity at burnout and Newtonian iteration is performed to improve the estimate of position and velocity by a variation of Laplace's initial orbit determination method.\n23. The system of claim 2, wherein the algorithms are implemented on a satellite platform.\n24. The system of claim 2, wherein the algorithms are implemented on an aircraft.\n25. The system of claim 2, wherein the objects to be detected and tracked include aircraft.\n26. The system of claim 2, wherein the objects to be detected and tracked include resident space objects.\n27. A method of detecting and tracking objects using data received from passive optical sensors, including a scanning acquisition sensor capable of sensing signals emitted in an acquisition sensor field-of-regard, and a tracking sensor capable of sensing signals emitted in a tracking sensor field-of-regard, the method comprising the steps of:\nseparating likely target data received from the acquisition sensor from spurious data by utilizing one or more background-adaptive detection algorithms;\nreducing false detections resulting from the step of separating likely target data samples by using multiple scans of the acquisition sensor field-of-regard to identify earth-fixed objects and rejecting data samples which are not consistent with known object motion and intensity characteristics;\ninitiating tracks of objects of interest by storing line-of-sight vector data associated with the objects of interest;\nreducing false detections by testing a hypothesis that the tracks of objects of interest are consistent with predetermined characteristics of selected object types;\nscheduling an observation time for the tracking sensor to observe specified objects being tracked;\ncalculating a sequence of line-of-sight pointing commands to cause the tracking sensor to be slewed to a sequence of positions for observing each specified object during the scheduled observation time intervals;\nusing a background-adaptive streak detection algorithm to detect the specified objects in the tracking sensor field-of-regard;\ncombining the data received from the acquisition sensor data with the data received from the tracking sensor data to form tracks; and\ncontrolling background-adaptive detection algorithm parameters so as to adapt to operating conditions.\n28. The method of claim 27, wherein the spurious data include background clutter.\n29. The method of claim 27, wherein the spurious data include noise.\n30. The method of claim 27, wherein the step of using a background-adaptive streak detection algorithm to detect the specified objects in the tracking sensor further includes a step of using the background-adaptive streak detection algorithm to detect other objects in the tracking sensor field-of-regard.\n31. The method of claim 27, wherein the step of controlling background-adaptive detection algorithm parameters includes a capability to control background-adaptive detection algorithm parameters so as to adapt to background conditions.\n32. The method of claim 27, wherein the step of controlling background-adaptive detection algorithm parameters includes a capability to control background-adaptive detection algorithm parameters so as to adapt to environment conditions.\n33. The method of claim 27, wherein the step of controlling background-adaptive detection algorithm parameters includes a capability to control background-adaptive detection algorithm parameters so as to adapt to handover quality conditions.\n34. The method of claim 27, wherein all steps are carried out on a space-based platform.\n35. The method of claim 27, wherein all steps are carried out on an airborne platform.\n36. The method of claim 27, wherein the objects of interest include missiles launched from the earth.\n37. The method of claim 36, wherein the missiles include tactical missiles.\n38. The method of claim 36, wherein the missiles include strategic missiles.\n39. The method of claim 27, wherein the objects of interest include satellites.\n40. A method of detecting and tracking objects using data received from a passive optical sensors, the sensor capable of sensing signals emitted in a sensor field-of-regard, the method comprising the steps of:\nseparating likely target data received from the acquisition sensor from spurious data by utilizing one or more background-adaptive detection algorithms;\nreducing false detections resulting from the step of separating likely target data by using multiple scans of the sensor field-of-regard to identify earth-fixed objects and rejecting data which are not consistent with known object motion and intensity characteristics;\ninitiating tracks of objects of interest by storing line-of-sight vector data associated with the objects of interest;\nreducing false detections by testing a hypothesis that the tracks of objects of interest are consistent with predetermined characteristics of selected object types;\nscheduling an observation time for the sensor to observe specified objects being tracked;\ncalculating a sequence of line-of-sight pointing commands to cause the sensor to be slewed to a sequence of positions for observing each specified object during the scheduled observation time intervals;\nusing a background-adaptive streak detection algorithm to detect the specified objects in the sensor field-of-regard;\ncontrolling background-adaptive detection algorithm parameters so as to adapt to operating conditions.\n41. A method for subtracting a background signal sensed by an electromagnetic sensor that includes a plurality of detectors, using a background subtraction algorithm, the method comprising the steps of:\nestimating the background that each detector is observing by recursively filtering data output by each detector in order to subtract that estimate from each detector output, wherein an effective length of an averaging function implicit or explicit in the recursive background estimation filter is adapted to a local background by means of a steepest descent method which minimizes the variance of a data residuals output by the background subtraction algorithm.\n42. The method of claim 41, wherein the averaging function is a function of time.\n43. The method of claim 41, wherein the averaging function is a function of position.\n44. The method of claim 41, wherein the steepest descent method estimates statistics of the observed sensor background, and wherein an array of background-subtracted residuals is used in the steepest descent algorithm.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5038785A",
        "US5392225A",
        "US5504492A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6065007A",
        "WO2000049563A1",
        "US6195475B1",
        "US6262680B1",
        "US6295373B1",
        "WO2002031751A1",
        "WO2002056051A1",
        "US6484131B1",
        "US6487516B1",
        "US20020181059A1",
        "WO2003006915A1",
        "US20030099375A1",
        "US6584300B2",
        "US6651012B1",
        "US20040004707A1",
        "US6680687B2",
        "US20040031918A1",
        "US20040054572A1",
        "US6710743B2",
        "US6750806B2",
        "US20040158832A1",
        "US6792152B1",
        "US20040188617A1",
        "US6807468B2",
        "US20040206898A1",
        "US6816632B1",
        "US20040243378A1",
        "US6864828B1",
        "US6875019B2",
        "WO2005038478A2",
        "US6917692B1",
        "WO2005069197A1",
        "US20050169551A1",
        "US20050175219A1",
        "US20050185824A1",
        "US6943724B1",
        "US20050226508A1",
        "US20050226490A1",
        "US20050264438A1",
        "US20050276460A1",
        "US20050275728A1",
        "US20050275834A1",
        "US20050276461A1",
        "US20050288907A1",
        "US6993458B1",
        "US20060023916A1",
        "US7003136B1",
        "US20060060717A1",
        "US7026980B1",
        "US20060107211A1",
        "US20060107223A1",
        "US20060285770A1",
        "US7181323B1",
        "US20070073525A1",
        "US20070090180A1",
        "US20070096772A1",
        "US20070126893A1",
        "US20070146491A1",
        "US20070150128A1",
        "US7248206B1",
        "US7263208B1",
        "US7266042B1",
        "US7351977B2",
        "US7411543B1",
        "CN100443870C",
        "US20080309920A1",
        "US20090200466A1",
        "EP2094004A1",
        "US20090245580A1",
        "US20090279609A1",
        "US20100021008A1",
        "US20100038490A1",
        "US20100076726A1",
        "US20100296703A1",
        "US7869952B1",
        "US20110025551A1",
        "US7991192B2",
        "US20110226907A1",
        "US8035549B1",
        "WO2011130722A3",
        "US8103085B1",
        "US8130137B1",
        "CN102426357A",
        "US20120099764A1",
        "US8175393B2",
        "US20120134541A1",
        "US8193968B1",
        "WO2012115611A1",
        "WO2012134620A1",
        "US8285533B2",
        "US8295547B1",
        "US20130094694A1",
        "US20130235211A1",
        "US20130245929A1",
        "US20130250125A1",
        "US8620023B1",
        "US8736924B2",
        "US8787114B1",
        "US8816895B2",
        "US20140278048A1",
        "US8891852B2",
        "US8946606B1",
        "US8965046B2",
        "US9111444B2",
        "US9140784B1",
        "US9212869B1",
        "US20160012608A1",
        "US9292187B2",
        "US9297886B1",
        "RU2582871C1",
        "US20170061637A1",
        "US9651499B2",
        "US20170350956A1",
        "US20180113203A1",
        "US9983585B1",
        "RU183845U1",
        "RU184016U1",
        "PL422440A1",
        "US10410371B2",
        "CN110544233A",
        "CN110728668A",
        "US10586464B2",
        "CN110930508A",
        "CN111161304A",
        "US10740609B1",
        "CN112346033A",
        "US10977808B2",
        "CN112861877A",
        "CN113391302A",
        "CN113408422A",
        "US11125623B2",
        "US11153494B2",
        "US11168984B2",
        "US11242162B2",
        "CN114066937A",
        "CN114593646A",
        "US11632506B2",
        "US20230221154A1"
    ],
    "citedby_ftf": []
}