{
    "patent_id": "US-11463898-B2",
    "title": "Systems, methods, and devices for electronic spectrum management ",
    "assignee": "Digital Global Systems, Inc.",
    "publication_date": "2022-10-04",
    "patent_link": "https://patents.google.com/patent/US11463898B2/en",
    "inventors": [
        "Ronald C. Dzierwa",
        "Gabriel R. Garcia",
        "Daniel Carbajal"
    ],
    "classifications": [
        "H04W24/08",
        "G06N20/00",
        "G06N5/022",
        "H04B17/23",
        "H04B17/27",
        "H04B17/309",
        "H04B17/318",
        "H04W16/14",
        "H04W64/006",
        "H04B17/3911",
        "H04W64/00"
    ],
    "abstract": "Systems, methods, and devices enable spectrum management by identifying, classifying, and cataloging signals of interest based on radio frequency measurements. Signal data is compared with stored data to identify the signal of interest. Signal degradation data is calculated based on noise figure parameters, hardware parameters and environment parameters.",
    "claims": "\n1. A method for automatic signal detection in a radio-frequency (RF) environment, comprising:\nlearning the RF environment to a settled percent during a period of time based on statistical learning techniques, thereby creating learning data including power level measurements of the RF environment;\nforming a knowledge map of the RF environment based on the power level measurements of the RF environment;\nscrubbing a real-time spectral sweep against the knowledge map;\ncalculating a first derivative of the power level measurements and a second derivative of the power level measurements;\nselecting most prominent derivatives of the first derivative and the second derivative;\nsmoothing the real-time spectral sweep with a correction vector, wherein the correction vector is determined according to the real-time spectral sweep;\ndetecting at least one signal in the RF environment based on matched positive and negative gradients; and\naveraging the real-time spectral sweep, removing areas identified by the matched positive and negative gradients, connecting points between removed areas to determine a baseline, and subtracting the baseline from the real-time spectral sweep to reveal the at least one signal;\nwherein the knowledge map comprises an array of normal distributions, wherein each normal distribution corresponds to how often a power level at each frequency has been at a particular level;\nwherein the detecting the at least one signal in the RF environment comprises automatically fine-tuning a threshold of power level on a segmented basis while extracting at least one temporal feature from the knowledge map.\n2. The method of claim 1, further comprising creating a profile of the RF environment based on the knowledge map, wherein the profile comprises a highest power level at each frequency during the period of time.\n3. The method of claim 1, further comprising periodically reevaluating the RF environment and updating the knowledge map.\n4. The method of claim 1, further comprising sending a notification and/or an alarm to an operator after detecting the at least one signal.\n5. The method of claim 1, further comprising displaying the knowledge map and/or detecting results in real time on a remote device.\n6. The method of claim 1, wherein the settled percent is about 99.95%.\n7. The method of claim 1, further comprising indexing the power level measurements for each frequency interval in a spectrum section in the period of time.\n8. A system for automatic signal detection in a radio-frequency (RF) environment, comprising:\nat least one apparatus for detecting signals in the RF environment;\nwherein the at least one apparatus is operable to sweep and learn the RF environment to a settled percent during a period of time based on statistical learning techniques, thereby creating learning data including power level measurements of the RF environment;\nwherein the at least one apparatus is operable to form a knowledge map based on the power level measurements of the RF environment;\nwherein the knowledge map comprises an array of normal distributions, wherein each normal distribution corresponds to how often a power level at each frequency has been at a particular level;\nwherein the at least one apparatus is operable to scrub a real-time spectral sweep against the knowledge map;\nwherein the at least one apparatus is operable to calculate a first derivative of the power level measurements and a second derivative of the power level measurements;\nwherein the at least one apparatus is operable to select most prominent derivatives of the first derivative and the second derivative;\nwherein the at least one apparatus is operable to smooth the real-time spectral sweep with a correction vector, wherein the correction vector is determined according to the real-time spectral sweep;\nwherein the at least one apparatus is operable to detect at least one signal in the RF environment based on matched positive and negative gradients; and\nwherein the at least one apparatus is operable to average the real-time spectral sweep, remove areas identified by the matched positive and negative gradients, connect points between removed areas to determine a baseline, and subtract the baseline from the real-time spectral sweep to reveal the at least one signal;\nwherein the at least one apparatus is operable to automatically fine-tune a threshold of power level on a segmented basis while extracting at least one temporal feature from the knowledge map.\n9. The system of claim 8, wherein the at least one apparatus and/or a remote device is operable to create a profile of the RF environment based on the knowledge map, wherein the profile comprises a highest power level at each frequency during the period of time.\n10. The system of claim 8, wherein the at least one apparatus periodically reevaluates the RF environment and updates the knowledge map.\n11. The system of claim 8, wherein the at least one apparatus is operable to send a notification and/or an alarm to an operator after detecting the at least one signal.\n12. The system of claim 8, wherein the settled percent is about 99.95%.\n13. The system of claim 8, wherein the at least one apparatus is operable to index the power level measurements for each frequency interval in a spectrum section in the period of time.\n14. The system of claim 8, wherein the knowledge map and detecting results are displayed on a remote device in real time.\n15. The system of claim 8, wherein a frequency resolution of the knowledge map is based on a Fast Fourier Transform (FFT) size setting.\n16. A system for automatic signal detection in a radio-frequency (RF) environment, comprising:\nat least one apparatus for detecting signals in the RF environment; and\na remote device in network-based communication with the at least one apparatus;\nwherein the at least one apparatus is operable to sweep and learn the RF environment to a settled percent during a period of time based on statistical learning techniques, thereby creating learning data including power level measurements of the RF environment;\nwherein the at least one apparatus is operable to form a knowledge map based on the power level measurements of the RF environment;\nwherein the knowledge map comprises an array of normal distributions, wherein each normal distribution corresponds to how often a power level at each frequency has been at a particular level;\nwherein the at least one apparatus is operable to scrub a real-time spectral sweep against the knowledge map;\nwherein the at least one apparatus is operable to calculate a first derivative of the power level measurements and a second derivative of the power level measurements;\nwherein the at least one apparatus is operable to select most prominent derivatives of the first derivative and the second derivative;\nwherein the at least one apparatus is operable to smooth the real-time spectral sweep with a correction vector, wherein the correction vector is determined according to the real-time spectral sweep;\nwherein the at least one apparatus is operable to detect at least one signal in the RF environment based on matched positive and negative gradients; and\nwherein the at least one apparatus is operable to average the real-time spectral sweep, remove areas identified by the matched positive and negative gradients, connect points between removed areas to determine a baseline, and subtract the baseline from the real-time spectral sweep to reveal the at least one signal;\nwherein the at least one apparatus is operable to automatically fine-tune a threshold of power level on a segmented basis while extracting at least one temporal feature from the knowledge map.\n17. The system of claim 16, wherein the knowledge map and detecting results are displayed on the remote device in real time.\n18. The system of claim 16, wherein the at least one apparatus is operable to send a notification and/or an alarm to an operator after detecting the at least one signal."
}