{
    "patent_link": "https://patents.google.com/patent/US5644660A/en",
    "patent_id": "US5644660A",
    "title": "Method and apparatus for efficiently transmitting forced updates in a moving picture codec",
    "abstract": "A method and apparatus for selecting blocks for intraframe encoding in a way which avoids intraframe encoding blocks which have not diverged. An inter-energy value is calculated which represents the approximate number of bits required to encode the block of data using a best interframe encoding technique. An intra-energy value is calculated which represents the approximate number of bits required to encode the block of data using intraframe encoding. The block is transmitted using intraframe encoding if the intra-energy is approximately less than the inter-energy. Otherwise, the block is either a) transmitted using an interframe encoding technique or b) not transmitted, thereby implying that the block from the previous frame in the sequence should be repeated. An encoder determines the number of times K that the block has been interframe encoded since it was last intraframe encoded. A weighting factor w(K) is calculated which decreases with the value of K. A weighted energy value is then calculated by multiplying the intra-energy plus an offset S by the weighting factor w(k). If the weighted energy value is approximately less than the inter-energy value, the block is transmitted using intraframe encoding.",
    "inventors": [
        "John E. Bruder"
    ],
    "assignee": "Polycom Inc",
    "classifications": [
        "H04N21/658",
        "H04N19/107",
        "H04N19/61",
        "H04N21/6377"
    ],
    "claims": "\n1. A method for encoding and transmitting a block of data in each of a sequence of frames, the method comprising the steps of:\ncalculating a first energy value representative of the approximate number of bits required to encode said block of data using an interframe encoding technique,\ncalculating a second energy value representative of the approximate number of bits required to encode the block of data using intraframe encoding, and\ntransmitting said block using intraframe encoding if said second energy value is approximately less than said first energy value.\n2. A method for encoding and transmitting a block of data in each of a sequence of frames, the method comprising the steps of:\ndetermining the number of frames k in which said block was interframe encoded since said block was last encoded using intraframe encoding,\ncalculating a first energy value representative of the approximate number of bits required to encode said block of data using an interframe encoding technique,\ncalculating a second energy value representative of the approximate number of bits required to encode the block of data using intraframe encoding,\ncalculating a weighting factor w(k) that decreases with increasing value of k,\ncalculating a weighted energy value by multiplying said second energy by said weighting factor w(k), and\ntransmitting said block using intraframe encoding if said weighted energy value is approximately less than said first energy value.\n3. A method for encoding and transmitting a sequence of frames of data, each frame of said sequence conforming to a frame format divided into a plurality of blocks, the method comprising the steps of:\n(a) providing an array of counters, each counter of said array corresponding to a block of said frame format;\n(b) for each block of each frame, if the corresponding counter is greater than a threshold determined for said block, transmitting said block using intraframe coding and restarting said corresponding counter; and\n(c) for blocks of a frame not selected for intraframe coding, incrementing the corresponding counters.\n4. The method of claim 3 further comprising the step of:\nwithin each frame transmitted, limiting to a predetermined maximum the number of blocks selected in step (b) for intraframe coding.\n5. The method of claim 3 wherein said threshold is a constant for all blocks of all frames of said sequence.\n6. The method of claim 5 wherein said constant is selected at the beginning of the transmission of said sequence of frames, the value of said selected constant being inversely related to the data rate of transmission of said sequence of frames.\n7. The method of claim 5 wherein a counter of said array counts all frames transmitted since the corresponding block was last encoded using intraframe encoding.\n8. The method of claim 3 wherein a counter of said array counts all frames transmitted since the corresponding block was last encoded using intraframe encoding.\n9. The method of claim 3 wherein the transmitting of step (b) further comprises the steps of:\ncalculating a first energy value representative of the approximate number of bits required to encode said block using an interframe encoding technique;\ncalculating a second energy value representative of the approximate number of bits required to encode said block using an intraframe encoding technique;\ncalculating a weighting factor that decreases with increase in the value of the counter corresponding to said block;\ncalculating a weighted energy value by multiplying said second energy value by said weighting factor; and\nselecting intraframe coding to transmit said block if said weighted energy value is approximately less than said first energy value.\n10. The method of claim 9 wherein said weighting factor decreases approximately logarithmically with increase in said corresponding counter.\n11. The method of claim 9 wherein said corresponding counter omits counting those frames in which said block was encoded as having no change from the previous frame.\n12. The method of claim 3 wherein said corresponding counter omits counting those frames in which said block was encoded as having no change from the previous frame.\n13. A method for encoding and transmitting a block of data in each of a sequence of frames, the method comprising the steps of:\n(a) selecting at the beginning of the transmission of said sequence a constant first threshold, the value of said first threshold being inversely related to the data rate of transmission of said sequence of frames;\n(b) determining as a first aging count, a count of all frames transmitted since said block was last encoded using intraframe coding;\n(c) determining as a second aging count, a count of the number of frames in which said frame has been encoded using an interframe encoding method since said block was last encoded using intraframe coding;\n(d) calculating a first energy value representative of the approximate number of bits required to encode said block of data using an interframe encoding technique;\n(e) calculating a second energy value representative of the approximate number of bits required to encode said block of data using an intraframe encoding technique;\n(f) calculating a weighting factor that decreases with increase in said second aging count;\n(g) calculating a weighted energy value by multiplying said second energy value by said weighting factor; and\n(h) transmitting said block using intraframe coding if said first aging count is greater than said first threshold or said weighted energy value is approximately less than said first energy value.\n14. The method of claim 13 wherein said weighting factor decreases approximately logarithmically with increase in said aging count.\n15. An apparatus for encoding and transmitting a block of data in each of a sequence of frames, each frame of said sequence conforming to a frame format divided into a plurality of blocks, the apparatus comprising:\nan array of counters, each counter of said array corresponding to a block of said frame format and having a value counting a number of frames transmitted since an intraframe encoding of said block was last transmitted;\nan intraframe encoder for encoding said block using an intraframe coding method to produce an intraframe encoding;\nan interframe encoder for encoding said block using an interframe coding method to produce an interframe encoding;\na selector responsive to said counters, that selects said intraframe encoding for transmission if the corresponding counter is greater than a threshold determined for said block, and restarts said corresponding counter, and selects said interframe encoding only if said corresponding counter is less than or equal to said threshold;\nan incrementer, for incrementing said counters, and responsive to said selector, that increments said corresponding counter only if said selector does not select intraframe encoding for transmission of said block; and\na transmitter that transmits a said block in said selected encoding.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4827338A",
        "US4837618A",
        "US4942465A",
        "US4947248A",
        "US5057918A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5911008A",
        "US5991443A",
        "US6002802A",
        "US6101282A",
        "US6167157A",
        "US6266447B1",
        "EP1202574A2",
        "US20060133423A1",
        "US20110026592A1",
        "US20120106632A1",
        "CN101712239B",
        "US9888252B2"
    ],
    "citedby_ftf": []
}