{
    "patent_link": "https://patents.google.com/patent/US20080243675A1/en",
    "patent_id": "US20080243675A1",
    "title": "High Speed Processing of Financial Information Using FPGA Devices",
    "abstract": "Methods and systems for processing financial market data using reconfigurable logic are disclosed. Various functional operations to be performed on the financial market data can be implemented in firmware pipelines to accelerate the speed of processing. Also, a combination of software logic and firmware logic can be used to efficiently control and manage the high speed flow of financial market data to and from the reconfigurable logic.",
    "inventors": [
        "Scott Parsons",
        "David E. Taylor",
        "David Vincent Schuehler",
        "Mark A. Franklin",
        "Roger D. Chamberlain"
    ],
    "assignee": "Exegy Inc",
    "classifications": [
        "G06Q40/04",
        "G06Q40/00",
        "G06Q40/06"
    ],
    "claims": "\n1. A method for processing financial market data, the method comprising:\nstreaming a financial market data feed through a reconfigurable logic device, the reconfigurable logic device having a resident firmware application module pipeline; and\nperforming with the firmware application module pipeline a plurality of different financial data processing operations on the streaming financial market data.\n2. The method of claim 1 wherein the financial market data feed comprises a financial market source data feed, the method further comprising:\nreceiving the financial market source data feed from a data source.\n3. The method of claim 1 wherein the financial market data feed comprises a financial market secondary data feed.\n4. The method of claim 1 wherein the financial market data feed comprises a plurality of messages, and wherein the performing step further comprises:\nnormalizing the messages to a common format.\n5. The method of claim 4 wherein the performing step further comprises:\nconverting the financial market data to a plurality of messages having a predetermined format.\n6. The method of claim 1 wherein the financial market data feed comprises a plurality of messages, and wherein the performing step further comprises:\nparsing the messages into a plurality of data fields.\n7. The method of claim 6 wherein the financial market data feed comprises a plurality of messages, and wherein the performing step further comprises:\nperforming a calculation operation on the data fields of the parsed messages.\n8. The method of claim 1 wherein the financial market data feed comprises a plurality of messages, and wherein the performing step further comprises:\ntransforming the messages from a first format to a second format.\n9. The method of claim 8 wherein the first format comprises a format as received from an external feed source.\n10. The method of claim 8 wherein the first format comprises FIX and wherein the second format comprises FAST.\n11. The method of claim 8 wherein the first format comprises FAST and wherein the second format comprises FIX.\n12. The method of claim 8 wherein the first format comprises a format as received from an external feed source, and wherein the second format comprises FAST.\n13. The method of claim 1 wherein the firmware application module pipeline is configured to perform at least one financial data processing operation selected from the group consisting of: a feed compression operation, a feed decompression operation, a feed handler operation, a rule-based calculation operation, a feed journal operation, an alert generation engine, a Last Value Cache (LVC) server operation, a historical time-series oriented databases with analytics operation, a news database operation with a search capability, an order book server operation, an order router operation, a direct market access gateway operation, a trading engine, an auto-quote server operation, a compliance journal operation, an internal matching system operation, an order management system operation, an entitlements and reporting operation, a management and monitoring operation, and a publishing and contribution server operation.\n14. The method of claim 1 further comprising:\nproviding data processed through the reconfigurable logic device to a trader workstation user interface.\n15. A device for processing a streaming financial market data feed, the device comprising:\na reconfigurable logic device having a firmware application module pipeline, the reconfigurable logic device being configured to receive the data feed and process the data feed through the firmware application module pipeline to perform a plurality of different financial data processing operations thereon.\n16. The device of claim 15 wherein the financial market data feed comprises a plurality of messages, and wherein the reconfigurable logic device is further configured to normalize the messages to a common format.\n17. The device of claim 15 wherein the reconfigurable logic device is further configured to convert the financial market data feed to a plurality of messages having a predetermined format.\n18. The device of claim 15 wherein the financial market data feed comprises a plurality of messages, and wherein the reconfigurable logic device is further configured to parse the messages into a plurality of data fields.\n19. The device of claim 18 wherein the financial market data feed comprises a plurality of messages, and wherein the reconfigurable logic device is further configured to perform a calculation operation on the data fields of the parsed messages.\n20. The device of claim 15 wherein the financial market data feed comprises a plurality of messages, and wherein the reconfigurable logic device is further configured to transform the messages from a first format to a second format.\n21. The method of claim 20 wherein the first format comprises a format as received from an external feed source.\n22. The device of claim 20 wherein the first format comprises FIX and wherein the second format comprises FAST.\n23. The device of claim 20 wherein the first format comprises FAST and wherein the second format comprises FIX.\n24. The device of claim 15 wherein the firmware application module pipeline is configured to perform at least one financial data processing operation selected from the group consisting of: a feed compression operation, a feed decompression operation, a feed handler operation, a rule-based calculation operation, a feed journal operation, an alert generation engine, a Last Value Cache (LVC) server operation, a historical time-series oriented databases with analytics operation, a news database operation with a search capability, an order book server operation, an order router operation, a direct market access gateway operation, a trading engine, an auto-quote server operation, a compliance journal operation, an internal matching system operation, an order management system operation, an entitlements and reporting operation, a management and monitoring operation, and a publishing and contribution server operation.\n25. The device of claim 15 further comprising:\na trader workstation in communication with the reconfigurable logic device, and wherein a user interface on the workstation is configured to display data processed by the reconfigurable logic device.\n26. The device of claim 15 further comprising:\nan application programming interface (API) and customer-supplied application software in communication with the reconfigurable logic device, and wherein the customer-supplied application software is configured to receive data from the reconfigurable logic device via the API and further process the received data.\n27. An apparatus for processing financial market data, the apparatus comprising:\na reconfigurable logic device with firmware logic deployed thereon, the firmware logic being configured to perform a specified data processing operation on the financial market data; and\na processor in communication with the reconfigurable logic device, the processor being programmed with software logic, the software logic being configured to (1) receive the financial market data as an input, and (2) manage a flow of the received financial market data into and out of the reconfigurable logic device.\n28. The apparatus of claim 27 wherein the financial market data comprises a plurality of financial market data messages, and wherein the software logic is further configured to manage the flow of the received financial market data into and out of the reconfigurable logic device such that each message passes only once from the software logic to the firmware logic.\n29. The apparatus of claim 27 wherein the financial market data comprises a plurality of financial market data messages, and wherein the software logic is further configured to manage the flow of the received financial market data into and out of the reconfigurable logic device such that each message passes only once from the firmware logic back to the software logic.\n30. The apparatus of claim 27 wherein the financial market data comprises a plurality of financial market data messages, and wherein the software logic is further configured to write each received financial market data message to a buffer that is mapped into both a kernel space and a user address space supported by an operating system of the processor.\n31. The apparatus of claim 27 wherein the financial market data comprises a plurality of financial market data messages, and wherein the software logic is further configured to (1) maintain a plurality of different thread groups simultaneously, and (2) assign each financial market data message to a thread group based on a configuration file.\n32. The apparatus of claim 31 wherein processor is further configured to receive the financial market data messages from a plurality of different financial market data feeds, and wherein the configuration file is configured to associate each thread group with a different financial market data feed such that messages from a given one of the feeds will be processed by the thread group associated with that message's feed.\n33. The apparatus of claim 27 wherein the financial market data comprises a plurality of financial market data messages, and wherein the software logic is further configured to write each received financial market data message destined for the firmware logic to a buffer that is mapped into both a kernel space and a user address space supported by an operating system of the processor.\n34. The apparatus of claim 27 wherein the financial market data comprises a plurality of financial market data messages, and wherein the software logic further comprises a hardware interface driver and an MDC driver in communication with the hardware interface driver, wherein the hardware interface driver is configured to receive financial market data messages that have been processed by the firmware, and wherein the MDC driver is configured to (1) receive the firmware-processed financial market data messages from the hardware interface driver, (2) provide a first path and a second path for the firmware-processed financial market data messages, the first path comprising a path for the firmware-processed financial market data messages to at least one client through a network protocol stack, the second path comprising a path for the firmware-processed financial market data messages to an exceptions handling software module.\n35. The apparatus of claim 34 wherein the MDC driver is further configured to interrogate at least a portion of the firmware-processed financial market data messages to determine the path over which each firmware-processed financial market data message should travel.\n36. The apparatus of claim 27 wherein the software logic is further configured to issue a control command to the firmware logic in response to an instruction received by the processor from a client computer in communication therewith.\n37. A method for processing financial market data, the method comprising:\ncontrolling with software logic a flow of financial market data from the software logic to and from firmware logic; and\nperforming a specified financial data processing operation on financial market data with firmware logic in response to the software logic controlling step.\n38. The method of claim 37 wherein the financial market data comprises a plurality of financial market data messages, and wherein the controlling step further comprises controlling the flow of the financial market data such that each message passes only once from the software logic to the firmware logic.\n39. The method of claim 37 wherein the financial market data comprises a plurality of financial market data messages, and wherein the controlling step further comprises controlling the flow of the financial market data such that each message passes only once from the firmware logic to the software logic.\n40. An apparatus for processing financial market data, the apparatus comprising:\na ticker plant configured to receive a stream of financial market data messages, the ticker plant comprising a processor and a reconfigurable logic device in communication with the processor, wherein the processor is configured to execute software logic, the software logic configured to manage a flow of the financial market data messages to the reconfigurable logic device, wherein the reconfigurable logic device is configured with firmware logic, the firmware logic configured to (1) receive the flow of financial market data messages directed thereto by the software logic, and (2) perform at least one financial data processing operation on the received flow to thereby generate a flow of firmware-processed financial market data.\n41. The apparatus of claim 40 wherein the ticker plant is further configured with a network interface for communicating with a plurality of client computers over a network, and wherein software logic is further configured to manage the flow of the firmware-processed financial market data from the firmware logic to the network interface for subsequent delivery to the client computers over the network.\n42. The apparatus of claim 41 wherein the firmware logic is further configured with a firmware pipeline that is configured to perform a plurality of different financial data processing operations on the received flow to thereby generate the flow of firmware-processed financial market data.\n43. The apparatus of claim 42 wherein the ticker plant further comprises a memory in which a plurality of financial instrument records are stored in memory addresses associated with a financial instrument symbology that is internal to the ticker plant, wherein the reconfigurable logic is communication with the memory, wherein the financial market data messages relate to financial instruments, wherein the financial market data messages reference their related financial instruments using a financial instrument symbology that is different than the internal financial instrument symbology, and wherein the firmware logic is further configured to (1) convert each received financial market data message to the internal financial instrument symbology, (2) retrieve financial instrument records pertaining to the received financial market data messages from the memory using the internal financial instrument symbology for the received financial market data messages, and (3) update the financial instrument records in response to the financial data processing operations performed on the received financial market data messages.\n44. A method for processing financial market data, the method comprising:\nreceiving a stream of financial market data messages from an external feed;\nexecuting software logic to manage a flow of the financial market data messages to a reconfigurable logic device, the reconfigurable logic device having firmware logic deployed thereon;\nperforming with the firmware logic at least one financial data processing operation on the flow of financial market data messages to thereby generate a flow of firmware-processed financial market data.\n45. The method of claim 44 further comprising:\nexecuting software logic to manage the flow of the firmware-processed financial market data to thereby deliver the firmware-processed financial market data from the firmware logic to a plurality of remote client computers over a network.\n46. The method of claim 45 wherein the performing step comprises performing with the firmware logic a plurality of different financial data processing operations on the received flow to thereby generate the flow of firmware-processed financial market data.\n47. The method of claim 46 wherein the financial market data messages relate to financial instruments, wherein the financial market data messages reference their related financial instruments using a first financial instrument symbology, the method further comprising:\nstoring a plurality of financial instrument records in memory addresses associated with a second financial instrument symbology that is different than the first financial instrument symbology; and\nusing the firmware logic, (1) converting each received financial market data message to the second financial instrument symbology, (2) retrieving stored financial instrument records pertaining to the received financial market data messages using the second financial instrument symbology for the received financial market data messages, and (3) updating the financial instrument records in response to at least one of the financial data processing operations performed on the received financial market data messages.\n48. An apparatus for processing a stream of financial market data messages, the apparatus comprising:\na reconfigurable logic device configured with a plurality of firmware application modules (FAMs) arranged in a pipeline, the pipeline comprising: (1) a message parsing FAM configured to receive and parse the financial market data messages, (2) a symbol mapping FAM in communication with the message parsing FAM, (3) a last value cache (LVC) updating FAM in communication with the symbol mapping FAM, (4) an interest and entitlement filtering FAM in communication with the LVC updating FAM, and (5) a message formatting FAM in communication with the interest and entitlement filtering FAM.\n49. The apparatus of claim 48, wherein each financial market data message comprises a plurality of date fields, each data field having a data value, and wherein the message parsing FAM is further configured to receive and parse the plurality of financial market data messages into a plurality of its constituent data fields, at least one of the data fields for each message comprising a financial instrument symbol identifier;\nwherein the symbol mapping FAM is configured to map each financial instrument symbol identifier to a symbol value understood within the pipeline;\nwherein the LVC updating FAM is configured to perform at least one field value update operation for a plurality of financial instrument records in response to the parsed data fields and the symbol values;\nwherein the interest and entitlement filtering FAM is configured to receive data from the LVC updating FAM and perform interest and entitlement filtering on that received data; and\nwherein the message formatting FAM is configured to generate a plurality of financial market data messages for output from the reconfigurable logic device in response to the data passed by the interest and entitlement filtering FAM and at least a portion of the parsed data fields.\n50. The apparatus of claim 49 wherein the symbol mapping FAM is configured to map each financial instrument symbol identifier to a symbol value using a hash function in combination with open addressing.\n51. The apparatus of claim 49 wherein the updating FAM is further configured to maintain a cache memory of recently updated records.\n52. The apparatus of claim 49 wherein the interest and entitlement filtering FAM is configured to operate on a plurality of bit vectors associated each financial market data message, at least one bit vector for each message defining whether any entities are interested in data relating to that message, at least another of the bit vectors for each message defining whether any entities are entitled to access data relating to that message.\n53. An apparatus for processing financial market data, the financial market data comprising a plurality of financial market symbols, each financial market symbol identifying a financial instrument, the apparatus comprising:\na reconfigurable logic device configured to (1) receive the financial market data, (2) process the received financial market data to determine the financial instrument symbols therein, (3) map each determined financial instrument symbol to a second financial instrument symbol that also identifies the same financial instrument.\n54. The apparatus of claim 53 wherein the financial market data comprises a plurality of financial market data messages, each message identifying a financial market symbol, and wherein the reconfigurable logic device is further configured to associate each message with the second financial instrument symbol that was mapped from the determined financial instrument symbol for that message.\n55. The apparatus of claim 54 further comprising a memory configured to store the second financial instrument symbols, and wherein the reconfigurable logic device is further configured to map each determined financial instrument symbol to a second financial instrument symbol by performing a lookup in the memory in response to a hash operation.\n56. The apparatus of claim 55 wherein each financial market data message further comprises a symbology identifier, and wherein the reconfigurable logic device is further configured to, for each message, (1) determine a key code therefor based on that message's symbology identifier, (2) perform a compression operation on that message's financial instrument symbol to generate a compressed financial instrument symbol, and (3) generate a hash key for the hash operation based at least in part upon the determined key code and the compressed financial instrument symbol.\n57. The apparatus of claim 56 wherein the hash key comprises a concatenation of the determined key code and the compressed financial instrument symbol.\n58. The apparatus of claim 57 wherein reconfigurable logic device is further configured to perform the hash operation using a near-perfect hashing function in combination with open addressing into the memory to resolve any hash collisions.\n59. The apparatus of claim 58 wherein the memory comprises a plurality of memory addresses, and wherein the second financial instrument symbols comprise the memory addresses.\n60. The apparatus of claim 56 wherein the reconfigurable logic device is further configured to (1) perform, in parallel, a plurality of different compression operations on each message's financial instrument symbol to thereby generate a plurality of different compressed financial instrument symbols, (2) select which of the plurality of different compressed financial instrument symbols are to be used for generating the hash key in response to the determined key code.\n61. The apparatus of claim 55 wherein the memory is located on the reconfigurable logic device.\n62. An apparatus for processing a plurality of financial market data messages, each financial market data message comprising a country identifier and an exchange identifier, the apparatus comprising:\na reconfigurable logic device configured to (1) receive the financial market data messages, (2) process the received financial market data messages to determine the country identifiers and exchange identifiers therein, (3) map each message's determined country identifier and exchange identifier to a global exchange identifier.\n63. The apparatus of claim 62 further comprising a memory configured to store the global exchange identifiers, and wherein the reconfigurable logic device is configured to perform the mapping by using the country identifier and exchange identifier for direct addressing lookups in the memory.\n64. The apparatus of claim 62 wherein the reconfigurable logic device is further configured perform the mapping using a hash table.\n65. A method for processing financial market data, the financial market data comprising a plurality of financial market symbols, each financial market symbol identifying a financial instrument, the method comprising:\nreceiving the financial market data in firmware logic deployed on a reconfigurable logic device;\nprocessing the received financial market data with the firmware logic to determine the financial instrument symbols therein, using the firmware logic, mapping each determined financial instrument symbol to a second financial instrument symbol that also identifies the same financial instrument.\n66. The method of claim 65 wherein the mapping comprises performing a near-perfect hashing operation in combination with open addressing on data derived from the determined financial instrument symbols.\n67. An apparatus for processing a plurality of financial market data messages, each financial market data message comprising financial market data and being associated with a financial instrument, the apparatus comprising:\na reconfigurable logic device configured to (1) receive the financial market data messages, and (2) process each received financial market data message to update a stored record for the financial instrument associated with that message.\n68. The apparatus of claim 67 further comprising a record memory configured to store a plurality of records for a plurality of financial instruments, and wherein the reconfigurable logic device is further configured to (1) receive a financial instrument symbol identifier in association with each received message, (2) retrieve from the record memory a record for each message based at least in part upon each message's associated financial instrument symbol identifier, and (3) update each retrieved record in response to the processing of each financial market data message.\n69. The apparatus of claim 68 further comprising a record management memory, the record management memory comprising a plurality of record management memory addresses, the record management memory being configured to store a plurality of pointers to records in the record memory, each pointer being stored in a record management memory address, and wherein the reconfigurable logic device is further configured to perform a lookup in the record management memory based at least in part upon each message's associated financial instrument symbol identifier to thereby retrieve a pointer to a location in the record memory where a record for that message's associated financial instrument is stored.\n70. The apparatus of claim 69 wherein the record management memory is deployed on a memory device external to the reconfigurable logic device.\n71. The apparatus of claim 70 wherein the memory device comprises at least one selected from the group consisting of an SRAM device and an SDRAM device.\n72. The apparatus of claim 68 wherein the record memory is further configured to store, for each of a plurality of financial instruments, a composite record and a regional record for each exchange on which that financial instrument trades, and wherein the reconfigurable logic device is further configured to (1) receive an exchange identifier in association with each received message, and (2) retrieve from the record memory both the composite record and each regional record for the financial instrument associated with each message based at least in part upon each message's associated financial instrument symbol identifier and exchange identifier.\n73. The apparatus of claim 72 further comprising a record management memory, the record management memory comprising a plurality of record management memory addresses, each record management memory address being associated with a financial instrument symbol identifier and storing a composite pointer to the composite record in the record memory for the financial instrument corresponding to that record management memory address's associated financial instrument symbol identifier and a regional pointer to a location in the record memory that is associated with each regional record for the financial instrument corresponding to that record management memory address's associated financial instrument symbol identifier, and wherein the reconfigurable logic device is further configured to, for each message, (1) retrieve the pointers stored in the record management address associated with that message's associated financial instrument symbol identifier, (2) retrieve the composite record from the record memory based at least in part on the retrieved composite pointer, and (3) retrieve each regional record from the record memory based at least in part on the retrieved regional pointer and that message's associated exchange identifier.\n74. The apparatus of claim 72 wherein the reconfigurable logic device comprises a plurality of composite record update engines and a plurality of regional record update engines for performing the processing of each received financial market data message, and wherein the reconfigurable logic device is further configured to (1) provide the retrieved composite records and the financial market data to the composite record update engines for processing thereby, and (2) provide the retrieved regional records and the financial market data to the regional record update engines for processing thereby.\n75. The apparatus of claim 68 wherein the reconfigurable logic device comprises a plurality of update engines for performing the processing of each received financial market data message, and wherein the reconfigurable logic device is further configured to deliver the retrieved records and the financial market data to the update engines for processing thereby.\n76. The apparatus of claim 75 further comprising a template memory, the template memory being configured to store business logic for use by the update engines.\n77. The apparatus of claim 76 wherein the reconfigurable logic device is further configured to select the business logic to be used by the update engines for processing each message in response to at least one of the group consisting of a field in that message and a field in a retrieved record for that message.\n78. The apparatus of claim 75 wherein the reconfigurable logic device further comprises a pipelined circuit configured to perform the retrieval and delivery operations such that the pipelined circuit can operate on a plurality of the messages simultaneously.\n79. The apparatus of claim 78 wherein the pipelined circuit is configured to stall processing of a second message associated with a financial instrument in response to detecting that the pipelined circuit is already processing a first message associated with the same financial instrument as the second message, and wherein the pipelined circuit is configured to maintain the stall until processing of the first message is complete.\n80. The apparatus of claim 78 wherein the reconfigurable logic device is further configured to (1) maintain a cache memory for storing recently updated records, (2) for each message associated with a financial instrument for which a recently-updated record is stored in the cache memory, deliver the cached record to the update engines rather than a record retrieved from the record memory.\n81. The apparatus of claim 68 wherein the reconfigurable logic device is further configured to (1) detect whether a received message pertains to a financial instrument for which no record is stored in the record memory, and (2) in response to a detecting that a received message pertains to a financial instrument for which no record is stored in the record memory, writing a new record for that financial instrument into the record memory based at least in part on that received message.\n82. The apparatus of claim 68 wherein the reconfigurable logic device is further configured to add a new field to at least a plurality of the records in response to the processing.\n83. The apparatus of claim 68 wherein the record memory is deployed on a memory device external to the reconfigurable logic device.\n84. The apparatus of claim 83 wherein the memory device comprises at least one selected from the group consisting of an SRAM device and an SDRAM device.\n85. A method for processing a plurality of financial market data messages, each financial market data message comprising financial market data and being associated with a financial instrument, the method comprising:\nretrieving a record for a financial instrument associated with a financial market data message;\nperforming at least one financial data processing operation on at least a portion of the financial market data message with reconfigurable logic; and\nupdating the retrieved record in response to the performing step.\n86. The method of claim 85 wherein the retrieving step comprises retrieving a composite record for the financial instrument and at least one regional record for the financial instrument, and wherein the performing step comprises performing the a plurality of financial data processing operations on at least a portion of the message simultaneously for both the retrieved composite record and the at least one retrieved regional record, and wherein the updating step comprises updating the retrieved composite record and the at least one retrieved regional record in response to the performing step.\n87. An apparatus for processing a plurality of financial market data messages, each financial market data message comprising financial market data and being associated with a financial instrument, the apparatus comprising:\na record memory configured to store a plurality of records for a plurality of financial instruments;\na reconfigurable logic device in communication with the record memory, wherein the reconfigurable logic device is configured to (1) receive the financial market data messages, (2) retrieve from the record memory the records for the messages' associated financial instruments, (3) process each received financial market data message to update the record for the financial instrument associated with that message, and wherein each record comprises an interest list that identifies whether any of a plurality of entities have expressed an interest in being notified of data relating to the updated record.\n88. The apparatus of claim 87 wherein the interest list comprises a bit vector having a plurality of bit positions, wherein each bit position corresponds to a different entity, and wherein a bit value at each bit position determines whether the entity corresponding to that bit position is an interested entity.\n89. An apparatus for processing financial market data messages, each financial market data message comprising financial market data and being associated with an interest list and entitlement list, each interest list identifying whether any of a plurality of entities have expressed an interest in being notified of data relating to its associated message, each entitlement list identifying whether any of a plurality of entities are entitled to be notified of data relating to its associated message, the apparatus comprising:\na reconfigurable logic device configured to (1) receive a plurality of the messages, and (2) perform interest and entitlement filtering on the received messages in response to each message's associated interest list and entitlement list.\n90. The apparatus of claim 89 wherein the interest list comprises a bit vector having a plurality of bit positions, wherein each bit position corresponds to a different entity, and wherein a bit value at each bit position determines whether the entity corresponding to that bit position is an interested entity.\n91. The apparatus of claim 90 wherein the entitlement list comprises a bit vector having a plurality of bit positions, wherein each bit position corresponds to a different entity, and wherein a bit value at each bit position determines whether the entity corresponding to that bit position is an entitled entity.\n92. The apparatus of claim 91 wherein the same bit positions in the interest lists and the entitlement lists for each message correspond to the same entities.\n93. The apparatus of claim 92 wherein the reconfigurable logic device is further configured to perform the interest and entitlement filtering by performing, for each message, a bitwise AND operation on the entitlement list bit vector and the interest list bit vector associated with that message to thereby generate an entitled interest list bit vector, wherein the bit values at the different bit positions of the entitled interest list bit vector identify which interested entities are entitled to be notified of data relating to that message.\n94. The apparatus of claim 92 wherein the reconfigurable logic device is further configured to (1) operate on a plurality of different interest list bit vectors that are associated with each message, and (2) for each message, perform a bitwise OR operation on the plurality of interest list bit vectors for the same message to thereby generate a composite interest list bit vector for each message.\n95. The apparatus of claim 94 wherein the reconfigurable logic device is further configured to perform the interest and entitlement filtering by performing, for each message, a bitwise AND operation on the entitlement list bit vector and the composite interest list bit vector associated with that message to thereby generate an entitled interest list bit vector, wherein the bit values at the different bit positions of the entitled interest list bit vector identify which interested entities are entitled to be notified of data relating to that message.\n96. The apparatus of claim 95 wherein at least one of the plurality of interest list bit vectors comprises an exchange interest list bit vector.\n97. The apparatus of claim 96 wherein the reconfigurable logic device is further configured to, for each message, (1) receive an exchange identifier associated therewith, and (2) retrieve an exchange interest list bit vector from a table based on the received exchange identifier for that message.\n98. The apparatus of claim 89 wherein the reconfigurable logic device is further configured to drop a message if the interest and entitlement filtering results in a determination that no entitled and interested party is to be notified of data relating to that message.\n99. A method for processing financial market data messages, each financial market data message comprising financial market data and being associated with an interest list and entitlement list, each interest list identifying whether any of a plurality of entities have expressed an interest in being notified of data relating to its associated message, each entitlement list identifying whether any of a plurality of entities are entitled to be notified of data relating to its associated message, the method comprising:\nreceiving a plurality of the messages; and\nperforming interest and entitlement filtering with reconfigurable logic on the received messages in response to each message's associated interest list and entitlement list.\n100. An apparatus for processing financial market data messages, each financial market data message comprising a plurality of data fields, each data field having a data value, the apparatus comprising:\na reconfigurable logic device configured to (1) receive the financial market data messages, and (2) parse each received financial market data message into its constituent data fields.\n101. The apparatus of claim 100 wherein each message has any of a plurality of different formats, the apparatus further comprising a memory configured to store a data dictionary that defines how financial market data messages in a plurality of formats are to be parsed, and wherein the reconfigurable logic device is further configured to (1) determine the format exhibited by each received message, and (2) parse each received message into its constituent data fields as defined for the determined format in the data dictionary.\n102. The apparatus of claim 101 wherein the memory comprises a memory device that is external to the reconfigurable logic device.\n103. The apparatus of claim 102 wherein the memory device comprises at least one selected from the group consisting of an SRAM device and an SDRAM device.\n104. An apparatus for processing financial market data, the financial market data comprising a plurality of data fields, each data field having a data value, the apparatus comprising:\na reconfigurable logic device configured to generate a plurality of financial market data messages from a plurality of the data fields, each generated message having a specified format.\n105. The apparatus of claim 104 wherein each generated message exhibits any of a plurality of different formats, the apparatus further comprising a memory configured to store a data dictionary that defines a plurality of formats for financial market data messages, and wherein the reconfigurable logic device is further configured to access the data dictionary to determine how each generated message should be formatted.\n106. The apparatus of claim 105 wherein the memory comprises a memory device that is external to the reconfigurable logic device.\n107. The apparatus of claim 106 wherein the memory device comprises at least one selected from the group consisting of an SRAM device and an SDRAM device.",
    "status": "Active",
    "citations_own": [
        "US2196042A",
        "US3301848A",
        "US3301723A",
        "US3303896A",
        "US3317430A",
        "US3565176A",
        "US3888312A",
        "US3933205A",
        "US3937283A",
        "US3960736A",
        "US3965982A",
        "US4007792A",
        "US4067389A",
        "US4108782A",
        "US4112050A",
        "US4378845A",
        "US4461716A",
        "US4506734A",
        "US4514309A",
        "US4654266A",
        "US4657081A",
        "US4660643A",
        "US4683068A",
        "US4686052A",
        "US4718490A",
        "US4724905A",
        "US4725372A",
        "US4739834A",
        "US4741401A",
        "US4748011A",
        "US4795574A",
        "US4817717A",
        "US4830106A",
        "US4846277A",
        "US4848468A",
        "US4852650A",
        "US4892147A",
        "US4926940A",
        "US4938286A",
        "US5005645A",
        "US5024276A",
        "US5082579A",
        "US5106518A",
        "US5110486A",
        "US5224546A",
        "US5228510A",
        "US5330005A",
        "US5342530A",
        "US5402846A",
        "US5404488A",
        "US5411091A",
        "US5424284A",
        "US5482116A",
        "US5488083A",
        "US5497831A",
        "US5501275A",
        "US5624886A",
        "US5635458A",
        "US5649596A",
        "US5711396A",
        "US5722490A",
        "US5744024A",
        "US5775425A",
        "US5787986A",
        "US5877127A",
        "US5908814A",
        "US5908073A",
        "US6016871A",
        "US6035936A",
        "US6047772A",
        "US6054417A",
        "US6059034A",
        "US6060436A",
        "US6069118A",
        "US6169058B1",
        "US6228812B1",
        "US6247543B1",
        "US6267938B1",
        "US20020049256A1",
        "US6725931B2",
        "US6756345B2",
        "US20040153389A1",
        "US20050045330A1",
        "US6875728B2",
        "US20050092489A1",
        "US20050137114A1",
        "US20050153846A1",
        "US20060194700A1",
        "US20070011687A1",
        "US20070032693A1",
        "US20070129257A1",
        "US20070131425A1",
        "US20070173413A1",
        "US20070173414A1",
        "US20080039345A1",
        "US7350579B2"
    ],
    "citations_ftf": [
        "US2046381A",
        "US2390153A",
        "BE532101A",
        "US2805958A",
        "US3082402A",
        "US3059909A",
        "US3163219A",
        "US3296597A",
        "US3581072A",
        "US3601808A",
        "US3573747A",
        "US3611314A",
        "US3856921A",
        "US3824375A",
        "US3729712A",
        "FR2224466B1",
        "US3848235A",
        "AR207130A1",
        "US3906455A",
        "CA1056504A",
        "US4412287A",
        "US4044334A",
        "US4300193A",
        "US4298898A",
        "US4314356A",
        "US4314358A",
        "FR2481026B1",
        "US4561985A",
        "US4464718A",
        "US4705113A",
        "US4541935A",
        "US4479041A",
        "US4550436A",
        "US4903201A",
        "US4695389A",
        "US5270922A",
        "US4549608A",
        "US4623021A",
        "US4868866A",
        "US4674044A",
        "US4941178A",
        "US4714115A",
        "US4779680A",
        "US4823306A",
        "US5038284A",
        "US5179626A",
        "US5023910A",
        "JPH0219963A",
        "US5050075A",
        "US4869322A",
        "US4978512B1",
        "CA2007965C",
        "JPH02224060A",
        "US5169411A",
        "JPH03505498A",
        "US5249292A",
        "US5077665A",
        "US5101353A",
        "JPH0314075A",
        "AU620994B2",
        "US5126936A",
        "JPH03179863A",
        "US5163131A",
        "JPH087313Y2",
        "US5074359A",
        "US5243655A",
        "US5319776A",
        "US5313560A",
        "US5497488A",
        "US5140644A",
        "GB9016341D0",
        "US5255136A",
        "DE4027300A1",
        "US5063507A",
        "US5101424A",
        "GB9023096D0",
        "US5258908A",
        "US5615309A",
        "US5339411A",
        "US5297032A",
        "DE69229521T2",
        "US5477451A",
        "US5488725A",
        "US5265065A",
        "US5826075A",
        "US6985883B1",
        "US5375055A",
        "WO1993018505A1",
        "US5388259A",
        "US5259455A",
        "DE69331452T2",
        "US5524268A",
        "US5684980A",
        "US5802290A",
        "GB9220404D0",
        "US5246073A",
        "US6173270B1",
        "US5721898A",
        "US5347004A",
        "EP0664910A1",
        "US6044407A",
        "US5481735A",
        "US5432822A",
        "US5546462A",
        "US5544352A",
        "US6456982B1",
        "JPH0728624A",
        "CA2125513A1",
        "US5500793A",
        "EP0651321B1",
        "US5371794A",
        "US5363919A",
        "US5497317A",
        "US5813000A",
        "JP2986216B2",
        "US5571315A",
        "US5465353A",
        "US5461712A",
        "US5472049A",
        "US5809483A",
        "US5987432A",
        "JPH0822392A",
        "US5465792A",
        "US5623652A",
        "US5884286A",
        "US6263321B1",
        "JP2964879B2",
        "US5980845A",
        "US5688478A",
        "US5462721A",
        "US6768981B2",
        "SE505156C2",
        "CN100452072C",
        "US5619574A",
        "US5551516A",
        "US5833000A",
        "US5633865A",
        "US5819290A",
        "US5845266A",
        "GB2300991B",
        "US5674377A",
        "US5943421A",
        "WO1997010313A1",
        "JPH0981574A",
        "US6134551A",
        "US5701464A",
        "US5774839A",
        "US5807812A",
        "JPH09145544A",
        "US5864738A",
        "US20050267836A1",
        "JPH09269901A",
        "US5669447A",
        "US5713793A",
        "US5806597A",
        "US5781921A",
        "US5712942A",
        "GB2314433A",
        "US6147976A",
        "US5995963A",
        "US5884288A",
        "US6061662A",
        "US6016483A",
        "US6178494B1",
        "US5825879A",
        "US6084584A",
        "US5964295A",
        "JP3696993B2",
        "US5991881A",
        "US5963923A",
        "JP3231673B2",
        "US6330916B1",
        "US6505177B1",
        "DE19651075A1",
        "US5905974A",
        "US6073160A",
        "US5911778A",
        "US6028939A",
        "US6070172A",
        "US5930753A",
        "US5884738A",
        "US5873071A",
        "JPH10326287A",
        "US6236727B1",
        "GB9714102D0",
        "US6067569A",
        "US6317795B1",
        "US5950196A",
        "US6006264A",
        "US6772136B2",
        "US6173276B1",
        "JPH11110320A",
        "US5926775A",
        "US6226680B1",
        "US6591302B2",
        "US7237036B2",
        "US7089326B2",
        "US7167927B2",
        "GB2330585B",
        "GB2330682A",
        "US6442533B1",
        "US6370592B1",
        "US5950006A",
        "US6594643B1",
        "US6138176A",
        "US6412000B1",
        "US6321258B1",
        "US6091263A",
        "US6339819B1",
        "US7424552B2",
        "US7124106B1",
        "US6058391A",
        "US6519686B2",
        "US5987610A",
        "US6304858B1",
        "KR100441171B1",
        "AUPP209498A0",
        "JP4536833B2",
        "US6279113B1",
        "JP4073536B2",
        "US6236980B1",
        "JPH11316765A",
        "US6415269B1",
        "US6397259B1",
        "US6162766A",
        "US6105067A",
        "US6289461B1",
        "US6243753B1",
        "US6272616B1",
        "US6169969B1",
        "US6535868B1",
        "GB9819183D0",
        "US6226676B1",
        "US6317728B1",
        "JP4763866B2",
        "US7181548B2",
        "US6546374B1",
        "WO2000031963A1",
        "US6624761B2",
        "US6195024B1",
        "US6625150B1",
        "US6499107B1",
        "US6279140B1",
        "US6329996B1",
        "US6578147B1",
        "US20050111363A1",
        "US6601104B1",
        "US6604158B1",
        "US6778968B1",
        "US6839686B1",
        "JP3526414B2",
        "US6993504B1",
        "US6278982B1",
        "US6283212B1",
        "AU779731B2",
        "US6597812B1",
        "US6765918B1",
        "US6463474B1",
        "US6418419B1",
        "GB2352548B",
        "US20030093343A1",
        "US6133205A",
        "WO2001022425A1",
        "US6546375B1",
        "US7181424B1",
        "US6581098B1",
        "US7251629B1",
        "US6886103B1",
        "AU1606201A",
        "US6804667B1",
        "US6850906B1",
        "US7356498B2",
        "ATE364866T1",
        "US7103635B2",
        "US20030191876A1",
        "US7181608B2",
        "US6877044B2",
        "US8355525B2",
        "US6772132B1",
        "US7127424B2",
        "US7228289B2",
        "US20030099254A1",
        "US20030093347A1",
        "JP2001268071A",
        "CA2403737C",
        "US7103569B1",
        "US7363277B1",
        "US7099838B1",
        "US7571130B2",
        "US6941280B1",
        "JP2001283000A",
        "US7146007B1",
        "US7139743B2",
        "US6711558B1",
        "US8095508B2",
        "US8799138B2",
        "CA2406418C",
        "WO2001080558A2",
        "US6601094B1",
        "GB2366957A",
        "US7685052B2",
        "US6981054B1",
        "US20020019812A1",
        "US20040064737A1",
        "US7328349B2",
        "US8204082B2",
        "US7032031B2",
        "WO2002001472A1",
        "US7089206B2",
        "US7177833B1",
        "US20030033450A1",
        "US20020100029A1",
        "US20020010825A1",
        "US6820129B1",
        "JP2002108910A",
        "US7417568B2",
        "US8692695B2",
        "US9143546B2",
        "JP2002117232A",
        "US20020069375A1",
        "US20020072893A1",
        "US7065475B1",
        "WO2002061525A2",
        "US6807156B1",
        "US7212998B1",
        "US7178100B2",
        "US7117280B2",
        "WO2002055843A1",
        "US20030033594A1",
        "US20030105620A1",
        "US20030037321A1",
        "US20030046668A1",
        "US20020180742A1",
        "US6691301B2",
        "US20020199173A1",
        "US20030074177A1",
        "US20030023653A1",
        "US20030033588A1",
        "US20020101425A1",
        "US6868265B2",
        "US20030028864A1",
        "US7386046B2",
        "US6847645B1",
        "US20030028408A1",
        "US6528568B2",
        "US20030055769A1",
        "US20030055771A1",
        "US20030033234A1",
        "US20030055770A1",
        "US20030061409A1",
        "US20030055658A1",
        "US20030097481A1",
        "WO2002071227A1",
        "US20020150248A1",
        "JP2002269343A",
        "US7681032B2",
        "US20030035547A1",
        "US20030079060A1",
        "US20030086300A1",
        "US7325249B2",
        "US6785677B1",
        "US6944168B2",
        "US7152151B2",
        "US7558753B2",
        "JP2002352070A",
        "US7702563B2",
        "US7624444B2",
        "US20030009411A1",
        "US7207041B2",
        "US7149715B2",
        "US6928549B2",
        "JP2003036360A",
        "US20030023302A1",
        "US7845004B2",
        "US7587476B2",
        "US6931408B2",
        "US7046848B1",
        "US7499966B2",
        "US7133405B2",
        "US6978223B2",
        "EP1436936A4",
        "US7558967B2",
        "CA2403699C",
        "US20030065943A1",
        "US20030187662A1",
        "US20030184593A1",
        "US7181765B2",
        "EP1444617A4",
        "US7716330B2",
        "AU2002349906A1",
        "US20030140337A1",
        "US20030120460A1",
        "US20030117971A1",
        "US20030121010A1",
        "US6772345B1",
        "US7454603B2",
        "US6765408B2",
        "US7225188B1",
        "JP2003256660A",
        "US7496689B2",
        "US20040111632A1",
        "US20030217306A1",
        "US7249118B2",
        "US8027893B1",
        "US7277887B1",
        "US7093023B2",
        "WO2003100622A1",
        "DE60325966D1",
        "US7167980B2",
        "EP1516272A4",
        "US7660761B2",
        "US7478431B1",
        "US7224185B2",
        "US7711844B2",
        "US20040034587A1",
        "US7953820B2",
        "US6832650B2",
        "US7685121B2",
        "US7761459B1",
        "US8032440B1",
        "US7373432B2",
        "WO2004042562A2",
        "KR101035646B1",
        "US7603303B1",
        "US7769668B2",
        "US6901461B2",
        "US7752117B2",
        "WO2004072797A2",
        "TW591532B",
        "US7440917B2",
        "US7593880B2",
        "US20040186804A1",
        "US7640201B2",
        "US7587510B1",
        "US10572824B2",
        "EP1627331B1",
        "US7058735B2",
        "US20040267657A1",
        "US7788726B2",
        "US7257842B2",
        "US20050033672A1",
        "US7756782B2",
        "US7444515B2",
        "US7222114B1",
        "US7200837B2",
        "US7287037B2",
        "US20050080649A1",
        "US10002385B2",
        "US20050097027A1",
        "US7454418B1",
        "US7191160B2",
        "US7529703B2",
        "US20050216384A1",
        "US7617291B2",
        "US7546327B2",
        "US7496108B2",
        "JP3925932B2",
        "JP4120888B2",
        "US7602785B2",
        "US20050187845A1",
        "US7469228B2",
        "US8219477B2",
        "US8126795B2",
        "US7542932B2",
        "US7630928B2",
        "US7949792B2",
        "US20050197938A1",
        "US7835961B2",
        "US8260764B1",
        "US7711628B2",
        "US7411957B2",
        "US7457834B2",
        "US7966658B2",
        "GB0408876D0",
        "EP1589450A1",
        "US7756033B2",
        "US7971659B2",
        "US20050283743A1",
        "US7305383B1",
        "US7555449B2",
        "US20080162378A1",
        "US8200568B2",
        "US7529707B2",
        "US7577605B2",
        "JP4397761B2",
        "US20060053295A1",
        "US20060047636A1",
        "US7426487B2",
        "WO2006031551A2",
        "US7428508B2",
        "US7430539B2",
        "US7593877B2",
        "US8849711B2",
        "US7509275B2",
        "US20060143099A1",
        "US7461064B2",
        "US20060075404A1",
        "US8321465B2",
        "US7598958B1",
        "EP1820131A2",
        "US20060129745A1",
        "US7788293B2",
        "US7917299B2",
        "US7414975B2",
        "WO2006108158A2",
        "JP4786218B2",
        "US7765183B2",
        "US7801801B2",
        "US20060288028A1",
        "EP1736876A1",
        "US7487327B1",
        "US8130758B2",
        "US20070011183A1",
        "US7933828B2",
        "US8024253B2",
        "US7782873B2",
        "US7587614B1",
        "US8140362B2",
        "US20070061241A1",
        "US8073763B1",
        "US7580719B2",
        "US7945895B2",
        "US7673041B2",
        "US7801910B2",
        "US7702629B2",
        "US7617231B2",
        "US7668849B1",
        "WO2007074903A1",
        "US7954114B2",
        "US20070179935A1",
        "CN101529386B",
        "WO2007109047A2",
        "US8379841B2",
        "US20070244859A1",
        "US7539845B1",
        "US7752123B2",
        "US7636703B2",
        "US20060282369A1",
        "JP5108009B2",
        "US7840482B2",
        "US7921046B2",
        "US7755171B2",
        "US7856546B2",
        "WO2008014494A2",
        "US7609658B2",
        "WO2008022036A2",
        "US7701945B2",
        "US8244718B2",
        "US20080071664A1",
        "US20080077793A1",
        "US7930314B2",
        "US20080084573A1",
        "US20080104542A1",
        "US7660793B2",
        "US8326819B2",
        "US8068114B2",
        "CA2691336A1",
        "WO2009029842A1",
        "JP4180644B1",
        "US10229453B2",
        "US8209707B2",
        "US8374986B2",
        "US8788841B2",
        "JP5871619B2",
        "WO2011043769A1",
        "EP2577936A2",
        "WO2012044700A1",
        "CA2820898C",
        "US8645532B2",
        "US9047243B2",
        "US10650452B2",
        "US9990393B2",
        "US20140180904A1",
        "US11436672B2"
    ],
    "citedby_own": [
        "US20060133834A1",
        "US20070136279A1",
        "US20070300234A1",
        "US20070300233A1",
        "US20070299973A1",
        "US20080010487A1",
        "US20080114938A1",
        "US20080114724A1",
        "US20080141274A1",
        "US20080141272A1",
        "US20080137830A1",
        "US20080140550A1",
        "US20080141276A1",
        "US20080141275A1",
        "US20080244017A1",
        "US20080301061A1",
        "US20090006559A1",
        "US20090024498A1",
        "US20100017321A1",
        "US20100042638A1",
        "WO2010051575A1",
        "US20100128638A1",
        "WO2010077829A1",
        "US20100174664A1",
        "US20100208729A1",
        "US20100280939A1",
        "US20100287294A1",
        "US7840482B2",
        "US20110106686A1",
        "US20110218900A1",
        "US20110225081A1",
        "US20110320335A1",
        "WO2012079041A1",
        "US8285617B1",
        "US20120260045A1",
        "US20120257630A1",
        "US8301545B1",
        "US20120291049A1",
        "US8321325B2",
        "US8326819B2",
        "US8374986B2",
        "US8379841B2",
        "WO2013148693A1",
        "CN103380438A",
        "US20130290295A1",
        "US8601069B1",
        "US8655764B2",
        "US20140101074A1",
        "US20140143115A1",
        "US8751364B2",
        "US8751452B2",
        "US20140180904A1",
        "US8788396B2",
        "US20140324764A1",
        "US8879727B2",
        "US20140359036A1",
        "US20140379549A1",
        "US8935293B2",
        "US20150032590A1",
        "US8959106B2",
        "US8990416B2",
        "US20150095207A1",
        "EP2858024A1",
        "US20150127519A1",
        "US9047249B2",
        "US9047243B2",
        "US9058360B2",
        "WO2015094944A1",
        "US9098587B2",
        "US9110945B2",
        "WO2015184558A1",
        "WO2015184557A1",
        "US9229792B1",
        "EP2936418A4",
        "US9244978B2",
        "US9256646B2",
        "US9262479B2",
        "US9305238B2",
        "US20160104242A1",
        "US9329975B2",
        "US9390135B2",
        "US9418113B2",
        "US9430494B2",
        "US20170053349A1",
        "US9607337B2",
        "US9613378B2",
        "US9633097B2",
        "US9633093B2",
        "US9712645B2",
        "US9886486B2",
        "US9934279B2",
        "US9940360B2",
        "US9972103B2",
        "US9990393B2",
        "US20180181626A1",
        "US10120907B2",
        "US10121196B2",
        "US10146845B2",
        "US10229453B2",
        "US10298444B2",
        "US10439923B1",
        "US10572937B2",
        "US10572824B2",
        "US10650452B2",
        "US10846624B2",
        "US10868707B1",
        "US10880211B2",
        "US10902013B2",
        "EP3639152A4",
        "US10942943B2",
        "US10951695B2",
        "US10956422B2",
        "US11037241B2",
        "US11037243B2",
        "US11062391B2",
        "US11144993B2",
        "US11153208B2",
        "US20220046077A1",
        "US20220044259A1",
        "US11282138B2",
        "US11315182B2",
        "WO2022177975A1",
        "US11436672B2",
        "US11455313B2",
        "EP3970107A4",
        "US11710181B1"
    ],
    "citedby_ftf": [
        "US6711558B1",
        "US7139743B2",
        "US8032439B2",
        "US7917299B2",
        "US7634584B2",
        "US20100017339A1",
        "US9123006B2",
        "US10057333B2",
        "US9979589B2",
        "SG10201704581VA",
        "US9959572B2",
        "US9940670B2",
        "US10002202B2",
        "WO2011150327A2",
        "US8996644B2",
        "US9003053B2",
        "US9258390B2",
        "US10873613B2",
        "US9674318B2",
        "US9600429B2",
        "US20120310882A1",
        "US8763018B2",
        "US8612405B1",
        "US9164751B2",
        "US8660828B2",
        "US10262365B2",
        "US9391840B2",
        "US8788512B2",
        "US20130346274A1",
        "US9391841B2",
        "US9069810B2",
        "US10733669B2",
        "US10270709B2",
        "US10505747B2",
        "US8655760B1",
        "US20140249979A1",
        "US20140279342A1",
        "US10742604B2",
        "US9426124B2",
        "EP2809033B1",
        "US10102575B1",
        "US9258258B2",
        "US10394751B2",
        "US10332206B2",
        "US9691102B2",
        "US10366452B2",
        "US10929926B2",
        "US10692143B2",
        "US11037239B2",
        "US10467693B2",
        "US20150127509A1",
        "WO2015143373A1",
        "CN105564028B",
        "KR101820319B1",
        "US9136938B1",
        "US20160197669A1",
        "CN104599185A",
        "US10198294B2",
        "US10296392B2",
        "US10511478B2",
        "US9792154B2",
        "US10216555B2",
        "AU2016301235B2",
        "US11288739B2",
        "US11164248B2",
        "US10721321B2",
        "US10580100B2",
        "US11514448B1",
        "CA3030763A1",
        "US10417217B2",
        "US10943297B2",
        "US10748210B2",
        "US10326862B2",
        "US10812613B2",
        "US10592313B2",
        "US10579629B2",
        "WO2018177503A1",
        "CN107194811A",
        "US10454833B1",
        "US10313495B1",
        "US11258682B2",
        "CN108021380A",
        "CN108182139B",
        "US10628601B2",
        "US10970184B2",
        "JP6474184B1",
        "US11669914B2",
        "US11544782B2",
        "US11550299B2",
        "WO2019217323A1",
        "US20200104735A1",
        "US10826502B1",
        "US10771069B1",
        "US10698854B1",
        "US11449367B2",
        "MX2021010468A",
        "US11258885B2",
        "US11323372B2",
        "US20210334219A1",
        "US20220058735A1",
        "WO2022101866A1",
        "US20220207604A1",
        "US11425230B2",
        "WO2022165435A1",
        "US20220318906A1",
        "CN113671880A",
        "US11711453B2",
        "WO2023154042A1"
    ]
}