{
    "patent_id": "US-2022036137-A1",
    "title": "Method for detecting anomalies in a data set ",
    "assignee": "Rulex, Inc.",
    "publication_date": "2022-02-03",
    "patent_link": "https://patents.google.com/patent/US20220036137A1/en",
    "inventors": [
        "Marco Muselli",
        "Massimiliano Costacurta",
        "Damiano Verda",
        "Enrico Ferrari"
    ],
    "classifications": [
        "G06F17/18",
        "G06K9/6263",
        "G06F18/2178",
        "G06F18/2155",
        "G06F18/23",
        "G06F18/2415",
        "G06F18/2431",
        "G06K9/6202",
        "G06K9/6218",
        "G06K9/6259",
        "G06K9/6277",
        "G06K9/628",
        "G06N20/00",
        "G06N5/01",
        "G06V10/751",
        "G06N20/10",
        "G06N3/08",
        "G06N5/025"
    ],
    "abstract": "A computer-implemented method and system for detecting anomalies in an unlabeled data set of data records is provided. The method applies a classification method to a training data set obtained from the unlabeled data set to generate a classification model associating a predicted output class to each training data record. The predicted output class is compared with the original output class, in order to detect an anomalous data record in the presence of a discrepancy between the original and the predicted output class. The method may assign a confidence score to the predicted output class by the classification model, wherein the anomalous data record is detected on the basis of a threshold of the confidence score. For example, the classification method may be based on Boolean functions synthesis by a Shadow Clustering algorithm, and the classification model is in the form of a set of conditional rules.",
    "claims": "\n1. A computer-implemented method for detecting anomalies in an unlabeled data set, wherein the unlabeled data set comprises data records of input variables and at least one output variable dependent from one or more input variables, said method comprising:\na. from the unlabeled data set, generating, by a computing device, a training data set comprising training data records and original output classes, wherein:\ni. each training data record is obtained by excluding from a corresponding data record at least the output variable, and\nii. an original output class corresponding to a value of the output variable of the corresponding data record is associated to the training data record;\nb. applying, by the computing device, a classification method to the training data set, to generate a classification model associating a predicted output class to the training data record, wherein the predicted output class is selected from the original output classes associated to the training data records; and\nc. comparing, by the computing device, the original output class and the predicted output class, wherein an anomalous data record is detected in a presence of a discrepancy between the original output class and the predicted output class.\n2. The method of claim 1, further comprising assigning a confidence score to the predicted output class by the classification model, wherein the anomalous data record is detected based on a threshold of the confidence score.\n3. The method of claim 2, wherein the predicted output class is the output class which optimizes a probability score assigned to each output class by the classification model.\n4. The method of claim 3, wherein the confidence score of the predicted output class is assigned based on the probability scores associated to the output classes.\n5. The method of claim 1, further comprising submitting the anomalous data record to a validation step, to generate a corrected data set.\n6. The method of claim 1, wherein the classification model is in a form of a set of conditional rules of input variables.\n7. The method of claim 6, wherein the classification method is based on Boolean functions synthesis, said method comprising:\na. converting the training data records into binary strings of a Boolean space by a coding that preserves ordering and distance;\nb. generating at least one cluster, the cluster comprising binary strings covered by an implicant, wherein the corresponding training data records are associated to the same output class; and\nc. from the implicant, generating a conditional rule.\n8. The method of claim 7, wherein the coding is inverse only-one coding.\n9. The method of claim 7, wherein the implicant is generated by a Shadow Clustering algorithm.\n10. The method of claim 7, further comprising assigning one or more significance parameters to each conditional rule, wherein probability scores are assigned based on the significance parameters of the conditional rules satisfied by the training data record.\n11. The method of claim 7, wherein a validation step of the anomalous data record is performed by or under supervision of a human operator based on the conditional rules verified by the anomalous data record.\n12. The method of claim 1, wherein the input variables are related to at least one category selected from the group comprising names, codes, time values, address components, control parameters, and numeric values.\n13. The method of claim 1, wherein the data records of the unlabeled data set are related to an application selected from the group comprising: auto insurance damage claims, a business process, a medical patient records, a purchase order, and a supply chain management.\n14. The method of claim 1, wherein the method is integrated in a business or operations software application selected from the group comprising: enterprise resource planning (ERP), customer relationship management (CRM), product lifecycle management (PLM), and electronic health records management (EHRM).\n15. An apparatus comprising:\na processor; and\nmemory storing computer-executable instructions that, when executed by the processor, cause the apparatus to:\nfrom an unlabeled data set comprising data records of input variables and at least one output variable dependent from one or more input variables, generate a training data set comprising training data records and original output classes, wherein:\neach training data record is obtained by excluding from a corresponding data record at least the output variable, and\nan original output class corresponding to a value of the output variable of the corresponding data record is associated to the training data record;\napply a classification method to the training data set, to generate a classification model associating a predicted output class to the training data record, wherein the predicted output class is selected from the original output classes associated to the training data records; and\ncompare the original output class and the predicted output class, wherein an anomalous data record is detected in a presence of a discrepancy between the original output class and the predicted output class.\n16. The apparatus of claim 15, wherein the computer-readable instructions, when executed by the processor, further cause the apparatus to:\nassign a confidence score to the predicted output class by the classification model, wherein the anomalous data record is detected based on a threshold of the confidence score.\n17. The apparatus of claim 16, wherein the predicted output class is the output class which optimizes a probability score assigned to each output class by the classification model.\n18. The apparatus of claim 17, wherein the confidence score of the predicted output class is assigned based on the probability scores associated to the output classes.\n19. The apparatus of claim 15, wherein the computer-readable instructions, when executed by the apparatus, cause the apparatus to:\nsubmit the anomalous data record to a validation step, to generate a corrected data set.\n20. The apparatus of claim 15, wherein the classification model is in a form of a set of conditional rules of input variables.",
    "status": "Pending",
    "citations_own": [],
    "citations_ftf": [
        "US7478077B2",
        "US7937345B2",
        "US8055593B2",
        "US8418249B1"
    ],
    "citedby_own": [
        "CN113065574A",
        "CN115276666A",
        "US11507563B2"
    ],
    "citedby_ftf": [
        "IL299717A",
        "DK202070472A1",
        "CN112184241A"
    ]
}