{
    "patent_id": "US-11195057-B2",
    "title": "System and method for extremely efficient image and pattern recognition and artificial intelligence platform ",
    "assignee": "Z Advanced Computing, Inc.",
    "publication_date": "2021-12-07",
    "patent_link": "https://patents.google.com/patent/US11195057B2/en",
    "inventors": [
        "Lotfi A. Zadeh",
        "Saied Tadayon",
        "Bijan Tadayon"
    ],
    "classifications": [
        "G06K9/6264",
        "G06N3/043",
        "G06F16/43",
        "G06F16/953",
        "G06F18/2185",
        "G06N3/0436",
        "G06N3/044",
        "G06N3/047",
        "G06N20/10",
        "G06N3/006",
        "G06N3/045",
        "G06N3/084",
        "G06N7/01"
    ],
    "abstract": "Specification covers new algorithms, methods, and systems for: Artificial Intelligence; the first application of General-AI. (versus Specific, Vertical, or Narrow-AI) (as humans can do) (which also includes Explainable-AI or XAI); addition of reasoning, inference, and cognitive layers/engines to learning module/engine/layer; soft computing; Information Principle; Stratification; Incremental Enlargement Principle; deep-level/detailed recognition, e.g., image recognition (e.g., for action, gesture, emotion, expression, biometrics, fingerprint, tilted or partial-face, OCR, relationship, position, pattern, and object); Big Data analytics; machine learning; crowd-sourcing; classification; clustering; SVM; similarity measures; Enhanced Boltzmann Machines; Enhanced Convolutional Neural Networks; optimization; search engine; ranking; semantic web; context analysis; question-answering system; soft, fuzzy, or un-sharp boundaries/impreciseness/ambiguities/fuzziness in class or set, e.g., for language analysis; Natural Language Processing (NLP); Computing-with-Words (CWW); parsing; machine translation; music, sound, speech, or speaker recognition; video search and analysis (e.g., “intelligent tracking”, with detailed recognition); image annotation; image or color correction; data reliability; Z-Number; Z-Web; Z-Factor; rules engine; playing games; control system; autonomous vehicles or drones; self-diagnosis and self-repair robots; system diagnosis; medical diagnosis/images; genetics; drug discovery; biomedicine; data mining; event prediction; financial forecasting (e.g., for stocks); economics; risk assessment; fraud detection (e.g., for cryptocurrency); e-mail management; database management; indexing and join operation; memory management; data compression; event-centric social network; social behavior; drone/satellite vision/navigation; smart city/home/appliances/IoT; and Image Ad and Referral Networks, for e-commerce, e.g., 3D shoe recognition, from any view angle.",
    "claims": "\n1. A method for image recognition in an image or video recognition platform, with\nexplainability, said method comprising:\nan interface receiving an image;\nsaid interface sending said image to a first analyzer and a second analyzer;\nsaid first analyzer obtaining a first data from said image;\nsaid second analyzer obtaining a second data from said image;\nwherein said first data is a complex hybrid data;\nwherein said first data is different type of data than said second data;\na first processor combining said first data from said first analyzer and said second data from said second analyzer;\na second processor receiving said combined said first data and said second data from said first processor;\nsaid second processor analyzing contradiction and uncertainty in said combined said first data and said second data;\nsaid second processor sending said contradiction and uncertainty-analysis to a cognition layer device;\nsaid cognition layer device communicating with a search engine for images;\nsaid search engine for images communicating with a first database for images;\nsaid search engine for images communicating with a second database for non-images;\nsaid search engine for images receiving said contradiction and uncertainty analysis from said cognition layer device;\nsaid search engine for images receiving said first data and said second data;\nsaid search engine for images searching within said first database for images;\nsaid search engine for images searching within said second database for non-images;\nsaid search engine for images combining said search within said first database for images with said search within said second database for non-images;\nbased on said contradiction and uncertainty analysis and said first data and said second data, said search engine for images obtaining a match for said image;\nsaid search engine for images outputting said match for said image.\n2. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, wherein said image is a still image.\n3. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, wherein said image is a frame of a video.\n4. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, wherein said image is a portion of a frame of a video.\n5. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, wherein said image or video recognition platform is for intelligent tracking of objects.\n6. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, wherein said image or video recognition platform is for intelligent tracking of humans.\n7. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, wherein said image or video recognition platform is on a video camera.\n8. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, wherein said image or video recognition platform is on an autonomous vehicle.\n9. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, wherein said image or video recognition platform is on a drone, airplane, or satellite.\n10. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, wherein said image or video recognition platform is on a boat or submarine vehicle.\n11. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, wherein said image or video recognition platform is at the airport.\n12. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, wherein said image is related to face.\n13. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, wherein said image is related to biometrics.\n14. The method for image recognition in an image or video recognition platform, with exploitability, as recited in claim 1, wherein said image or video recognition platform is a part of a navigation system of a vehicle or drone.\n15. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, wherein said image or video recognition platform is connected to a GPS or coordinate analysis system.\n16. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, wherein said image or video recognition platform is a part of a multi-camera system.\n17. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, said method comprises: communicating with an inference engine.\n18. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, said method comprises: communicating with a logic engine.\n19. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, said method comprises: communicating with an outside knowledge base.\n20. The method for image recognition in an image or video recognition platform, with explainability, as recited in claim 1, said method comprises: combining image, video, voice, sound, numeral, and text data.",
    "status": "Active",
    "citations_own": [
        "US5295228A",
        "US5329611A",
        "US5517596A",
        "US6157921A",
        "US7542947B2",
        "US7689529B2",
        "US7697761B2",
        "US7698236B2",
        "US7711157B2",
        "US7721336B1",
        "US7734451B2",
        "US7734400B2",
        "US7739337B1",
        "US7742103B1",
        "US7761742B2",
        "US7769512B2",
        "US7783580B2",
        "US7784295B2",
        "US7792746B2",
        "US7792750B2",
        "US7797268B2",
        "US7801840B2",
        "US7805397B2",
        "US7805396B2",
        "US7805984B2",
        "US7817854B2",
        "US7836496B2",
        "US7832511B2",
        "US7840500B2",
        "US7844564B2",
        "US7853538B2",
        "US7856356B2",
        "US7857976B2",
        "US7864552B2",
        "US7869989B1",
        "US7895135B2",
        "US7921068B2",
        "US7925874B1",
        "US7929771B2",
        "US7930265B2",
        "US7936906B2",
        "US7934499B2",
        "US7941350B2",
        "US7966061B2",
        "US7974455B2",
        "US7991754B2",
        "US7999857B2",
        "US8004544B1",
        "US8015196B2",
        "US8016319B2",
        "US8023974B1",
        "US8054592B2",
        "US8060456B2",
        "US8063889B2",
        "US8077983B2",
        "US8081844B2",
        "US8095483B2",
        "US8108324B2",
        "US8116534B2",
        "US8150109B2",
        "US8165354B1",
        "US8199242B2",
        "US8199979B2",
        "US8199203B2",
        "US8204310B2",
        "US8208764B2",
        "US8209179B2",
        "US8224042B2",
        "US8224040B2",
        "US8233676B2",
        "US8244040B2",
        "US8249313B2",
        "US8254691B2",
        "US8259168B2",
        "US8265474B2",
        "US8275175B2",
        "US8285006B2",
        "US8289546B2",
        "US8295558B2",
        "US8300900B2",
        "US8300898B2",
        "US8306279B2",
        "US8316436B2",
        "US8320682B2",
        "US8325999B2",
        "US8326001B2",
        "US8332422B2",
        "US8331632B1",
        "US8340366B2",
        "US8352467B1",
        "US8359611B2",
        "US8370352B2",
        "US8374405B2",
        "US8379920B2",
        "US8379940B2",
        "US8379074B2",
        "US8386446B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20200380168A1",
        "US20210081816A1",
        "US11423258B2",
        "US11443759B2",
        "US11461903B2",
        "US20220346681A1",
        "US11627547B1",
        "US11809522B2"
    ],
    "citedby_ftf": [
        "US10812327B2",
        "US11010341B2",
        "US10373019B2",
        "USD824933S1",
        "US10196058B2",
        "US10296788B1",
        "US10261513B2",
        "WO2018150089A1",
        "DE102017111926A1",
        "US11257038B2",
        "GB201719058D0",
        "US10953303B2",
        "US11182985B2",
        "EP3534296A1",
        "EP3769238A4",
        "US11341584B1",
        "US20190351914A1",
        "US11321717B2",
        "JP2019212202A",
        "US10878531B2",
        "WO2020037301A1",
        "US11082369B1",
        "US11429794B2",
        "US10853215B2",
        "RU2720899C2",
        "WO2020056409A1",
        "RU2720952C2",
        "JP7065738B2",
        "WO2020061236A1",
        "RU2725659C2",
        "US10769496B2",
        "US11132900B2",
        "US11301966B2",
        "US10948300B2",
        "US11214268B2",
        "US10825137B2",
        "US10764390B2",
        "US11029972B2",
        "US11338816B2",
        "US11157770B2",
        "US10973472B2",
        "US10991101B2",
        "US11216889B1",
        "US11488049B2",
        "US11170789B2",
        "US10997471B2",
        "EP3963536A4",
        "US11537928B2",
        "EP3736740A1",
        "US11643115B2",
        "US10942619B2",
        "US11093690B1",
        "US11283937B1",
        "US20210055716A1",
        "US11663814B2",
        "CN110780780B",
        "TWI721553B",
        "RU2757406C1",
        "US11003572B2",
        "US11681873B2",
        "US11687635B2",
        "US11436041B2",
        "US11474828B2",
        "US11599384B2",
        "KR102068279B1",
        "US11039205B2",
        "CN113544692A",
        "US11074735B2",
        "US11551474B2",
        "US11429445B2",
        "US11243979B1",
        "CN111062478A",
        "US10997179B1",
        "US10769150B1",
        "US11681708B2",
        "US11403482B2",
        "US11399047B2",
        "US11397764B2",
        "US11443264B2",
        "US20210248458A1",
        "BR112022017094A2",
        "US11714963B2",
        "US20210294800A1",
        "JP7115502B2",
        "JP7265619B2",
        "JP7364512B2",
        "US11645563B2",
        "US11354778B2",
        "US11386302B2",
        "US20210319085A1",
        "US20210329306A1",
        "US11392960B2",
        "US11481785B2",
        "US11386487B2",
        "US10929738B1",
        "KR20230006010A",
        "JP2021177219A",
        "US11681914B2",
        "JP2023527695A",
        "US11403325B2",
        "US11144846B1",
        "GB202007688D0",
        "US20210375492A1",
        "US11545145B2",
        "US20210390563A1",
        "CN111753697A",
        "USD951993S1",
        "USD939570S1",
        "TWI754972B",
        "CN111832636A",
        "US11599746B2",
        "CN111813828A",
        "IL299513A",
        "CN111797777B",
        "CN111798252B",
        "CN111833887A",
        "KR102242666B1",
        "AU2021308727A1",
        "EP3940586A1",
        "US11495014B2",
        "WO2022023988A1",
        "US11533217B2",
        "US11556742B2",
        "CN111914759A",
        "CN112749711B",
        "JP6807621B1",
        "CN112001276A",
        "US11797755B2",
        "US11620350B2",
        "CN112087661B",
        "US11263436B1",
        "US11550824B2",
        "CN112073508B",
        "KR20220032198A",
        "US11762928B2",
        "USD977517S1",
        "US20220092096A1",
        "CN112180898B",
        "US11467895B2",
        "US11568862B2",
        "CN113392639B",
        "CN112130728B",
        "US20220101270A1",
        "CN112016526B",
        "CN112200789A",
        "US11653883B2",
        "CN112463841B",
        "JP2022075139A",
        "CN112364779B",
        "US20220156756A1",
        "CN112308016A",
        "CN112417206B",
        "KR102591829B1",
        "CN112464816A",
        "CN112686093A",
        "CN112527793A",
        "US11354788B1",
        "CN112418722B",
        "CN112527163B",
        "US20220188349A1",
        "KR20230128492A",
        "US11789466B2",
        "US11341698B1",
        "AU2021401816A1",
        "CN112613436B",
        "CN112308173B",
        "CN112686530B",
        "CN112749207B",
        "CN112712119B",
        "CN112861609A",
        "CN112769619B",
        "US11134217B1",
        "CN114140465B",
        "CN112418191B",
        "US11695803B2",
        "CN112783922B",
        "CN113157993A",
        "KR102310588B1",
        "KR102343036B1",
        "KR102310587B1",
        "WO2022187215A1",
        "CN112926480B",
        "CN112988382B",
        "US11562536B2",
        "CN112925920A",
        "WO2022204266A1",
        "CN113065432A",
        "US20220309055A1",
        "CN113020428B",
        "CN113060305B",
        "US20220310069A1",
        "WO2022204485A1",
        "US11521639B1",
        "US11632395B2",
        "CN113032793A",
        "NO20210472A1",
        "US11663389B2",
        "CN113077057B",
        "WO2022221932A1",
        "CN113112489B",
        "CN113094620B",
        "CN113076425B",
        "CN113128613B",
        "US11625446B2",
        "US11675765B2",
        "CN113515644B",
        "CN113254641B",
        "US11645711B2",
        "CN113554022A",
        "CN113344081B",
        "US20220391601A1",
        "US11522747B1",
        "US11768962B2",
        "US11748080B2",
        "US20220405510A1",
        "CN113139626B",
        "US20220405322A1",
        "CN113420067A",
        "CN113259390B",
        "US11354599B1",
        "CN113535813B",
        "CN113343920A",
        "CN113361477A",
        "CN113255842B",
        "CN113449491A",
        "US11281730B1",
        "CN113470099B",
        "CN113723449B",
        "US11763803B1",
        "US20230046386A1",
        "CN113705650B",
        "CN113407859B",
        "WO2023028135A1",
        "CN113449019B",
        "US20230066513A1",
        "CN113723308B",
        "US11587416B1",
        "US11709820B2",
        "CN113793345B",
        "US20230082420A1",
        "CN113962913B",
        "CN113965550B",
        "CN113918682A",
        "US11593415B1",
        "US20230196425A1",
        "US20230206108A1",
        "CN114266321A",
        "CN114005079B",
        "CN114049508B",
        "CN114911387B",
        "US11693720B1",
        "CN114090962B",
        "US20230281257A1",
        "CN114155477B",
        "CN114842524B",
        "WO2023177401A1",
        "CN114926351B",
        "CN114820502B",
        "CN114662413B",
        "CN114692005B",
        "US11791835B1",
        "CN114821751B",
        "CN115072508B",
        "CN114998816B",
        "CN115496076B",
        "CN115545001B",
        "CN116304920B",
        "CN115861715B",
        "CN115904740B",
        "CN115840885B",
        "CN116386108B",
        "CN116579932A",
        "CN116204844B",
        "CN116540316B",
        "CN116628173B"
    ]
}