{
    "patent_id": "US-11423039-B2",
    "title": "Collaborative dataset consolidation via distributed computer networks ",
    "assignee": "data. world, Inc.",
    "publication_date": "2022-08-23",
    "patent_link": "https://patents.google.com/patent/US11423039B2/en",
    "inventors": [
        "Bryon Kristen Jacob",
        "Jon Loyens",
        "David Lee GRIFFITH",
        "Brett A. Hurt",
        "Triet Minh Le",
        "Shad William Reynolds",
        "Arthur Albert Keen",
        "Joseph Boutros",
        "Alexander John Zelenak"
    ],
    "classifications": [
        "G06F16/2471",
        "G06F16/215",
        "G06F16/2465",
        "G06F16/252",
        "G06F16/256",
        "G06F16/258",
        "G06F21/6218",
        "G06N5/022",
        "G06N5/04"
    ],
    "abstract": "Various embodiments relate generally to data science and data analysis, computer software and systems, and wired and wireless network communications to provide an interface between repositories of disparate datasets and computing machine-based entities that seek access to the datasets, and, more specifically, to a computing and data storage platform that facilitates consolidation of one or more datasets, whereby a collaborative data layer and associated logic facilitate, for example, efficient access to, and implementation of, collaborative datasets. In some examples, a method may include receiving data representing a query into a collaborative dataset consolidation system, identifying datasets relevant to the query, generating one or more queries to access disparate data repositories, and retrieving data representing query results. In some cases, one or more queries are applied (e.g., as a federated query) to atomized datasets stored in one or more atomized data stores, at least two of which may be different.",
    "claims": "\n1. A method comprising:\nreceiving a data file including a dataset into a collaborative dataset consolidation system responsive to receiving a user input signal originating a first user interface;\nformatting the dataset to form a first atomized dataset including atomized data points each including data representing at least two objects and an association between the two objects;\nforming a second atomized dataset including the first atomized dataset and one or more other atomized datasets;\nreceiving data representing a federated query into the collaborative dataset consolidation system, the query being associated with an identifier;\nidentifying a subset of the second atomized dataset relevant to the federated query, wherein portions of the second atomized dataset are disposed in different data repositories;\ngenerating results of the federated query by generating one or more sub-queries configured to identify, based on the association, at least a portion of the first atomized dataset and at least another portion of the one or more other atomized datasets, and to retrieve the at least the portion of the first atomized dataset and the at least the another portion of the one or more other atomized datasets, the at least the portion of the first atomized dataset and the at least the another portion of the one or more other atomized datasets being transformed to a format and retrieved from the different data repositories; and\ngenerating data representing a notification that the second atomized dataset is queried.\n2. The method of claim 1 wherein further comprising:\ngenerating a plurality of sub-queries each of which is configured to access at least one of the different data repositories.\n3. The method of claim 2 wherein generating the plurality of sub-queries further comprises:\nreceiving data representing the federated query.\n4. The method of claim 1 wherein further comprising:\nretrieving data representing query results from the at least one of the different data repositories.\n5. The method of claim 1 further comprising transmitted the data representing the notification to a second user interface.\n6. The method of claim 1 further comprising transmitted the data representing the notification to an activity feed portion of a second user interface.\n7. The method of claim 1 wherein generating the plurality of sub-queries comprises: classifying query portions.\n8. The method of claim 7 wherein classifying the query portions comprises:\nidentifying a classification type for a portion of the query.\n9. The method of claim 1 wherein the datasets comprise linked data points.\n10. The method of claim 9 wherein linked data points comprise triples.\n11. The method of claim 10 wherein at least one triple of the triples are formatted to comply with a Resource Description Framework (“RDF”) data model.\n12. A system comprising:\na data store configured to store executable instructions and data; and\na processor configured to execute instructions, the processor being configured to:\nreceive a data file including a dataset into a collaborative dataset consolidation system responsive to receiving a user input signal originating a first user interface;\nformat the dataset to form a first atomized dataset including atomized data points each including data representing at least two objects and an association between the two objects;\nform a second atomized dataset including the first atomized dataset and one or more other atomized datasets;\nreceive data representing a query into the collaborative dataset consolidation system, the query being associated with an identifier;\nidentify a subset of the second atomized dataset relevant to the query, wherein portions of the second atomized dataset are disposed in different data repositories;\ngenerate a plurality of sub-queries each of which is configured to access at least one of the different data repositories, by generating the plurality of sub-queries, each of the plurality of sub-queries being configured to identify, based on the association, at least a portion of the first atomized dataset and at least another portion of the one or more other atomized datasets, and to retrieve the at least the portion of the first atomized dataset and the at least the another portion of the one or more others atomized dataset, the at least the portion of the first atomized dataset and the at least the another portion of the one or more other atomized datasets being transformed to a format and retrieved from the different data repositories; and\nretrieving data representing query results from the at least one of the different data repositories.\n13. The system of claim 12 wherein the processor is further configured to:\ngenerate the query results responsive to a federated query; and\ngenerate data representing a notification that the second atomized dataset is queried.\n14. The system of claim 12 wherein the processor is further configured to:\ntransmit the data representing the notification to a second user interface.\n15. The system of claim 12 wherein the processor is further configured to:\ntransmit the data representing the notification to an activity feed portion of a second user interface.\n16. The system of claim 12 wherein the processor is further configured to:\ngenerate the plurality of sub-queries comprises: classifying query portions.\n17. The system of claim 16 wherein the processor is further configured to:\nclassify the query portions including identifying a classification type for a portion of the query.\n18. The system of claim 12 wherein the datasets comprise linked data points.\n19. The system of claim 18 wherein linked data points comprise triples.\n20. The system of claim 19 wherein at least one triple of the triples are formatted to comply with a Resource Description Framework (“RDF”) data model.",
    "status": "Active",
    "citations_own": [
        "US6144962A",
        "US6317752B1",
        "US20020133476A1",
        "US20020143755A1",
        "US6529909B1",
        "US20030093597A1",
        "US20030120681A1",
        "US20030208506A1",
        "US20040064456A1",
        "US6768986B2",
        "US20050010566A1",
        "US20050010550A1",
        "US20050234957A1",
        "US20050246357A1",
        "US20050278139A1",
        "US20060100995A1",
        "US20060129605A1",
        "US7080090B2",
        "US20060161545A1",
        "US20060168002A1",
        "US20060218024A1",
        "US20060235837A1",
        "US7146375B2",
        "US20070027904A1",
        "US20070139227A1",
        "US20070179760A1",
        "US20070203933A1",
        "US20070271604A1",
        "US20070276875A1",
        "US20080046427A1",
        "US20080091634A1",
        "US20080162999A1",
        "US20080162550A1",
        "US20080216060A1",
        "US20080240566A1",
        "US20080256026A1",
        "US20080294996A1",
        "US20080319829A1",
        "US20090006156A1",
        "US20090013281A1",
        "US20090018996A1",
        "US20090064053A1",
        "US20090106734A1",
        "US20090119254A1",
        "US20090132503A1",
        "US20090132474A1",
        "US20090138437A1",
        "US20090150313A1",
        "US20090157630A1",
        "US20090182710A1",
        "US20090198693A1",
        "US20090234799A1",
        "US20090300054A1",
        "US20100114885A1",
        "US20100138388A1",
        "US7761407B1",
        "US20100235384A1",
        "US20100241644A1",
        "US20100250577A1",
        "US20100250576A1",
        "US20100268722A1",
        "US7836063B2",
        "US7856416B2",
        "US20100332453A1",
        "US7877350B2",
        "US7953695B2",
        "US20110153047A1",
        "US20110202560A1",
        "US8037108B1",
        "US20110298804A1",
        "US8099382B2",
        "US20120016895A1",
        "US20120036162A1",
        "US20120102022A1",
        "US8170981B1",
        "US20120154633A1",
        "US20120179644A1",
        "US20120254192A1",
        "US8296200B2",
        "US20120278902A1",
        "US20120284301A1",
        "US20120310674A1",
        "US20120330908A1",
        "US20120330979A1",
        "US20130031208A1",
        "US20130031364A1",
        "US20130041893A1",
        "US20130054517A1",
        "US8429179B1",
        "US20130110775A1",
        "US20130114645A1",
        "US20130138681A1",
        "US20130156348A1",
        "EP2631817A1",
        "US20130263019A1",
        "US20130262443A1",
        "US8583631B1",
        "US20130321458A1",
        "US20140006448A1",
        "CA2820994A1",
        "US20140115013A1",
        "US20140198097A1",
        "US20140214857A1",
        "US20140229869A1",
        "US20140244623A1",
        "US20140280287A1",
        "US20140279640A1",
        "US8856643B2",
        "US20140337331A1",
        "US20140337436A1",
        "US20140372434A1",
        "US20150052125A1",
        "US20150081666A1",
        "US20150095391A1",
        "US9002860B1",
        "US20150120643A1",
        "US20150142829A1",
        "US20150143248A1",
        "US20150149879A1",
        "US20150186653A1",
        "US20150213109A1",
        "US20150234884A1",
        "US20150242867A1",
        "US20150269223A1",
        "US20150278273A1",
        "US20150356144A1",
        "US20150372915A1",
        "US20150379079A1",
        "US20160055184A1",
        "US20160063271A1",
        "US20160092475A1",
        "US20160092474A1",
        "US20160098418A1",
        "US20160117362A1",
        "US20160132572A1",
        "US20160147837A1",
        "US20160203196A1",
        "US20160232457A1",
        "US20160283551A1",
        "US20160292206A1",
        "US20160314143A1",
        "US20160322082A1",
        "US20160321316A1",
        "US20160371288A1",
        "US20160371355A1",
        "US20170017537A1",
        "US9560026B1",
        "US20170053130A1",
        "US9613152B2",
        "US20170132401A1",
        "US20170161323A1",
        "US20170161341A1",
        "US20170177729A1",
        "US9710526B2",
        "US20170220615A1",
        "US20170228405A1",
        "US20170236060A1",
        "WO2017190153A1",
        "US20170357653A1",
        "US20170364694A1",
        "US20170364569A1",
        "US20170364564A1",
        "US20170364539A1",
        "US20170364703A1",
        "US20170364568A1",
        "US20170364553A1",
        "US20170364570A1",
        "US20170364538A1",
        "WO2017222927A1",
        "US20170371926A1",
        "US20170371881A1",
        "US20180025307A1",
        "US20180032327A1",
        "US20180210936A1",
        "WO2018156551A1",
        "WO2018164971A1",
        "US20180262864A1",
        "US20180300494A1",
        "US20180314705A1",
        "US20180330111A1",
        "US20190005104A1",
        "US10176234B2",
        "US20190034491A1",
        "US20190042606A1",
        "US20190050459A1",
        "US20190050445A1",
        "US20190065569A1",
        "US20190066052A1",
        "US20190065567A1",
        "US20190079968A1",
        "US20190095472A1",
        "US10248297B2",
        "US20190121807A1",
        "US20190266155A1",
        "US20190295296A1",
        "US20190317961A1",
        "US20190332606A1",
        "US20190347347A1",
        "US20190347268A1",
        "US10545986B2",
        "US10546001B1",
        "US20200073865A1",
        "US20200097504A1",
        "US10664509B1",
        "US10673887B2",
        "US10691299B2",
        "US20200201854A1",
        "US10769535B2",
        "US20210397589A1",
        "US20210397626A1"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "US9396283B2",
        "US11068847B2",
        "US11016931B2",
        "US10853376B2",
        "US11042537B2",
        "US11042556B2",
        "US10452677B2",
        "US11068475B2",
        "US10438013B2",
        "US11023104B2",
        "US11334625B2",
        "US10353911B2",
        "US11036716B2",
        "US11042548B2",
        "US10452975B2",
        "US10346429B2",
        "US11042560B2",
        "US11468049B2",
        "US11086896B2",
        "US10747774B2",
        "US10645548B2",
        "US11675808B2",
        "US11755602B2",
        "US11036697B2",
        "US10984008B2",
        "US10324925B2",
        "US10824637B2",
        "US11068453B2",
        "US11238109B2",
        "US10922308B2",
        "US11243960B2",
        "US11537990B2",
        "USD940732S1",
        "USD940169S1",
        "USD920353S1",
        "US11327991B2",
        "US11442988B2",
        "US11074260B2",
        "GB201818997D0",
        "US10423662B1",
        "US20210117436A1"
    ]
}