{
    "patent_link": "https://patents.google.com/patent/US5999882A/en",
    "patent_id": "US5999882A",
    "title": "Method and system of providing weather information along a travel route",
    "abstract": "A system (10) for providing weather information along a travel route may comprise a client system (14) and a server system (12). The client system (14) may receive and upload the travel route to the server system (12). The server system (12) may automatically retrieve weather data (74) associated with the travel route and use data to automatically generate a visualization (76) of weather along the travel route. The server system (12) may download the weather data (74) and visualizations (76) to the client system (14) for display.",
    "inventors": [
        "Danny L. Simpson",
        "Thomas F. Tascione",
        "Rick P. Reagan",
        "David M. Ben-Yaacov"
    ],
    "assignee": "CA Inc",
    "classifications": [],
    "claims": "\n1. A method of providing weather information along a travel route, comprising the steps of:\nreceiving a travel route;\nautomatically retrieving weather data associated with the travel route; and\nautomatically generating a dynamic simulation of weather along the travel route using the weather data.\n2. The method of claim 1, further comprising the steps of:\ngenerating a plurality of route points along the travel route;\nautomatically retrieving weather data associated with each route point; and\nautomatically generating a dynamic simulation of weather for each route point using the weather data associated with that route point.\n3. The method of claim 1, further comprising the step of downloading the dynamic simulation over a network to a client system.\n4. The method of claim 3, wherein the network is the Internet.\n5. The method of claim 1, further comprising the steps of:\ncompressing the dynamic simulation; and\ndownloading the compressed dynamic simulation over a network to a client system.\n6. The method of claim 3, further comprising the step of displaying the dynamic simulation on the client system.\n7. The method of claim 1, further comprising the step of downloading the weather data and dynamic simulation over a network to a client system.\n8. The method of claim 7, wherein the network is the Internet.\n9. The method of claim 1, further comprising the steps of:\ncompressing the weather data and dynamic simulation; and\ndownloading the compressed weather data and dynamic simulation over a network to a client system.\n10. The method of claim 1, the step of receiving the travel route further comprising the steps of:\nreceiving the travel route at a client system; and\nuploading the travel route over a network to a server system.\n11. The method of claim 10, wherein the network is the Internet.\n12. The method of claim 1, the step of receiving the travel route further comprising the steps of:\nreceiving a departure point at a client system;\nretrieving information associated with the departure point at the client system;\nreceiving a destination point at the client system; and\nretrieving information associated with the destination point at the client system.\n13. The method of claim 1, the step of receiving the travel route further comprising the steps of:\nreceiving a departure point; and\nreceiving a destination point.\n14. The method of claim 1, the step of receiving the travel route further comprising the steps of:\nreceiving a departure point;\nreceiving a destination point; and\nreceiving a way point between the departure point and the destination point.\n15. The method of claim 1, the step of receiving the travel route further comprising the steps of:\ngraphically displaying a map having a plurality of interactive travel points;\nreceiving a selection of a first travel point of the map; and\nreceiving a selection of a second travel point of the map.\n16. The method of claim 1, the step of receiving the travel route further comprising the steps of:\ngraphically displaying a map having a plurality of interactive travel points;\nreceiving a selection of a first travel point of the map;\nreceiving a selection of a second travel point of the map; and\nreceiving a way point between the first travel point and the second travel point.\n17. The method of claim 1, wherein the travel route is a flight path, the step of receiving a travel route further comprising the steps of:\nreceiving a departure airport; and\nreceiving a destination airport.\n18. The method of claim 1, wherein the travel route is a flight path, further comprising:\nthe step of receiving a travel route further comprising the steps of:\nreceiving a departure airport;\nreceiving a destination airport;\nreceiving a flight altitude; and\nthe step of automatically generating a dynamic simulation of weather along the travel route comprising generating the dynamic simulation of weather at the flight altitude.\n19. The method of claim 1, the step of automatically retrieving weather data associated with the travel route further comprising the step of automatically retrieving alpha-numeric weather data associated with the travel route.\n20. The method of claim 1, the step of automatically retrieving weather data associated with the travel route further comprising the step of automatically retrieving satellite imagery associated with the travel route.\n21. The method of claim 20, wherein the satellite imagery comprises visual satellite imagery.\n22. The method of claim 20, wherein the satellite imagery comprises infrared satellite imagery.\n23. The method of claim 1, the step of automatically retrieving weather data associated with the travel route further comprising the step of automatically retrieving radar imagery associated with the travel route.\n24. The method of claim 23, wherein the radar imagery comprises at least one local radar imagery.\n25. The method of claim 23, wherein the radar imagery comprises composite radar imagery.\n26. The method of claim 1, the step of automatically retrieving weather data associated with the travel route further comprising the step of retrieving weather observation data associated with the travel route.\n27. The method of claim 1, the step of automatically generating the dynamic simulation along the travel route using the weather data further comprising the step of generating a dynamic fly-through using the weather data.\n28. The method of claim 1, the step of automatically generating the dynamic simulation along the travel route using the weather data comprising the step of generating a dynamic two-dimensional (2D) fly-through using the weather data.\n29. The method of claim 1, the step of automatically generating the dynamic simulation along the travel route using the weather data comprising the step of generating a dynamic three-dimensional (3D) fly-through using the weather data.\n30. The method of claim 1, further comprising the steps of:\nreceiving a request for expert information; and\nestablishing an audio link with an expert station.\n31. The method of claim 1, further comprising the steps of:\nreceiving from a client system a request for expert information concerning a displayed weather hazard;\nestablishing an audio link between the client system and an expert station; and\nuploading the displayed weather hazard to the expert station.\n32. A server system for providing weather information along a travel route, comprising:\na server browser operable to receive a travel route over a network;\na display engine operable to automatically retrieve weather data associated with the travel route; and\na rendering engine operable to automatically generate a dynamic simulation of weather along the travel route using the weather data.\n33. The server system of claim 32, further comprising:\nthe display engine operable to generate a plurality of route points along the travel route;\nthe display engine operable to automatically retrieve weather data associated with each route point; and\nthe rendering engine operable to automatically generate a dynamic simulation of weather for each route point using the weather data associated with that route point.\n34. The server system of claim 32, further comprising:\nthe server browser operable to download the weather data over the network to a client system; and\nthe server browser operable to download the dynamic simulation over the network to the client system.\n35. The server system of claim 32, the network further comprising the Internet.\n36. The server system of claim 32, further comprising:\nthe display engine operable to compress the weather data; and\nthe display engine operable to compress the dynamic simulation.\n37. The server system of claim 32, wherein the weather data comprises alpha-numeric weather data associated with the travel route.\n38. The server system of claim 32, wherein the weather data comprises satellite imagery associated with the travel route.\n39. The server system of claim 32, wherein the weather data comprises radar imagery associated with the travel route.\n40. The server system of claim 32, wherein the weather data comprises weather observation data associated with the travel route.\n41. The server system of claim 32, wherein the dynamic simulation comprises a dynamic fly-through.\n42. The server system of claim 32, wherein the dynamic simulation comprises a dynamic two-dimensional (2D) fly-through.\n43. The server system of claim 32, wherein the dynamic simulation comprises a dynamic three-dimensional (3D) fly-through.\n44. The server system of claim 32, further comprising an expert station operable to be connected to a client system via the server system.\n45. A system for providing weather information along a travel route, comprising:\na client system operable to receive a travel route;\nthe client system operable to upload the travel route over a network to a server system, comprising:\na display engine operable to automatically retrieve weather data associated with the travel route;\na rendering engine operable to automatically generate a dynamic simulation of weather data along the travel route using the weather data; and\na server application operable to download the weather data and dynamic simulation over the network to the client system.\n46. The system of claim 45, further comprising:\nthe client system operable to display the weather data; and\nthe client system operable to display the dynamic simulation.\n47. The system of claim 45, the client system further comprising a browser to upload the travel route over the network to the server system.\n48. The system of claim 46, the client system further comprising a viewer to display the dynamic simulation.\n49. The system of claim 45, the client system further comprising an interface to receive the travel route.\n50. The system of claim 49, further comprising:\nthe interface operable to receive a departure point;\nthe interface operable to retrieve information associated with the departure point;\nthe interface operable to receive a destination point;\nthe client system operable to retrieve information associated with the destination point;\nthe client system operable to store the departure and destination points and associated information as a travel route; and\nthe client system operable to upload the travel route over the network to the server system.\n51. The system of claim 49, further comprising:\nthe interface operable to receive a departure point; and\nthe interface operable to receive a destination point.\n52. The system of claim 49, further comprising:\nthe interface operable to receive a departure point;\nthe interface operable to receive a destination point; and\nthe interface operable to receive a way point between the departure point and the destination point.\n53. The system of claim 49, further comprising:\nthe interface comprising a map displaying a plurality of interactive travel points;\nthe map operable to receive a selection of a first travel point of the map; and\nthe map operable to receive a selection of a second travel point of the map.\n54. The system of claim 49, further comprising:\nthe interface comprising a map displaying a plurality of interactive travel points;\nthe map operable to receive a selection of a first travel point of the map;\nthe map operable to receive a selection of a second travel point of the map; and\nthe map operable to receive a way point between the first travel point and the second travel point.\n55. The system of claim 49, wherein the travel route is a flight path, further comprising:\nthe interface operable to receive a departure airport; and\nthe interface operable to receive a destination airport.\n56. The system of claim 49, wherein the travel route is a flight path, further comprising:\nthe interface operable to receive a departure airport;\nthe interface operable to receive a destination airport;\nthe interface operable to receive a flight altitude; and\nautomatically generating the dynamic simulation of weather at the flight altitude.\n57. The system of claim 45, wherein the weather data comprises alpha-numeric weather data associated with the travel route.\n58. The system of claim 46, wherein the weather data comprises satellite imagery associated with the travel route.\n59. The system of claim 45, wherein the weather data comprises radar imagery associated with the travel route.\n60. The system of claim 45, wherein the weather data comprises weather observation data associated with the travel route.\n61. The system of claim 45, wherein the dynamic simulation comprises a dynamic fly-through.\n62. The system of claim 45, wherein the dynamic simulation comprises a dynamic two-dimensional (2D) fly-through.\n63. The system of claim 45, wherein the dynamic simulation comprises a dynamic three-dimensional (3D) fly-through.\n64. The system of claim 45, further comprising an expert station operable to be connected to the client system via the server system.\n65. A method of providing weather information for a location, comprising the steps of:\nreceiving a location;\nautomatically retrieving weather data associated with the location; and\nautomatically generating a dynamic simulation of weather at the location using the weather data.\n66. The method of claim 65, further comprising the steps of:\ngenerating at least one point for the location;\nautomatically retrieving weather data associated with each point; and\nautomatically generating a dynamic simulation of weather for each point using the weather data associated with that point.\n67. The method of claim 65, further comprising the step of downloading the weather data and dynamic simulation over a network to a client system.\n68. The method of claim 67, wherein the client system comprises an interactive TV.\n69. The method of claim 65, further comprising the steps of:\ncompressing the weather data and dynamic simulation; and\ndownloading the compressed weather data and dynamic simulation over a network to a client system.\n70. The method of claim 65, the step of receiving the location further comprising the steps of:\nreceiving the location at a client system; and\nuploading the location over a network to a server system.\n71. The method of claim 65, the step of receiving the location further comprising the steps of:\ngraphically displaying a map having a plurality of interactive points; and\nreceiving a selection of a point of the map.\n72. The method of claim 65, further comprising the steps of:\nreceiving a request for expert information; and\nestablishing an audio link with an expert station.\n73. The method of claim 65, further comprising the steps of:\nreceiving from a client system a request for expert information concerning a displayed weather hazard;\nestablishing an audio link between the client system and an expert station; and\nuploading the displayed weather hazard to the expert station.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4521857A",
        "US5220507A",
        "US5379215A",
        "US5568385A",
        "US5598359A",
        "US5648768A",
        "US5802526A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "WO2000042521A1",
        "US6104392A",
        "US6154143A",
        "US6208307B1",
        "US6209026B1",
        "US6269309B1",
        "US6289277B1",
        "US6317686B1",
        "US6339747B1",
        "WO2002023462A1",
        "US6381538B1",
        "US6397163B1",
        "US20020069020A1",
        "US6498987B1",
        "US20030004817A1",
        "US20030036844A1",
        "DE10139668A1",
        "US20030050757A1",
        "WO2003041032A1",
        "US6590529B2",
        "US6619555B2",
        "US20030192052A1",
        "US20030200546A1",
        "US20030200547A1",
        "US6650972B1",
        "US6654689B1",
        "US20030229897A1",
        "US20030233658A1",
        "US6711617B1",
        "US20040078821A1",
        "US20040098175A1",
        "US20040102895A1",
        "US6748597B1",
        "US6751801B1",
        "US6789739B2",
        "US20040218910A1",
        "US20040218895A1",
        "US20040244476A1",
        "US6832153B2",
        "US20050001743A1",
        "US6842737B1",
        "US20050055308A1",
        "US20050102104A1",
        "US6925606B2",
        "US20050187704A1",
        "US20060031006A1",
        "US7027898B1",
        "US7031927B1",
        "US7039505B1",
        "US20060142944A1",
        "US20060158330A1",
        "WO2006083966A2",
        "US20060209090A1",
        "US20070027616A1",
        "US7184965B2",
        "US20070100515A1",
        "US20070153752A1",
        "US20070155416A1",
        "US20070162328A1",
        "US7250945B1",
        "US20070192159A1",
        "US7260094B1",
        "US7268703B1",
        "US7289904B2",
        "US20070280229A1",
        "US7319931B2",
        "US7366606B2",
        "US7386392B1",
        "US20080140288A1",
        "US20080167885A1",
        "DE102007016978A1",
        "US7451042B2",
        "US7463955B1",
        "US7471995B1",
        "US7518530B2",
        "US20090112377A1",
        "US7546206B1",
        "US7562049B2",
        "US20090197685A1",
        "US7643788B2",
        "US7668653B2",
        "US7680594B2",
        "US20100109861A1",
        "US7752106B1",
        "US20100229101A1",
        "US7818380B2",
        "US7818121B2",
        "US7844517B2",
        "US7849149B2",
        "US20100324958A1",
        "US7885599B2",
        "EP2290636A1",
        "US20110050458A1",
        "US7908080B2",
        "US20110102637A1",
        "US20110102192A1",
        "US7949330B2",
        "US8024111B1",
        "EP2372671A1",
        "US8041779B2",
        "US8046162B2",
        "US8099308B2",
        "US8131407B1",
        "US8135500B1",
        "US8229467B2",
        "US8600588B2",
        "US8606517B1",
        "US20130332890A1",
        "US8619072B2",
        "US8634814B2",
        "US8660780B2",
        "US20140100779A1",
        "US8718910B2",
        "US8725396B2",
        "US20140163772A1",
        "US20140188311A1",
        "US8781718B2",
        "US8909679B2",
        "US8982116B2",
        "US20150123837A1",
        "US9046924B2",
        "US20150379875A1",
        "US9406238B2",
        "US10026324B2",
        "US10223909B2",
        "US10473781B2",
        "US20200334995A1",
        "US11144868B1",
        "CN113947952A",
        "US11225144B2",
        "US11254211B2"
    ],
    "citedby_ftf": []
}