{
    "patent_id": "US-11714291-B2",
    "title": "Virtual and augmented reality systems and methods ",
    "assignee": "Magic Leap, Inc.",
    "publication_date": "2023-08-01",
    "patent_link": "https://patents.google.com/patent/US11714291B2/en",
    "inventors": [
        "Brian T. Schowengerdt"
    ],
    "classifications": [
        "G02B27/4205",
        "G02B17/08",
        "G02B26/0808",
        "G02B27/0087",
        "G02B27/0093",
        "G02B27/01",
        "G02B27/017",
        "G02B27/0172",
        "G02B27/0176",
        "G02B3/0006",
        "G02B3/0037",
        "G02B30/24",
        "G02B30/34",
        "G02B5/005",
        "G02B5/1814",
        "G02B5/1828",
        "G02B5/20",
        "G02B6/00",
        "G02B6/02042",
        "G02B6/06",
        "G02B6/32",
        "G02B6/34",
        "G02B6/40",
        "G02C7/049",
        "G02C7/104",
        "G02F1/0105",
        "G02F1/1334",
        "G02F1/17",
        "G02F1/29",
        "G02F1/292",
        "G02F1/31",
        "G06F3/011",
        "G06F3/012",
        "G06F3/013",
        "G06F3/017",
        "G06F3/1423",
        "G06T13/40",
        "G06T15/00",
        "G06T15/10",
        "G06T15/506",
        "G06T17/10",
        "G06T19/003",
        "G06T19/006",
        "G06T19/20",
        "G06T5/002",
        "G06T5/003",
        "G06T5/50",
        "G06T7/50",
        "G06T7/73",
        "G06V10/42",
        "G06V40/193",
        "G09G5/003",
        "G09G5/02",
        "G09G5/10",
        "G09G5/18",
        "H04N13/117",
        "H04N13/239",
        "H04N13/286",
        "H04N13/327",
        "H04N13/332",
        "H04N13/341",
        "H04N13/344",
        "H04N13/361",
        "H04N13/363",
        "H04N13/366",
        "H04N13/383",
        "H04N23/00",
        "H04N5/21",
        "H04N5/74",
        "G02B2006/0098",
        "G02B2027/0118",
        "G02B2027/0123",
        "G02B2027/0125",
        "G02B2027/0134",
        "G02B2027/0138",
        "G02B2027/014",
        "G02B2027/0163",
        "G02B2027/0178",
        "G02B2027/0187",
        "G02C2202/16",
        "G02F1/294",
        "G06T2207/10021",
        "G06T2207/30201",
        "G06T2213/08",
        "H04N2013/0085"
    ],
    "abstract": "A method for displaying virtual content to a user, the method includes determining an accommodation of the user's eyes. The method also includes delivering, through a first waveguide of a stack of waveguides, light rays having a first wavefront curvature based at least in part on the determined accommodation, wherein the first wavefront curvature corresponds to a focal distance of the determined accommodation. The method further includes delivering, through a second waveguide of the stack of waveguides, light rays having a second wavefront curvature, the second wavefront curvature associated with a predetermined margin of the focal distance of the determined accommodation.",
    "claims": "\n1. A system for displaying virtual content to a user, comprising:\na display system to deliver light associated with one or more frames of image data, wherein the light corresponds to a plurality of pixels, wherein the display system scans the light with variable line pitch;\na blurring module to variably blur one or more pixels of the plurality of pixels to modify a size of the one or more pixels; and\na processor to control the blurring module such that the size of the one or more pixels is modified based at least in part on a line pitch of the display system.\n2. The system of claim 1 wherein the display system is a fiber scanning system.\n3. The system of claim 1, wherein the size of the one or more pixels is enlarged.\n4. The system of claim 1, wherein the size of the one or more pixels is reduced.\n5. The system of claim 1, wherein the line pitch is sparse.\n6. The system of claim 1, wherein the line pitch is dense.\n7. The system of claim 1, further comprising an accommodation tracking module to track an accommodation of the user's eyes.\n8. The system of claim 7, wherein the blurring module variably blurs the one or more pixels based at least in part on the tracked accommodation.\n9. The system of claim 8, wherein blurring the one or more pixels simulates a dioptric blur.\n10. The system of claim 8, wherein blurring the one or more pixels provides feedback corresponding to the tracked accommodation.\n11. A method for displaying virtual content to a user, comprising:\nprojecting light associated with one or more frames of image data with a display system, wherein the light corresponds to a plurality of pixels, and wherein the light is scanned with variable line pitch; and\nvariably blurring one or more pixels of the plurality of pixels with a blurring module to modify a size of the one or more pixels; and\nmodifying the size of the one or more pixels based at least in part on a line pitch of the display system by controlling the blurring module with a processor.\n12. The method of claim 11 wherein the display system is a fiber scanning system.\n13. The method of claim 11, wherein modifying the size of the one or more pixels comprises enlarging the size of the one or more pixels.\n14. The method of claim 11, wherein modifying the size of the one or more pixels comprises reducing the size of the one or more pixels.\n15. The method of claim 11, wherein the line pitch is sparse.\n16. The method of claim 11, wherein the line pitch is dense.\n17. The method of claim 11, further comprising tracking an accommodation of the user's eyes with an accommodation tracking module.\n18. The method of claim 17, further comprising variably blurring the one or more pixels based at least in part on the tracked accommodation with the blurring module.\n19. The method of claim 18, further comprising simulating a dioptric blur by blurring the one or more pixels.\n20. The method of claim 18, further comprising providing feedback corresponding to the tracked accommodation by blurring the one or more pixels."
}