{
    "patent_id": "US-11406443-B2",
    "title": "Articulation joint features for articulating surgical device ",
    "assignee": "Cilag Gmbh International",
    "publication_date": "2022-08-09",
    "patent_link": "https://patents.google.com/patent/US11406443B2/en",
    "inventors": [
        "Barry C. Worrell",
        "David K. Norvell",
        "Charles J. Scheib",
        "Frederick E. Shelton, IV",
        "Geoffrey S. Strobl",
        "Jeffrey S. Swayze",
        "Gregory A. Trees",
        "Jason E. Zerkle",
        "Kevin M. Montgomery"
    ],
    "classifications": [
        "A61B18/12",
        "A61B18/1445",
        "A61B18/1447",
        "A61B17/295",
        "A61B18/14",
        "A61B2017/00314",
        "A61B2018/00601",
        "A61B2018/0063",
        "A61B2018/126",
        "A61B2018/1455"
    ],
    "abstract": "An electrosurgical device comprises a body, an end effector, a cutting member, and a shaft. The end effector includes a pair of jaws that are operable to deliver RF energy to tissue that is clamped between the jaws. The cutting member is operable to sever tissue that is clamped between the jaws. The shaft extends between the body and the end effector. The shaft includes an articulation section that is operable to selectively position the end effector at non-parallel positions relative to the longitudinal axis of the shaft. Some versions include a rotation section that is distal to the articulation section. The rotation section is operable to rotate the end effector relative to the articulation section.",
    "claims": "\n1. An apparatus comprising:\n(a) a body;\n(b) an end effector comprising:\n(i) a first jaw, and\n(ii) a second jaw, wherein the first and second jaws are operable to clamp tissue therebetween; and\n(c) a shaft assembly extending between the body and the end effector, wherein the shaft assembly comprises:\n(i) a proximal shaft portion defining a longitudinal axis, and\n(ii) an articulation section extending between the proximal shaft portion and the end effector, wherein the articulation section is operable to provide lateral deflection of the end effector relative to the longitudinal axis, wherein the articulation section comprises:\n(A) a proximal section end coupled to the proximal shaft portion,\n(B) a distal section end coupled to the end effector, and\n(C) a flexible feature extending between the proximal and distal section ends, wherein a dimension of the flexible feature decreases distally such that the flexible feature is configured to enable a distal end of the articulation section to deflect laterally in response to a lesser input force than a proximal end of the articulation section.\n2. The apparatus of claim 1, wherein the flexible feature comprises a spine.\n3. The apparatus of claim 2, wherein the spine extends continuously from the proximal section end to the distal section end.\n4. The apparatus of claim 2, wherein the spine has a width in a direction transverse to the longitudinal axis, wherein the width decreases distally.\n5. The apparatus of claim 1, wherein a proximal end of the flexible feature has a first width and a distal end of the flexible feature has a different second width.\n6. The apparatus of claim 5, wherein the second width is lesser than the first width.\n7. The apparatus of claim 6, wherein the first width tapers in a distal direction to the second width.\n8. The apparatus of claim 1, wherein the articulation section further includes a plurality of ribs spaced apart axially along the flexible feature.\n9. The apparatus of claim 1, wherein the articulation section further comprises an integrally formed first longitudinal portion that defines a first lateral side of the articulation section, and an integrally formed second longitudinal portion that defines a second lateral side of the articulation section, wherein the first and second longitudinal portions are configured to mate from opposing sides of the longitudinal axis and thereby cooperate to define the articulation section.\n10. The apparatus of claim 9, wherein the first longitudinal portion includes a first coupling feature, wherein the second longitudinal portion includes a second coupling feature configured to couple with the first coupling feature.\n11. The apparatus of claim 9, wherein the first longitudinal portion includes a first plurality of ribs, wherein the second longitudinal portion includes a second plurality of ribs.\n12. The apparatus of claim 1, wherein the articulation section further includes a plurality of channels extending longitudinally therethrough.\n13. The apparatus of claim 1, further comprising a cutting member operable to cut tissue clamped between the first and second jaws.\n14. The apparatus of claim 13, further comprising a translating member, wherein the cutting member is coupled to the translating member, wherein the articulation section further comprises a first channel extending longitudinally between the proximal and distal section ends, wherein the first channel is configured to slidably receive the translating member.\n15. The apparatus of claim 14, further comprising an elongate articulation drive member coupled to the end effector and configured to drive movement of the articulation section, wherein the articulation section further comprises a second channel extending longitudinally between the proximal and distal section ends, wherein the second channel is configured to slidably receive the elongate articulation drive member.\n16. An apparatus comprising:\n(a) a body;\n(b) an end effector comprising:\n(i) a first jaw, and\n(ii) a second jaw, wherein the first and second jaws are operable to clamp tissue therebetween; and\n(c) a shaft assembly extending between the body and the end effector, wherein the shaft assembly comprises:\n(i) a proximal shaft portion defining a longitudinal axis, and\n(ii) an articulation section extending between the proximal shaft portion and the end effector, wherein the articulation section is operable to provide lateral deflection of the end effector relative to the longitudinal axis, wherein the articulation section comprises:\n(A) a proximal section end coupled to the proximal shaft portion,\n(B) a distal section end coupled to the end effector, and\n(C) a flexible feature extending continuously from the proximal section end to the distal section end wherein the flexible feature has a first width at the proximal section end and a different second width at the distal section end.\n17. The apparatus of claim 16, wherein the second width is lesser than the first width.\n18. The apparatus of claim 17, wherein the flexible feature comprises a spine that tapers from the first width to the second width.\n19. An apparatus comprising:\n(a) a body;\n(b) an end effector comprising:\n(i) a first jaw having a first electrode, and\n(ii) a second jaw having a second electrode, wherein the first and second jaws are operable to clamp tissue therebetween and apply bipolar RF energy to the clamped tissue with the first and second electrodes; and\n(c) a shaft assembly extending between the body and the end effector, wherein the shaft assembly comprises:\n(i) a proximal shaft portion defining a longitudinal axis, and\n(ii) an articulation section extending between the proximal shaft portion and the end effector, wherein the articulation section is operable to provide lateral deflection of the end effector relative to the longitudinal axis, wherein the articulation section comprises:\n(A) a proximal section end coupled to the proximal shaft portion,\n(B) a distal section end coupled to the end effector, and\n(C) a flexible spine extending between the proximal and distal section ends, wherein the flexible spine has a dimension that decreases distally.\n20. The apparatus of claim 19, wherein the flexible spine extends continuously from the proximal section end to the distal section end."
}