{
    "patent_link": "https://patents.google.com/patent/US5809522A/en",
    "patent_id": "US5809522A",
    "title": "Microprocessor system with process identification tag entries to reduce cache flushing after a context switch",
    "abstract": "An x86 microprocessor system with a process identification system which stores a number assigned to each process run by the microprocessor system and associates this number with instructions, data, and information fetched and stored in a cache or translation lookaside buffer (TLB) during the execution of the process. Upon a process or context switch, the instructions, data, and information are not automatically flushed from the cache and TLB. The instructions, data, and information are replaced only when instructions, data, and information for a new process require the same cache memory locations or the same TLB memory location. The cache and TLB may include a valid bit block and a tag block that includes memory locations for storing the pertinent process identification number for each entry. The cache, which may be a set associative cache, and TLB include logic for comparing a process identification number stored in a process identification register with the process identification number stored in the tag block.",
    "inventors": [
        "Steve Novak",
        "Hong-Yi Chen"
    ],
    "assignee": "Lattice Semiconductor Corp",
    "classifications": [
        "G06F12/1036",
        "G06F12/0842",
        "G06F12/0864"
    ],
    "claims": "\n1. An x86 microprocessor system having a microprocessor, a main memory, and a process identification system, wherein the microprocessor system executes instructions contained in one or more processes, wherein the microprocessor system comprises:\na microprocessor;\na cache memory system comprising:\na first address register for receiving a series of addresses from the microprocessor;\na first process identification register for receiving and storing a process identification number assigned by the microprocessor for a process being currently executed by the microprocessor;\na first tag block having memory locations to store a tag derived from each of the series of addresses received from the microprocessor and having memory locations to store the process identification number with each stored tag, wherein all of the memory locations in the first tag block are available to store the tag and process identification number for the process being currently executed by the microprocessor;\na first data block having memory locations to store data received from memory locations in the main memory identified by each of the series of addresses received from the microprocessor;\na first valid bit block to store a valid bit to indicate whether each tag stored in the tag block is valid; and\na first logic element to determine if data identified by each of the series of addresses received from the microprocessor is in the cache memory.\n2. The x86 microprocessor system of claim 1 wherein the first logic element comprises:\nfirst logic equal elements to determine if a tag derived from an address received from the microprocessor is equal to a tag in the first tag block;\nsecond logic equal elements to determine if the process identification number stored with each tag is equal to the process identification number stored in the first process identification register; and\nfirst AND logic elements each having an output and each having inputs from one of the first logic equal elements, one of the second logic equal elements and the valid bit block;\nwherein, if the output from one of the first AND logic elements is true the data identified by the address received from the microprocessor is stored in the first data block.\n3. The x86 microprocessor system of claim 2 further comprising a second logic element to output data stored in the first data block that is identified by the address received from the microprocessor.\n4. The x86 microprocessor system of claim 3 further comprising a translation lookaside buffer.\n5. The x86 microprocessor system of claim 4 wherein the translation lookaside buffer comprises:\na second address register for receiving a series of linear addresses;\na second process identification register for receiving and storing the process identification number;\na second tag block having memory locations to store a tag derived from each of the series of linear addresses and having memory locations to store the process identification number with each stored tag in the second tag block;\na second data block having memory locations to store a page table entry identified by each of the series of linear addresses;\na second valid bit block to store a valid bit to indicate whether each tag stored in the second tag block is valid; and\na third logic element to determine if a page table entry identified by each of the series of linear addresses is in the second data block.\n6. The x86 microprocessor system of claim 5 wherein the third logic element comprises:\nthird logic equal elements to determine if a tag derived from a received linear address is equal to a tag in the second tag block;\nfourth logic equal elements to determine if the process identification number stored with each tag is equal to the process identification number stored in the second process identification register; and\nsecond AND logic elements each having an output and each having inputs from one of the third logic equal elements, one of the fourth logic equal elements and the valid bit block;\nwherein, if the output from one of the second AND logic element is true the page table entry identified by the linear address is stored in the second data block.\n7. The x86 microprocessor system of claim 6 further comprising a third logic element to output a page table entry that is identified by the linear address.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4525778A",
        "US4928225A",
        "EP0442474A2",
        "JPH04205636A",
        "US5287508A",
        "US5319760A",
        "US5428757A",
        "US5564052A",
        "US5627987A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6014667A",
        "WO2000068780A2",
        "US6230242B1",
        "US6249911B1",
        "US6249843B1",
        "US6253286B1",
        "US6269425B1",
        "WO2001077820A2",
        "WO2001098907A1",
        "US20020062427A1",
        "US20020062425A1",
        "US20020062434A1",
        "US20020065979A1",
        "US20020065980A1",
        "US20020069328A1",
        "US20020073282A1",
        "EP1215582A1",
        "US6490671B1",
        "US6496925B1",
        "US20030018687A1",
        "US6542921B1",
        "US6571316B1",
        "US20030120892A1",
        "US6594729B1",
        "US20030182512A1",
        "US6629208B2",
        "US20030233394A1",
        "US20040025161A1",
        "US20040098559A1",
        "US20040160448A1",
        "US20040243760A1",
        "US20050038980A1",
        "US20050264575A1",
        "WO2006045801A2",
        "US7051329B1",
        "US20060158916A1",
        "US7096345B1",
        "US7191319B1",
        "US7437532B1",
        "US7472033B1",
        "US20090252167A1",
        "US7725677B1",
        "US20110283282A1",
        "US20120246408A1",
        "WO2013101378A1",
        "US20130179640A1",
        "US20140181448A1",
        "US20150100738A1",
        "US9547358B2",
        "US9552032B2",
        "US9632711B1",
        "US9645752B1",
        "US9983875B2",
        "US10037229B2",
        "US10037211B2",
        "US10042647B2",
        "US10318419B2",
        "US10346174B2",
        "US10489382B2",
        "US10540184B2",
        "US10545766B2",
        "US10552164B2",
        "US10564977B2",
        "US10572265B2",
        "US10606600B2",
        "US10649785B2",
        "US10732981B2",
        "US10761854B2",
        "US10782979B2",
        "US10838733B2",
        "US10963261B2",
        "US11010192B2"
    ],
    "citedby_ftf": []
}