{
    "patent_link": "https://patents.google.com/patent/US20050120311A1/en",
    "patent_id": "US20050120311A1",
    "title": "Click-through re-ranking of images and other data",
    "abstract": "A method and apparatus using feedback obtained by user clicks and the position of the clicked images in the search result to determine user preferences for data that best satisfies particular queries. User click information is tracked to determine which images users click on for particular queries. This information is used to update and improve future query results. The described embodiment determines a user preference score for each image that is clicked for a given query. The placement of a clicked image in the search results is considered when computing the image/query score.",
    "inventors": [
        "John Thrall"
    ],
    "assignee": "Altaba Inc",
    "classifications": [
        "G06F16/9535",
        "G06F16/54",
        "G06F16/9536",
        "G06F16/9538",
        "Y10S707/99935",
        "Y10S707/99937",
        "Y10S707/99945"
    ],
    "claims": "\n1. A method of scoring data for use in a search engine, comprising:\ntracking clicks by users on data returned in a search result in response to a query; and\ndetermining a user preference for a clicked data in accordance with a physical position of the clicked data in the search result.\n2. The method of claim 1, wherein determining a user preference for a clicked data is further performed in accordance with a number of clicks made by users on the data returned in the search result.\n3. The method of claim 1, wherein determining a user preference for a clicked data is performed by determining a ratio of actual clicks to clicks expected for the clicked data and a specific query.\n4. The method of claim 1, wherein determining a user preference is performed periodically.\n5. The method of claim 1, wherein determining a user preference is performed weekly.\n6. The method of claim 1, wherein determining a user preference is performed in real time.\n7. The method of claim 1, further comprising determining values in a weight table based on user preferences for physical positions within search results independent of a query.\n8. The method of claim 1, wherein determining a user preference for a clicked data in accordance with a physical position of the data in the search result is performed in accordance with weight values determined by observed user click behavior.\n9. The method of claim 1, wherein determining a user preference for a clicked data in accordance with a physical position of the data in the search result is performed in accordance with weight values determined by trial and error.\n10. The method of claim 1, wherein tracking clicks by users includes tracking: a query, a data fingerprint, and a position in the search results for a click on data from a search result for a specific query.\n11. The method of claim 10, wherein tracking clicks by users further includes tracking: a time the click occurred and user ID information.\n12. The method of claim 1, wherein determining a user preference further includes weighting click information so that clicks by users on data in unpopular positions in the search result migrate that data toward the top of future search results.\n13. The method of claim 1, further including normalizing the click information before the determining step.\n14. The method of claim 1, wherein the data is image data.\n15. The method of claim 1, wherein the data is shopping data.\n16. The method of claim 1, wherein the data is textual data.\n17. The method of claim 1, further comprising using the determined user preference to determine rankings for display of future search results.\n18. The method of claim 1, wherein determining a user preference includes determining context dependent user preference scores in accordance with a characteristic of the users clicking on the search results.\n19. An apparatus that scores data for use in a search engine, comprising:\na module that tracks clicks by users on data returned in a search result in response to a query; and\na module that determines a user preference for a clicked data in accordance with a physical position of the clicked data in the search result.\n20. The apparatus of claim 19, wherein determining a user preference for a clicked data is further performed in accordance with a number of clicks made by users on the data returned in the search result.\n21. The apparatus of claim 19, wherein determining a user preference for a clicked data in accordance with a physical position of the data in the search result is performed in accordance with weight values determined by observed user click behavior.\n22. The apparatus of claim 19, wherein determining a user preference further includes weighting click information so that clicks by users on data in unpopular positions in the search result migrate that data toward the top of future search results.\n23. The apparatus of claim 19, wherein the data is image data.\n24. The apparatus of claim 19, wherein determining a user preference uses a plurality of weight tables corresponding to ones of a plurality of user interfaces displaying the search result.\n25. A computer program product, including computer instructions on a computer-readable medium, the instructions capable of causing a computer to perform the following:\ntracking clicks by users on data returned in a search result in response to a query; and\ndetermining a user preference for a clicked data in accordance with a physical position of the clicked data in the search result.",
    "status": "Active",
    "citations_own": [
        "US20030018626A1",
        "US6640218B1",
        "US20030216930A1",
        "US20050065916A1",
        "US20050065928A1",
        "US20050071255A1",
        "US20050080772A1",
        "US20050114306A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20050149390A1",
        "US20050149388A1",
        "US20050256848A1",
        "WO2006063451A1",
        "US20060184577A1",
        "US20060204142A1",
        "US20060277492A1",
        "US20060294068A1",
        "US20070078846A1",
        "US20070239756A1",
        "US20070299826A1",
        "US20090041366A1",
        "US20090063460A1",
        "US20090144238A1",
        "US20090222767A1",
        "US20090248657A1",
        "US20090307168A1",
        "US20100042467A1",
        "US20100318531A1",
        "US7885482B2",
        "EP2212813A4",
        "US20110238686A1",
        "US20110270849A1",
        "US8073832B2",
        "US20120212772A1",
        "US20120311421A1",
        "US20120311140A1",
        "US20130018912A1",
        "US8694373B2",
        "US8781888B1",
        "US8819004B1",
        "US20140250115A1",
        "US20140321761A1",
        "US8898156B2",
        "US20140379528A1",
        "US20150019582A1",
        "US20150154308A1",
        "US20150161128A1",
        "US20150169741A1",
        "US9110923B2",
        "TWI498753B",
        "US9137394B2",
        "US9152652B2",
        "JP2015181050A",
        "JP2015181048A",
        "JP2015187887A",
        "US9182932B2",
        "WO2016099447A1",
        "US9489449B1",
        "US9489161B2",
        "US9547369B1",
        "US9747622B1",
        "US9773214B2",
        "US9805425B2",
        "US9928752B2",
        "US10082992B2",
        "US10176429B2",
        "US10223637B1",
        "US10269081B1",
        "US10332184B2",
        "US10546262B2",
        "US10810654B1",
        "CN111914165A",
        "US10872350B1",
        "US10929890B2",
        "US10970769B2",
        "US10970463B2",
        "US11023947B1",
        "US11205179B1",
        "US11463578B1",
        "US11514493B1",
        "US11574119B2",
        "US11676192B1",
        "US11734368B1"
    ],
    "citedby_ftf": [
        "US7693827B2",
        "US7249126B1",
        "US8078607B2",
        "US8874570B1",
        "US9256685B2",
        "US7984049B2",
        "US7827170B1",
        "US7860870B2",
        "CN101576932B",
        "US8478700B2",
        "US8463773B2",
        "US20120278318A1",
        "US8996305B2",
        "US9053177B1",
        "CN106202098A",
        "US10558687B2",
        "US10592568B2"
    ]
}