{
    "patent_link": "https://patents.google.com/patent/US20030172017A1/en",
    "patent_id": "US20030172017A1",
    "title": "High performance multi-dimensional risk engines for enterprise wide market risk management",
    "abstract": "A system and method for performing Value at Risk (VaR) analysis at a large volume scale. The system employs two basic types of elements in its architecture: controllers and brokers. Controllers are engines that perform actual processing of data, while brokers manage the access to and from the data resources. Controllers of the present invention have three main components, an input queue, a manager and workers. The controllers retrieve units of work from the incoming queue, process the units, and place the result onto an outgoing queue. The outgoing queue of one controller is shared with the next element in the processing chain. Brokers are responsible for maintaining pool of common resources and providing access to those resources to a requestor (i.e., a controller). In the preferred embodiment, the resource is a data source, such as a database containing market pricing data. The broker accesses the data source though an adapter. In addition to accessing data from the data source a broker maintains a cache of cacheable elements. The system of the present invention further includes a query subsystem for generating reports relating the risk positions.",
    "inventors": [
        "Vincent Feingold",
        "Julie Shapiro",
        "Donald Conte",
        "Katrina Kalish"
    ],
    "assignee": "JPMorgan Chase Bank NA",
    "classifications": [
        "G06Q40/08",
        "G06Q40/00"
    ],
    "claims": "\n1. A system for performing risk analysis of a portfolio of positions, the system comprising:\nan input interface adapter, the input interface adapter receiving position data describing at least some of the positions in the portfolio;\nat least one controller coupled to the input interface adapter, the controller performing a valuation of the position data, the controller comprising:\nan input queue,\na controller manager coupled to the input queue, and\na plurality of workers coupled to the controller manager, wherein the number of workers coupled to the controller manager is scalable;\nat least one data broker coupled to the at least one controller, wherein the data broker provides the controller with data required for performing the valuation.\n2. The system of claim 1, further comprising:\na position database coupled to the input interface adapter, the position database storing the position data.\n3. The system of claim 1, further comprising:\na hypothetical position interface coupled to the input interface adapter, the hypothetical position interface providing hypothetical position data.\n4. The system of claim 1, further comprising:\na network coupled to the input interface adapter, the network providing the position data to the input interface adapter.\n5. The system of claim 1, further comprising:\na position receiver coupled to the input interface adapter, the position receiver converting the position data into a map of name-value pairs.\n6. The system of claim 1, wherein the at least one controller further comprises:\na position controller, the position controller constructing a position object, the position object including references to asset information, market data information and valuation models.\n7. The system of claim 6, further comprising:\nan asset data broker coupled to the position controller, the asset data broker providing the position controller with the references to the asset information, the asset information describing static data related to assets.\n8. The system of claim 7, further comprising:\nan asset database coupled to the asset data broker, the asset database storing the asset information.\n9. The system of claim 6, further comprising:\na market data broker coupled to the position controller, the market data broker providing the position controller with the references to the market data information, the market data information describing variable market data related to positions.\n10. The system of claim 9, further comprising:\na market data database coupled to the market data broker, the market data database storing the market data information.\n11. The system of claim 6, further comprising:\na product information broker coupled to the position controller, the product information broker providing the position controller with the valuation models, the valuation models describing models by which positions are valued.\n12. The system of claim 11, further comprising:\na rules database coupled to the product information broker, the rules database storing rules governing the valuation models.\n13. The system of claim 6, further comprising:\na risk exposure controller coupled to the position controller, the risk exposure controller receiving the position object from the position controller and creating at least one risk exposure and hypothetical market data for at least one scenario with respect to the at least one risk exposure.\n14. The system of claim 13, further comprising:\na valuation range controller coupled to the risk exposure controller, the valuation range controller valuing the at least one scenario associated with the position object.\n15. The system of claim 1, further comprising a plurality of controllers performing the valuation of positions.\n16. The system of claim 15, further comprising:\na load collector coupled to the plurality of controllers, the load collector storing position objects representing the positions, wherein tokens referencing the position objects are passed between the plurality of controllers and not the position objects themselves.\n17. The system of claim 16, further comprising:\na risk position database coupled to the load collector, the risk position database storing valued risk position data.\n18. The system of claim 1, wherein the at least one data broker comprises:\na broker manager, the broker manager managing requests for data;\na data source adapter coupled to the broker manager, the data source adapter interfacing with sources of data; and\na cache coupled to the broker manager, the cache storing data retrieved from the data source.\n19. The system of claim 1, wherein the at least one data broker employs one of a plurality of data searching methodologies including an optimistic search, a pessimistic search and a very pessimistic search.\n20. A method for performing risk analysis of a portfolio of positions, the method comprising:\nreceiving position data describing at least some of the positions in the portfolio;\nvaluing the position data by a controller, the controller having a plurality of workers;\nautomatically scaling a number of workers in the controller in regard to the volume of position data; and\nretrieving valuation data required by the controller in order to perform the valuation.\n21. The method of claim 20, further comprising storing the position data in a position database.\n22. The method of claim 20, further comprising receiving hypothetical position data.\n23. The method of claim 20, further comprising receiving the position data from a network.\n24. The method of claim 20, further comprising converting the position data into a map of name-value pairs.\n25. The method of claim 20, further comprising constructing a position object, the position object including references to asset information, market data information and valuation models.\n26. The method of claim 25, further comprising providing the controller with the references to the asset information, the asset information describing static data related to assets.\n27. The method of claim 26, further comprising storing the asset information in an asset database.\n28. The method of claim 25, further comprising:\nproviding the controller with the references to the market data information, the market data information describing variable market data related to positions.\n29. The method of claim 28, further comprising storing the market data information in a market data database.\n30. The method of claim 25, further comprising providing the controller with the valuation models, the valuation models describing models by which positions are valued.\n31. The method of claim 30, further comprising storing rules governing the valuation models in a rules database.\n32. The method of claim 25, further comprising creating at least one risk exposure and hypothetical market data for at least one scenario with respect to the at least one risk exposure.\n33. The method of claim 32, further comprising valuing the at least one scenario associated with the at least one risk exposure.\n34. The method of claim 20, wherein a plurality of controllers are involved in the valuation of positions.\n35. The method of claim 34, further comprising:\nstoring position objects representing the positions in a load collector; and\npassing tokens referencing the position objects between the plurality of controllers and not passing the position objects themselves.\n36. The method of claim 35, further comprising storing valued risk position data.\n37. A system for performing risk analysis of a portfolio of positions, the system comprising:\na position controller, the position controller constructing a position object for each position received by the position controller;\na risk exposure controller coupled to the position controller, the risk exposure controller receiving the position object from the position controller and creating at least one risk exposure and hypothetical market data for at least one scenario with respect to the at least one risk exposure; and\na valuation range controller coupled to the risk exposure controller, the valuation range controller valuing the at least one scenario associated with the at least one risk exposure.\n38. A query system for use in a risk analysis system containing a portfolio of positions, the query system comprising:\na portfolio controller receiving a query from a user, the portfolio controller determining risk positions required to satisfy the query;\na cube controller coupled to the portfolio controller, the cube controller receiving and aggregating the risk positions;\nan expansion controller coupled to the cube controller, the expansion controller building a multidimensional cube of cells from the aggregated risk positions; and\nan analytical controller coupled to the expansion controller, the analytical controller calculating characteristics contained in the query using the multidimensional cube of cells.\n39. The query system of claim 38 wherein the cells in the multidimensional cube contain distributions of random variables.",
    "status": "Abandoned",
    "citations_own": [
        "US3634669A",
        "US4634845A",
        "US4642768A",
        "US4897811A",
        "US4897533A",
        "US4992940A",
        "US5080748A",
        "US5180901A",
        "US5276311A",
        "US5278751A",
        "US5287268A",
        "US5287269A",
        "US5381470A",
        "US5383113A",
        "US5481647A",
        "US5483445A",
        "US5482139A",
        "US5483444A",
        "US5490060A",
        "US5592560A",
        "US5603025A",
        "US5604542A",
        "US5606496A",
        "US5705798A",
        "US5708422A",
        "US5710458A",
        "US5710889A",
        "US5710886A",
        "US5710887A",
        "US5715399A",
        "US5717925A",
        "US5717865A",
        "US5721847A",
        "US5721781A",
        "US5721768A",
        "US5857079A",
        "US5857175A",
        "US5859419A",
        "US5857709A",
        "US5864609A",
        "US5864828A",
        "US5864830A",
        "US5870718A",
        "US5870721A",
        "US5873096A",
        "US5875437A",
        "US6014749A",
        "US6014645A",
        "US6014638A",
        "US6014636A",
        "US6016482A",
        "US6016954A",
        "US6018722A",
        "US6021397A",
        "US6019284A",
        "US6026370A",
        "US6029195A",
        "US6029139A",
        "US6029890A",
        "US6032125A",
        "US6032136A",
        "US6169975B1",
        "US6173267B1",
        "US6173270B1",
        "US6182048B1",
        "US6185582B1",
        "US6182894B1",
        "US6188403B1",
        "US6188993B1",
        "US6188405B1",
        "US6186793B1",
        "US6192113B1",
        "US6189787B1",
        "US6195092B1",
        "US6195644B1",
        "US6336099B1",
        "US6338048B1",
        "US20020007330A1",
        "US6341724B2",
        "US6343743B1",
        "US6345261B1",
        "US6345766B1",
        "US20020019791A1",
        "US20020026418A1",
        "US20020046145A1",
        "US20030004828A1",
        "US6505168B1",
        "US6505780B1",
        "US20030018492A1",
        "US20030018558A1",
        "US6513018B1",
        "US20030023549A1",
        "US20030033240A1",
        "US6564214B1",
        "US6675127B2",
        "US20050004855A1",
        "US20050021400A1",
        "US6985880B1",
        "US7165049B2"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20040024693A1",
        "US20040225590A1",
        "US20040254872A1",
        "US20050187744A1",
        "US20050204898A1",
        "US20060015425A1",
        "US20060059068A1",
        "US20060059069A1",
        "US20060059065A1",
        "US20060059066A1",
        "US20060059067A1",
        "WO2006031446A3",
        "WO2006089588A1",
        "US20060265296A1",
        "US20070027843A1",
        "US20070294158A1",
        "US20080077603A1",
        "US20080120323A1",
        "US7426487B2",
        "US20090171824A1",
        "US7593879B2",
        "US20090248588A1",
        "US20090299916A1",
        "US20090293904A1",
        "US20100017345A1",
        "US7672921B1",
        "US20100145875A1",
        "US7778897B1",
        "US20100332411A1",
        "US20110035342A1",
        "WO2011133225A2",
        "US8121937B2",
        "US8131634B1",
        "US8140415B2",
        "US8234201B1",
        "US20120221486A1",
        "US8321333B2",
        "US8341180B1",
        "US8738490B2",
        "US8762191B2",
        "US8996481B2",
        "US9058581B2",
        "US9063985B2",
        "US20160098795A1",
        "US20170116308A1",
        "US20170344913A1",
        "CN110633316A",
        "US10846624B2",
        "US10872078B2",
        "US10909623B2",
        "US10929152B2",
        "US10963962B2",
        "US11263695B2",
        "US11397985B2",
        "US11436672B2",
        "US11449538B2",
        "US11551302B2"
    ],
    "citedby_ftf": []
}