{
    "patent_link": "https://patents.google.com/patent/US6298308B1/en",
    "patent_id": "US6298308B1",
    "title": "Diagnostic network with automated proactive local experts",
    "abstract": "A method is provided for invoking condition monitoring among a plurality of machines, comprising establishing a network of automated local experts at generally fixed locations and interconnected by at least one network connection, configuring each of the local experts to receive vibration data from at least one of the plurality of machines which is located in relative physical proximity thereto and configuring each of the local experts to analyze the received vibration data and to diagnose a condition of the machine providing the received vibration data based on the received vibration, and configuring each of the local experts to transmit diagnostic information relating to the condition of the respective machines via the at least one network connection.",
    "inventors": [
        "Alan J. Reid",
        "Dean A. Lofall"
    ],
    "assignee": "SymphonyAI Industrial Plant Performance Inc",
    "classifications": [
        "G05B19/4063",
        "G01H1/003",
        "G05B19/4185",
        "G05B2219/31151",
        "G05B2219/31156",
        "G05B2219/31158",
        "G05B2219/33002",
        "G05B2219/33284",
        "G05B2219/37351",
        "G05B2219/37434",
        "G05B2219/37435",
        "Y02P90/02",
        "Y02P90/80"
    ],
    "claims": "\n1. A method for invoking condition monitoring among a plurality of machines, comprising the steps of:\n2. The method of claim 1, wherein the at least one network connection comprises a local area network (LAN) connection.\n3. The method of claim 1, wherein the at least one network connection comprises at least one of a wide area network (WAN), dial-up network (DUN), virtual private network (VPN), Internet connection, serial connection and parallel connection.\n4. The method of claim 1, wherein at least one of the local experts is configured to transmit the diagnostic information via the at least one network to the client at a predefined location.\n5. The method of claim 4, wherein the predefined location is a local facility proximate the machine to which the diagnostic information pertains.\n6. The method of claim 5, wherein the local facility receives diagnostic information from a plurality of the local experts.\n7. The method of claim 5, wherein the predefined location is a remote facility located off-site relative to the machine to which the diagnostic information pertains.\n8. The method of claim 7, wherein the remote facility receives diagnostic information from a plurality of the local experts.\n9. The method of claim 1, wherein at least one of the local experts is configured to transmit the diagnostic information using at least one of an electronic mail message and a pager message.\n10. The method of claim 1, wherein at least one of the local experts substantially continuously analyzes received vibration data.\n11. The method of claim 1, wherein the local experts each comprise a predictive or adaptive based expert system.\n12. The method of claim 11, wherein the local experts each comprise at least one of a knowledge base, a rule base, and a neural network for diagnosing a condition of a machine.\n13. The method of claim 1, wherein the local experts are each configured to diagnose at least one of wear, incipient failure, and required maintenance based on the received vibration data, and to transmit diagnostic information relating to such diagnosis via the at least one network connection.\n14. The method of claim 1, wherein the local experts are each configured to diagnose a cause of a problem based on the received vibration data and to transmit diagnostic information identifying the cause of the problem together with recommended action to be taken via the at least one network connection.\n15. The method of claim 14, wherein the diagnostic information comprises an identity of a machine part and recommended maintenance relating to the machine part.\n16. The method of claim 1, further comprising a step of configuring each of the local experts to replicate at least a portion of the received vibration data from a machine to the client at a central monitoring location automatically upon diagnosing a problem with the machine.\n17. The method of claim 1, wherein methods by which the local experts transmit the diagnostic information via the at least one network connection vary as a function of a predefined level of severity of a diagnosed condition.\n18. The method of claim 17, wherein the methods comprise electronic mail and paging.\n19. The method of claim 18, wherein pages comprise relatively brief messages identifying a specific machine and diagnosed problem, and electronic mail messages comprise additional information.\n20. The method of claim 19, wherein the additional information comprises at least one of a summary of the data analysis which resulted in the diagnosis and recommended maintenance.\n21. The method of claim 1, wherein at least one of the local experts includes a modem for connecting the local expert to the at least one network connection.\n22. The method of claim 1, wherein the local experts are each configured to include tables stored in memory identifying network addresses, email addresses and pager addresses of personnel to be notified in an event a problem is diagnosed with a particular machine.\n23. The method of claim 1, wherein the local experts are each configured to store maintenance information in memory and to supply such information to a user in response to analyzing the received vibration data and diagnosing a condition of the machine.\n24. The method of claim 1, further comprising the steps of configuring each of the local experts to carry out self-tests to confirm proper operation, and to notify the network of an operational problem via the at least one network connection in the event of a self-test failure.\n25. The method of claim 1, further comprising the step of configuring each of the local experts to periodically provide machine condition reports to the client at a central location via the at least one network connection.\n26. The method of claim 1, wherein each of the local experts analyzes the vibration data substantially in real time.\n27. The method of claim 1, wherein the at least one network connection comprises a hard-wired network.\n28. The method of claim 1, further comprising the step of configuring the local experts to receive additional data relating to a physical parameter of the machines other than vibration.\n29. The method of claims 28, wherein the additional data relates to lubricant analysis.\n30. The method of claim 1, wherein at least one of the local experts is associated with a particular one of the plurality of machines.\n31. The method of claim 30, wherein the at least one of the local experts is physically mounted to a corresponding particular one of the plurality of machines.\n32. A method for invoking condition monitoring among a plurality of machines, comprising the steps of:\n33. A system for invoking condition monitoring among a plurality of machines, comprising:\n34. The system of claim 33, wherein the at least one network connection comprises a local area network (LAN) connection.\n35. The system of claim 33, wherein the at least one network connection comprises at least one of a wide area network (WAN), dial-up network (DUN), virtual private network (VPN), Internet connection, serial connection and parallel connection.\n36. The system of claim 33, wherein at least one of the local experts is configured to transmit the diagnostic information via the at least one network to the client at a predefined location.\n37. The system of claim 36, wherein the predefined location is a local facility proximate the machine to which the diagnostic information pertains.\n38. The system of claim 37, wherein the local facility receives diagnostic information from a plurality of the local experts.\n39. The system of claim 37, wherein the predefined location is a remote facility located off-site relative to the machine to which the diagnostic information pertains.\n40. The system of claim 39, wherein the remote facility receives diagnostic information from a plurality of the local experts.\n41. The system of claim 33, wherein at least one of the local experts is configured to transmit the diagnostic information using at least one of an electronic mail message and a pager message.\n42. The system of claim 33, wherein at least one of the local experts substantially continuously analyzes received vibration data.\n43. The system of claim 33, wherein the local experts each comprise a predictive or adaptive based expert system.\n44. The system of claim 43, wherein the local experts each comprise at least one of a knowledge base, a rule base, and a neural network for diagnosing a condition of a machine.\n45. The system of claim 33, wherein the local experts are each configured to diagnose at least one of wear, incipient failure, and required maintenance based on the received vibration data, and to transmit diagnostic information relating to such diagnosis via the at least one network connection.\n46. The system of claim 33, wherein the local experts are each configured to diagnose a cause of a problem based on the received vibration data and to transmit diagnostic information identifying the cause of the problem together with recommended action to be taken via the at least one network connection.\n47. The system of claim 46, wherein the diagnostic information comprises an identity of a machine part and recommended maintenance relating to the machine part.\n48. The system of claim 33, wherein each of the local experts is configured to replicate at least a portion of the received vibration data from a machine to the client at a central monitoring location automatically upon diagnosing a problem with the machine.\n49. The system of claim 33, wherein methods by which the local experts are configured to transmit the diagnostic information via the at least one network connection vary as a function of a predefined level of severity of a diagnosed condition.\n50. The system of claim 49, wherein the methods comprise electronic mail and paging.\n51. The system of claim 50, wherein pages comprise relatively brief messages identifying a specific machine and diagnosed problem, and electronic mail messages comprise additional information.\n52. The system of claim 51, wherein the additional information comprises at least one of a summary of the data analysis which resulted in the diagnosis and recommended maintenance.\n53. The system of claim 33, wherein at least one of the local experts includes a modem for connecting the local expert to the at least one network connection.\n54. The system of claim 33, wherein the local experts are each configured to include tables stored in memory identifying network addresses, email addresses and pager addresses of personnel to be notified in an event a problem is diagnosed with a particular machine.\n55. The system of claim 33, wherein the local experts are each configured to store maintenance information in memory and to supply such information to a user in response to analyzing the received vibration data and diagnosing a condition of the machine.\n56. The system of claim 33, wherein each of the local experts is configured to carry out self-tests to confirm proper operation, and to notify the network of an operational problem via the at least one network connection in the event of a self-test failure.\n57. The system of claim 33, wherein each of the local experts is configured to periodically provide machine condition reports to the client at a central location via the at least one network connection.\n58. The system of claim 33, wherein each of the local experts analyzes the vibration data substantially in real time.\n59. The system of claim 33, wherein the at least one network connection comprises a hard-wired network.\n60. The system of claim 33, wherein the local experts are configured to receive additional data relating to a physical parameter of the machines other than vibration.\n61. The system of claim 60, wherein the additional data relates to lubricant analysis.\n62. The system of claim 33, wherein at least one of the local experts is associated with a particular one of the plurality of machines.\n63. The system of claim 62, wherein the at least one of the local experts is physically mounted to a corresponding particular one of the plurality of machines.\n64. The system of claim 33, wherein each of the local experts is configured to provide reports to notify the network of the operating status of at least one of the local expert and a machine being analyzed by the local expert.\n65. The system of claim 33, wherein the at least one network connection comprises at least one of a wireless link, radio link, and satellite link.\n66. A system for invoking condition monitoring among a plurality of machines, comprising:",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4408285A",
        "US4517468A",
        "US5109700A",
        "WO1995008809A2",
        "US5414494A",
        "US5435168A",
        "US5481481A",
        "US5610339A",
        "US5633811A",
        "WO1997043729A1",
        "EP0814590A2",
        "US5710723A",
        "US5736970A",
        "WO1998039718A1",
        "US5808903A",
        "US5814733A",
        "US5917428A",
        "US5963884A",
        "WO1999060351A1",
        "US5995910A",
        "US5992237A",
        "US6041287A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20010007140A1",
        "US20010047213A1",
        "US20010053965A1",
        "US20020022984A1",
        "US20020042761A1",
        "US20020083372A1",
        "US20020091821A1",
        "US20020152052A1",
        "US20030014322A1",
        "US20030014387A1",
        "US20030014498A1",
        "US20030014149A1",
        "US20030041136A1",
        "US20030055990A1",
        "US20030055534A1",
        "US6542856B2",
        "US6549869B1",
        "US20030077179A1",
        "US6556956B1",
        "US20030084379A1",
        "US6591296B1",
        "US20030135547A1",
        "US20030135349A1",
        "US6604061B2",
        "US20030154051A1",
        "US6609212B1",
        "US6618745B2",
        "US20030204791A1",
        "US20040003007A1",
        "US6678639B2",
        "US20040015465A1",
        "US20040019460A1",
        "US20040021563A1",
        "US20040039478A1",
        "US20040078725A1",
        "US20040078727A1",
        "US20040078726A1",
        "US20040102928A1",
        "US6748341B2",
        "US20040117477A1",
        "GB2396920A",
        "US6799148B2",
        "US20040236706A1",
        "US20040267395A1",
        "US6853959B2",
        "US20050055429A1",
        "US20050096873A1",
        "US20050096759A1",
        "US20050144264A1",
        "US20050177347A1",
        "GB2413413A",
        "US20060015205A1",
        "US20060047796A1",
        "US7013287B1",
        "US20060107087A1",
        "US20060116836A1",
        "US20060181427A1",
        "US7099957B2",
        "WO2007003150A1",
        "WO2007025833A1",
        "US20070129826A1",
        "EP1808768A2",
        "US20080077268A1",
        "WO2008039352A2",
        "WO2008151971A1",
        "US7475122B2",
        "US7475293B1",
        "US20090138588A1",
        "US20090204237A1",
        "US20090204267A1",
        "US20090204234A1",
        "US20090204245A1",
        "US20090210081A1",
        "CN100573374C",
        "US20100010654A1",
        "US20100023156A1",
        "GB2485446A",
        "US20140039838A1",
        "US8798847B2",
        "US20140220514A1",
        "US20140282043A1",
        "US20140267296A1",
        "US8958995B2",
        "US8963733B2",
        "WO2015025260A1",
        "US9389610B2",
        "US9400867B2",
        "US20170004697A1",
        "US9618037B2",
        "US9766270B2",
        "WO2018011224A3",
        "US10077810B2",
        "DE102017112931A1",
        "US20190113896A1",
        "US20190176332A1",
        "WO2020049087A1",
        "US11003179B2",
        "US11036215B2",
        "US11199835B2",
        "US11199837B2",
        "US11237546B2",
        "US11378945B2",
        "CN115186842A",
        "US11774944B2"
    ],
    "citedby_ftf": [
        "US7254518B2",
        "US7949495B2",
        "US8290721B2",
        "US6836749B1",
        "FR2838204A1",
        "US6701258B2",
        "RU2324171C2",
        "US7676445B2",
        "US7627441B2",
        "US7441249B2",
        "US7523667B2",
        "US7046180B2",
        "US20060149519A1",
        "US8112565B2",
        "US20070068225A1",
        "US7953501B2",
        "US8788070B2",
        "EP2074385B2",
        "US8898036B2",
        "DE102008034418B4",
        "KR20110133021A",
        "US9207670B2",
        "US20130326383A1",
        "US9052240B2",
        "US9602122B2",
        "US10310496B2",
        "US11422547B2"
    ]
}