{
    "patent_id": "US-11126635-B2",
    "title": "Systems and methods for data processing and enterprise AI applications ",
    "assignee": "C3.Ai, Inc.",
    "publication_date": "2021-09-21",
    "patent_link": "https://patents.google.com/patent/US11126635B2/en",
    "inventors": [
        "Houman Behzadi",
        "Edward Y. Abbo",
        "Thomas M. Siebel",
        "John Coker",
        "Scott Kurinskas",
        "Thomas Rothwein",
        "David Tchankotadze"
    ],
    "classifications": [
        "G06F16/254",
        "G06F16/25",
        "G06F16/283",
        "G06F16/288",
        "G06F8/10",
        "G06F8/24",
        "G06F8/35",
        "G06F8/77",
        "G06F9/54",
        "G06N20/00",
        "G06N20/20",
        "G06N5/01",
        "G06Q10/06",
        "H04L67/10",
        "H04L67/12",
        "H04L67/53",
        "H04L67/566",
        "H04L67/60",
        "H04L67/61",
        "H04L69/16",
        "H04L69/40",
        "H04L29/08783",
        "H04L29/08792",
        "H04L67/565",
        "H04L67/5651",
        "Y02P90/80",
        "Y02P90/84",
        "Y04S40/18"
    ],
    "abstract": "Systems, methods, and devices for a cyberphysical (IoT) software application development platform based upon a model driven architecture and derivative IoT SaaS applications are disclosed herein. The system may include concentrators to receive and forward time-series data from sensors or smart devices. The system may include message decoders to receive messages comprising the time-series data and storing the messages on message queues. The system may include a persistence component to store the time-series data in a key-value store and store the relational data in a relational database. The system may include a data services component to implement a type layer over data stores. The system may also include a processing component to access and process data in the data stores via the type layer, the processing component comprising a batch processing component and an iterative processing component.",
    "claims": "\n1. A method for developing and using enterprise applications, comprising:\n(a) obtaining data from a plurality of different sources that utilize different data types or data structures, wherein the plurality of different sources comprise extraprise data sources, enterprise data sources, or internet-of-things data sources;\n(b) generating an abstract representation of the data from the plurality of different sources obtained in (a) using a model-driven architecture, wherein the generating comprises transforming the data from the plurality of different sources to the abstract representation using a plurality of data handlers, each data handler of the plurality of data handlers corresponding to a different source of the plurality of different sources, wherein the abstract representation (i) abstracts underlying details of one or more data stores and one or more data store access methods and (ii) provides an interface across different programming languages;\n(c) processing the abstract representation of the data using one or more of a plurality of algorithms, wherein the plurality of algorithms comprise big data operations, machine learning models, and business application logic, the plurality of algorithms having been abstracted by an abstraction layer prior to processing the abstract representation of the data; and\n(d) providing an application development platform in a user interface, wherein the application development platform comprises virtual building blocks configured to enable development of the enterprise applications, wherein the virtual building blocks graphically represent the abstract representations of the plurality of algorithms and the data, and wherein the application development platform comprises a tool for creating versions of the virtual building blocks by defining properties and metadata of underlying data and algorithms, wherein the properties and metadata comprise at least a data type of the underlying data and input and output parameters of the underlying algorithms,\nwherein the abstract representations of the plurality of algorithms and the abstract representations of the data enable the data to be processed and the enterprise applications to be developed using one or more of the plurality of algorithms without requiring knowledge of a structure, logic, or interrelationship of the plurality of algorithms or the different data types or data structures.\n2. The method of claim 1, wherein the plurality of different sources comprise one or more of customer billing and customer management systems, asset management systems, workforce management systems, distribution management systems, outage management systems, and meter or sensor data management systems.\n3. The method of claim 1, wherein the internet-of-things data sources comprise internet-connected smart devices.\n4. The method of claim 1, wherein obtaining data from the plurality of different sources comprises communicating with the plurality of different sources using application programming interfaces (APIs).\n5. The method of claim 4, wherein the APIs comprise RESTful APIs.\n6. The method of claim 1, wherein the virtual building blocks are configured to be manipulated within the user interface to enable development of the enterprise applications.\n7. The method of claim 1, wherein the model-driven architecture comprises three or more logical layers, wherein the three or more logical layers comprise an entity layer, an application layer, and a user interface layer.\n8. The method of claim 7, wherein the entity layer comprises definitions for end users of the enterprise applications.\n9. The method of claim 7, wherein the application layer comprises definitions for the big data operations, the machine learning models, and the business application logic.\n10. The method of claim 7, wherein the user interface layer comprises definitions for how the data and the algorithms are displayed.\n11. The method of claim 7, wherein the abstraction layer is configured to merge the definitions for the three or more logical layers at runtime, and generate composite definitions that include metadata from each of the three or more logical layers.\n12. The method of claim 1, wherein the abstraction layer provides an interface over the plurality of algorithms and the data.\n13. The method of claim 1, wherein the machine learning models comprise logistic regression models, linear regression models, decision trees, nave Bayes classifiers, clustering models, principal component analysis models, feature extraction and transformation models, and classification models.\n14. The method of claim 1, wherein the data from the plurality of different sources comprises time-series data and non-time series data, and wherein the method further comprises storing the time-series data in a key-value store and storing the non-time-series data in a relational database.\n15. The method of claim 1, further comprising displaying an output of the processing of the abstract representation of the data in the user interface.\n16. The method of claim 15, wherein the user interface comprises a plurality of application development tools.\n17. The method of claim 1, further comprising generating notifications, flags, or alerts upon processing of the abstract representation of the data using the plurality of algorithms.\n18. The method of claim 1, wherein the user interface is configured to provide an abstracted and correlated view of the processed data such that a user can traverse, view and manipulate the processed data from across a variety of different underlying systems.\n19. The method of claim 1, wherein the method is performed on a cloud-based platform.\n20. The method of claim 1, wherein the abstract representations of the plurality of algorithms and the data enable a reduction in a number of data elements and processes in an enterprise application as compared to the enterprise application without the abstract representations.\n21. The method of claim 1, wherein the model-driven architecture comprises models for generating abstraction representations of data types, database types, authentication processes, encryption processes, and machine learning algorithms.\n22. The method of claim 6, wherein the manipulation comprises drag and drop development.\n23. The method of claim 1, wherein the abstract representations of the plurality of algorithms comprise (i) a set of input data models defining data from the plurality of different sources that utilize the different data types or data structures, (ii) an abstracted implementation body, and (iii) a return data model for use in the user interface.\n24. The method of claim 1, wherein a selected data handler comprises transformation rules for transforming data from a particular source of the plurality of different sources to the abstract representation.\n25. The method of claim 24, wherein the abstract representation comprises a unified image of the transformed data from the plurality of different sources.\n26. The method of claim 25, wherein the unified image comprises data stored across multiple data stores but appears to services and applications to be stored in a single data store.\n27. A method, comprising:\n(a) obtaining data from a plurality of different sources that utilize different data types or data structures, wherein the plurality of different sources comprise extraprise data sources, enterprise data sources, or internet-of-things data sources;\n(b) using a model-driven architecture, transforming the data obtained from the plurality of different sources to an abstract representation of the data using a plurality of data handlers, each data handler corresponding to a different source of the plurality of different sources, wherein the abstract representation (i) abstracts underlying details of one or more data stores and one or more data store access methods and (ii) provides an interface across different programming languages; and\n(c) providing a user interface used in processing the abstract representation of the data using one or more of a plurality of algorithms, wherein the plurality of algorithms comprise big data operations, machine learning models, and business application logic,\nwherein the abstract representation of the data enables the data to be processed without requiring knowledge of a structure, logic, or interrelationship of the plurality of algorithms or the different data types or data structures.\n28. The method of claim 27, wherein a selected data handler comprises transformation rules for transforming data from a particular source of the plurality of different sources to the abstract representation.\n29. The method of claim 28, wherein the abstract representation comprises a unified image of the transformed data from the plurality of different sources.\n30. The method of claim 27, wherein the plurality of different sources comprises one or more of customer billing and customer management systems, asset management systems, workforce management systems, distribution management systems, outage management systems, and meter or sensor data management systems.\n31. The method of claim 27, wherein the internet-of-things data sources comprise smart devices.\n32. The method of claim 27, wherein obtaining data from the plurality of different sources comprises communicating with the plurality of different sources using application programming interfaces (APIs).\n33. The method of claim 32, wherein the APIs comprise RESTful APIs.\n34. The method of claim 27, wherein the machine learning models comprise logistic regression models, linear regression models, decision trees, nave Bayes classifiers, clustering models, principal component analysis models, feature extraction and transformation models, and classification models.\n35. The method of claim 27, wherein the data from the plurality of different sources comprises time-series data and non-time series data, and wherein the method further comprises storing the time-series data in a key-value store and storing the non-time-series data in a relational database.\n36. The method of claim 27, further comprising displaying an output of the processing of the abstract representation of the data in the user interface.\n37. The method of claim 36, wherein the user interface comprises a plurality of application development tools.\n38. The method of claim 27, further comprising generating notifications, flags, or alerts upon processing of the abstract representation of the data using the plurality of algorithms.\n39. The method of claim 27, wherein the abstract representation comprises a unified image of the transformed data from the plurality of different sources.\n40. The method of claim 39, wherein the unified image comprises data stored across multiple data stores but appears to services and applications to be stored in a single data store.",
    "status": "Active",
    "citations_own": [
        "US5132920A",
        "US5524253A",
        "US6178362B1",
        "US20030037322A1",
        "US20030034998A1",
        "US20030041163A1",
        "US20030172368A1",
        "US20030177146A1",
        "US20040224549A1",
        "US20040225649A1",
        "US20050050054A1",
        "US20050177816A1",
        "US20050228808A1",
        "US20050234969A1",
        "US20050240592A1",
        "US6961148B2",
        "US20060010148A1",
        "US7137071B2",
        "US20060259442A1",
        "US7159208B2",
        "US20070022093A1",
        "US7200529B2",
        "US20070112714A1",
        "US20070214408A1",
        "US7334015B1",
        "US20090044196A1",
        "US20090044179A1",
        "US20090132867A1",
        "US20090228726A1",
        "US7590970B2",
        "US20100023546A1",
        "US20100070217A1",
        "US20100094475A1",
        "US20100223296A1",
        "US20100262313A1",
        "US20100274602A1",
        "US20100274367A1",
        "US20100286937A1",
        "US20110010016A1",
        "US7877421B2",
        "US20110252426A1",
        "US20120002733A1",
        "US20120022910A1",
        "US20120054147A1",
        "US8166465B2",
        "US8180872B1",
        "US8190555B2",
        "US20120266129A1",
        "US20120271472A1",
        "US20120310559A1",
        "US8442917B1",
        "US8442935B2",
        "US20130124453A1",
        "US20130173322A1",
        "US20130211870A1",
        "US20130212420A1",
        "US20130238795A1",
        "US20130332194A1",
        "US20130346422A1",
        "US8626877B2",
        "US20140047107A1",
        "US20140046956A1",
        "US20140058572A1",
        "US20140074670A1",
        "US20140156806A1",
        "US20140279824A1",
        "US20140279899A1",
        "US20140279837A1",
        "US20140280142A1",
        "US20140337429A1",
        "US20150019195A1",
        "US20150058681A1",
        "US8972484B2",
        "US20150095303A1",
        "US20150120224A1",
        "US20150134733A1",
        "US9069737B1",
        "US9148669B2",
        "US20150370873A1",
        "US9268815B2",
        "US9281995B2",
        "US20160078379A1",
        "WO2016118979A2",
        "US20170126741A1",
        "US9734221B2",
        "US9799017B1",
        "US9824133B1",
        "US9886483B1",
        "US9922101B1",
        "US20180107660A1",
        "US10114367B2",
        "US20190007517A1",
        "US20190065545A1",
        "US10235780B2"
    ],
    "citations_ftf": [
        "US1011436A",
        "US1023578A",
        "CN102473097B",
        "US10157347B1",
        "WO2015179778A1"
    ],
    "citedby_own": [
        "US20210279633A1",
        "US11320469B2",
        "US20220309083A1",
        "US11587053B1",
        "WO2023075752A1"
    ],
    "citedby_ftf": [
        "US8300798B1",
        "US10057333B2",
        "US8856323B2",
        "EP2683103B1",
        "US10075520B2",
        "US9411327B2",
        "US9430491B2",
        "US11602611B2",
        "US10990894B2",
        "US10896421B2",
        "US10356651B2",
        "US10154409B2",
        "US10834592B2",
        "US9942756B2",
        "US10812327B2",
        "US20150339673A1",
        "US20160055427A1",
        "US20150032589A1",
        "US20150066771A1",
        "US10468126B1",
        "EP3197384A4",
        "US20160071017A1",
        "US20160063502A1",
        "US20160078367A1",
        "US11080709B2",
        "US10546099B2",
        "US11288328B2",
        "US11238090B1",
        "US11341338B1",
        "US10290001B2",
        "KR101593834B1",
        "WO2016089984A1",
        "US9774604B2",
        "US10638295B2",
        "US20160245279A1",
        "US10648735B2",
        "US20160313216A1",
        "US20160245686A1",
        "US11106871B2",
        "US10628423B2",
        "EP4148589A1",
        "KR102046700B1",
        "US11231826B2",
        "KR20160109242A",
        "IN2015CH01317A",
        "US11042128B2",
        "KR20160112724A",
        "US20160283506A1",
        "CA2980618C",
        "US10366111B1",
        "US10425350B1",
        "US10404787B1",
        "US10541938B1",
        "US10812341B1",
        "US10348810B1",
        "US10791063B1",
        "US10706970B1",
        "US10270707B1",
        "US10515097B2",
        "US10509684B2",
        "US10496926B2",
        "US10860622B1",
        "US10776404B2",
        "US10541936B1",
        "US10511659B1",
        "US10505863B1",
        "US10528875B1",
        "US9692447B2",
        "US10135777B2",
        "EP3278213A4",
        "US10437814B2",
        "US10306013B2",
        "US10015178B2",
        "US10419452B2",
        "JP5997330B1",
        "US10671915B2",
        "EP3332335A1",
        "US10699595B2",
        "US9774994B2",
        "US10231084B2",
        "US10437575B2",
        "US10648823B2",
        "US10272921B2",
        "US10318404B2",
        "US10313455B2",
        "US10848384B2",
        "US11222034B2",
        "US11151654B2",
        "US11436911B2",
        "US10902524B2",
        "US10708151B2",
        "US20170124464A1",
        "US11570214B2",
        "US11546380B2",
        "US11507858B2",
        "US11232268B1",
        "US11222184B1",
        "US11170038B1",
        "US10673710B2",
        "US9537914B1",
        "US20170161833A1",
        "US10228962B2",
        "US11588776B1",
        "CA2951618A1",
        "US10235780B2",
        "US20170177446A1",
        "US10387266B2",
        "US10656861B1",
        "US10592564B2",
        "US11181875B2",
        "US11268732B2",
        "US11120299B2",
        "US11775850B2",
        "US10664766B2",
        "US10182045B2",
        "US10083055B2",
        "US11146449B2",
        "US10310832B2",
        "US20170242935A1",
        "US10210155B2",
        "US10177930B1",
        "US11308115B2",
        "US10080132B2",
        "US9743272B1",
        "US10039113B2",
        "EP3437053A4",
        "US10135817B2",
        "KR101758558B1",
        "US10362109B2",
        "US10831350B1",
        "US11003334B1",
        "CN109154802A",
        "US10637951B2",
        "WO2018002731A2",
        "US10505756B2",
        "US11774920B2",
        "US10417451B2",
        "US10552914B2",
        "US11507064B2",
        "CN114625076A",
        "US11327475B2",
        "US11774944B2",
        "US10983507B2",
        "US10783535B2",
        "US20170337486A1",
        "US10600063B2",
        "US10868743B2",
        "US10810676B2",
        "US11237546B2",
        "US10796253B2",
        "US10103936B2",
        "US10334462B2",
        "WO2018004540A1",
        "US10540265B2",
        "US10439913B2",
        "US11256828B1",
        "US10885463B2",
        "US20180027049A1",
        "CN107645532B",
        "CN106296378B",
        "US10366060B2",
        "US10216556B2",
        "US10776846B2",
        "US10705926B2",
        "EP3491793A1",
        "US10546313B2",
        "US10387198B2",
        "US20230185608A1",
        "US10193762B2",
        "US10216582B2",
        "US10956467B1",
        "EP3475888A1",
        "US11463526B2",
        "US10397303B1",
        "US10437565B2",
        "US10313470B2",
        "US10831641B2",
        "US10643168B2",
        "US10586242B2",
        "US10684939B2",
        "US10893011B2",
        "US10476896B2",
        "US10650621B1",
        "US10643228B2",
        "US10628840B2",
        "US10621072B2",
        "US20180075386A1",
        "US20180075163A1",
        "JP7005600B2",
        "US10338967B2",
        "US11593377B2",
        "US11580107B2",
        "US10977260B2",
        "US10127400B2",
        "US11269939B1",
        "US11550847B1",
        "US11232100B2",
        "US11314753B2",
        "US11023463B2",
        "US11567993B1",
        "US11003714B1",
        "US10956415B2",
        "US11604795B2",
        "US10726009B2",
        "US11294941B1",
        "US11442935B2",
        "US11250056B1",
        "US11599541B2",
        "US11281706B2",
        "US10776355B1",
        "US11663227B2",
        "US20180089324A1",
        "US11321321B2",
        "US11615104B2",
        "US11416528B2",
        "US11620336B1",
        "US11562023B1",
        "US11106734B1",
        "US11243963B2",
        "US10795884B2",
        "US11222066B1",
        "US11126632B2",
        "US10984044B1",
        "US11586627B2",
        "US11163758B2",
        "US10353965B2",
        "US11461334B2",
        "US9766991B1",
        "US10212182B2",
        "US11080588B2",
        "US10616347B1",
        "US10127125B2",
        "JP6591695B2",
        "US11451043B1",
        "WO2018085353A1",
        "KR20180047828A",
        "DE102016120972A1",
        "US10936618B2",
        "US10581620B2",
        "WO2018089990A1",
        "US10824681B2",
        "US10380348B2",
        "US10382348B2",
        "US10708389B2",
        "US10713384B2",
        "US11580348B2",
        "CN106648648B",
        "US11039225B2",
        "US10917706B2",
        "US10575250B2",
        "US10902381B2",
        "US9946777B1",
        "US10262910B2",
        "US10374968B1",
        "US11057344B2",
        "US10445696B2",
        "US10756950B2",
        "CN108322380B",
        "US10761920B2",
        "US10855783B2",
        "US11163624B2",
        "US10832361B2",
        "US11113244B1",
        "US10762072B2",
        "US10268524B2",
        "US11169495B2",
        "US10229577B2",
        "US10445680B2",
        "US11334824B2",
        "US11082250B2",
        "US10854194B2",
        "US20190361412A1",
        "US10515098B2",
        "US10417245B2",
        "US11360447B2",
        "US11764991B2",
        "US11568148B1",
        "US11068661B1",
        "US11153376B2",
        "US10831509B2",
        "US10447623B2",
        "US20180246924A1",
        "JP6419234B2",
        "US10885014B2",
        "US10831773B2",
        "US10721254B2",
        "US11029053B2",
        "US11222268B2",
        "US10762563B2",
        "US10645080B2",
        "WO2018169430A1",
        "WO2018169429A1",
        "US11042144B2",
        "US20180285201A1",
        "US10706375B2",
        "US10607155B2",
        "US11386435B2",
        "SG10201702888XA",
        "US10687212B2",
        "US10635577B2",
        "US10992711B2",
        "US10469567B2",
        "TWI684936B",
        "US10798145B1",
        "EP3616007A1",
        "US10476902B2",
        "TWI719302B",
        "US20180315125A1",
        "US10838950B2",
        "US10540282B2",
        "US10437724B2",
        "US20180321981A1",
        "US11663205B2",
        "US11204816B2",
        "US10788229B2",
        "KR101982756B1",
        "US20180341889A1",
        "US20180343184A1",
        "US20180349445A1",
        "US10212024B2",
        "US11188390B2",
        "US11726822B2",
        "US11022947B2",
        "US11271769B2",
        "US10929421B2",
        "US11250343B2",
        "US10359771B2",
        "US10917803B2",
        "WO2018232147A1",
        "US11062226B2",
        "US10805317B2",
        "US11199956B2",
        "US11627195B2",
        "US11132636B2",
        "CN109118028B",
        "US10735904B2",
        "US10548185B2",
        "US11036767B2",
        "CN107479943B",
        "US11507947B1",
        "US11159671B2",
        "US11487730B2",
        "US11036690B2",
        "US11366941B2",
        "US10730526B2",
        "US11267481B2",
        "WO2019018442A1",
        "US11551195B2",
        "US20190028414A1",
        "US20190028909A1",
        "EP3655824A1",
        "US11068958B1",
        "US10505897B2",
        "US10721303B2",
        "US20190033811A1",
        "US11398299B2",
        "US11681667B2",
        "US10735273B2",
        "CA3072045A1",
        "US11442445B2",
        "US11775891B2",
        "US10599460B2",
        "US11316865B2",
        "US10546655B2",
        "US20190050780A1",
        "US10681185B1",
        "US11797877B2",
        "US20190065973A1",
        "US11025693B2",
        "US10313413B2",
        "US10581945B2",
        "US20190068455A1",
        "EP3451248A1",
        "US10855655B2",
        "WO2019051010A1",
        "CA3075754A1",
        "US11301491B2",
        "WO2019055647A1",
        "US20190079990A1",
        "US10949581B2",
        "EP3682373A4",
        "US10831890B2",
        "US10756990B1",
        "US10558541B1",
        "TWI653587B",
        "US11282021B2",
        "US10785102B2",
        "US11151137B2",
        "US10896182B2",
        "US10860618B2",
        "US10796350B2",
        "US10962945B2",
        "US11120012B2",
        "US20190095821A1",
        "US11070568B2",
        "US11314788B2",
        "US11367142B1",
        "US10778776B2",
        "US20200242513A1",
        "US20200279624A1",
        "US20190102841A1",
        "US10650001B2",
        "WO2019069144A1",
        "US10764169B2",
        "US10591301B2",
        "US10664317B2",
        "US10685034B2",
        "US11314601B1",
        "US11082296B2",
        "US11095502B2",
        "US10616168B2",
        "US10956843B2",
        "WO2019094729A1",
        "US10824608B2",
        "US10469600B2",
        "US10938950B2",
        "US11397726B2",
        "US10809682B2",
        "US11281169B2",
        "CN109814861A",
        "JP6649349B2",
        "US11127235B2",
        "US10963330B2",
        "US11126927B2",
        "US20190164094A1",
        "US10732948B2",
        "US10678936B2",
        "KR102071315B1",
        "US11055371B2",
        "US11010232B2",
        "US10693997B2",
        "US11068991B2",
        "US10862988B2",
        "WO2019125801A1",
        "US10726051B2",
        "US10921792B2",
        "US11676046B2",
        "US10769570B2",
        "EP3506615B1",
        "KR102035706B1",
        "US10719533B2",
        "US10817402B2",
        "WO2019139595A1",
        "US11561986B1",
        "WO2019142052A2",
        "US10805329B2",
        "US10951460B1",
        "US10997180B2",
        "US11038770B2",
        "US10585724B2",
        "CN110149353A",
        "CN108346003B",
        "US10262271B1",
        "US10812349B2",
        "US10755046B1",
        "CN114374581B",
        "US20190260831A1",
        "US10394628B1",
        "US20190266622A1",
        "US10664294B2",
        "US20190273649A1",
        "EP3762928A4",
        "BR112020014770A2",
        "US10721142B1",
        "CN110276503B",
        "CN108614690B",
        "US10860614B2",
        "US20190295001A1",
        "CN108510081A",
        "EP3769319B1",
        "US11010694B2",
        "CN108509184B",
        "US10728340B2",
        "US11568170B2",
        "CN110351315A",
        "US10790662B2",
        "US10900796B2",
        "US10897138B2",
        "CN108763289B",
        "CN109144562B",
        "US10990990B2",
        "US11334543B1",
        "US20190342297A1",
        "US10819584B2",
        "US11036751B2",
        "US10402397B1",
        "US11062036B2",
        "EP3570513A1",
        "US10944603B2",
        "US10686882B2",
        "US10540669B2",
        "US10620937B1",
        "CA3102116A1",
        "US11308232B2",
        "WO2019234297A1",
        "US10812409B2",
        "CN112640381A",
        "GB2574906B",
        "US10779340B2",
        "US20190389074A1",
        "US10706236B1",
        "US10817275B2",
        "US11354406B2",
        "US11321327B2",
        "US10936614B2",
        "US10922151B2",
        "US11104596B2",
        "WO2020251598A1",
        "US11190410B2",
        "US11626192B1",
        "US11482322B1",
        "US11177041B1",
        "US11501859B1",
        "US20200034926A1",
        "US11120366B2",
        "CN109086390B",
        "WO2020023998A1",
        "CN109062578B",
        "US20200042917A1",
        "US11352874B2",
        "CN109189599B",
        "US20200050766A1",
        "US11763950B1",
        "US11569981B1",
        "US10846651B2",
        "US10832196B2",
        "US11587683B2",
        "US20200081916A1",
        "US11520803B1",
        "US11366842B1",
        "US11182411B2",
        "WO2020061707A1",
        "US10775976B1",
        "US10761813B1",
        "US11647095B1",
        "PL3695585T3",
        "DK201870650A1",
        "US20210383333A1",
        "EP3637260A1",
        "US10750351B1",
        "US11681725B2",
        "WO2020077350A1",
        "US10805154B2",
        "KR102302631B1",
        "JP6956280B2",
        "US10936585B1",
        "US11019060B2",
        "US10983899B2",
        "CN111143232B",
        "AU2019372050B2",
        "US11392652B2",
        "CN109213787B",
        "US10439825B1",
        "CN109522120B",
        "EP3889857A4",
        "WO2020112349A1",
        "US11200250B2",
        "US11356440B2",
        "CN109587142B",
        "US11210578B2",
        "US11451571B2",
        "WO2020122902A1",
        "US11165774B2",
        "JP7059916B2",
        "US10747407B2",
        "US20200210310A1",
        "US11689573B2",
        "KR20200084268A",
        "US10705955B1",
        "WO2020142164A1",
        "US11665184B2",
        "US11436567B2",
        "US11334057B2",
        "US10887262B1",
        "US10788798B2",
        "US11250313B2",
        "US11797550B2",
        "CN111526171B",
        "US11017339B2",
        "US10819797B2",
        "US11349709B2",
        "JP7156082B2",
        "US10997187B2",
        "US10963518B2",
        "WO2020176535A1",
        "US11687617B2",
        "US11487586B2",
        "EP3935581A4",
        "US11263554B2",
        "US10877875B2",
        "US11675787B2",
        "US11368410B2",
        "WO2020191028A1",
        "CN110097953A",
        "US10841188B2",
        "US11392843B2",
        "US11625789B1",
        "US11316664B2",
        "US20200319857A1",
        "CN111796923A",
        "US11144226B2",
        "US11514089B2",
        "US10802815B1",
        "US11621085B1",
        "CN110058846B",
        "US11544216B2",
        "WO2020220216A1",
        "CN113227982A",
        "US11715051B1",
        "US11238469B1",
        "US11270077B2",
        "RU2731744C1",
        "US11041650B2",
        "CN110135817A",
        "US20200382524A1",
        "US11736508B2",
        "US11427224B2",
        "US11711374B2",
        "CN110363382A",
        "US11776060B2",
        "US20200387836A1",
        "US11216190B2",
        "US11032381B2",
        "KR20190082692A",
        "US11165962B2",
        "CN110287211B",
        "US11635990B2",
        "US11086754B2",
        "US11501881B2",
        "US20210005207A1",
        "WO2021006778A1",
        "US11308428B2",
        "US10942728B2",
        "US10958560B2",
        "WO2021009925A1",
        "US10963828B2",
        "US10904100B1",
        "US10810528B1",
        "US11288728B2",
        "US11256608B2",
        "KR102214060B1",
        "CN110519816B",
        "US11328205B2",
        "US11240294B2",
        "US11645344B2",
        "US11580131B2",
        "EP4026028A4",
        "KR20210030106A",
        "US10992534B2",
        "WO2021050816A1",
        "CN110782122A",
        "US11605023B2",
        "US11763233B2",
        "JP6847382B1",
        "US20210105625A1",
        "US10956833B1",
        "US20210112128A1",
        "US11182142B2",
        "US11556507B2",
        "US11489745B2",
        "US20210117882A1",
        "US20210117860A1",
        "US11494380B2",
        "US11044620B2",
        "US11803940B2",
        "US11775353B2",
        "CN110795088B",
        "US11463478B2",
        "US11068742B2",
        "US11188758B2",
        "US20220277331A1",
        "US20210136220A1",
        "JP2023500378A",
        "EP4055551A1",
        "US20210133650A1",
        "US11726752B2",
        "US11442749B2",
        "CN110874718A",
        "US20210149886A1",
        "US10904038B1",
        "US20210158259A1",
        "US11349859B2",
        "US11270785B1",
        "TWI730530B",
        "CN110888867B",
        "US11238129B2",
        "CN111080479B",
        "US20210182307A1",
        "CA3159291A1",
        "EP4078489A1",
        "US11265227B2",
        "US20210201236A1",
        "CN115210700A",
        "US11734269B2",
        "CN111131501B",
        "US11663617B2",
        "US11334725B2",
        "CN111222790B",
        "US11403347B2",
        "US11509619B2",
        "US11409546B2",
        "US11736615B2",
        "US11070670B1",
        "CN111324635A",
        "US11327962B1",
        "US11443264B2",
        "US11741393B2",
        "US11748350B2",
        "CN111339298A",
        "US11605012B2",
        "US10846106B1",
        "US11418595B2",
        "US11741437B2",
        "US20210294317A1",
        "US20210294848A1",
        "US11531687B2",
        "US11461488B2",
        "CN111459541B",
        "KR102408152B1",
        "US11237752B2",
        "US11392960B2",
        "US11481785B2",
        "US10997195B1",
        "US11614923B2",
        "US11514119B2",
        "US11461349B2",
        "TW202143139A",
        "US20210365449A1",
        "US20210382807A1",
        "US11455199B2",
        "KR102188132B1",
        "US11539529B2",
        "US11763178B2",
        "US11115799B1",
        "US11327663B2",
        "US11068254B1",
        "US11556563B2",
        "US11595288B2",
        "US11526388B2",
        "US11625737B2",
        "US20210406964A1",
        "WO2022003692A1",
        "CN111784353A",
        "US11539796B2",
        "CN111737234A",
        "US11095506B1",
        "US11231913B1",
        "US11526825B2",
        "WO2022022806A1",
        "CN111782205A",
        "US11803792B2",
        "US11726846B2",
        "US11645247B2",
        "CN112215454B",
        "CN111984436A",
        "US20220067756A1",
        "WO2022043976A1",
        "US20220067626A1",
        "US11212195B1",
        "US11397773B2",
        "US20220109728A1",
        "US11367021B2",
        "US20220114333A1",
        "EP4229518A1",
        "US11704313B1",
        "CN112217837B",
        "CN112291239B",
        "US11392573B1",
        "US11640565B1",
        "US11726764B2",
        "US11665221B2",
        "US11615660B2",
        "WO2022108542A1",
        "CN112418439B",
        "US11314584B1",
        "CN112463147B",
        "US11113269B1",
        "US11645624B2",
        "WO2022124877A1",
        "CN112543134B",
        "US11663192B2",
        "AU2021409790A1",
        "US11777799B2",
        "CN112529335B",
        "IT202000032585A1",
        "US11675650B2",
        "US11397629B1",
        "US11556558B2",
        "US11074142B1",
        "US20220232069A1",
        "CN112765143B",
        "US11741119B2",
        "CN112817578B",
        "AU2021200533A1",
        "US11650995B2",
        "US11080294B1",
        "US20220250656A1",
        "TWI742999B",
        "US11711348B2",
        "US11736585B2",
        "US20220283995A1",
        "US11729071B1",
        "RU2761136C1",
        "US11477285B2",
        "US11687487B1",
        "WO2022197294A1",
        "US11748917B2",
        "US20220309079A1",
        "CN113194041B",
        "WO2022212916A1",
        "US20220318670A1",
        "US20220317635A1",
        "US11663219B1",
        "CN113259265B",
        "US20220358162A1",
        "US11550555B2",
        "WO2022236323A1",
        "US20220358115A1",
        "CN113159731A",
        "US20220366500A1",
        "CN113392104B",
        "US11269752B1",
        "US11368539B1",
        "US20220383341A1",
        "US11294929B1",
        "US20220398288A1",
        "US20220405609A1",
        "US11575536B2",
        "US11769066B2",
        "US11720400B2",
        "CN113596619A",
        "US20220405775A1",
        "US11354599B1",
        "US20230004573A1",
        "US20230004474A1",
        "CN113591925B",
        "US11677875B2",
        "US20230012177A1",
        "US20230016863A1",
        "CN113645142A",
        "US11687399B2",
        "WO2023002379A1",
        "US20230023922A1",
        "US20230036483A1",
        "WO2023009195A1",
        "US20230033681A1",
        "US11790300B2",
        "US11748075B2",
        "US11403072B1",
        "US20230047463A1",
        "US20210377130A1",
        "US20230056637A1",
        "US20230065744A1",
        "US11558239B1",
        "WO2023039212A1",
        "US11477208B1",
        "US11354430B1",
        "WO2023049232A1",
        "CN113570002A",
        "US20230100315A1",
        "US11789781B1",
        "US11438437B1",
        "US20230123231A1",
        "US11552975B1",
        "US11770307B2",
        "US11796974B2",
        "US20230161795A1",
        "US11704311B2",
        "US11714930B2",
        "WO2023114402A1",
        "CN113934735B",
        "US20230206233A1",
        "CN113992646B",
        "US20230217273A1",
        "US20230247089A1",
        "US20230237052A1",
        "CN114443695A",
        "US20230281213A1",
        "US20230252390A1",
        "US20230269272A1",
        "US20230281212A1",
        "CN114629783A",
        "WO2023178260A1",
        "WO2023186274A1",
        "CN114810644B",
        "US20230315763A1",
        "US11736616B1",
        "CN115330281B",
        "CN115422305A",
        "CN115808911B",
        "CN116008714B",
        "CN116561540B"
    ]
}