{
    "patent_id": "US-10963493-B1",
    "title": "Interactive game with robot system ",
    "assignee": "AIBrain Corporation",
    "publication_date": "2021-03-30",
    "patent_link": "https://patents.google.com/patent/US10963493B1/en",
    "inventors": [
        "Yi Hu",
        "Run Cui",
        "Hong Shik Shinn"
    ],
    "classifications": [
        "G06F40/211",
        "G05D1/0016",
        "G05D1/021",
        "G05D1/0221",
        "G06F16/3329",
        "G06F18/254",
        "G06F40/289",
        "G06F40/30",
        "G06F40/40",
        "G06F40/56",
        "G06K9/00268",
        "G06K9/00302",
        "G06N3/008",
        "G06N3/042",
        "G06N3/045",
        "G06N3/08",
        "G06N3/088",
        "G06N5/022",
        "G06N5/041",
        "G06V10/764",
        "G06V10/809",
        "G06V10/82",
        "G06V20/10",
        "G06V40/168",
        "G06V40/174",
        "G06N20/00",
        "G06N5/01",
        "G06V40/161"
    ],
    "abstract": "A system comprises a motor and a base. The motor is configured to control the physical movement of the system and the base is configured to be coupled with a computing device. The computing device is configured to receive an indication of a target object and detect an obstacle object in a physical environment of the system. In response to detecting an obstacle object, the computing device provides to a user an inquiry associated with the detected obstacle object and receives a natural language response. Based at least in part on the natural language response, the computing device controls the motor to navigate the system around the detected obstacle object. Once the target object is detected, the computing device provides an indication that the target object has been located.",
    "claims": "\n1. A system, comprising:\na motor configured to control a physical movement of the system; and\na base configured to be coupled with a computing device;\nwherein the computing device is configured to:\nreceive an indication of a target object;\ndetect an obstacle object in a physical environment of the system;\nin response to a detection of the detected obstacle object, provide to a user an inquiry associated with the detected obstacle object;\nreceive a natural language response to the inquiry;\ncontrol the motor to navigate the system around the detected obstacle object based at least in part on the natural language response;\ndetect the target object;\nprovide an indication that the target object has been located; and\nrecognize a facial expression response to the indication that the target object has been located.\n2. The system of claim 1, wherein the target object is a human face.\n3. The system of claim 1, wherein the computing device is a smartphone device.\n4. The system of claim 1, wherein the inquiry associated with the detected obstacle object is determined using a reasoning engine.\n5. The system of claim 4, wherein the reasoning engine is installed on a remote computer server accessible via a network connection of the computing device.\n6. The system of claim 5, wherein the reasoning engine is an adaptive interactive cognitive reasoning engine utilizing an artificial intelligence memory graph data structure.\n7. The system of claim 1, wherein the natural language response to the inquiry is used to generate an action command sequence determined by a reasoning engine and the action command sequence is used to control the motor to navigate the system around the detected obstacle object.\n8. The system of claim 1, wherein the inquiry associated with the detected obstacle object is one of a set of pre-defined inquiries configured for a reasoning engine.\n9. The system of claim 1, wherein the computing device is further configured to receive a second natural language response in response to the indication that the target object has been located.\n10. The system of claim 1, wherein the facial expression response is used to confirm that the target object has been located.\n11. The system of claim 1, wherein the detected obstacle object is detected using a vision module configured to process an image captured by a camera of the computing device.\n12. The system of claim 1, wherein the computing device includes a camera and a microphone.\n13. The system of claim 1, wherein the base includes a distance measurement sensor.\n14. The system of claim 13, wherein the distance measurement sensor is configured to approximate the distance from the base to the detected obstacle object.\n15. The system of claim 13, wherein the computing device is configured to control the distance measurement sensor.\n16. The system of claim 1, wherein the computing device is further configured to register a facial identity associated with a human player.\n17. The system of claim 16, wherein the computing device is further configured to identify the human player using facial identification, wherein identifying the human player includes comparing the registered facial identity with extracted facial identification features.\n18. A method, comprising:\nexecuting an interactive game on a mobile computing device, wherein the mobile computing device is coupled with a base and the base includes a motor configured to control the physical movement of the base;\nreceiving an indication of a target object;\ndetecting an obstacle object in a physical environment of the interactive game;\nin response to the detection of the obstacle object, providing to a user an inquiry associated with the detected obstacle object;\nreceiving a natural language response to the inquiry;\ncontrolling the motor to navigate the base around the detected obstacle object based at least in part on the natural language response;\ndetecting the target object;\nproviding an indication that the target object has been located; and\nrecognizing a facial expression response to the indication that the target object has been located.\n19. The method of claim 18, wherein the base includes a distance measurement sensor.\n20. A computer program product embodied in a non-transitory computer readable medium and comprising computer instructions for:\nexecuting an interactive game on a mobile computing device, wherein the mobile computing device is coupled with a base and the base includes a motor configured to control the physical movement of the base;\nreceiving an indication of a target object;\ndetecting an obstacle object in a physical environment of the interactive game;\nin response to the detection of the obstacle object, providing to a user an inquiry associated with the detected obstacle object;\nreceiving a natural language response to the inquiry;\ncontrolling the motor to navigate the base around the detected obstacle object based at least in part on the natural language response;\ndetecting the target object;\nproviding an indication that the target object has been located; and\nrecognizing a facial expression response to the indication that the target object has been located."
}