{
    "patent_link": "https://patents.google.com/patent/US20050286772A1/en",
    "patent_id": "US20050286772A1",
    "title": "Multiple classifier system with voting arbitration",
    "abstract": "Systems and methods are provided for classifying a subject into one of a plurality of output classes. An input pattern representing the subject is classified at a plurality of pattern recognition classifiers to obtain a ranked set of at least two classifier outputs at each classifier. A classifier output includes an associated output class, output score, and ranking. Each classifier output is mapped to a corresponding weight value according to its associated output class, output score, and ranking. The weight values for the classifier outputs are combined according to a voting algorithm to determine an output class associated with the subject.",
    "inventors": [
        "Lawrence Albertelli"
    ],
    "assignee": "Lockheed Martin Corp",
    "classifications": [],
    "claims": "\n1. A method of classifying a subject into one of a plurality of output classes, comprising:\nclassifying an input pattern representing the subject at a plurality of pattern recognition classifiers to obtain a ranked set of at least two classifier outputs at each classifier, a classifier output including an associated output class, output score range, and ranking;\nmapping each classifier output to a corresponding weight value according to its associated output class, output score range, and ranking; and\ncombining the weight values for the classifier outputs according to a voting algorithm to determine an output class associated with the subject.\n2. The method of claim 1, wherein combining the weight values according to a voting algorithm comprises combining the weight values via a sum rule voting algorithm.\n3. The method of claim 1, the weight value for a given classifier output representing the conditional probability that the associated class of the classifier output is the class associated with the subject given the associated class, output score, and ranking of the classifier output.\n4. The method of claim 1, each of the plurality of classifiers receiving an input pattern representing the subject from an associated sensor.\n5. The method of claim 1, further comprising selecting the output class having the largest combined weight value.\n6. The method of claim 1, wherein combining the weight values according to a voting algorithm comprises combining the weight values via a product rule voting algorithm.\n7. A method for generating output mapping weights for a classifier in a multiple classifier system, comprising\ntraining the classifier on a plurality of training patterns;\nclassifying a plurality of test patterns, each test pattern having a known class membership, to obtain a ranked set of at least two classifier outputs for each test pattern, a given classifier output including an associated output class, an associated output score range from a plurality of defined output score ranges, and an associated ranking;\nsorting the classifier outputs into a plurality of categories based on associated output classes, output score ranges, and rankings to generate at least two confusion matrices from the classifier outputs; and\ngenerating weight values for at least one defined category of classifier outputs from at least two confusion matrices.\n8. The method of claim 7, further comprising constructing a look-up table from the generated weight values, the look-up table providing a weight value for a given classifier output from the classifier based upon its associated class, output score, and ranking.\n9. The method of claim 7, wherein the plurality of output score ranges include a plurality of boundaries defining the ranges, the boundaries being determined according to the distribution of the test results such that each output score range contains an equal number of test samples for a given combination of output class and ranking from a plurality of available output classes and rankings.\n10. The method of claim 9, wherein the plurality of boundaries are different for each combination of output class and ranking.\n11. A computer program product, recorded in a computer readable medium and operative in a data processing system, for classifying an input pattern into one of a plurality of output classes, comprising:\na plurality of pattern recognition classifiers, each classifier classifying the input pattern to obtain a ranked set of at least two classifier outputs, wherein a given classifier output includes an associated output class, output score range, and ranking;\na plurality of output mapping components, each output mapping component being associated with one of the pattern recognition classifiers and operative to map each output from the set of at least two classifier outputs from its associated classifier to a corresponding weight value according to its associated output class, output score range, and ranking; and\nan arbitrator that combines the weight values for the classifier outputs according to a voting algorithm to determine an output class associated with the input pattern.\n12. The computer program product of claim 11, wherein at least one of the plurality of output mapping components comprises a look-up table, the look-up table providing a weight value for a given classifier output according to its associated output class, output score, and ranking.\n13. The computer program product of claim 11, the voting algorithm comprising a Borda count algorithm.\n14. The computer program product of claim 11, at least one of the pattern recognition classifiers comprising a neural network classifier.\n15. The computer program product of claim 11, the input pattern comprising at least one alphanumeric text character.\n16. The computer program product of claim 15, further comprising a digital camera that acquires a block of text as a digital image for analysis.\n17. The computer program product of claim 16, comprising a segmentation component that segments an alphanumeric character from the block of text.\n18. The computer program product of claim 11, further comprising a plurality of feature extractors, each feature extractor being associated with one of the pattern recognition classifiers, that extract feature data from the input pattern and provide the feature data to their respective associated classifiers.\n19. A computer program product, recorded in a computer readable medium and operative in a data processing system, for generating output mapping weights in a multiple classifier system, comprising\na pattern recognition classifier that classifies a plurality of test patterns, each test pattern having a known class membership, to obtain a ranked set of at least two classifier outputs for each test pattern, a given classifier output including an associated output class, an associated output score range from a plurality of output score ranges, and an associated ranking;\na matrix generation component that sorts the classifier outputs into a plurality of categories based on associated output classes, output score ranges, and rankings to generate at least two confusion matrices from the classifier outputs; and\na weight generation component that generates weighting values for at least one defined category of classifier outputs from at least two confusion matrices.\n20. The computer program product of claim 19, wherein the weight generation component generates a look-up table from the generated weighing values.\n21. The computer program product of claim 19, further comprising an output mapping component associated with the classifier, the output mapping component receiving the generated weight values from the weight generation component.\n22. The method of claim 19, wherein the plurality of output score ranges include a plurality of boundaries defining the ranges, the boundaries being determined according to the distribution of the test results such that each output score range contains an equal number of test samples for a given combination of output class and ranking from a plurality of available output classes and rankings.\n23. The method of claim 19, wherein the plurality of boundaries are different for each combination of output class and ranking.",
    "status": "Abandoned",
    "citations_own": [
        "US6181829B1",
        "US6185328B1",
        "US20020159642A1",
        "US20020186885A1",
        "US6496184B1",
        "US20040076344A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20060120609A1",
        "US20070104384A1",
        "US20070174272A1",
        "WO2007101132A2",
        "US20080154807A1",
        "US20080300833A1",
        "US20090248690A1",
        "US20100054539A1",
        "US20110002531A1",
        "US20110190599A1",
        "GB2478371A",
        "US20110255751A1",
        "US20110274345A1",
        "WO2011142651A1",
        "US20120123978A1",
        "WO2012103625A1",
        "US20140122381A1",
        "US8992446B2",
        "US9053350B1",
        "WO2015113635A1",
        "US9230104B2",
        "US9240184B1",
        "US9407646B2",
        "US9450972B2",
        "US9559918B2",
        "US9641542B2",
        "US20170270484A1",
        "US10038713B2",
        "US10318554B2",
        "US10454785B2",
        "JP2020035097A",
        "US10936868B2",
        "US10943099B2",
        "US11756677B2"
    ],
    "citedby_ftf": []
}