{
    "patent_link": "https://patents.google.com/patent/US6499030B1/en",
    "patent_id": "US6499030B1",
    "title": "Apparatus and method for information retrieval, and storage medium storing program therefor",
    "abstract": "A user inputs a retrieval query represented by a set of propositions using a modal operator through an interface. The retrieval query is passed to a document set gathering unit through a retrieval input unit. The document set gathering unit refers to an index, gathers a set of documents having a true proposition, and writes it to a work area. A similarity computation unit computes the similarity of the gathered set of documents and writes it to the work area. The retrieval result output unit refers to the work area, ranks the gathered sets of documents in consideration of a true/false value and a similarity, and the ranking result to the interface as a retrieval result. A common keyword extraction unit extracts a keyword for output from the ranked sets of documents, and outputs the keyword after adding a corresponding modal operator to the keyword to the interface.",
    "inventors": [
        "Nobuyuki Igata"
    ],
    "assignee": "Fujitsu Ltd",
    "classifications": [
        "G06F16/3341",
        "Y10S707/99936"
    ],
    "claims": "\n1. An information retrieval apparatus retrieving a document corresponding to a retrieval query inputted by a user from a document database, comprising:\n2. The apparatus according to claim 1, wherein\n3. The apparatus according to claim 2, wherein\n4. The apparatus according to claim 2, wherein\n5. The apparatus according to claim 1, further comprising:\n6. The apparatus according to claim 5, wherein:\n7. The apparatus according to claim 5, wherein\n8. The apparatus according to claim 5, wherein\n9. An information retrieval apparatus retrieving a document database corresponding to a retrieval query inputted by a user from a plurality of document databases, comprising:\n10. The apparatus according to claim 9, further comprising:\n11. The apparatus according to claim 9, wherein the name. said necessity/possibility condition discrimination unit determines a document database satisfying a necessity condition in which the proposition is true in all stored documents if the modal operator added to the proposition is a necessity operator.\n12. The apparatus according to claim 11, further comprising:\n13. The apparatus according to claim 9, wherein\n14. The apparatus according to claim 13, further comprising:\n15. The apparatus according to claim 13, wherein\n16. The apparatus according to claim 15, further comprising:\n17. An information retrieval method for retrieving a document corresponding to a retrieval query inputted by a user from a document database, comprising:\n18. The method according to claim 17, wherein\n19. The method according to claim 18, wherein\n20. The method according to claim 18, wherein\n21. The method according to claim 17, further comprising:\n22. The method according to claim 21, wherein:\n23. The method according to claim 21, wherein\n24. The method according to claim 21, wherein\n25. An information retrieval method for retrieving a document database corresponding to a retrieval query inputted by a user from a plurality of document databases, comprising:\n26. The method according to claim 25, further comprising:\n27. The method according to claim 25, wherein\n28. The method according to claim 27, further comprising:\n29. The method according to claim 25, wherein\n30. The method according to claim 29, further comprising:\n31. The method according to claim 29, wherein\n32. The method according to claim 31, further comprising:\n33. A computer-readable storage medium storing a program used to direct a computer to perform:\n34. The storage medium according to claim 33, wherein\n35. The storage medium according to claim 34, wherein\n36. The storage medium according to claim 34, wherein\n37. The storage medium according to claim 33, wherein\n38. The storage medium according to claim 37, wherein:\n39. The storage medium according to claim 38, wherein\n40. The storage medium according to claim 37, wherein\n41. A computer-readable storage medium storing a program used to direct a computer to perform:\n42. The storage medium according to claim 41, wherein\n43. The storage medium according to claim 41, wherein\n44. The storage medium according to claim 41, wherein\n45. The storage medium according to claim 41, wherein\n46. The storage medium according to claim 45, wherein\n47. The storage medium according to claim 41, wherein said program further directs said computer to determine, in said (c), a document database satisfying a necessity condition in which the proposition is true in all stored documents although the modal operator added to the proposition is a possibility operator.\n48. The storage medium according to claim 47, said program further directs said computer to perform\n49. An information retrieval apparatus retrieving a document corresponding to a retrieval query inputted by a user from a document database, comprising:\n50. The apparatus according to claim 49, further comprising:\n51. An information retrieval apparatus retrieving a document database corresponding to a retrieval query inputted by a user from a plurality of document databases, comprising:\n52. The Apparatus according to claim 51, further comprising:",
    "status": "Expired - Lifetime",
    "citations_own": [
        "JPH03130873A",
        "JPH03172966A",
        "JPH06162101A",
        "US5377309A",
        "JPH07225772A",
        "US5481700A",
        "JPH09153066A",
        "JPH1013407A",
        "US5778150A",
        "US5870740A",
        "US5907840A",
        "US6076088A",
        "US6240439B1",
        "US6314410B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20030187834A1",
        "US20040030686A1",
        "US20060020571A1",
        "US20060031195A1",
        "US20060106792A1",
        "US20060129595A1",
        "US20060206483A1",
        "US20060218137A1",
        "US20060277208A1",
        "US20070143266A1",
        "US20070162379A1",
        "US20070263574A1",
        "US7412374B1",
        "US7426507B1",
        "US20080319971A1",
        "US20090070312A1",
        "US20090083832A1",
        "US7536408B2",
        "US7580921B2",
        "US7657548B2",
        "US7660843B1",
        "US20100070495A1",
        "US7693813B1",
        "US7702614B1",
        "US7702618B1",
        "US7711679B2",
        "US20110004628A1",
        "US20110016113A1",
        "US7890639B1",
        "US7925655B1",
        "US7987421B1",
        "US8036937B2",
        "US20110289074A1",
        "US8086594B1",
        "US8166021B1",
        "US8166045B1",
        "US9483568B1",
        "US9501506B1",
        "US10475082B2"
    ],
    "citedby_ftf": [
        "JP5308199B2",
        "JP5265420B2",
        "CN108897785A"
    ]
}