{
    "patent_id": "US-9146987-B2",
    "title": "Clustering based question set generation for training and testing of a question and answer system ",
    "assignee": "International Business Machines Corporation",
    "publication_date": "2015-09-29",
    "patent_link": "https://patents.google.com/patent/US9146987B2/en",
    "inventors": [
        "Christopher S. Alkov",
        "Suzanne L. Estrada",
        "Peter F. Haggar",
        "Kevin B. Haverlock"
    ],
    "classifications": [
        "G06F16/35",
        "G06F17/30705",
        "G06N5/041",
        "G06N20/00"
    ],
    "abstract": "Mechanisms for selecting questions for a cluster of questions to be used with a question and answer (QA) system are provided. An input question is received and analyzed to identify at least one feature of the input question. Clustering of the input question with one or more other questions in a cluster of questions based on the at least one feature of the input question is performed. Based on results of the clustering, a determination is made as to whether to include or reject the input question as part of the cluster of questions. In response to determining to include the input question as part of the cluster of questions, the cluster of questions is updated to include the input question. The updated cluster of questions is stored in a storage device associated with a data processing system.",
    "claims": "\n1. A method, in a data processing system comprising a processor and a memory, for selecting questions for a cluster of questions to be used with a question and answer (QA) system, the method comprising:\nreceiving, in the data processing system, an input question;\nanalyzing, by the data processing system, the input question to identify at least one feature of the input question;\nperforming, by the data processing system, clustering of the input question with one or more other questions in a cluster of questions based on the at least one feature of the input question, wherein performing clustering of the input question with the one or more other questions in the cluster of questions comprises calculating a distance metric between the at least one feature of the input question and a similar feature of a center of the cluster of questions;\ndetermining, by the data processing system, based on results of the clustering, whether to include or reject the input question as part of the cluster of questions, wherein determining whether to include or reject the input question as part of the cluster of questions comprises comparing the distance metric to one or more threshold distance values;\nin response to determining to include the input question as part of the cluster of questions, updating, by the data processing system, the cluster of questions to include the input question; and\nstoring, by the data processing system, the updated cluster of questions in a storage device associated with the data processing system.\n2. The method of claim 1, wherein the at least one feature of the input question comprises at least one of a focus of the input question, a lexical answer type (LAT) of the input question, a question classification (QClass) of the input question, or a question section (QSection) of the input question.\n3. The method of claim 1, wherein performing clustering of the input question with the one or more other questions in the cluster of questions comprises clustering the input question with one or more other questions based on a degree of similarity between features of the one or more other questions and that at least one feature of the input question.\n4. The method of claim 1, wherein the cluster of questions is one cluster of a plurality of clusters of questions, and wherein different threshold distance values are associated with different clusters in the plurality of clusters of questions.\n5. The method of claim 1, wherein a plurality of threshold distance values are provided, and wherein it is determined to accept the input question as part of the cluster of questions in response to a determination that the distance metric is greater than a first threshold distance value and less than a second threshold distance value.\n6. The method of claim 1, wherein determining whether to include or reject the input question as part of the cluster of questions comprises determining to reject the input question in response to the distance metric being equal to or less than a threshold distance value.\n7. The method of claim 1, wherein determining whether to include or reject the input question as part of the cluster of questions comprises determining to reject the input question in response to the distance metric being equal to or greater than a threshold distance value.\n8. The method of claim 1, further comprising:\nin response to a determination to reject the input question as part of the cluster of questions, including the input question in a second cluster of questions.\n9. The method of claim 8, wherein the collection of questions is a training set of questions used to train the QA system, and wherein the second cluster of questions is a testing set of questions for testing the QA system after the QA system has been trained using the training set of questions.\n10. The method of claim 9, further comprising:\ntraining the QA system using the training set of questions; and\ntesting the QA system using the testing set of questions.\n11. The method of claim 10, wherein each cluster in the plurality of clusters is associated with a different domain of subject matter handled by the QA system.\n12. The method of claim 10, wherein each cluster in the plurality of clusters is used to train a separate instance of a pipeline in the QA system.\n13. The method of claim 1, wherein the cluster of questions is one cluster of a plurality of clusters of questions.\n14. The method of claim 1, wherein the cluster of questions is one cluster of a plurality of clusters of questions, each cluster of questions representing a grouping of questions having similar features, and wherein the clustering associates the input question with one or more of the clusters in the plurality of clusters.\n15. The method of claim 1, wherein the cluster of questions is a training set of questions for training the QA system, and wherein the input question is accepted as part of the cluster of questions in response to a determination that the at least one feature of the input question is sufficiently similar to features of questions of at least one cluster of questions in a plurality of clusters of questions.\n16. The method of claim 1, wherein the input question is selected from a question pool comprising questions for training the QA system and questions for testing the QA system, and wherein the performing of the clustering of the input question with one or more other questions in a cluster of questions selects the input question for inclusion in either a training set of questions for training the QA system or a testing set of questions for testing the QA system.\n17. The method of claim 16, wherein the input question is selected from the question pool in an automated manner using one of an arbitrary selection operation or a selection operation based on predefined criteria.\n18. A computer program product comprising a non-transitory computer readable medium having a computer readable program stored therein, wherein the computer readable program, when executed on a computing device, causes the computing device to:\nreceive an input question;\nanalyze the input question to identify at least one feature of the input question;\nperform clustering of the input question with one or more other questions in a cluster of questions based on the at least one feature of the input question, wherein performing clustering of the input question with the one or more other questions in the cluster of questions comprises calculating a distance metric between the at least one feature of the input question and a similar feature of a center of the cluster of questions;\ndetermine, based on results of the clustering, whether to include or reject the input question as part of the cluster of questions, wherein determining whether to include or reject the input question as part of the cluster of questions comprises comparing the distance metric to one or more threshold distance values;\nin response to determining to include the input question as part of the cluster of questions, updating, by the data processing system, the cluster of questions to include the input question; and\nstore the updated cluster of questions in a storage device associated with the data processing system.\n19. An apparatus comprising:\na processor; and\na memory coupled to the processor, wherein the memory comprises instructions which, when executed by the processor, cause the processor to:\nreceive an input question;\nanalyze the input question to identify at least one feature of the input question;\nperform clustering of the input question with one or more other questions in a cluster of questions based on the at least one feature of the input question, wherein performing clustering of the input question with the one or more other questions in the cluster of questions comprises calculating a distance metric between the at least one feature of the input question and a similar feature of a center of the cluster of questions;\ndetermine, based on results of the clustering, whether to include or reject the input question as part of the cluster of questions, wherein determining whether to include or reject the input question as part of the cluster of questions comprises comparing the distance metric to one or more threshold distance values;\nin response to determining to include the input question as part of the cluster of questions, updating, by the data processing system, the cluster of questions to include the input question; and\nstore the updated cluster of questions in a storage device associated with the data processing system.",
    "status": "Active",
    "citations_own": [
        "US5960422A",
        "US6424971B1",
        "US6523036B1",
        "US6591405B1",
        "US6804670B2",
        "US20040267607A1",
        "US6904428B2",
        "US20050143999A1",
        "US6993517B2",
        "US20060277165A1",
        "US20070192308A1",
        "US7349899B2",
        "US7398270B1",
        "US20090112828A1",
        "US20090287678A1",
        "US20090292687A1",
        "US7636730B2",
        "US20090327279A1",
        "US20100030769A1",
        "US20100076978A1",
        "US20100106723A1",
        "US7720870B2",
        "US7809660B2",
        "US7840556B1",
        "US20110066587A1",
        "US20110103353A1",
        "US20110125734A1",
        "EP2328135A1",
        "US20110218947A1",
        "US20110219002A1",
        "US20110246465A1",
        "US8108392B2",
        "US20120030157A1",
        "US20120301864A1",
        "US20130007055A1",
        "US20130018652A1",
        "US20130018876A1",
        "US20130024457A1",
        "US20130066886A1",
        "US8510236B1",
        "US20130262500A1",
        "US20140075334A1",
        "US20140161416A1",
        "US20140172883A1",
        "US20140358631A1"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "US9213748B1",
        "US9529824B2",
        "US9396263B1",
        "US20150170084A1",
        "US9396236B1",
        "US10503786B2",
        "US10216802B2",
        "US10380257B2",
        "CN106803092B",
        "US10699215B2",
        "CN108733712B",
        "CN107092692A",
        "KR101853091B1",
        "JP6695835B2",
        "CN110399547B",
        "CN109446520B",
        "CN111382263B",
        "US11687796B2",
        "CN110442692A",
        "US11379670B1",
        "CN110837559B",
        "CN111125387B",
        "CN111143565A",
        "US11188991B2",
        "CN111368060B",
        "CN113111157B"
    ]
}