{
    "patent_link": "https://patents.google.com/patent/US6181829B1/en",
    "patent_id": "US6181829B1",
    "title": "Method and system for classifying and processing of pixels of image data",
    "abstract": "A system and method classify a pixel of image data as one of a plurality of image types. A first image characteristic value for the pixel, a second image characteristic value for the pixel ,a third image characteristic value for the pixel, and a fourth image characteristic for the pixel is determined. Some of these determinations may be resolution dependent. The values from these determination are utilized in assigning an image type classification to the pixel. Moreover, if at least one of the image characteristic values is greater than a predetermined threshold value the pixel is classified as a halftone peak value. The system includes a plurality of microclassifiers for determining a distinct image characteristic value of the pixel; a plurality of macroreduction circuits connected to the plurality of microclassifiers for performing further higher level operations upon the distinct image characteristic values of the pixel to produce reduced values; and a classification circuit to classify the pixel as an image type based on the reduced values from the macroreduction circuits. The system also includes a circuit to detect flat peaks without detecting multiple peaks and a rectangular blur filtering system.",
    "inventors": [
        "Raymond J. Clark",
        "Leon C. Williams",
        "Stuart A. Schweid",
        "Jeng-Nan Shiau"
    ],
    "assignee": "Xerox Corp",
    "classifications": [],
    "claims": "\n1. A method for determining a halftone frequency of a pixel of image data in a window of pixels, comprising the steps of:\n2. A system for determining a halftone frequency of a pixel of image data in a window of pixels, comprising:\n3. The system as claimed in claim 2, wherein said first filter means comprises:\n4. The system as claimed in claim 2, wherein said second filter means comprises:\n5. The system as claimed in claim 3, wherein said first filter means comprises:\n6. The system as claimed in claim 2, wherein said peak count means includes an adder.\n7. A printing system for rendering a pixel of image data, comprising:\n8. The system as claimed in claim 7, wherein said first filter means comprises:\n9. The system as claimed in claim 7, wherein said second filter means comprises:\n10. The system as claimed in claim 8, wherein said first filter means comprises:\n11. The system as claimed in claim 7, wherein said peak count means includes an adder.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4288821A",
        "US4447830A",
        "US5343309A",
        "US5485289A",
        "US5550569A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6347153B1",
        "US6529291B1",
        "US20030043389A1",
        "US20040096102A1",
        "US20040114185A1",
        "US20040150844A1",
        "US6775032B2",
        "US20040202367A1",
        "US6832217B1",
        "US20050058364A1",
        "US20050163374A1",
        "US20050254717A1",
        "US20050271277A1",
        "US20050286772A1",
        "US20060132850A1",
        "US20080239401A1",
        "US20090214131A1",
        "US20090244577A1",
        "US20090251129A1",
        "US20090257675A1",
        "US20090257673A1",
        "US20090257674A1",
        "US20100046856A1",
        "US20100290089A1",
        "US20100295535A1",
        "US20100295537A1",
        "US20100295536A1",
        "US20110050352A1",
        "US20110084687A1",
        "US7965413B2",
        "US8538152B2",
        "US8542925B2",
        "US8718961B2",
        "US20150063713A1",
        "US9026403B2",
        "US9288364B1",
        "US10616447B1",
        "WO2021139178A1",
        "US11087428B2"
    ],
    "citedby_ftf": []
}