{
    "patent_id": "US-8868468-B2",
    "title": "Intelligent decision supporting system and method for making intelligent decisions and classifying text using classifiers trained to define different semantic standards ",
    "assignee": "Samsung Electronics Co., Ltd., Samsung Electronics (China) R&D Center",
    "publication_date": "2014-10-21",
    "patent_link": "https://patents.google.com/patent/US8868468B2/en",
    "inventors": [
        "Ge Peng",
        "Ying Jiang",
        "Jin Wang",
        "Sipei LIU"
    ],
    "classifications": [
        "G06F40/30",
        "G06N5/04",
        "G06N20/00",
        "G06N5/02",
        "G06N5/022",
        "G06N5/025",
        "G06N5/041"
    ],
    "abstract": "An intelligent decision system and a method for making an intelligent decision are provided. The intelligent decision supporting system includes a multi-dimensional classifier comprising a plurality of classifiers that define different semantic standards and are trained based on the different semantic standards, for classifying a text by the semantic standards and for outputting a plurality of attributes of the text and a confidence rate of each of the plurality of attributes, a question submitting module for receiving the output of the multi-dimensional classifier, for forming a question based on the plurality of attributes of the text and the confidence rate of each attribute, and for submitting the question to an inference machine, the inference machine for receiving the question submitted by the question submitting module, for inquiring of a domain ontology knowledge library based on the question, and for providing an answer for the question to an decision reply module.",
    "claims": "\n1. An intelligent decision supporting system, the system comprising:\nat least one controller configured to execute one or more modules; and\na storage unit for storing the one or more modules,\nwherein the one or more modules comprises:\na multi-dimensional classifier module, comprising a plurality of classifiers that define different semantic standards and are trained based on the different semantic standards, for classifying a text by the semantic standards and for outputting a plurality of attributes of the text and a confidence rate of each of the plurality of attributes;\na question submitting module for receiving the output of the multi-dimensional classifier module, for forming a question based on the plurality of attributes of the text and the confidence rate of each attribute, and for submitting the question to an inference module;\nthe inference module for receiving the question submitted by the question submitting module, for inquiring of a domain ontology knowledge library based on the question, and for providing an answer for the question to a decision reply module;\na domain ontology knowledge library module for storing a domain ontology knowledge library related to an application domain of the intelligent decision supporting system, wherein the domain ontology knowledge library records descriptions of rules for deriving decisions corresponding to the semantic standards of the multi-dimensional classifier module; and\nthe decision reply module for providing the answer for the question provided by the inference machine to a user.\n2. The system of claim 1, wherein the one or more modules further comprises:\na knowledge library management module for configuring the rules for deriving the domain ontology knowledge library stored in the domain ontology knowledge library module and the form of the question of the question submitting module.\n3. The system of claim 1, wherein the multi-dimensional classifier module comprises a Supporting Vector Machine (SVM).\n4. The system of claim 1, wherein the rules for deriving decisions in the domain ontology knowledge library correspond to combinations of semantic standards of the multi-dimensional classifier module.\n5. The system of claim 1, wherein the multi-dimensional classifier module collects training texts according to semantic standards, extracts eigenvectors of the training texts to form an eigenvector space, describes each training text with eigenvectors based on the eigenvector space, and predicts and outputs attributes of the text to be predicted and confidence rate of each attribute based on the training model of each classifier.\n6. The system of claim 5, wherein the multi-dimensional classifier module uses a Term Frequency-Inverse Document Frequency (TF-IDF) method to extract eigenvectors of the training texts.\n7. The system of claim 1, wherein the confidence rate comprises a probability value between 0 and 1.\n8. The system of claim 1, wherein the question is submitted to the inference module as eXtensible Markup Language (XML).\n9. A method for making an intelligent decision, the method comprising:\ndefining semantic standards of a plurality of classifiers of a multi-dimensional classifier according to an application domain and recording descriptions of rules in a domain ontology knowledge library for deriving decisions that correspond to the semantic standards of the multi-dimensional classifier;\ncollecting training texts according to the semantic standards, and training the multi-dimensional classifier;\nclassifying a text to be analyzed by using multiple standards, and outputting attributes of the text and confidence rate of each attribute;\nforming a question for intelligent decision based on attributes of the text and the confidence rate of each attribute; and\ninquiring of the domain ontology knowledge library based on the question by an inference machine to obtain an answer for intelligent decision and providing the answer to a user.\n10. The method of claim 9, wherein the collecting of the training texts according to the semantic standards comprises:\ncollecting training texts according to semantic standards, by the multi-dimensional classifier;\nextracting eigenvectors of the training texts to form an eigenvector space;\ndescribing each training text with eigenvectors based on the eigenvector space, to form a training model for each classifier; and\npredicting and outputting attributes of the text and confidence rate of each attribute based on the training model of each classifier.\n11. The method of claim 10, further comprising using a Term Frequency-Inverse Document Frequency (TF-IDF) method to extract eigenvectors of a training text.\n12. The method of claim 9, wherein the rules for deriving decisions in the domain ontology knowledge library correspond to combinations of semantic standards of the multi-dimensional classifier.\n13. The method of claim 9, wherein the confidence rate comprises a probability value between 0 and 1.\n14. The method of claim 9, wherein the question is submitted to the inference machine as eXtensible Markup Language (XML).",
    "status": "Active",
    "citations_own": [
        "US7685146B2",
        "US20100094844A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US9959317B2",
        "US20190066675A1",
        "US10360501B2"
    ],
    "citedby_ftf": [
        "US8959425B2",
        "CN103177308A",
        "US9009256B1",
        "US9679163B2",
        "US9256445B2",
        "US9449112B2",
        "CA2767676C",
        "US9292576B2",
        "CN103092914A",
        "US20160085848A1",
        "CN103258027B",
        "CN103412878B",
        "US9898586B2",
        "CN103646025B",
        "WO2015164879A1",
        "CN105243069A",
        "CN104123395A",
        "US9910939B2",
        "MY187134A",
        "US10884891B2",
        "US9384450B1",
        "CN104834958B",
        "CN104991887B",
        "US10776704B2",
        "CN105138802B",
        "CN105205537B",
        "CN105404674B",
        "US10607146B2",
        "CN106228246A",
        "CN106407271B",
        "CN108133427A",
        "CN106789595A",
        "US10419269B2",
        "US10942948B2",
        "CN107291828B",
        "CN107301213A",
        "CN107330471B",
        "CN107633156B",
        "CN108346474B",
        "JP2021536636A",
        "CN109635171B",
        "CN109918489B",
        "CN109933794A",
        "CN110008340A",
        "CN110245227B",
        "CN110309509A",
        "CN110688849B",
        "CN110569333B",
        "CN111400414A",
        "RU2755520C1",
        "CN112395410B",
        "CN113610373A",
        "WO2023122226A2"
    ]
}