{
    "patent_id": "US-11087488-B2",
    "title": "Automated gesture identification using neural networks ",
    "assignee": "Avodah, Inc.",
    "publication_date": "2021-08-10",
    "patent_link": "https://patents.google.com/patent/US11087488B2/en",
    "inventors": [
        "Trevor Chandler",
        "Dallas Nash",
        "Michael Menefee"
    ],
    "classifications": [
        "G06T7/73",
        "G06V10/82",
        "G06F18/256",
        "G06F3/017",
        "G06F3/0304",
        "G06K9/00248",
        "G06K9/00342",
        "G06K9/00355",
        "G06N3/044",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/08",
        "G06T7/20",
        "G06T7/90",
        "G06V40/165",
        "G06V40/23",
        "G06V40/28",
        "G06N3/006"
    ],
    "abstract": "Disclosed are methods, apparatus and systems for gesture recognition based on neural network processing. One exemplary method for identifying a gesture communicated by a subject includes receiving a plurality of images associated with the gesture, providing the plurality of images to a first 3-dimensional convolutional neural network (3D CNN) and a second 3D CNN, where the first 3D CNN is operable to produce motion information, where the second 3D CNN is operable to produce pose and color information, and where the first 3D CNN is operable to implement an optical flow algorithm to detect the gesture, fusing the motion information and the pose and color information to produce an identification of the gesture, and determining whether the identification corresponds to a singular gesture across the plurality of images using a recurrent neural network that comprises one or more long short-term memory units.",
    "claims": "\n1. An artificial intelligence system adapted for processing images associated with a gesture performed by a subject, comprising:\na plurality of pipeline structures, each of the pipeline structures configured to include three components:\nan associated pre-rule component configured to process an input to the pipeline structure,\nan associated pipeline component, and\nan associated post-rule component configured to process an output of the pipeline component,\nwherein a first pipeline structure comprises:\na first pre-rule component configured to determine whether an input stream includes a plurality of input images comprising pixels,\na first pipeline component configured to generate recognition information comprising at least one characteristic in each of the plurality of input images, the at least one characteristic comprising a pose, a color or a gesture type, and\na first post-rule component configured to determine whether the at least one characteristic is associated with the gesture,\nwherein a second pipeline structure comprises:\na second pre-rule component configured to determine whether the plurality of input images is associated with the gesture, and\na second pipeline component configured to perform a facial recognition or an emotional recognition operation on the plurality of input images and generate a first result,\nwherein a third pipeline structure comprises:\na third pre-rule component configured to determine whether the first result from the second pipeline structure is compatible with the recognition information generated by the first pipeline structure, and\na third pipeline component configured to determine, using a feedback connection, whether the recognition information corresponds to a singular gesture across the plurality of input images.\n2. The system of claim 1, wherein the first pipeline structure comprises a three-dimensional convolutional neural network (3D CNN) configured to receive the input stream and output the recognition information, wherein the second pipeline structure comprises a facial or emotional recognition (FER) module, and wherein the third pipeline structure comprises a recurrent neural network (RNN) comprising an output that is coupled to an input of the RNN to provide the feedback connection.\n3. The system of claim 1, wherein a fourth pipeline structure of the plurality of pipeline structures comprises a pre-processing module configured to receive the input stream and output the plurality of input images, and wherein the fourth pipeline structure comprises:\na fourth pre-rule component configured to determine whether the input stream includes a plurality of captured images comprising pixels,\na fourth pipeline component configured to perform pose estimation on each of the plurality of captured images, and\na fourth post-rule component configured to overlay pose estimation pixels onto the plurality of captured images to generate the plurality of input images.\n4. The system of claim 3, wherein the pose estimation identifies the subject's body, fingers and face.\n5. The system of claim 3, wherein the fourth pipeline component is further configured, prior to performing the pose estimation, to:\nprocess the plurality of captured images to extract pixels corresponding to a subject, a foreground and a background in each of the plurality of captured images; and\nperform spatial filtering, upon determining that the background or the foreground includes no information that pertains to the gesture being identified, to remove the pixels corresponding to the background or the foreground.\n6. The system of claim 1, wherein the first pipeline structure is operable to use an optical flow algorithm to detect the gesture.\n7. The system of claim 6, wherein the optical flow algorithm comprises sharpening, line, edge, corner and shape enhancements.\n8. The system of claim 1, wherein the second pipeline component is operable to use 32 reference points on a face of a subject performing the gesture to generate the first result.\n9. The system of claim 1, wherein the third pipeline component comprises one or more long short-term memory (LTSM) units.\n10. The system of claim 1, wherein a fifth pipeline structure of the plurality of pipeline structures comprises an audio recognition module, and wherein the fifth pipeline structure comprises:\na fifth pre-rule component configured to determine whether an input includes audio samples,\na fifth pipeline component configured to perform audio recognition on the audio samples, and\na fifth post-rule component configured to determine whether the audio samples are associated with the gesture and generate a second result, and\nwherein the third pre-rule of the third pipeline structure is further configured to determine whether the second result is compatible with the recognition information generated by the first pipeline structure."
}