{
    "patent_id": "US-11736952-B2",
    "title": "Systems, methods, and devices for electronic spectrum management ",
    "assignee": "Digital Global Systems, Inc.",
    "publication_date": "2023-08-22",
    "patent_link": "https://patents.google.com/patent/US11736952B2/en",
    "inventors": [
        "Ronald C. Dzierwa",
        "Gabriel R. Garcia",
        "Daniel Carbajal"
    ],
    "classifications": [
        "H04W16/14",
        "G06N20/00",
        "G06F17/142",
        "G06N5/022",
        "H04B1/06",
        "H04B17/23",
        "H04B17/27",
        "H04B17/309",
        "H04B17/318",
        "H04W28/0236",
        "H04W64/006",
        "H04B17/3911",
        "H04W24/08",
        "H04W64/00"
    ],
    "abstract": "Devices and methods enable optimizing a signal of interest based on identifying and analyzing the signal of interest based on radio frequency energy measurements. Signal data is compared with stored data to identify the signal of interest. Signal degradation data is calculated based on noise figure parameters, hardware parameters and environment parameters. The signal of interest is optimized based on the signal degradation data. Terrain data is also operable to be used for optimizing the signal of interest.",
    "claims": "\n1. A method for automatic signal detection in a radio-frequency (RF) environment, comprising:\nlearning the RF environment, thereby creating learning data including power level measurements of the RF environment;\nforming a knowledge map based on the power level measurements of the RF environment;\ncreating a channel plan;\nscrubbing a spectral sweep against the knowledge map;\ncalculating a first derivative of the power level measurements and a second derivative of the power level measurements;\ndetecting at least one signal in the RF environment based on matched positive and negative gradients;\naveraging the spectral sweep, removing areas identified by the matched positive and negative gradients, and connecting points between removed areas to determine a baseline;\nsmoothing the spectral sweep with a correction vector, wherein the correction vector is determined according to the spectral sweep;\nsubtracting the baseline from the spectral sweep to reveal the at least one signal, thereby creating signal data;\nprocessing the signal data using compressed data for deltas, thereby generating processed data in near-real time; and\ndetermining that one or more of the at least one signal violates the channel plan.\n2. The method of claim 1, wherein the knowledge map comprises an array of normal distributions, wherein each normal distribution corresponds to how often a power level at each frequency has been at a particular level.\n3. The method of claim 1, further comprising creating a profile of the RF environment based on the knowledge map, wherein the profile comprises a highest power level at each frequency.\n4. The method of claim 1, further comprising automatically extracting at least one temporal feature of the RF environment from the knowledge map.\n5. The method of claim 1, further comprising automatically fine-tuning a threshold of power level on a segmented basis while extracting at least one temporal feature from the knowledge map.\n6. The method of claim 1, further comprising indexing the power level measurements for each frequency interval in a spectrum section.\n7. The method of claim 1, further comprising periodically reevaluating the RF environment and updating the knowledge map.\n8. The method of claim 1, further comprising sending a notification and/or an alarm to an operator after detecting the at least one signal.\n9. The method of claim 1, further comprising displaying the knowledge map and/or detecting results in real time on a remote device.\n10. A system for automatic signal detection in a radio-frequency (RF) environment, comprising:\nat least one apparatus for detecting signals in the RF environment;\nwherein the at least one apparatus is operable to sweep and learn the RF environment, thereby creating learning data including power level measurements of the RF environment;\nwherein the at least one apparatus is operable to form a knowledge map based on the power level measurements of the RF environment;\nwherein the at least one apparatus is operable to create a channel plan;\nwherein the at least one apparatus is operable to scrub a spectral sweep against the knowledge map;\nwherein the at least one apparatus is operable to calculate a first derivative of the power level measurements and a second derivative of the power level measurements;\nwherein the at least one apparatus is operable to detect at least one signal in the RF environment based on matched positive and negative gradients;\nwherein the at least one apparatus is operable to average the spectral sweep, remove areas identified by the matched positive and negative gradients, and connect points between removed areas to determine a baseline;\nwherein the at least one apparatus is operable to smooth the spectral sweep with a correction vector, wherein the correction vector is determined according to the spectral sweep;\nwherein the at least one apparatus is operable to subtract the baseline from the spectral sweep to reveal the at least one signal, thereby creating signal data;\nwherein the at least one apparatus is operable to process the signal data using compressed data for deltas, thereby generating processed data in near-real time; and\nwherein the at least one apparatus is operable to determine that one or more of the at least one signal violates the channel plan.\n11. The system of claim 10, wherein the knowledge map comprises an array of normal distributions, wherein each normal distribution corresponds to how often a power level at each frequency has been at a particular level.\n12. The system of claim 10, wherein the at least one apparatus and/or a remote device is operable to create a profile of the RF environment based on the knowledge map, wherein the profile comprises a highest power level at each frequency.\n13. The system of claim 10, wherein the at least one apparatus is operable to automatically extract at least one temporal feature of the RF environment from the knowledge map.\n14. The system of claim 10, wherein the at least one apparatus automatically fine-tunes a threshold of power level on a segmented basis while extracting at least one temporal feature from the knowledge map.\n15. The system of claim 10, wherein the at least one apparatus is operable to index the power level measurements for each frequency interval in a spectrum section.\n16. The system of claim 10, wherein the at least one apparatus periodically reevaluates the RF environment and updates the knowledge map.\n17. The system of claim 10, wherein the at least one apparatus is operable to send a notification and/or an alarm to an operator after detecting the at least one signal.\n18. A system for automatic signal detection in a radio-frequency (RF) environment, comprising:\nat least one apparatus for detecting signals in the RF environment; and\na remote device in communication with the at least one apparatus;\nwherein the at least one apparatus is operable to sweep and learn the RF environment, thereby creating learning data including power level measurements of the RF environment;\nwherein the at least one apparatus is operable to form a knowledge map based on the power level measurements of the RF environment;\nwherein the at least one apparatus is operable to create a channel plan;\nwherein the at least one apparatus is operable to scrub a spectral sweep against the knowledge map;\nwherein the at least one apparatus is operable to calculate a first derivative of the power level measurements and a second derivative of the power level measurements;\nwherein the at least one apparatus is operable to detect at least one signal in the RF environment based on matched positive and negative gradients;\nwherein the at least one apparatus is operable to average the spectral sweep, remove areas identified by the matched positive and negative gradients, and connect points between removed areas to determine a baseline;\nwherein the at least one apparatus is operable to smooth the spectral sweep with a correction vector, wherein the correction vector is determined according to the spectral sweep;\nwherein the at least one apparatus is operable to subtract the baseline from the spectral sweep to reveal the at least one signal, thereby creating signal data;\nwherein the at least one apparatus is operable to process the signal data using compressed data for deltas, thereby generating processed data in near-real time; and\nwherein the at least one apparatus is operable to determine that one or more of the at least one signal violates the channel plan.\n19. The system of claim 18, wherein the knowledge map and/or detecting results are displayed on the remote device in real time.\n20. The system of claim 18, wherein the at least one apparatus is operable to send a notification and/or an alarm to an operator after detecting the at least one signal."
}