{
    "patent_link": "https://patents.google.com/patent/US6185625B1/en",
    "patent_id": "US6185625B1",
    "title": "Scaling proxy server sending to the client a graphical user interface for establishing object encoding preferences after receiving the client's request for the object",
    "abstract": "A system for enhancing data access over a communications link is disclosed. In accordance with a particular embodiment, a system for retrieving an object over a computer network includes a network client with a browser for rendering an object to a user and a user interface enabling the user to establish an encoding preference. A remote scaling server is coupled between the network client and the computer network, and includes a remote proxy and an encode service provider. The remote scaling server is configured to request a user-specified encoding preference from the network client, retrieve an object from the computer network using the remote proxy, encode the object using the encode service provider in accordance with the requested user-specified encoding preference, and transmit the encoded object to the network client using the remote proxy. The disclosed system thus enables users to dynamically influence the trade-off between quality of content and download speed.",
    "inventors": [
        "Michael Man-Hak Tso",
        "Jin Jing",
        "Robert Conrad Knauerhase",
        "David Alfred Romrell",
        "Daniel Joshua Gillespie",
        "Bikram Singh Bakshi",
        "Seshardi Sathyanarayan"
    ],
    "assignee": "Intel Corp",
    "classifications": [
        "H04L67/306",
        "G06F16/9577",
        "H04L67/565",
        "H04L69/329"
    ],
    "claims": "\n1. A system for retrieving an object over a computer network, said system comprising a network client and a remote scaling server coupled between the network client and the computer network, wherein:\n2. The system of claim 1, wherein said encode service provider is configured to selectively encode an object having a predetermined characteristic.\n3. The system of claim 2, wherein said remote scaling server includes a plurality of encode service providers, said remote scaling server being configured to invoke one of said plurality of encode service providers based at least in part on the predetermined characteristic of the object retrieved from the computer network.\n4. The system of claim 2, wherein said network client further includes an embedded decoder configured to selectively decode an object having a predetermined characteristic.\n5. The system of claim 2, wherein said network client further includes a local proxy in communication with said browser, said local proxy being configured to request an object from the computer network through said remote proxy and to receive an encoded object from said remote proxy.\n6. The system of claim 5, wherein said network client further includes a decode service provider coupled to said local proxy, said decode service provider being configured to selectively decode an object having a predetermined characteristic.\n7. The system of claim 6, wherein said decode service provider comprises a component of said browser.\n8. The system of claim 6, wherein said network client further includes a plurality of decode service providers, said network client being configured to invoke one of said plurality of decode service providers based on a predetermined characteristic of the object received from said remote proxy.\n9. The system of claim 1, wherein said graphical user interface is activated by instructions embedded in a data stream transmitted to said network client by said remote scaling server.\n10. The system of claim 9, wherein said embedded instructions execute automatically upon receipt by said network client.\n11. The system of claim 1, wherein said user preference corresponds to a desired content quality for the object to be transmitted to said network client.\n12. The system of claim 1, wherein said network client further includes a decode service provider configured to determine whether said browser is capable of rendering an object received by said network client and to selectively translate the object to a format supported by said browser.\n13. An apparatus for transferring an object to a client over a communications link, said apparatus comprising a server configured to receive an object request from the client, download a graphical user interface to the client in response to receiving the object request, retrieve an object from a data store coupled to the server, obtain a user-entered encoding preference from the client through the downloaded graphical user interface, selectively encode the object based on one or more predetermined selection criteria in accordance with the received user-entered encoding preference, and transmit the encoded object to the client, wherein the graphical user interface comprises a set of automatically executing instructions for requesting an encoding preference from a user of the client, receiving a response from the user, and transmitting the response back to the server.\n14. The apparatus of claim 13, wherein said predetermined selection criteria comprise a characteristic of the object.\n15. The apparatus of claim 13, wherein said predetermined selection criteria comprise a characteristic of the client.\n16. The apparatus of claim 13, wherein said predetermined selection criteria comprise a characteristic of the communications link.\n17. The apparatus of claim 13, wherein said data store resides on an external network, said server being coupled to said external network over a second communications link.\n18. The apparatus of claim 17, wherein the external network comprises the Internet.\n19. The apparatus of claim 17, further comprising a memory coupled to said server, said server being further configured to store one or more representations of an object in said memory.\n20. The apparatus of claim 17, wherein said server includes a plurality of encode service providers, each of said encode service providers being configured to scale an object according to at least one of said predetermined selection criteria.\n21. A method for providing a client with an object to be rendered to a user, said method being implemented on a server coupled to the client by a communications link, the server being capable of accessing objects in a data store, said method comprising the steps of:\n22. The method of claim 21, wherein said scaling step comprises scaling the retrieved object based on a characteristic of the retrieved object.\n23. The method of claim 21, wherein said scaling step comprises scaling the retrieved object based on a characteristic of the server.\n24. The method of claim 21, wherein said scaling step comprises scaling the retrieved object based on a characteristic of the client.\n25. The method of claim 21, wherein said scaling step comprises scaling the retrieved object based on a characteristic of the communications link coupling the server and the client.\n26. The method of claim 21, wherein the server includes a memory capable of storing one or more representations of an object, said retrieving step comprising attempting to retrieve a version of an object from the memory and, if not found therein, retrieving the requested object from the data store.\n27. The method of claim 26, wherein the client is configured to render a different version of an object previously transmitted by the server, said method further comprising the steps of:\n28. The method of claim 26, further comprising the step of generating one or more versions of an object in a background mode of the server, and storing the one or more versions in the memory.\n29. The method of claim 21, wherein at least two of said steps of retrieving the requested object, scaling the retrieved object and transmitting the scaled object proceed concurrently in a stream-based manner.\n30. A set of instructions resident on a storage medium for execution by a server, said set of instructions enabling the server to provide a client coupled thereto with an encoded version of an object for display to a user, said set of instructions comprising instructions for:\n31. The set of instructions of claim 30, wherein the server is coupled to a memory, said set of instructions further comprising instructions for maintaining one or more representations of an object in the memory.\n32. The set of instructions of claim 30, wherein the storage medium comprises a portable magnetic storage device.\n33. The set of instructions of claim 30, wherein the storage medium comprises a memory installed in a computer.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5373375A",
        "US5517612A",
        "US5544320A",
        "US5673322A",
        "US5684969A",
        "US5701451A",
        "US5706434A",
        "US5724556A",
        "US5727159A",
        "US5742768A",
        "US5742905A",
        "US5764235A",
        "US5768510A",
        "US5805735A",
        "US5918013A",
        "US5953506A",
        "US5991816A",
        "US5996022A",
        "US6018343A",
        "US6049821A",
        "US6076109A",
        "US6088803A",
        "US6101328A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20010032257A1",
        "US6308238B1",
        "US20010037292A1",
        "US20010047285A1",
        "US6330605B1",
        "US20020000991A1",
        "US6339787B1",
        "US6341304B1",
        "US20020010742A1",
        "US6345300B1",
        "WO2002010929A1",
        "US6349336B1",
        "US20020026475A1",
        "US20020030844A1",
        "US20020035644A1",
        "US6363413B2",
        "US6366947B1",
        "US6374305B1",
        "US20020049817A1",
        "US20020052968A1",
        "US20020059584A1",
        "US6405240B1",
        "WO2001096977A3",
        "US20020075300A1",
        "US20020080871A1",
        "US20020087714A1",
        "US6421733B1",
        "US20020115477A1",
        "US20020133635A1",
        "US20020133627A1",
        "US20020143981A1",
        "WO2002088979A1",
        "US6484212B1",
        "US20020174018A1",
        "US20020178381A1",
        "WO2002095608A1",
        "US6490602B1",
        "US20020184257A1",
        "US20020180774A1",
        "US20020188698A1",
        "US20020188692A1",
        "US20020196278A1",
        "US20030005047A1",
        "US6505256B1",
        "US20030009248A1",
        "US20030023756A1",
        "US6523027B1",
        "US20030041106A1",
        "US20030050058A1",
        "US20030061299A1",
        "US20030061386A1",
        "US20030061610A1",
        "US20030074425A1",
        "US20030074421A1",
        "US20030076448A1",
        "US20030079041A1",
        "USH2065H1",
        "US20030110160A1",
        "US20030110234A1",
        "US20030115180A1",
        "US20030121040A1",
        "WO2003052610A1",
        "US6587877B1",
        "US20030125953A1",
        "US20030126236A1",
        "US20030126278A1",
        "US6594699B1",
        "US20030135633A1",
        "US20030135860A1",
        "US20030145062A1",
        "US6615267B1",
        "US20030167211A1",
        "US20030177269A1",
        "US20030182620A1",
        "US20030182424A1",
        "WO2003079212A1",
        "US20030182359A1",
        "US20030188192A1",
        "US20030187930A1",
        "US20030185226A1",
        "FR2838268A1",
        "US6633314B1",
        "US20030195968A1",
        "US20030195967A1",
        "US6637031B1",
        "US20030212900A1",
        "US20030212901A1",
        "US6654814B1",
        "US20030221100A1",
        "US6671424B1",
        "US20040003032A1",
        "US6690403B1",
        "US6701441B1",
        "US20040044731A1",
        "US20040044740A1",
        "US6704873B1",
        "US6704798B1",
        "EP1255187A3",
        "EP1398713A1",
        "US20040054972A1",
        "US6710786B1",
        "US6718535B1",
        "US20040073918A1",
        "US20040073873A1",
        "US20040088371A1",
        "US6745226B1",
        "US20040104920A1",
        "US20040123239A1",
        "US20040125130A1",
        "US20040128394A1",
        "US6763377B1",
        "US20040139089A1",
        "US20040139208A1",
        "US20040143624A1",
        "US20040160637A1",
        "US6782431B1",
        "US6785705B1",
        "US6789263B1",
        "US20040184664A1",
        "US20040194023A1",
        "US20040197088A1",
        "US20040199650A1",
        "US6810425B2",
        "US20040237100A1",
        "US20040235645A1",
        "US6826599B1",
        "US20040255150A1",
        "US20040260792A1",
        "US20040267384A1",
        "US6845505B1",
        "US20050021834A1",
        "US20050038753A1",
        "US20050044541A1",
        "US6862606B1",
        "US20050055644A1",
        "US6868525B1",
        "US20050060641A1",
        "US6873877B1",
        "US6874009B1",
        "US6892219B1",
        "US20050102353A1",
        "US20050104887A1",
        "US20050114445A1",
        "US20050114866A1",
        "US20050125532A1",
        "US20050132217A1",
        "US20050131887A1",
        "US6925600B2",
        "US6928486B2",
        "US6928461B2",
        "US20050193097A1",
        "US20050190934A1",
        "US6941382B1",
        "US6963910B1",
        "US20050251380A1",
        "US6965947B1",
        "US20050256924A1",
        "US20050256933A1",
        "US20050261985A1",
        "US20050262245A1",
        "US6973501B1",
        "US6973475B2",
        "US20050273791A1",
        "US20050273779A1",
        "US20060031558A1",
        "US7006993B1",
        "US20060047854A1",
        "US20060080390A1",
        "US7047312B1",
        "US20060122844A1",
        "US7076555B1",
        "US20060159080A1",
        "US20060161555A1",
        "US20060167987A1",
        "US20060167972A1",
        "US20060168095A1",
        "US20060174277A1",
        "US7099914B1",
        "US7100195B1",
        "US20060195601A1",
        "US20060228878A1",
        "US20060248206A1",
        "US20060253575A1",
        "US7139637B1",
        "US20060282856A1",
        "US20060288084A1",
        "US20070009179A1",
        "WO2007009257A1",
        "US7177825B1",
        "US20070050515A1",
        "US20070055580A1",
        "US7197547B1",
        "US7219309B2",
        "US20070109156A1",
        "US7233914B1",
        "US20070143836A1",
        "US7240283B1",
        "US20070156677A1",
        "US7251612B1",
        "US20070179985A1",
        "US7257122B1",
        "US20070192843A1",
        "US20070198715A1",
        "US20070198716A1",
        "US20070198734A1",
        "US20070198634A1",
        "US20070198670A1",
        "US20070201761A1",
        "US20070209047A1",
        "US20070245024A1",
        "US20070250890A1",
        "US7289244B2",
        "US20070255659A1",
        "US20070266108A1",
        "US20070288992A1",
        "US20070294178A1",
        "US20080005030A1",
        "US20080002951A1",
        "US20080016220A1",
        "US20080022304A1",
        "US20080034417A1",
        "US20080034413A1",
        "US20080034198A1",
        "FR2905221A1",
        "US7356605B1",
        "US7356570B1",
        "US20080091945A1",
        "US20080104250A1",
        "US20080104220A1",
        "US7370005B1",
        "US20080109557A1",
        "US20080114984A1",
        "US20080117679A1",
        "US20080120661A1",
        "US20080137685A1",
        "US20080176543A1",
        "CN100409218C",
        "USRE40459E1",
        "US20080215747A1",
        "US20080228899A1",
        "US20080225728A1",
        "US20080229024A1",
        "US20080228938A1",
        "US20080229023A1",
        "US20080229025A1",
        "US20080229021A1",
        "US7428725B2",
        "US20080232457A1",
        "US20080295179A1",
        "US20080309665A1",
        "US20090024982A1",
        "US20090049487A1",
        "US20090055519A1",
        "US20090063622A1",
        "US20090070414A1",
        "US20090080523A1",
        "US20090100125A1",
        "US20090097751A1",
        "US20090100483A1",
        "US7552450B1",
        "US20090189892A1",
        "US20090193129A1",
        "US20090240814A1",
        "US7617453B1",
        "US20090287839A1",
        "US20090288013A1",
        "US20090313535A1",
        "US7636793B1",
        "US7647340B2",
        "US20100017627A1",
        "US20100017501A1",
        "US20100049797A1",
        "US20100082771A1",
        "US20100111494A1",
        "US20100115388A1",
        "US20100121972A1",
        "US20100131673A1",
        "US20100145794A1",
        "US20100153474A1",
        "US20100153352A1",
        "US7756130B1",
        "US20100180091A1",
        "US7779482B1",
        "US20100217934A1",
        "US7792712B2",
        "US20100228795A1",
        "US20100235329A1",
        "US7831728B2",
        "US20100325242A1",
        "US7860309B1",
        "US20100332700A1",
        "US20100333155A1",
        "US7873065B1",
        "US7925694B2",
        "US7937478B2",
        "US7953893B1",
        "US20110185411A1",
        "US20110199243A1",
        "US8010668B1",
        "US8015480B2",
        "US20110231642A1",
        "US8028314B1",
        "US20110296109A1",
        "US8074028B2",
        "WO2011160728A1",
        "US8090856B1",
        "US8103783B2",
        "US8145777B2",
        "US8191008B2",
        "US20120136928A1",
        "US8200837B1",
        "US8245242B2",
        "US8255984B1",
        "US8296441B2",
        "US20120284611A1",
        "US20120311066A1",
        "US8356317B2",
        "US8359007B2",
        "US8370420B1",
        "US8370435B1",
        "US20130104059A1",
        "US20130104025A1",
        "US8463802B2",
        "US8462631B2",
        "US8504775B2",
        "US8549229B2",
        "US20130268669A1",
        "US20130283182A1",
        "US20130311871A1",
        "US20130311654A1",
        "US8615159B2",
        "US8627097B2",
        "US8626763B1",
        "US8639694B1",
        "US8671213B2",
        "US8694584B2",
        "US8788849B2",
        "US8805965B2",
        "US8849856B2",
        "US8862870B2",
        "US20140310344A1",
        "US8892495B2",
        "US8935316B2",
        "US20150019478A1",
        "US9009326B2",
        "US9020993B2",
        "US20150156094A1",
        "US20150213504A1",
        "US9104686B2",
        "US9407608B2",
        "US9438700B2",
        "US9491072B2",
        "US9497284B2",
        "US20160352833A1",
        "US9535563B2",
        "US9544352B2",
        "US9596292B1",
        "US9621666B2",
        "US9692725B2",
        "US9747311B2",
        "US9762461B2",
        "US9792321B2",
        "US9967154B2",
        "US9996562B2",
        "US10165038B2",
        "CN109923837A",
        "US10365781B2",
        "US10387270B2",
        "US10397294B2",
        "US10476868B2",
        "US10491963B1",
        "US10776244B2",
        "US10902080B2",
        "US10924580B2",
        "US10931792B2",
        "US10985934B2",
        "US11036696B2",
        "US11057446B2",
        "US11144952B2",
        "US11157664B2",
        "US11190374B2",
        "US11256671B2",
        "US11411922B2",
        "US11539608B2",
        "US11822526B2"
    ],
    "citedby_ftf": []
}