{
    "patent_link": "https://patents.google.com/patent/US4429385A/en",
    "patent_id": "US4429385A",
    "title": "Method and apparatus for digital serial scanning with hierarchical and relational access",
    "abstract": "Digitally encoded data such as classified advertising and other data bases of similarly related messages are broadcast on a serial-type digital data transmission system. Each message is preceded by a headnote, structured so that upon reception, the receiver can select messages based upon a combination of hierarchical and relational views of the message data, without any interaction whatsoever with the broadcast system.",
    "inventors": [
        "Richard J. Cichelli",
        "Michael O. Thompson"
    ],
    "assignee": "NEWSPAPER ASSOCIATION OF AMERICA Inc",
    "classifications": [
        "G06Q40/12",
        "G06F16/00"
    ],
    "claims": "\n1. An information retrieval method from broadcast information which supports both hierarchical and relational access to said broadcast information by one or more receiving units, comprising the steps of:\nA. defining items of information having plural characteristic elements within frames and collecting said frames, wherein each frame further comprises a fixed-length digitally encoded header portion and a variable-length digitally encoded screen information portion, wherein said header portion comprises a path descriptor and an attribute descriptor for each frame; and\nB. forming a serial data base of said frames; and\nC. broadcasting said serial data base in a sequential and repetitive fashion to a plurality of receiving units; and\nD. defining those frames desired at a receiving unit by there generating a desired pattern selector and a desired mask selector, each comprised of separate fields of digitally encoded information elements and then scanning the header portion of each frame as it is being serially received at said receiving unit, and\nE. selecting frames by comparing, in an elementwise fashion, for a match of the path and attribute descriptor portions of each frame header with the previously generated, desired pattern selector according to the conditions imposed by the corresponding elements of the previously generated, desired mask selector; and\nF. grabbing selected frames and generating a graphical or alphanumeric video display of the screen information for the said frame.\n2. The method according to claim 1, wherein said step (A) of defining further comprises the step of digitally encoding, as a relational frame, those of said plural characteristic elements which are mutually exclusive characteristic elements (within data frames having the same path descriptor as said relational frame) and ordering said mutually exclusive characteristic elements into a set of sub-sets defined as spanning sets and further said step (E) of selecting further comprises the step of an elementwise comparison of elements within a frame headnote portion against said desired mask attribute selector elements, wherein a given frame is selected if all the path descriptor elements of its headnote portion are matched and also for each mutually exclusive element of a given spanning set within said attribute descriptor headnote portion there is a corresponding mask element set to DON'T CARE (X) for each attribute selected as True (T).\n3. The method according to claim 1, wherein said step (A) of defining a pattern path descriptor further comprises the step of digitally encoding a plurality of path level values in each frame headnote, wherein the zero level has no attributes or path values and is selected by a unique frame value alone and each succesive path level value is selectable, in Step E, from a choice of descendants which are digitally encoded in the headnote of each frame.\n4. The method according to claim 1, wherein said step (E) comprises a bit serial comparison for equality between all elements of a fixed bit length pattern descriptor portion of each frame's headnote and corresponding bits representing the elements of the desired pattern selector for which corresponding bits representing the elements of the desired mask selector are digitally encoded as MATCH (M).\n5. The method according to claim 1, wherein said step (A) further comprises digitally encoding the attribute descriptor portion of each frame headnote as a plurality of bits sets to True (T) or False (F) and said comparison step (E) further comprises selecting a given frame if all attribute descriptor bits of that given frame, have the same value as the corresponding attribute selector bits or, if any descriptor bit of that frame does not have the same value as the corresponding attribute selector bit, then a mask designator bit corresponding to that non-matching descriptor bit digitally had been encoded as DON'T CARE (X).\n6. A receiver unit operable to receive the broadcast of a cyclically repeated data base, and support both hierarchical and relational information retrieval access to said broadcast data base, said receiver unit comprising:\nA. means to receive digitally encoded broadcast signals representing serially presented discrete frames of information said frames being comprised of data frames and relational frames, each data frame having a plurality of characteristics and each relational frame comprising a digital encoding of the characteristics of a given level of data frames, wherein subsets of those characteristics, which are mutually exclusive, are grouped and digitally encoded as a spanning set in each relational frame, both types of frames having a fixed-length digitally encoded header portion and a variable length digitally encoded screen information portion; and\nB. means to select desired data frames of said broadcast according to a hierarchical and relational access which further comprises scanning means to read the header portion of each frame as it is received and grab those frames which meet the criteria established by a selection means;\nC. said selection means further comprising a pattern processing means to digitally encode a desired pattern selector to be compared against each frame header portion by an Exclusive OR means and also a mask processing means to digitally encode a desired mask selector separately to be compared against the output of the Exclusive OR means by an Inclusive OR means, thereby to select, for display, a given frame only if a pattern descriptor portion of the header portion of that frame matches the pattern selector according to the further conditions as digitally encoded in the mask selector.\n7. A receiver unit according to claim 6, wherein each data and relational frame fixed-length header portion further comprises a path descriptor and an attribute descriptor and, for a given relational frame, each of said spanning sets encoded therein further comprises a grouping of elements representing the mutually exclusive characteristics within all data frames having the same path descriptor as said relational frame, wherein said pattern processing means further comprises means to digitally encode said pattern selector as a desired path value and those characteristics of all data frames at said path value which the user wishes to be TRUE (T), and said mask selector means further comprises means to digitally encode said mask selector with a Match(M) value or a DON'T CARE(X) value which is compared against the digitally encoded value for each attribute descriptors in a frames headnote wherein, further, said mask selector means is operable to select a given data frame if the path descriptor portion of the headnote of that data frame is matched and also for each mutually exclusive element of a given spanning set of said frame attribute descriptor there is a corresponding mask element set to DON'T CARE(X) for each attribute selected by said selection means as True (T).\n8. A receiver unit according to claim 7, wherein said selection means further comprises a keypad input device further comprising a NEXT input operable to grab and hold for review the information portion of additional selected frames as serially received which meet the match conditions established by said selection means.\n9. A receiver unit according to claim 8, wherein said keypad input device further comprises DON'T CARE, YES, NO inputs which, for the choices presented by a given grabbed relational frame, are operable to set corresponding attribute selector and mask selector elements, wherein for a DON'T CARE input the corresponding mask selector element is set to DON'T CARE (X), and for a YES or NO input the corresponding pattern attribute selector element respectively is set to True (T) or False (F), wherein further for each True (T) in the attribute selector which is a member of a spanning set the corresponding mask selector element is set to DON'T CARE (X).\n10. A broadcast-based information retrieval system which supports both hierarchical and relational access to a serial data base by one or more receiving units, said system comprising:\nA. assembly logic means to define items of information having plural characteristics within frames, wherein each frame further comprises a fixed-length digitally encoded header portion and a variable-length digitally encoded screen information portion, wherein the header portion of each frame comprises a pattern descriptor which further comprises a path descriptor and an attribute descriptor; and\nB. head-end processor means to collect said frames and form a serial data base of said frames;\nC. modulator means to broadcast said serial data base in a sequential and repetitive fashion to a demodulator means at one or more receiving units, each comprising receiver logic means and signal synthesis means;\nD. said receiver logic means operable to define a pattern selector and a mask selector to match an hierarchical path descriptor and a relational attribute descriptor by generating a desired pattern selector and a desired mask selector, each comprised of separate fields of digitally encoded information elements, at that receiving unit and then perform an elementwise scanning of the pattern descriptor of each frame as it is being serially received, and then grabbing a frame if there is a match of the path and attribute descriptor portions of that frame header to the defined pattern selector, according to the further conditions imposed by the corresponding elements of said defined mask selector;\nE. said signal synthesis means operable to generate a graphical or alphanumeric video display of the screen information portion of a frame which has been grabbed at that receiving unit.\n11. A system according to claim 10, wherein said receiver logic means further comprises a frame grabbing means to selectively grab a frame for display based upon a real-time scanning of the pattern descriptor of that frame, during the time said frame appears at that receiving unit during said sequential broadcast of the serial data base.\n12. A system according to claim 10, wherein each frame pattern descriptor further comprises a binary number defining the path location for a given frame and a set of binary attribute values which are set either as True (T) or False (F) for each of a plurality of attribute characteristics descriptive of the information portion of said given frame.\n13. A system according to claim 10, wherein said receiver logic means further comprises a pattern processing means to digitally encode a desired pattern selector to be compared against each frame header portion by an Exclusive OR means and also a mask processing means to digitally encode a desired mask selector separately to be compared against the output of the Exclusive OR means, thereby to instruct the signal synthesis means to display a given frame only if the pattern descriptor portion of the header of that frame matches the pattern selector according to the further conditions as digitally encoded in the mask selector.\n14. A system according to claim 10, wherein each data and relational frame fixed-length header portion further comprises a path descriptor and an attribute descriptor and, for a given relational frame, there is digital encoding of the characteristics of a given level of data frames, wherein subsets of those characteristics which are mutually exclusive are grouped and digitally encoded as spanning sets, wherein said mask attribute selector means grabs a given data frame if the path descriptor portion of the headnote of that data frame is matched and also for each element of a given spanning set of said frame attribute descriptor there is a corresponding mask element set to DON'T CARE(X) for each attribute selected by said selection means as True (T).\n15. A system according to claim 14, wherein said receiver logic means comprises a keypad input device comprising a NEXT input operable to grab and hold for review the information portion of additional selected frames as serially received which meet the match conditions established by said selection means.\n16. A system according to claim 15, wherein said keypad input device further comprises DON'T CARE, YES, NO inputs which, for the choices presented by a given grabbed relational frame, are operable to set corresponding attribute selector and mask selector elements, wherein for a DON'T CARE input the corresponding mask selector element is set to DON'T CARE (X), and for a YES or NO input the corresponding pattern attribute selector element respectively is set to True (T) or False (F), wherein further for each True (T) in the attribute selector which is member of a spanning set the corresponding mask selector element is set to DON'T CARE (X).",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US3214736A",
        "US3827026A",
        "US3840811A",
        "US3860745A",
        "US3927250A",
        "US3947972A",
        "US3986208A",
        "US4006465A",
        "US4028733A",
        "US4032972A",
        "US4044380A",
        "US4054911A",
        "US4078316A",
        "US4115662A",
        "US4120003A",
        "US4131881A",
        "US4167759A",
        "US4186413A",
        "US4205343A",
        "US4213124A",
        "US4225752A",
        "US4233628A",
        "US4264925A",
        "US4267568A",
        "US4286320A",
        "US4291198A",
        "US4298928A",
        "US4305101A",
        "US4308558A",
        "US4317132A",
        "US4337483A",
        "US4361848A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4554631A",
        "US4555759A",
        "US4611227A",
        "WO1987007410A1",
        "US4725886A",
        "US4803651A",
        "US4833597A",
        "US4870576A",
        "US4916539A",
        "US5008819A",
        "US5032989A",
        "US5065338A",
        "US5065347A",
        "US5115504A",
        "US5121430A",
        "US5220652A",
        "US5224209A",
        "US5235680A",
        "US5261042A",
        "US5265244A",
        "US5276866A",
        "US5283731A",
        "US5307461A",
        "US5319453A",
        "US5355473A",
        "US5375235A",
        "US5388259A",
        "US5404505A",
        "US5428778A",
        "US5446678A",
        "US5508815A",
        "US5550746A",
        "US5581756A",
        "US5584025A",
        "WO1997010558A1",
        "WO1997021178A1",
        "GB2313941A",
        "US5724577A",
        "US5726898A",
        "US5737538A",
        "US5740549A",
        "US5768142A",
        "US5768521A",
        "US5781773A",
        "US5781246A",
        "US5794216A",
        "US5796090A",
        "US5808608A",
        "US5838917A",
        "US5870724A",
        "US5875110A",
        "US5880768A",
        "US5887243A",
        "US5940073A",
        "US5974407A",
        "US5978381A",
        "US6038601A",
        "US6061097A",
        "US6138162A",
        "WO2000078046A1",
        "US6167188A",
        "US6173311B1",
        "US6195661B1",
        "WO2001016800A1",
        "US6202060B1",
        "US6233581B1",
        "US20010003846A1",
        "US6331877B1",
        "US20020040472A1",
        "US20020054068A1",
        "US20020059610A1",
        "US6396546B1",
        "US20020073424A1",
        "US6408307B1",
        "US20020095673A1",
        "US6427147B1",
        "US20020108050A1",
        "US20020116293A1",
        "US6480857B1",
        "US6493877B1",
        "US20020198846A1",
        "US20020198845A1",
        "US20030009423A1",
        "US20030009424A1",
        "US20030023564A1",
        "US20030068046A1",
        "US20030079227A1",
        "US20030115602A1",
        "US20030130976A1",
        "US20030140003A1",
        "US20030144869A1",
        "US20030182142A1",
        "US20030188311A1",
        "US20030196201A1",
        "US20030196119A1",
        "US20030229593A1",
        "US20030233330A1",
        "US20040006542A1",
        "US20040024670A1",
        "US20040039704A1",
        "US20040045028A1",
        "US6712702B2",
        "US20040073920A1",
        "US20040093558A1",
        "US20040103439A1",
        "US20040111745A1",
        "US20040128686A1",
        "US20040128681A1",
        "US20040162784A1",
        "US6807558B1",
        "US20040221310A1",
        "US20040230529A1",
        "US20040236717A1",
        "US6832385B2",
        "US20040267552A1",
        "US20040264920A1",
        "US20050028218A1",
        "US20050028208A1",
        "US20050058433A1",
        "US20050097593A1",
        "US20050102696A1",
        "US20050125822A1",
        "US20050125823A1",
        "US20050137984A1",
        "US20050138660A1",
        "US20050149972A1",
        "US20050147247A1",
        "US20050204388A1",
        "US20050204384A1",
        "US20050229215A1",
        "US20050251827A1",
        "US20050251828A1",
        "US20050264793A1",
        "US20050283611A1",
        "US20050283800A1",
        "US20060092906A1",
        "US20060107326A1",
        "US20060106722A1",
        "US20060107046A1",
        "US20060106726A1",
        "US20060112015A1",
        "US20060143083A1",
        "US20060156336A1",
        "US20060167816A1",
        "US20060224822A1",
        "US20060236342A1",
        "US20060242665A1",
        "US20060248573A1",
        "US20060259925A1",
        "US20060271493A1",
        "US20070016469A1",
        "US20070038859A1",
        "US7185355B1",
        "US20070078777A1",
        "US20070094145A1",
        "US20070104456A1",
        "US20070107010A1",
        "US20070120645A1",
        "US20070157248A1",
        "US20070157247A1",
        "US20070157222A1",
        "US20070162398A1",
        "US20070162934A1",
        "US20070201702A1",
        "US20070220580A1",
        "US20070245019A1",
        "US20070266324A1",
        "US20070294229A1",
        "US20070294200A1",
        "US7328450B2",
        "US7336788B1",
        "US20080077958A1",
        "US20080104032A1",
        "US20080155607A1",
        "US20080155600A1",
        "US7401286B1",
        "US20080189268A1",
        "US20080243764A1",
        "US20080244638A1",
        "US20080288353A1",
        "US20080301732A1",
        "US20090012864A1",
        "US7487529B1",
        "US20090034935A1",
        "US7493646B2",
        "US7496943B1",
        "US20090060468A1",
        "US20090060469A1",
        "US20090069038A1",
        "US7509270B1",
        "US20090133078A1",
        "US20090132557A1",
        "US20090132440A1",
        "US20090165051A1",
        "US20090228912A1",
        "US20090241054A1",
        "US20090265278A1",
        "US20090313658A1",
        "US20090327137A1",
        "US20090328105A1",
        "US20100003267A1",
        "US20100037061A1",
        "US20100074600A1",
        "US7716349B1",
        "US20100121714A1",
        "US20100153997A1",
        "US20100154001A1",
        "US20100154005A1",
        "US20100153885A1",
        "US20100175084A1",
        "US20100186028A1",
        "US20100192177A1",
        "US7769344B1",
        "US7774280B2",
        "US20100211636A1",
        "US20100223261A1",
        "US20100223640A1",
        "US20100251281A1",
        "US7809644B2",
        "US20100257553A1",
        "US7814421B2",
        "US20100262931A1",
        "US20100262260A1",
        "US20100306708A1",
        "USRE41993E1",
        "US7849393B1",
        "US20100310230A1",
        "US20100311399A1",
        "US20100319013A1",
        "US20100325668A1",
        "US7861166B1",
        "US7865567B1",
        "US20110016492A1",
        "US20110041154A1",
        "US20110060718A1",
        "US20110070819A1",
        "US20110072452A1",
        "US7917436B2",
        "US20110078729A1",
        "US20110078731A1",
        "US20110078172A1",
        "US20110078020A1",
        "US20110078726A1",
        "US20110088060A1",
        "US20110093898A1",
        "US20110099573A1",
        "US20110162000A1",
        "US20110163939A1",
        "US20110176787A1",
        "US20110179454A1",
        "US20110197222A1",
        "US20110197232A1",
        "US8073695B1",
        "US8079044B1",
        "US8087047B2",
        "US8095949B1",
        "US8281339B1",
        "US8291461B2",
        "US8327403B1",
        "US8402488B2",
        "US8401890B1",
        "US8407737B1",
        "US8438601B2",
        "US8442916B2",
        "US8505049B2",
        "US8719857B1",
        "US8732758B2",
        "US8761584B2",
        "US8775245B2",
        "US8793738B2",
        "US8799954B1",
        "US8806533B1",
        "US8832742B2",
        "US8843963B2",
        "US8892495B2",
        "US8918807B2",
        "US8949901B2",
        "US8984550B2",
        "US8989561B1",
        "US9014546B2",
        "US9038103B2",
        "US9053640B1",
        "US9075861B2",
        "US9125169B2",
        "US9137491B2",
        "US9147198B2",
        "US9166714B2",
        "US9185332B2",
        "US9204193B2",
        "US9218122B2",
        "US9253262B2",
        "US9288521B2",
        "US9307281B2",
        "US9326025B2",
        "US9426509B2",
        "US9535563B2",
        "US9674563B2",
        "US9736524B2",
        "US9749693B2",
        "US9807436B2",
        "US9848276B2",
        "US9848161B2",
        "US9854318B2",
        "US9973817B1",
        "US10063934B2",
        "US10102597B1",
        "USRE47642E1"
    ],
    "citedby_ftf": []
}