{
    "patent_link": "https://patents.google.com/patent/US20010039527A1/en",
    "patent_id": "US20010039527A1",
    "title": "Offer matching system",
    "abstract": "An improved matching system for trading instruments in which the occurrence of automatically confirmed trades is dependent on receipt of match acknowledgement messages by the host computer (200) from all counterparties (KS A, KS B) to the matching trade. The host computer (200) matches like bids and offers provided thereto by the various keystations (KS A, KS B) in accordance with a predetermined matching criteria. Each of the keystations (KS A, KS B) includes a trade status timer (300, 302) and a display (310, 312) for timing receipt of a confirmed trade and/or ticket generation message from the host (200) after the keystation (KS A, KS B) has sent a match acknowledgement message and for displaying an “unconfirmed trade” status message awaiting receipt of the “confirmed trade” indication from the host (200). An alarm and a display message is provided at the keystation (KS A, KS B) when the “confirmed trade” indication is not timely received. The host (200) receives match acknowledgement messages from all of the counterparties (KS A, KS B) to the match before confirming a trade. A ticket is not generated at the keystation (KS A, KS B) until the trade has been confirmed by the host (200).",
    "inventors": [
        "Christopher J. Ordish",
        "John M. Richards",
        "Clifford A. Mackenzie"
    ],
    "assignee": "Individual",
    "classifications": [],
    "claims": "\n1. In a matching system for trading instruments in which bids for said trading instruments are automatically matched against offers for given trading instruments for automatically providing matching transactions in order to provide confirmed trades for said given trading instruments, said system comprising a host computer means for matching like bids and offers provided thereto in accordance with a predetermined matching criteria, a transaction originating keystation means for providing a bid on a given trading instrument to said system for providing a potential matching transaction, a counterparty keystation means for providing an offer on said given trading instrument involved in said potential matching transaction, and network means for interconnecting said host computer means, said transaction originating keystation means, and said counterparty keystation means in said system for enabling data communications therebetween; the improvement comprising match notification data message generation means for providing a match notification data message to said transaction originating keystation means and said counterparty keystation means via said network means in response to the occurrence of a matching transaction at said host computer means, said host computer means comprising said match notification data message generation means, said match notification data message comprising an unconfirmed matching transaction for said given trading instrument; and match acknowledgement data message generation means disposed at each of said keystation means for respectively providing a match acknowledgement data message to said host computer means via said network means in response to receipt of said match notification data message by said transaction originating keystation means and said counterparty keystation means, respectively; said host computer means further comprising confirmed trade data message generation means for providing a confirmed trade data message to said transaction originating keystation means and said counterparty keystation means via said network means in response to receipt of said match acknowledgement data messages from both said transaction originating keystation means and said counterparty keystation means; said transaction originating keystation means and said counterparty keystation means each further comprising trade status timing means for timing receipt of said confirmed trade data message by said respective keystation means for providing a trade status display at said respective keystation means based on said timed receipt/of said confirmed trade data message; whereby the occurrence of automatically confirmed trades is dependent on match acknowledgement from all counterparties to the matching trade.\n2. An improved matching system in accordance with\nclaim 1\nwherein said trade status timing means further comprises means for timing receipt of said confirmed trade data message by said respective keystation means in response to provision of said match acknowledgement data message from said respective keystation means.\n3. An improved matching system in accordance with\nclaim 2\nwherein said trade status timing means further comprises means for timing receipt of said confirmed trade data message by said respective keystation means for providing a confirmed trade status display in response to receipt of said confirmed trade data message by said respective keystation means within a predetermined time interval.\n4. An improved matching system in accordance with\nclaim 1\nwherein said trade status timing means further comprises means for timing receipt of said confirmed trade data message by said respective keystation means for providing a confirmed trade status display in response to receipt of said confirmed trade data message by said respective keystation means within a predetermined time interval.\n5. An improved matching system in accordance with\nclaim 4\nwherein said trade status timing means further comprises means for providing an unconfirmed trade status display during said predetermined time interval.\n6. An improved matching system in accordance with\nclaim 5\nwherein said trade status timing means further comprises alarm means for providing an alarm condition for said respective keystation means when said confirmed trade data message is not received within said predetermined time interval.\n7. An improved matching system in accordance with\nclaim 6\nwherein said trade status timing means further comprises means for providing a late confirmed trade status display in response to receipt of said confirmed trade data message after said predetermined time interval.\n8. An improved matching system in accordance with\nclaim 7\nwherein said trade status timing means further comprises means for timing receipt of said confirmed trade data message by said respective keystation means in response to provision of said match acknowledgement data message from said respective keystation means.\n9. An improved matching system in accordance with\nclaim 8\nwherein said trade status timing means further comprises message display means for displaying said trade status display at said respective keystation means.\n10. An improved matching system in accordance with\nclaim 9\nwherein said trading instruments comprise financial trading instruments.\n11. An improved matching system in accordance with\nclaim 1\nwherein said trade status timing means further comprises alarm means for providing an alarm condition for said respective keystation means when said confirmed trade data message is not received within a predetermined time interval.\n12. An improved matching system in accordance with\nclaim 11\nwherein said trade status timing means further comprises means for timing receipt of said confirmed trade data message by said respective keystation means in response to provision of said match acknowledgement data message from said respective keystation means.\n13. An improved matching system in accordance with\nclaim 12\nwherein said trade status timing means further comprises means for timing receipt of said confirmed trade data message by said respective keystation means for providing a confirmed trade status display in response to receipt of said confirmed trade data message by said respective keystation within said predetermined time interval.\n14. An improved matching system in accordance with\nclaim 13\nwherein said trade status timing means further comprises means for providing an unconfirmed trade status display during said predetermined time interval.\n15. An improved matching system in accordance with\nclaim 14\nwherein said trade status timing means further comprises means for providing a late confirmed trade status display in response to receipt of said confirmed trade data message after said predetermined time interval.\n16. An improved matching system in accordance with\nclaim 5\nwherein said trade status timing means further comprises means for timing receipt of said confirmed trade data message by said respective keystation means in response to provision of said match acknowledgement data message from said respective keystation means.\n17. An improved matching system in accordance with\nclaim 1\nwherein said trade status timing means further comprises message display means for displaying said trade status display at said respective keystation means.\n18. An improved matching system in accordance with\nclaim 17\nwherein said trade status timing means further comprises means for timing receipt of said confirmed trade data message by said respective keystation means in response to provision of said match acknowledgement data message from said respective keystation means.\n19. An improved matching system in accordance with\nclaim 18\nsaid trade status timing means further comprises alarm means for providing an alarm condition for said respective keystation means when said confirmed trade data message is not received within said predetermined time interval.\n20. An improved matching system in accordance with\nclaim 1\nwherein said trading instruments comprise financial trading instruments.\n21. An improved matching system in accordance with\nclaim 1\nwherein said confirmed trade data message generation means further comprises trading ticket data generation means, each of said keystation means further comprising means responsive to receipt of a trading ticket data message from said trading ticket data generation means for automatically providing a trading ticket corresponding to said confirmed trade.\n22. An improved matching system in accordance with\nclaim 21\nwherein said trade status timing means further comprises means for timing receipt of said confirmed trade data message by said respective keystation means in response to provision of said match acknowledgement data message from said respective keystation means.\n23. An improved matching system in accordance with\nclaim 22\nwherein said trade status timing means further comprises alarm means for providing an alarm condition for said respective keystation means when said confirmed trade data message is not received within a predetermined interval.\n24. An improved matching system in accordance with\nclaim 23\nwherein said host computer means further comprises alarm means for timing receipt of said match acknowledgement data message from said counterparty keystation means for providing an alert condition data message to said transaction originating keystation means when said match acknowledgement data message is not received from said counterparty keystation means within a predetermined time interval, said transaction originating keystation means alarm means further comprising means responsive to receipt of said alert condition data message for providing an alarm condition for said transaction originating keystation means.\n25. An improved matching system in accordance with\nclaim 1\nwherein said host computer means further comprises alarm means for timing receipt of said match acknowledgement data message from said counterparty keystation means for providing an alert condition data message to said transaction originating keystation means when said match acknowledgement data message is not received from said counterparty keystation means within a predetermined time interval.\n26. An improved matching system in accordance with\nclaim 25\nwherein said trade status timing means further comprises alarm means for providing an alarm condition for said respective keystation means when said confirmed trade data message is not received within a predetermined interval.\n27. An improved matching system in accordance with\nclaim 26\nwherein said transaction originating keystation means alarm means further comprises means responsive to receipt of said alert condition data message for providing an alarm condition for said transaction originating keystation means.\n28. An improved matching system in accordance with\nclaim 1\nwherein each of said keystation means further comprises store and print means for storing and printing received messages and their status.\n29. An improved matching system in accordance with\nclaim 28\nwherein said trade status timing means further comprises alarm means for providing an alarm condition for said respective keystation means when said confirmed trade data message is not received within a predetermined time interval.\n30. An improved matching system in accordance with\nclaim 1\nwherein each of said keystation means further comprises storage means for storing an initial data message, said match acknowledgement data message generation means comprising means for acknowledging said initial message after storage thereof.\n31. An improved matching system in accordance with\nclaim 30\nwherein said trade status timing means further comprises alarm means for providing an alarm condition for said respective keystation means when said confirmed trade data message is not received within a predetermined time interval.\n32. In an offer matching system comprising a host station, a plurality of client stations respectively connected to the host station by a communication link, said host station comprising means for matching bids and offers provided to said host station by said client stations; the improvement comprising a timer device at each of said client station means for acknowledging trading messages received at one of said client stations, said timer device being started in response to a first trading message at said one client station; and an alarm at said one client station responsive to said timer device continuing beyond a predetermined time.\n33. A system as claimed in\nclaim 32\nwherein said first trading message is a trading message received from another client station in response to an offer made from said one client station.\n34. A system as claimed in\nclaim 32\nwherein said first trading message is a trading message from said one client station acknowledging a trading message received from another client station.\n35. A system as claimed in\nclaim 32\nwherein said one client station comprises a status indicator, said status indicator being responsive to the timing out of said timer device to indicate ‘unconfirmed’ status and being set to ‘confirmed’ status by the receipt of said second trading message at said one client station.\n36. A system as claimed in\nclaim 33\nwherein said one client station comprises a status indicator, said status indicator being responsive to the timing out of said timer device to indicate ‘unconfirmed’ status and being set to ‘confirmed’ status by the receipt of said second trading message at said one client station.\n37. A system as claimed in\nclaim 34\nwherein said one client station comprises a status indicator, said status indicator being responsive to the timing out of said timer device to indicate ‘unconfirmed’ status and being set to ‘confirmed’ status by the receipt of said second trading message at said one client station.\n38. A system as claimed in\nclaim 35\nwherein said one client station comprises an alarm operable in response to said unconfirmed status.\n39. A system as claimed in\nclaim 38\nwherein said one client station comprises a store and print device to store and print received messages and their status.\n40. A system as claimed in\nclaim 32\nwherein said one client station comprises a store and print device to store and print received messages and their status.\n41. A system as claimed in\nclaim 32\nwherein said one client station comprises a store to store an initial message, said acknowledgement means being arranged to acknowledge said initial message after storage thereof.\n42. A system as claimed in\nclaim 32\nwherein said host station comprises a timer operable in response to a message received from a client station and re-settable in response to a message received from an associated client station.",
    "status": "Abandoned",
    "citations_own": [
        "US3335231A",
        "US3465298A",
        "US3573747A",
        "US3574747A",
        "US3581072A",
        "US3626385A",
        "US3728488A",
        "US3745529A",
        "US3795800A",
        "US3829842A",
        "US4114027A",
        "US4114029A",
        "US4276593A",
        "US4302810A",
        "US4369493A",
        "US4376982A",
        "US4376978A",
        "US4382810A",
        "US4404551A",
        "US4410889A",
        "US4412287A",
        "US4486853A",
        "US4525779A",
        "US4531184A",
        "US4625276A",
        "US4674044A",
        "US4677552A",
        "US4713811A",
        "US4745559A",
        "US4750135A",
        "US4789928A",
        "US4805204A",
        "US4833616A",
        "US4858112A",
        "US4868865A",
        "US4876652A",
        "US4897857A",
        "US4903201A",
        "US4926325A",
        "US4930093A",
        "US4960981A",
        "US4980826A",
        "US5003473A",
        "US5012426A",
        "US5038284A",
        "US5077665A"
    ],
    "citations_ftf": [
        "GB1489573A",
        "GB1489571A",
        "AU601328B2",
        "JPH02174360A",
        "US5168446A",
        "US5136501A",
        "EP0411748A3",
        "JPH03179863A",
        "US5130993A",
        "US5097470A",
        "US5305200A",
        "EP0512702A3",
        "US5375055A"
    ],
    "citedby_own": [
        "US20010042040A1",
        "US20020032632A1",
        "US20020065765A1",
        "US20030023546A1",
        "US20030097325A1",
        "US20030130925A1",
        "US20040059666A1",
        "US6850918B1",
        "US20050080723A1",
        "US20050091142A1",
        "US20050131802A1",
        "US20060020536A1",
        "US20060026087A1",
        "US20060059083A1",
        "US20060080186A1",
        "US20060089898A1",
        "US20060089899A1",
        "US20060095363A1",
        "US20060195386A1",
        "US20060200405A1",
        "US20070061231A1",
        "US20070106573A1",
        "US20070208648A1",
        "US20070239591A1",
        "US20070282733A1",
        "US20070288346A1",
        "US20080126832A1",
        "US7406443B1",
        "US20080228617A1",
        "US7599868B1",
        "US20090281855A1",
        "US20100153304A1",
        "US8150774B2",
        "US8244621B1",
        "US20130191238A1",
        "US8775294B1",
        "US9811859B2",
        "US9830654B2",
        "US10176442B2",
        "US10210572B2",
        "US10354324B2"
    ],
    "citedby_ftf": [
        "US6985883B1",
        "US6263321B1",
        "GB9416673D0",
        "US8588729B2",
        "US6876309B1",
        "US7702540B1",
        "US7937312B1",
        "US7130823B1",
        "US7647243B2",
        "US5905975A",
        "US6026383A",
        "US7249027B1",
        "US6505174B1",
        "US10586282B2",
        "US5950176A",
        "US20060173761A1",
        "US7487123B1",
        "US20050267836A1",
        "US6243691B1",
        "US6247000B1",
        "US6014644A",
        "US5905974A",
        "US6850907B2",
        "US6598029B1",
        "US6112189A",
        "TW432305B",
        "US5873071A",
        "US6161099A",
        "US8386363B2",
        "US6058379A",
        "US6157920A",
        "US7885882B1",
        "US6055504A",
        "US7268700B1",
        "AU2476899A",
        "CA2228331C",
        "US6240400B1",
        "US6035289A",
        "US6285989B1",
        "US7558752B1",
        "WO2000011587A1",
        "EP1105813A4",
        "US7792713B1",
        "US7283980B2",
        "US7383206B2",
        "US7395238B2",
        "US6230146B1",
        "US7249085B1",
        "US7599878B2",
        "US6058417A",
        "US7007076B1",
        "US20080288390A1",
        "US6618707B1",
        "US7840472B1",
        "US7162446B1",
        "US8527392B2",
        "US7020632B1",
        "US6584451B1",
        "AU2742900A",
        "WO2000048104A1",
        "US7499876B2",
        "US7225152B2",
        "US20020077959A1",
        "US6871191B1",
        "US7155409B1",
        "US6631356B1",
        "WO2000055778A1",
        "US6304850B1",
        "WO2000058890A1",
        "US7010511B1",
        "US7840476B1",
        "US7194427B1",
        "US6101484A",
        "US7392214B1",
        "AU4839800A",
        "US20030004859A1",
        "US7165046B2",
        "US6564192B1",
        "US6606607B1",
        "AU5900600A",
        "US6952682B1",
        "US6934690B1",
        "US7480627B1",
        "US7296001B1",
        "AU6368100A",
        "US7155410B1",
        "US8793178B2",
        "US7080050B1",
        "WO2001015044A1",
        "US6347444B1",
        "US7912761B2",
        "US7103565B1",
        "US6691153B1",
        "US7099839B2",
        "US7035819B1",
        "DE29917313U1",
        "US8401951B2",
        "US7475046B1",
        "US7107240B1",
        "US20020038279A1",
        "US6453337B2",
        "US6751597B1",
        "US6876991B1",
        "US7376611B1",
        "US7386497B1",
        "US6466917B1",
        "US7373312B1",
        "CA2394031A1",
        "JP2003528370A",
        "US8145555B2",
        "US7149718B1",
        "AU762794B2",
        "NZ519176A",
        "US7356498B2",
        "US9727916B1",
        "US7054844B2",
        "US7430533B1",
        "US7233923B1",
        "US8200547B2",
        "US7865420B1",
        "US8554659B2",
        "US7835957B1",
        "US8781940B2",
        "US7110975B2",
        "GB0001882D0",
        "WO2001057614A2",
        "US7162447B1",
        "US6847953B2",
        "US8290809B1",
        "US7428505B1",
        "US9614934B2",
        "DE10195918T1",
        "US7499875B1",
        "US8706618B2",
        "US7958009B1",
        "US7451108B1",
        "US6963855B1",
        "US6604107B1",
        "US7523114B2",
        "US8332302B1",
        "US7689495B1",
        "US7343342B2",
        "CA2407635A1",
        "US7127422B1",
        "US20070055578A1",
        "US7263498B1",
        "AU2001264855A1",
        "WO2001090925A2",
        "US20020002531A1",
        "US7877278B1",
        "US7673229B1",
        "WO2001095224A1",
        "US20010056395A1",
        "US7363246B1",
        "US7366690B1",
        "US7333952B1",
        "US7184982B1",
        "US7827085B1",
        "US7024386B1",
        "US6983259B1",
        "GB2364586B",
        "US7043457B1",
        "US20030018561A1",
        "TW552538B",
        "US7925566B1",
        "US6532460B1",
        "US6829589B1",
        "US20020013722A1",
        "US7130824B1",
        "US7409366B1",
        "US20020026400A1",
        "US7689498B2",
        "US7908180B2",
        "US20050015321A1",
        "WO2002021413A2",
        "US6944599B1",
        "US7970686B1",
        "US7110972B1",
        "US7158956B1",
        "US6523037B1",
        "US7660740B2",
        "US7672893B1",
        "US20020046127A1",
        "US7136834B1",
        "US6748422B2",
        "US7340429B2",
        "EP1340175A1",
        "US20020095307A1",
        "US7870054B2",
        "US8463714B1",
        "US7634439B1",
        "US8458214B1",
        "US8630938B2",
        "US7774276B1",
        "US8566211B2",
        "US7299206B2",
        "US7242669B2",
        "US20030088495A1",
        "US7840474B1",
        "US20020108115A1",
        "US20020072968A1",
        "US20020087456A1",
        "US8086518B1",
        "US7363269B2",
        "US7310733B1",
        "US7277878B2",
        "US7084998B2",
        "US7072061B2",
        "US8380608B2",
        "US20020111895A1",
        "WO2002069112A2",
        "WO2002071189A2",
        "US20030144907A1",
        "US6939137B1",
        "US8145557B2",
        "US7840475B2",
        "US7392217B2",
        "GB2375626A",
        "WO2002095528A2",
        "US20030208437A1",
        "US20020188548A1",
        "US8428996B2",
        "US20020194111A1",
        "US20030028470A1",
        "US7890375B2",
        "US20030041006A1",
        "US7076564B2",
        "US7752266B2",
        "US10354322B2",
        "US20030078858A1",
        "US20030083974A1",
        "AU2002363525B2",
        "US7536362B2",
        "US8005743B2",
        "US7305469B2",
        "US20030115127A1",
        "US8126799B2",
        "US20030135444A1",
        "US7146331B1",
        "US20030144944A1",
        "US7672895B2",
        "US7483852B2",
        "US9311673B2",
        "US20030229554A1",
        "US8719041B2",
        "US7941348B2",
        "US8078505B2",
        "AU2003243591A1",
        "US20040006530A1",
        "US7124110B1",
        "US7310620B2",
        "US8209254B2",
        "US7974908B1",
        "US8554650B1",
        "US7752115B2",
        "EP1416363A3",
        "US7693747B2",
        "GB2395036A",
        "US20040220884A1",
        "WO2004044811A1",
        "US7593866B2",
        "US7904346B2",
        "US8126701B2",
        "US9818136B1",
        "US10817937B1",
        "US7756777B2",
        "WO2004088460A2",
        "US7734518B2",
        "US7660762B1",
        "US8353763B2",
        "US7641549B2",
        "US9881308B2",
        "US7870066B2",
        "US7742985B1",
        "US20050044004A1",
        "US10515408B2",
        "US20050038732A1",
        "US20050065871A1",
        "US7831491B2",
        "US20050096999A1",
        "US8131625B2",
        "US8131626B2",
        "US7716079B2",
        "US20050125329A1",
        "US20050131800A1",
        "US7783555B2",
        "US20050131837A1",
        "US7567931B2",
        "US20110208633A1",
        "US7698198B2",
        "US20050171887A1",
        "US7835987B2",
        "US20050171890A1",
        "US8738498B2",
        "US10304097B2",
        "US7792763B2",
        "KR101119295B1",
        "US9189568B2",
        "GB0409610D0",
        "US20050246187A1",
        "US8370269B2",
        "US20060031177A1",
        "US7590589B2",
        "US8255314B2",
        "US8719075B2",
        "CA2582271A1",
        "US20060085251A1",
        "AU2005299618A1",
        "US7650309B2",
        "US20060155635A1",
        "US20060200394A1",
        "CA2518012A1",
        "US20060253353A1",
        "US7840477B2",
        "US7650307B2",
        "US8484122B2",
        "US8494951B2",
        "US7831501B2",
        "US7979340B2",
        "US7761365B2",
        "US8874477B2",
        "US8577779B2",
        "US20070106593A1",
        "US7711644B2",
        "US7711640B2",
        "US8229832B2",
        "US7979339B2",
        "US20070244831A1",
        "US8668146B1",
        "US7703673B2",
        "US10062062B1",
        "US8684265B1",
        "US9704174B1",
        "US8639782B2",
        "US8386364B2",
        "US8799218B2",
        "WO2008083375A1",
        "US7716118B2",
        "US7890417B2",
        "WO2008101230A1",
        "US20080228621A1",
        "US20080228620A1",
        "US7716120B2",
        "US7711633B2",
        "US7747516B2",
        "US7769675B2",
        "US9218720B2",
        "US8117105B2",
        "US8521627B2",
        "US8620759B1",
        "US7840481B2",
        "US20100082500A1",
        "US20100076883A1",
        "US8712903B2",
        "US8321323B2",
        "US20100057627A1",
        "US8549407B2",
        "US8583480B2",
        "US8214804B2",
        "WO2009102867A1",
        "EP2266089A4",
        "US8326662B1",
        "US7979506B2",
        "US8645203B2",
        "US8977565B2",
        "US20100332368A1",
        "US9747622B1",
        "US20100287032A1",
        "US8775398B2",
        "US8676632B1",
        "US20110196775A1",
        "US8538858B2",
        "US9047642B2",
        "US10262365B2",
        "WO2013169851A2",
        "WO2013169849A2",
        "EP2847662B1",
        "WO2013169845A1",
        "JP6082458B2",
        "WO2013169865A2",
        "WO2013169875A2",
        "JP6002836B2",
        "JP6273263B2",
        "JP2015519656A",
        "WO2013169842A2",
        "WO2013169843A1",
        "WO2013169877A2",
        "US10546262B2",
        "US10949876B2",
        "EP2939095B1",
        "EP2912542B1",
        "KR101958517B1",
        "KR102001332B1",
        "CN109375853A",
        "US11023947B1",
        "US11676192B1",
        "EP3514754A1",
        "US10810654B1",
        "US10769725B1",
        "US9483788B2",
        "US10664548B2",
        "US10929890B2",
        "US10872350B1",
        "US10380656B2",
        "US10095396B2",
        "US9645732B2",
        "US10048757B2",
        "US9785305B2",
        "US20170045981A1",
        "US9674426B2",
        "US9860451B2",
        "US10565646B2",
        "US11164248B2",
        "US11288739B2",
        "US10534845B2",
        "US10970769B2",
        "US11263707B2",
        "US11367093B2",
        "US11710196B2",
        "US11514493B1",
        "US11205179B1",
        "US11734368B1",
        "DE102022000391A1"
    ]
}