{
    "patent_link": "https://patents.google.com/patent/US4419731A/en",
    "patent_id": "US4419731A",
    "title": "Apparatus for estimating slant visibility in fog",
    "abstract": "Apparatus for estimating the slant visibility in obscured atmospheres such as fog, whereby an indication is derived as to when, during an aircraft landing approach in such conditions, the aircrew are likely to be able to see the runway lights. The apparatus comprises a transmissometer array arranged to take visibility readings over a slanted distance from different heights not far from a runway threshold, and a computer arranged to compare the readings with a plurality of fog profile models, to determine the definitive model and hence to derive and indicate a visual acquisition estimate.",
    "inventors": [
        "Alan W. Puffett"
    ],
    "assignee": "UK Secretary of State for Defence",
    "classifications": [
        "G01N21/538",
        "G01W1/00"
    ],
    "claims": "\n1. An apparatus for estimating slant visual range in fog comprising:\na transmissometer array, having at least three transmissometer elements at respectively greater differing heights h1, h2 and h3 above the ground and disposed for operation between the differing heights and ground level, for generating transmissometer signals indicative of a fog strength; and\na slant visual range (SVR) computer coupled to said transmissometer array so as to receive the transmissometer signals therefrom, said SVR computer having:\nmeans for converting the transmissometer signals into signals σh1, σh2, σh3 representing the mean integral of extinction coefficient between said respectively greater heights h1, h2, h3, above ground and ground level;\nmeans for storing a predetermined set of extinction coefficient σh function models, each model characterising a different type of fog pattern, each model having predetermined criteria for its selection and use, and containing at least one empirical constant;\nmeans for selecting one of the models in accordance with values of σh1, σh2, σh3 determined by said converting means;\nmeans for determining the values of the empirical constant in the selected model thus obtaining a definitive extinction coefficient profile,\nmeans for storing values representing airfield lighting and accepting values representing flight path and background brightness, and\nmeans for estimating slant visual range from the definitive profile and the airfield lighting, background brightness and flight path values.\n2. An apparatus according to claim 1 and wherein said converting means comprises means for converting the transmissometer array signals into σh signals in accordance with the function: ##EQU10## where R is the distance over which the measurement is taken:\nIh is the signal from said transmissometer array, and\nIo is a clear day datum transmissometer signal.\n3. An apparatus according to claim 1 wherein the means for storing function models comprises means for storing the following predetermined set of models and their respective predetermined criteria for selection and use: ##EQU11## where a, b, c, j, k, p, q, r are empirical constants and σh.sbsb.U and σh.sbsb.L are mean integrals of extinction coefficient between the ground and a height above and below the fog top respectively.\n4. An apparatus according to claim 1 further including means for determining a visual sequence from the selected σh function model.\n5. An apparatus according to claim 1 wherein said deriving means includes means for determining the intersection of the function: ##EQU12## with the definitive model, where γ and α are empirical constant respectively related to a flight path about and lighting pattern characteristics of an airport;\nET represents an eye illuminance threshold, measured in lux, and\nσhc is the mean integral of the extinction coefficient profile at the visual contact height.\n6. An apparatus according to claim 5 further comprising means for deriving the value Log10 (ET) for use in the Hc function when the value of ET is not known, from the function:\nLog.sub.10 (E.sub.T)=u log.sub.10 β-v,\nwhere\nβ represents background brightness in nits and u and v are empirical constants.\n7. An apparatus according to claim 1 further comprising a brightness measuring detector mounted on the transmissometer array for deriving the value of β.\n8. An apparatus according to claim 6 and further comprising means for comparing the value of Log10 (ET) with a value -w and for limiting the value of Log10 (ET)≧-w, where w is an accustomation factor for night use, the limited value being used in the Hc function.\n9. Apparatus according to claim 5 further comprising:\nmeans for storing aircraft configuration data;\nmeans for applying the aircraft configuration data to the derived Hc value; and\nmeans for modifying the Hc function in accordance with the aircraft configuration data.\n10. Apparatus according to claim 4 wherein the SVR computer comprises iteratively operable means for applying to the selected model, the particular lighting patterns, direction, intensity and visual threshold values at a sequence of aircraft positions, during a landing run.\n11. An apparatus according to claim 1 wherein said transmissometer elements disposed for operation at three different heights above the ground comprise reflector elements.\n12. An apparatus according to claim 1 wherein said transmissometer array comprises a source/detector transmissometer unit mounted substantially at ground level and a plurality of reflector elements mounted at different heights.\n13. An apparatus according to claim 1 wherein h3 is substantially 30 meters.\n14. An apparatus according to claim 1 wherein said transmissometer array is mounted on a tower disposed at least 370 meters laterally from the center line of a runway.\n15. An apparatus according to claim 1 wherein said transmissometer array is mounted on a tower disposed at least 350 meters ahead of a runway threshold.\n16. An apparatus according to claim 1 further including a distinct transmissometer separate from said transmissometer array and for substantially horizontal operation up to 4 meters above ground to provide a confirmation of the fog extent and of the σh profile estimate.\n17. An apparatus for estimating slant visual range in fog, comprising:\na transmissometer array disposed for slant operation and having reflector elements disposed at respectively greater different heights h1, h2 and h3 above ground and a source/detector unit transmissometer unit mounted substantially at ground level, said array being arranged for generating signals indicative of a fog structure;\na background brightness detector, and\nsignal processing means, arranged for receiving said signals derived from said transmissometer array and signals representing background brightness from said brightness detector and for estimating slant visual range, said signal processing means comprising:\nconverter means for converting the transmissometer signals into signals σh1, σh2, σh3 representing the mean integral of extinction coefficient between the respectively greater heights h1, h2, h3, (and the ground, said converter means for converting) in accordance with the function ##EQU13## where R is the distance over which the measurement is taken,\nIh is the fog structure indicative signal from the transmissometer in respect of a height h1, h2, h3, and\nIo is a clear day datum transmissometer signal, comparison means for comparing the σh signals and selecting one model from the following groups of three (3) models in accordance with the predetermined criteria associated with each model ##EQU14## where a, b, c, j, k, p, q, r are empirical constants and σhU and σhL are mean integrals of extinction coefficient between the ground and a height above and below the fog top respectively,\ndetermining means, coupled to said comparison means, for determining the values of the empirical constants in the selected model to establish a definitive model,\nstore means for storing values representing airfield lighting and accepting values representing flight path,\nLog10 (ET) deriving means operative to determine the value of Log10 (ET) from the function\nLog.sub.10 (E.sub.T)=u log.sub.10 β-v\nwhere ET represents the eye illuminance threshold, measured in lux, βrepresents background brightness in nits and u and v are empirical constants; (and)\nVisual contact height determining means coupled to said Log10 (ET) determining means, for determining the intersection of the function ##EQU15## with the definitive model, where γ and α are empirical constants respectively related to flight path about the lighting pattern of an airport, and iterative visual sequence determination means coupled to said comparison means and to said store means for providing a visual sequence.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3650627A",
        "US3702565A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4520360A",
        "US4740886A",
        "EP0444402A2",
        "US5046259A",
        "US5142478A",
        "US5343395A",
        "US5384719A",
        "US5592157A",
        "US5627511A",
        "US5787385A",
        "US6085152A",
        "US6119055A",
        "US20050228551A1",
        "US20090293012A1",
        "US7869943B1",
        "US7885733B1",
        "US8032267B1",
        "US8185301B1",
        "CN106706566A"
    ],
    "citedby_ftf": [
        "EP0091997A1",
        "GB2510617B",
        "GB2561258B"
    ]
}