{
    "patent_link": "https://patents.google.com/patent/US20140310026A1/en",
    "patent_id": "US20140310026A1",
    "title": "Systems, apparatus, and methods for customer-driven insurance claim management",
    "abstract": "Systems, apparatus, methods, and articles of manufacture provide for facilitating management of insurance claims, including providing a claim management interface (e.g., a claim management dashboard) for facilitating review of one or more particular claims according to one or more user-selected preferences (e.g., threshold amounts associated with a claim, types of changes to claims).",
    "inventors": [
        "Amy Balthazar",
        "Michael Strietelmeier"
    ],
    "assignee": "Travelers Indemnity Co",
    "classifications": [],
    "claims": "\n1. An apparatus comprising:\na processor; and\na computer-readable memory in communication with the processor, the computer-readable memory storing instructions configured so that when executed by the processor the instructions direct the processor to:\ndetermine at least one preference of a user for presenting claim information via a claim management interface;\ndetermine, based on the at least one preference, claim count information about at least one claim associated with the user;\ngenerate, via the claim management interface, a representation of the claim count information;\nreceive, via the claim management interface, an indication of a selection by the user of a claim count associated with one or more claims; and\ntransmit, via the claim management interface, claim detail information for the one or more claims.\n2. The apparatus of claim 1, wherein the at least one preference comprises a threshold amount associated with open claims.\n3. The apparatus of claim 1, wherein the at least one preference comprises a preference for claims having associated activity within a predetermined activity time period.\n4. The apparatus of claim 1, wherein the at least one preference comprises a preference for claims associated with at least a threshold change amount in dollar value.\n5. The apparatus of claim 1, wherein the at least one preference comprises a preference for claims associated with at least a threshold amount paid.\n6. The apparatus of claim 1, the instructions being further configured to direct the processor to:\nreceive, from the user, an annotation associated with a claim; and\nstore, in a data storage device, an indication of the annotation in association with the claim.\n7. The apparatus of claim 1, the instructions being further configured to direct the processor to:\nfacilitate a virtual claim review process by presenting the claim management interface to the user and to at least one other user.\n8. The apparatus of claim 1, the instructions being further configured to direct the processor to:\ntransmit, to the user, an alert indicating that at least one claim associated with the user has been identified based on the at least one preference.\n9. The apparatus of claim 1, wherein the at least one preference comprises:\na threshold amount associated with open claims,\na predetermined activity time period,\na threshold change amount in dollar value, and\na threshold amount paid.\n10. The apparatus of claim 1, wherein the at least one preference comprises at least one of the following:\na default sort order, and\na filter for determining the claim information.\n11. A non-transitory computer readable medium storing instructions configured so that when executed by a processor of a computing device the instructions direct the processor to:\ndetermine, by a computing device comprising at least one processor, at least one preference of a user for presenting claim information via a claim management interface;\ndetermine, by the computing device, based on the at least one preference, claim count information about at least one claim associated with the user;\ngenerate, by the computing device via the claim management interface, a representation of the claim count information;\nreceive, by the computing device via the claim management interface, an indication of a selection by the user of a claim count associated with one or more claims; and\ntransmit, by the computing device via the claim management interface, claim detail information for the one or more claims.\n12. The computer readable medium of claim 11, wherein the at least one preference comprises a threshold amount associated with open claims.\n13. The computer readable medium of claim 11, wherein the at least one preference comprises a preference for claims having associated activity within a predetermined activity time period.\n14. The computer readable medium of claim 11, wherein the at least one preference comprises a preference for claims associated with at least a threshold change amount in dollar value.\n15. The computer readable medium of claim 11, wherein the at least one preference comprises a preference for claims associated with at least a threshold amount paid.\n16. The computer readable medium of claim 11, the instructions being further configured to direct the processor to:\nreceive, from the user, an annotation associated with a claim; and\nstore, in a data storage device, an indication of the annotation in association with the claim.\n17. The computer readable medium of claim 11, the instructions being further configured to direct the processor to:\nfacilitate a virtual claim review process by presenting the claim management interface to the user and to at least one other user.\n18. The computer readable medium of claim 11, the instructions being further configured to direct the processor to:\ntransmit, to the user, an alert indicating that at least one claim associated with the user has been identified based on the at least one preference.\n19. The computer readable medium of claim 11, wherein the at least one preference comprises:\na threshold amount associated with open claims,\na predetermined activity time period,\na threshold change amount in dollar value, and\na threshold amount paid.\n20. The computer readable medium of claim 11, wherein the at least one preference comprises at least one of the following:\na default sort order, and\na filter for determining the claim information.",
    "status": "Abandoned",
    "citations_own": [],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": []
}