{
    "patent_link": "https://patents.google.com/patent/US20070053563A1/en",
    "patent_id": "US20070053563A1",
    "title": "Probabilistic boosting tree framework for learning discriminative models",
    "abstract": "A probabilistic boosting tree framework for computing two-class and multi-class discriminative models is disclosed. In the learning stage, the probabilistic boosting tree (PBT) automatically constructs a tree in which each node combines a number of weak classifiers (e.g., evidence, knowledge) into a strong classifier or conditional posterior probability. The PBT approaches the target posterior distribution by data augmentation (e.g., tree expansion) through a divide-and-conquer strategy. In the testing stage, the conditional probability is computed at each tree node based on the learned classifier which guides the probability propagation in its sub-trees. The top node of the tree therefore outputs the overall posterior probability by integrating the probabilities gathered from its sub-trees. In the training stage, a tree is recursively constructed in which each tree node is a strong classifier. The input training set is divided into two new sets, left and right ones, according to the learned classifier. Each set is then used to train the left and right sub-trees recursively.",
    "inventors": [
        "Zhuowen Tu",
        "Adrian Barbu"
    ],
    "assignee": "Siemens Medical Solutions USA Inc",
    "classifications": [
        "G06T7/74",
        "G06F18/214",
        "G06N20/00",
        "G06N7/01",
        "G06T7/77",
        "G06V10/774",
        "G06T2207/10072",
        "G06T2207/10132",
        "G06T2207/20132",
        "G06T2207/30044",
        "G06T2207/30048",
        "G06T2207/30201",
        "G06V2201/03"
    ],
    "claims": "\n1. A method for localization of an object in an image comprising the steps of:\na). constructing a probabilistic boosting tree in which each node combines a number of weak classifiers into a strong classifier or conditional posterior probability;\nb). receiving at least one input image containing the object to be localized;\nc). identifying a bounding box in the input image in which the object should reside based on the conditional posterior probability;\nd). computing a probability value for the bounding box based on the likelihood that the object in fact resides in that location;\ne). repeating steps c).-d). at different locations in the input image; and\nf). selecting the bounding box with the highest computed probability as the location where the object resides.\n2. The method of claim 1 wherein step e). further comprises the steps of:\nsearching the at least one input image at different rotations in the image; and\nsearching the at least one input image at different aspect ratios in the image.\n3. The method of claim 1 wherein the weak classifiers represent features of the object.\n4. The method of claim 1 wherein the object is an anatomical structure.\n5. The method of claim 4 wherein the anatomical structure is a left ventricle.\n6. The method of claim 4 wherein the anatomical structure is a fetus head.\n7. The method of claim 4 wherein the anatomical structure is a fetus abdomen.\n8. The method of claim 4 wherein the anatomical structure is a fetus femur.\n9. The method of claim 4 wherein the anatomical structure is a face.\n10. The method of claim 4 wherein the anatomical structure is a rectal tube.\n11. A method for detecting an object in an image comprising the steps of:\na). constructing a probabilistic boosting tree in which each node combines a number of weak classifiers into a strong classifier or conditional posterior probability;\nb). receiving at least one input image;\nc). identifying a bounding box in the at least one input image in which the object may reside based on the conditional posterior probability;\nd). computing a probability value for the bounding box based on the likelihood that the object resides in the image;\ne). comparing the probability to a predetermined threshold;\nf). maintaining the bounding box if the probability is above the predetermined threshold\ng). repeating steps c).-f). at different locations in the image; and\nh). determining that the object resides in the image if the probability for at least one bounding box is above the predetermined threshold.\n12. The method of claim 11 wherein step g).further comprises the steps of:\nsearching the at least one input image at different rotations in the image; and\nsearching the at least one input image at different aspect ratios in the image.\n13. The method of claim 12 wherein the searching is performed in a coarse to fine manner.\n14. The method of claim 11 wherein the weak classifiers represent features of the object.\n15. The method of claim 11 wherein the object is an anatomical structure.\n16. The method of claim 15 wherein the anatomical structure is a left ventricle.\n17. The method of claim 15 wherein the anatomical structure is a fetus head.\n18. The method of claim 15 wherein the anatomical structure is a fetus abdomen.\n19. The method of claim 15 wherein the anatomical structure is a fetus femur.\n20. The method of claim 15 wherein the anatomical structure is a face.\n21. The method of claim 15 wherein the anatomical structure is a rectal tube.\n22. A method of classifying images of objects into different image categories comprising the steps of:\nrecursively constructing a probabilistic boosting tree in which each tree node is a strong classifier, a discriminative model being obtained at the top of the tree and each level of the tree comprising an augmented variable;\ndividing an input training set into two new sets according to a learned classifier;\nusing the two new sets to train a left and right sub-trees recursively, wherein clustering is automatically formed in a hierarchical way; and\noutputting an appropriate number of classifications based on a number of clusters formed.\n23. The method of claim 22 wherein the probabilistic tree solves a two class problem.\n24. The method of claim 22 wherein the step of outputting an appropriate number of classifications comprises a positive class and a negative class.\n25. The method of claim 22 wherein the probabilistic tree solves a multi-class problem.\n26. The method of claim 25 wherein the step of outputting an appropriate number of classifications comprises multiple categories.\n27. The method of claim 22 wherein the object is an anatomical structure.\n28. The method of claim 27 wherein the anatomical structure is a left ventricle.\n29. The method of claim 27 wherein the anatomical structure is a fetus head.\n30. The method of claim 27 wherein the anatomical structure is a fetus abdomen.\n31. The method of claim 27 wherein the anatomical structure is a fetus femur.\n32. The method of claim 27 wherein the anatomical structure is a face.\n33. The method of claim 27 wherein the anatomical structure is a rectal tube.",
    "status": "Abandoned",
    "citations_own": [
        "US6546379B1",
        "US20050018890A1"
    ],
    "citations_ftf": [
        "US7203669B2"
    ],
    "citedby_own": [
        "US20050197980A1",
        "US20070172126A1",
        "US20070217688A1",
        "US20080071711A1",
        "US20090119237A1",
        "US20100036192A1",
        "US20110002520A1",
        "US20110119210A1",
        "US20110188715A1",
        "DE102010028382A1",
        "WO2011163017A2",
        "US20120039541A1",
        "US20120183193A1",
        "DE102011002927A1",
        "US20150254866A1",
        "US9348972B2",
        "US9508152B2",
        "EP3226176A1",
        "US20170337846A1",
        "US9934361B2",
        "US11017210B2",
        "CN113792569A",
        "US11215711B2",
        "WO2023105348A1",
        "US11710309B2"
    ],
    "citedby_ftf": [
        "US7986827B2",
        "US7995820B2",
        "US8073215B2",
        "WO2009050940A1",
        "US7668942B2",
        "US20100082697A1",
        "US8170332B2",
        "US8605969B2",
        "US8768944B2",
        "US8860715B2",
        "US8478009B2",
        "US8920322B2",
        "US9053391B2",
        "US8891884B2",
        "US9070047B2",
        "US8837771B2",
        "US9033887B2",
        "KR20140095601A",
        "US10318848B2",
        "CA3028921C",
        "US9946958B1",
        "US11432875B2",
        "US10660613B2",
        "KR102224627B1"
    ]
}