{
    "patent_link": "https://patents.google.com/patent/US5963547A/en",
    "patent_id": "US5963547A",
    "title": "Method and apparatus for centralized multipoint conferencing in a packet network",
    "abstract": "A centralized multipoint conferencing arrangement uses a combination of multicast and unicast transmissions that is bandwidth efficient. A method of conferencing includes transmitting multimedia streams from endpoint terminals to a central resource such as a multipoint control unit (MCU) using unicast transmission. The multimedia streams are processed in the MCU and transmitted back to the endpoint terminals using multicast transmission. In addition, the MCU transmits other multimedia streams to selected endpoint terminals using unicast transmission. At the selected endpoint terminals, processing of the multimedia streams is inhibited in favor of processing the other multimedia streams.",
    "inventors": [
        "John E. O'Neil",
        "George W. Kajos"
    ],
    "assignee": "Cisco Technology Inc",
    "classifications": [
        "H04L65/4038",
        "H04L12/1827",
        "H04M3/567",
        "H04M7/006",
        "H04N7/148",
        "H04N7/152"
    ],
    "claims": "\n1. A method of conferencing in a packet network, comprising the steps of:\ntransmitting first multimedia streams from endpoint terminals to a central resource, each first multimedia stream being transmitted in a unicast packet transmission;\nprocessing the first multimedia streams in the central resource to generate second and third multimedia streams;\ntransmitting the second multimedia streams from the central resource to the endpoint terminals in a multicast packet transmission and transmitting the third multimedia streams to selected endpoint terminals, each third multimedia stream being transmitted in a unicast packet transmission; and\ninhibiting processing of the second multimedia streams at the selected endpoint terminals.\n2. The method of claim 1 wherein the step of inhibiting comprises transmitting a control message from the central resource to the selected endpoint terminals, the control message suspending a logical channel at the selected endpoint terminal associated with the second multimedia streams.\n3. The method of claim 1 wherein the step of inhibiting comprises ignoring the second multimedia streams at the selected endpoint terminals.\n4. The method of claim 3 wherein a selected endpoint terminal ignores a second stream upon determining that the second stream includes information from the first multimedia stream of that selected endpoint terminal.\n5. The method of claim 1 wherein the step of transmitting the third multimedia streams includes transmitting a unicast video stream to a one of the selected endpoint terminals associated with a designated video broadcaster.\n6. The method of claim 1 wherein the step of transmitting the third multimedia streams includes transmitting a unicast audio stream to a one of the selected endpoint terminals associated with a designated audio broadcaster.\n7. The method of claim 1 wherein the multimedia streams comprise video and audio streams.\n8. A method of conferencing in a packet network, comprising the steps of:\ntransmitting first video streams from endpoint terminals to a central resource, each first video stream being transmitted in a unicast packet transmission;\nprocessing the first video streams in the central resource to generate second and third video streams;\ntransmitting the second video streams from the central resource to the endpoint terminals in a multicast packet transmission and transmitting the third video streams to selected endpoint terminals, each third video stream being transmitted in a unicast packet transmission; and\ninhibiting processing of the second video streams at the selected endpoint terminals.\n9. The method o f claim 8 wherein the step of inhibiting comprises transmitting a control message from the central resource to the selected endpoint terminals, the control message suspending a logical channel at the selected endpoint terminal associated with the second video streams.\n10. The method of claim 8 wherein the step of inhibiting comprises ignoring the second video streams at the selected endpoint terminals.\n11. The method of claim 10 ewherein a selected endpoint terminal ignores a second stream upon determining that the second stream includes information from the first multimedia stream of that selected endpoint terminal.\n12. The method of claim 8 wherein the selected endpoint terminals are each associated with a designated video broadcaster.\n13. A multipoint conferencing system for use in a packet network, the system comprising:\nendpoint terminals for transmitting and receiving multimedia streams, the terminals transmitting first multimedia streams using unicast packet transmission;\na central resource operative to receive the first multimedia streams, process the first multimedia streams to generate second and third multimedia streams, transmit the second streams to the endpoint terminals in multicast packet transmission and transmit the third streams to selected endpoint terminals in unicast packet transmission; and inhibiting means for inhibiting processing of the second multimedia streams at the selected endpoint terminals.\n14. The system of claim 13 wherein the inhibiting means transmits a control message from the central resource to the selected endpoint terminals, the control message suspending a logical channel at the selected endpoint terminal associated with the second multimedia streams.\n15. A multipoint conferencing system for use in a packet network, the system comprising:\nendpoint terminals for transmitting and receiving multimedia streams, the terminals transmitting first multimedia streams using unicast packet transmission;\na central resource operative to receive the first multimedia streams, process the first multimedia streams to generate second and third multimedia streams, transmit the second streams to the endpoint terminals in multicast packet transmission and transmit the third streams to selected endpoint terminals in unicast packet transmission; wherein the selected endpoint terminals ignore the second multimedia streams.\n16. The system of claim 15 wherein a selected endpoint terminal ignores a second stream upon determining that the second stream includes information from the first multimedia stream of that selected endpoint terminal.\n17. The system of claim 13 wherein a one of the selected endpoint terminals associated with a designated video broadcaster receives a unicast video stream.\n18. The system of claim 13 wherein a one of the selected endpoint terminals associated with a designated audio broadcaster receives a unicast audio stream.\n19. The system of claim 13 wherein the multimedia streams comprise video and audio streams.\n20. For use in a multipoint conferencing system having endpoint terminals which transmit and receive multimedia streams in a packet network, a multipoint conferencing unit comprising:\nan interface unit for transmitting and receiving multimedia streams to and from the endpoint terminals, the interface unit being operative to receive first multimedia streams sent from the terminals using unicast packet transmission;\na processor unit coupled to the interface unit for processing the first streams to second and third multimedia streams;\nthe interface unit further being operative to transmit the second streams to the endpoint terminals in multicast packet transmission and to transmit the third streams to selected endpoint terminals in unicast packet transmissions; and\ninhibiting means for inhibiting processing of the second streams at the selected endpoint terminals.\n21. The multipoint conferencing unit of claim 20 wherein the inhibiting means transmits a control message to the selected endpoint terminals, the control message suspending a logical channel at the selected endpoint terminal associated with the second streams.\n22. The multipoint conferencing unit of claim 20 wherein a one of the selected endpoint terminals associated with a designated video broadcaster receives a unicast video stream.\n23. The multipoint conferencing unit of claim 20 wherein a one of the selected endpoint terminals associated with a designated audio broadcaster receives a unicast audio stream.\n24. The multipoint conferencing unit of claim 20 wherein the multimedia streams comprise video and audio streams.\n25. A method of conferencing in a packet network, comprising the steps of:\ntransmitting a first multimedia stream from an endpoint terminal to a central resource in a unicast packet transmission;\nreceiving at the endpoint terminal from the central resource a second multimedia stream in a multicast packet transmission and a third multimedia stream in a unicast packet transmission; and\nselecting one of the second and third multimedia streams for processing at the endpoint terminal.\n26. The method of claim 25 wherein the step of selecting includes suspending a logical channel at the endpoint terminal associated with the second multimedia stream in response to receiving a control message from the central resource.\n27. The method of claim 25 wherein the step of selecting includes ignoring the second multimedia stream at the endpoint terminal.\n28. The method of claim 27 wherein the endpoint terminal ignores the second multimedia stream upon determining that the second multimedia stream includes information from the first multimedia stream.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5473363A",
        "US5600646A",
        "US5608726A",
        "US5787084A"
    ],
    "citations_ftf": [
        "ES2129038T3",
        "US5778187A"
    ],
    "citedby_own": [
        "WO2000033508A1",
        "US6151621A",
        "US6163810A",
        "US6163531A",
        "US6202084B1",
        "US6278478B1",
        "US6288740B1",
        "US6300973B1",
        "EP1146722A2",
        "WO2001078393A1",
        "WO2002029513A2",
        "US20020066109A1",
        "US6408327B1",
        "US6421706B1",
        "US6509925B1",
        "US20030026253A1",
        "US20030058836A1",
        "EP1298903A2",
        "EP1298904A2",
        "WO2003063485A1",
        "US20030174202A1",
        "US6654455B1",
        "US20040008249A1",
        "US20040022202A1",
        "US6697365B1",
        "US20040054728A1",
        "US20040071100A1",
        "EP1410563A2",
        "US6728236B2",
        "EP1414186A2",
        "US6731609B1",
        "US20040088168A1",
        "US20040098456A1",
        "US6781964B1",
        "US20040164145A1",
        "US6804254B1",
        "US20040230655A1",
        "US20040230651A1",
        "US20040236830A1",
        "US20040257433A1",
        "US20050021619A1",
        "US20050068904A1",
        "US20050135401A1",
        "US20050136086A1",
        "US20050231588A1",
        "US7006494B1",
        "US7079495B1",
        "US7092379B1",
        "US20060200520A1",
        "US20060200517A1",
        "US7158487B1",
        "US7161939B2",
        "US7174365B1",
        "US7177323B2",
        "US20070186093A1",
        "US20070198929A1",
        "US20070285501A1",
        "US20080016156A1",
        "US7328239B1",
        "US20080091838A1",
        "US20080091778A1",
        "US7362349B2",
        "US20080123621A1",
        "US20080239062A1",
        "US20080282165A1",
        "US7529798B2",
        "US7599357B1",
        "US7606909B1",
        "US20100005497A1",
        "US20100034201A1",
        "US7668907B1",
        "US20100110938A1",
        "US20100149301A1",
        "US20100157017A1",
        "US20100322137A1",
        "US20110087597A1",
        "EP2359596A1",
        "US8069205B1",
        "USRE44554E1",
        "US8872885B2",
        "WO2014177345A1",
        "US8917309B1",
        "US8947492B2",
        "US20150156455A1",
        "US9055332B2",
        "US9210302B1",
        "US9386273B1",
        "US9609275B2",
        "WO2019128266A1"
    ],
    "citedby_ftf": [
        "US6621514B1",
        "US7039040B1",
        "US6757259B1",
        "US6646997B1",
        "US7007098B1",
        "US7266609B2",
        "US8572278B2",
        "US7124166B2",
        "US7237033B2",
        "US7016348B2",
        "JP3920675B2",
        "US8028092B2",
        "US6963353B1",
        "JP3984929B2",
        "US20050044250A1",
        "CN100388780C",
        "US7084898B1",
        "EP1675373A1",
        "US7660850B2",
        "US7882176B2",
        "US8098599B2",
        "US7937442B2",
        "US8150917B2",
        "US8259624B2",
        "US20090019112A1",
        "JP4915450B2",
        "US8442198B2",
        "US8411129B2",
        "US8787547B2",
        "US8582474B2",
        "US9426423B2"
    ]
}