{
    "patent_link": "https://patents.google.com/patent/US4286330A/en",
    "patent_id": "US4286330A",
    "title": "Autonomic string-manipulation system",
    "abstract": "Method and means in the field of data processing, relating to the subfield of artificial or machine intelligence. These are concerned with finite strings of arbitrary symbols and their manipulation, including operations on strings, processes defined in terms of said operations, devices that embody said processes, and combinations of said processes and devices with conventional data processing systems to effect useful processing of data. The most important operation and process are, respectively, Tetracoding (TTC), and Basic Intellector Process (BIP). INTELLECTOR is a hardware implementation of BIPs, which is a functionally equivalent variant of BIP. One or more INTELLECTORs are connectable to conventional digital data processing systems, combining their respective autonomic and programmed data processing capabilities.",
    "inventors": [
        "Joel D. Isaacson"
    ],
    "assignee": "Individual",
    "classifications": [
        "G06F7/762",
        "G06F7/76"
    ],
    "claims": "\n1. In data processing apparatus, the method of manipulating a physical representation of a finite string, including storing the resulting recurrent cycle of strings, which comprises:\n(a) interfacing said representation of said string with said apparatus; and\n(b) hegelizing the interfaced representation of said string so as to generate and store in said apparatus the resulting recurrent cycle of strings for a finite duration.\nAlso, please enter the following corrections by amendment in the above mentioned application.\n2. In electrical data processing systems, the method of processing the electrical bit-signals representing the streak of any finite string, including storing a representation of the associated Hegelian cycle, comprising the steps of:\n(a) applying triunation to said electrical bit-signals;\n(b) applying triunation to the electrical bit-signals resulting from the preceding application of triunation; and\n3. The method as in claim 2 with the additional step of:\n(d) outputting trace patterns from said representation of Hegelian cycle for pattern analysis.\n4. In electrical data processing systems, the method of processing the electrical bit-signals representing the streak of any finite string, including storing a representation of the associated Hegelian cycle, comprising the steps of:\n(a) generating from said electrical bit-signals electrical bit-signals representing the streak of the tetracode of said string;\n(b) generating from the resulting electrical bit-signals electrical bit-signals representing the streak of the tetracode of the predecessor tetracode; and\n(c) repeating step (b) a sufficient number of times for storing said representation of Hegelian cycle for a finite duration thereby enabling the retrieval of any portion thereof for pattern analysis.\n5. In electrical data processing systems, the method of processing the electrical bit-signals representing the streak of any finite string, including storing a representation of the associated Hegelian cycle, comprising the steps of:\n(a) generating from said electrical bit-signals electrical bit-signals representing the tetracode of the tetracode of said string;\n(b) generating from the resulting electrical bit-signals electrical bit-signals representing the tetracode of the predecessor tetracode; and\n(c) repeating step (b) a sufficient number of times for storing said representation of Hegelian cycle for a finite duration thereby enabling the retrieval of any portion thereof for pattern analysis.\n6. In electrical data processing systems, the method of processing the electrical bit-signals representing the tetracode of any finite string, including storing a representation of the associated Hegelian cycle, comprising the steps of:\n(a) applying tetracoding to said electrical bit-signals;\n(b) applying tetracoding to the electrical bit-signals resulting from the preceding application of tetracoding; and\n(c) repeating step (b) a sufficient number of times for storing said representation of Hegelian cycle for a finite duration thereby enabling the retrieval of any portion thereof for pattern analysis.\n7. In data processing apparatus, the method of processing the signals representing the streak of any finite string, including storing a representation of the recurrent cycle of strings resulting therefrom, whether or not said cycle is masked by noise, comprising the steps of:\n(a) applying a string-manipulating operation to said signals, wherein said operation is possibly augmented by one or more auxiliary operations then constituting part(s) thereof; and wherein said operation is of a type that is functionally equivalent to the primary operation Triunation, as determinable by functional equivalency tests, such as reduction to truth tables or to Post canonical forms;\n(b) applying the string-manipulating operation to the signals resulting from the preceding application of said operation; and\n(c) repeating step (b) a sufficient number of times for storing in said apparatus said representation of the recurrent cycle of strings for a finite duration, thereby enabling the retrieval of any portion thereof for pattern analysis.\n8. In data processing apparatus, the method of processing the signals representing the tetracode of any finite string, including storing a representation of the recurrent cycle of strings resulting therefrom, whether or not said cycle is masked by noise, comprising the steps of:\n(a) applying a string-manipulating operation to said signals, wherein said operation is possibly augmented by one or more auxiliary operations then constituting part(s) thereof; and wherein said operation is of a type that is functionally equivalent to the primary operation Tetracoding, as determinable by functional equivalency tests, such as reduction to truth tables or to Post canonical forms;\n(b) applying the string-manipulating operation to the signals resulting from the preceding application of said operation; and\n(c) repeating step (b) a sufficient number of times for storing in said apparatus said representation of the recurrent cycle of strings for a finite duration, thereby enabling the retrieval of any portion thereof for pattern analysis.\n9. In data processing apparatus, the method of processing the signals representing an encoding of the mutual relations of elements in any finite string, including storing a representation of the recurrent cycle of strings resulting therefrom, whether or not said cycle is masked by noise, comprising the steps of:\n(a) applying a string-manipulating operation to said signals, wherein said operation is possibly augmented by one or more auxiliary operations and if so augmented then said auxiliary operation(s) become(s) constitutent part(s) thereof; and wherein said operation is of a type that is essentially functionally equivalent to any of the primary operations and their functional equivalents, as determinable by functional equivalency tests, such as reduction to truth tables or to Post canonical forms;\n(b) applying the string-manipulating operation to the signals resulting from the preceding application of said operation; and\n(c) repeating step (b) a sufficient number of times for storing in said apparatus said representation of the recurrent cycle of strings for a finite duration, thereby enabling the retrieval of any portion thereof for pattern analysis.\n10. In electrical data processing systems, a circuit for processing the binary-word representing the streak of any finite string comprising, in combination:\n(a) a clocked register having n binary cells where n is a whole number compatible with the length of said streak and n being three or larger, in combination with means for loading said binary-word into said register;\n(b) combinatorial logic means for processing a binary-word held in said register by comparing each bit-signal in said binary-word, except for the leftmost and rightmost bit-signals which are set LOW throughout said processing, with its left-neighbor bit-signal and with its right-neighbor bit-signal and emitting a HIGH bit-signal if said three compared bit-signals are all HIGH or all LOW and otherwise emitting a LOW bit-signal, where HIGH and LOW designate two distinct electrical states; and\n(c) feedback lines connecting the outputs of said combinatorial logic means to the inputs of said register to enable the loading of a binary-word generated by said combinatorial logic means into said register.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3106699A",
        "US3196398A",
        "US3271745A",
        "US3347981A",
        "US3430207A",
        "US3544773A",
        "US3569678A",
        "US3576973A",
        "US3613084A",
        "US3657704A",
        "US3775753A",
        "US3792440A",
        "US3794854A",
        "US3866188A",
        "US3904891A",
        "US3914627A",
        "US3916387A",
        "US3921153A",
        "US3921151A",
        "US3930144A",
        "US4003022A",
        "UST956003I4",
        "US4034344A",
        "US4060713A",
        "US4167728A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4447886A",
        "EP0118182A2",
        "US4504970A",
        "US4591979A",
        "US4593367A",
        "US4599692A",
        "US4599693A",
        "US4620286A",
        "US4648044A",
        "US4658370A",
        "US4670848A",
        "US4697242A",
        "US4698751A",
        "US4730259A",
        "US4734856A",
        "US4761746A",
        "US4783752A",
        "US4803641A",
        "US4805225A",
        "US4816994A",
        "US4821333A",
        "US4881178A",
        "US4916633A",
        "US4967368A",
        "US4974191A",
        "US5021995A",
        "US5043891A",
        "US5129013A",
        "US5146537A",
        "US5263124A",
        "US5265244A",
        "US5264933A",
        "US5353392A",
        "US5398199A",
        "US5557514A",
        "WO1998049629A1",
        "US6233546B1",
        "US6275817B1",
        "US6341372B1",
        "US6389406B1",
        "US6394263B1",
        "WO2002093563A2",
        "US6505184B1",
        "US6525185B1",
        "US20040059955A1",
        "US20040181547A1",
        "US20060280511A1",
        "US20070038654A1",
        "US7213041B2",
        "US7222079B1",
        "US20070162508A1",
        "US20070214153A1",
        "US20070220069A1",
        "US20070220070A1",
        "US20070219975A1",
        "US20070233723A1",
        "US7340471B2",
        "US7348980B2",
        "US7389301B1",
        "US7409380B1",
        "US7418445B1",
        "US20080275842A1",
        "US7593923B1",
        "US7676330B1",
        "US7676477B1",
        "US7689571B1",
        "US7716241B1",
        "US7908240B1",
        "US8340981B1",
        "US20170132301A1",
        "US10255311B2",
        "US10325031B2",
        "US10380089B2",
        "US10394785B2",
        "US10411878B2",
        "US10437886B2",
        "US10725989B2",
        "US11100137B2",
        "US11100070B2",
        "US11281646B2",
        "US11294665B1"
    ],
    "citedby_ftf": []
}