{
    "patent_link": "https://patents.google.com/patent/US20020138371A1/en",
    "patent_id": "US20020138371A1",
    "title": "Online transaction risk management",
    "abstract": "A computerized risk management method and system for facilitating analysis and quantification of risk associated with an online transaction. An online transaction risk management system maintains a database relating risk variables including credit ratings, news feeds, world events government advisories, and other information sources with data related to potential risk for a financial institution. The system generates a risk quotient or other rating based upon a weighted algorithm applied to the criteria, wherein the risk quotient is indicative of risk associated with an online transaction. The quotient can be monitored on a periodic basis, during the course of a transaction, or on demand. Actions commensurate with a risk quotient can be presented to an online market participant to help a subscribing online market participant properly manage risk associated with a particular entity or transaction. A log or other stored history can be created such that utilization of the system can mitigate adverse effects relating to a problematic transaction.",
    "inventors": [
        "David Lawrence",
        "Ajay Junnarkar"
    ],
    "assignee": "Goldman Sachs and Co LLC",
    "classifications": [
        "G06Q40/08",
        "G06Q30/02",
        "G06Q30/0601"
    ],
    "claims": "\n1. A computer-implemented method for managing risk related to an online transaction, the method comprising:\ngathering data generally related to risk variables associated with the online transaction;\nreceiving information relating details of the online transaction;\nstructuring the information received according to risk quotient criteria; and\ncalculating a risk quotient referencing the structured information and the gathered data.\n2. The method of claim 1 additionally comprising the step of generating a suggested action responsive to the risk quotient.\n3. The method of claim 2 additionally comprising the steps of:\nstoring the information received, the risk quotient and the suggested action; and\ngenerating a diligence report referencing the stored information.\n4. The method of claim 3 wherein the diligence report comprises the information received relating to details of the financial transaction and actions taken responsive to the risk quotient.\n5. The method of claim 2 wherein the suggested action is additionally responsive to the information received.\n6. The method of claim 2 wherein the suggested action is directed towards reducing risk related to the online transaction which involves online market participants from different national jurisdictions.\n7. The method of claim 2 wherein the suggested action comprises refusing to perform a transaction.\n8. The method of claim 2 wherein the suggested action comprises blocking access to an online marketplace by a particular online market participant.\n9. The method of claim 2 wherein the suggested action comprises notifying an authority.\n10. The method of claim 1 wherein the information received comprises the identity of a high-risk entity and the high-risk entity's relationship to an online market participant.\n11. The method of claim 1 wherein the information received comprises the identity of a secrecy jurisdiction.\n12. The method of claim 1 wherein the information received is gathered electronically by real-time monitoring of online transactions.\n13. The method of claim 1 additionally comprising the step of aggregating risk quotients relating to an online market participant to assess a level of identified risk to which the online market participant is exposed.\n14. The method of claim 1 additionally comprising the step of calculating an average risk quotient associated with a transaction.\n15. The method of claim 1 wherein the online transaction comprises a sale of goods.\n16. A computerized system for managing risk associated with an online transaction, the system comprising:\na computer server accessible with a network access device via a communications network; and\nexecutable software stored on the server and executable on demand, the software operative with the server to cause the system to:\ngather data related to risk variables for an online transaction;\nreceive information relating to details of the online transaction;\nstructure the information received according to risk quotient criteria; and\ncalculate a risk quotient referencing the structured information and the gathered data.\n17. The computerized system of claim 16 wherein the information is received via an electronic feed.\n18. The computerized system of claim 16 wherein the information received is generated by a government agency.\n19. The computerized system of claim 16 wherein the network access device is a personal computer.\n20. The computerized system of claim 16 wherein the network access device is a wireless handheld device.\n21. Computer executable program code residing on a computer-readable medium, the program code comprising instructions for causing the computer to:\ngather data related to risk variables for an online transaction;\nreceive information relating to details of the online transaction;\nstructure the information received according to risk quotient criteria; and\ncalculate a risk quotient referencing the structured information and the gathered data.\n22. A computer data signal embodied in a digital data stream comprising data relating to risk management, wherein the computer data signal is generated by a method comprising the steps of:\ngathering data generally related to risk variables associated with the online transaction;\nreceiving information relating details of the online transaction;\nstructuring the information received according to risk quotient criteria; and\ncalculating a risk quotient referencing the structured information and the gathered data.\n23. A method of interacting with a network access device so as to manage risk relating to an online transaction, the method comprising the steps of:\ninitiating interaction with a online transaction risk management server via a communications network;\nexecuting commands on the network access device which cause information relating to details of an online transaction to be transmitted to an online transaction risk management server; and\nreceiving a risk quotient indicative of a level of risk associated with the transaction.\n24. The method of claim 23 wherein the risk quotient is a numerical value.\n25. The method of claim 23 additionally comprising the step of receiving a description of suggested action that can be taken to mitigate a level of risk associated with the transaction.",
    "status": "Abandoned",
    "citations_own": [
        "US20020128945A1",
        "US20020139837A1"
    ],
    "citations_ftf": [
        "CA1341310C",
        "US6341267B1",
        "US6321212B1"
    ],
    "citedby_own": [
        "US20020138407A1",
        "US20020194059A1",
        "US20030177087A1",
        "US20030236742A1",
        "US20040006533A1",
        "US20040138998A1",
        "US20050021360A1",
        "US20050108151A1",
        "US20050108102A1",
        "US20050108178A1",
        "US20050131752A1",
        "US6975996B2",
        "US20060004719A1",
        "US20060004878A1",
        "WO2005043291A3",
        "US20070085524A1",
        "US20080005394A1",
        "US20080147525A1",
        "US20080154787A1",
        "US20080319922A1",
        "US20090030756A1",
        "US20090119155A1",
        "US7548883B2",
        "US20100057599A1",
        "US20100076889A1",
        "US20100114757A1",
        "US20100250387A1",
        "US20110047076A1",
        "US7899722B1",
        "US7904365B2",
        "US7904361B2",
        "US20110066551A1",
        "US20110238566A1",
        "US8121937B2",
        "US8209246B2",
        "US20120185405A1",
        "US8285615B2",
        "US20130085917A1",
        "WO2013082190A1",
        "WO2013163114A1",
        "US8600855B2",
        "US20130346142A1",
        "US8762191B2",
        "WO2014143070A1",
        "US20140337087A1",
        "US8996481B2",
        "KR20170137138A",
        "US10223710B2",
        "US10652282B2",
        "US10867268B1",
        "US11126746B2",
        "US11132698B1",
        "US11335336B2",
        "US11468446B2"
    ],
    "citedby_ftf": [
        "EP1784767A4",
        "US8156022B2",
        "US8019694B2",
        "US7945501B2",
        "WO2008124719A1",
        "US8160952B1",
        "CN107230008B"
    ]
}