{
    "patent_link": "https://patents.google.com/patent/US5616504A/en",
    "patent_id": "US5616504A",
    "title": "Method and system for calibration of immunoassay systems through application of bayesian analysis",
    "abstract": "A method for improved measurement of a concentration of an analyte in a sample having an unknown concentration of the analyte includes using an affinity assay having an experimental indicator. Standard and control samples, each having a known concentration of the analyte are assayed and a response, an amount of experimental indicator emitted for each sample is detected. The unknown sample is also assayed and its response is detected. A prior probability density is supplied for the unknown concentration, along with a model for a standard curve relating an expected response to a concentration of the analyte. A posterior density, having a median, for the unknown concentration is generated based on the supplied prior density, the supplied model, and the responses for the standard samples, the control samples and the unknown samples, by applying Bayes' rule. The median of the posterior density may be provided as the measure of concentration of analyte in the unknown sample, with an accuracy defined by the standard deviation of the posterior density. The standard curve preferably accounts for relative error due to experimental variation by using a random variable to represent variations on the analyte concentration scale due to variability in the preparation of samples in the laboratory. The minimal detectable dose for a single assay run may also be determined.",
    "inventors": [
        "Emery N. Brown",
        "Steven J. Skates"
    ],
    "assignee": "General Hospital Corp",
    "classifications": [
        "G01N35/00693",
        "G01N33/48",
        "G01N33/50",
        "G01N33/53",
        "G01N2035/00702",
        "Y10S436/804"
    ],
    "claims": "\n1. A method for measuring a concentration of an analyte in a sample having an unknown concentration of the analyte using a binding assay in which a labelled binding partner for the analyte is allowed to react with the analyte to form a labeled complex in an assayed sample, wherein the labeled binding partner includes a tag which emits an experimental indicator and wherein the assayed sample emits in a predetermined period of time an amount of the experimental indicator, which amount is a response emitted by the assayed sample, the method comprising the steps of: assaying a plurality of known samples using the binding assay, wherein each known sample has a known concentration of the analyte and is allowed to react with the labeled binding partner for the analyte to form a first labeled complex and the first labeled complex is detected to obtain a response emitted by each assayed known sample;\nassaying the unknown sample using the binding assay, wherein each unknown sample is allowed to react with the labeled binding partner for the analyte to form a second labeled complex and the second labeled complex is detected to obtain a response emitted by the assayed unknown sample;\nsupplying a prior probability density for the unknown concentration and a probability model which specifics a standard curve relating an expected response to a concentration of the analyte;\ngenerating a posterior density for the unknown concentration based on the supplied prior density, the supplied probability model, and the responses for the assayed known samples and the assayed unknown sample, by applying Bayes' rule; and\nproviding a characteristic of the posterior density as a measure of the concentration of the analyte in the unknown sample.\n2. A method for measuring a concentration of an analyte in a sample having an unknown concentration of the analyte using a competitive binding assay in which a the analyte and a labeled competitor of the analyte are allowed to react with a binding partner for the analyte, wherein the labeled competitor includes a tag which emits an experimental indicator, wherein the analyte and the labeled competitor compete with one another for binding to the binding partner to form a labeled complex in an assayed sample, wherein the assayed sample emits in a predetermined period of time an amount of the experimental indicator, which amount is a response emitted by the assayed sample, the method comprising the steps of:\nassaying a plurality of known samples using the competitive binding assay, wherein each known sample has a known concentration of the analyte and is allowed to react with the binding partner and the labeled competitor to form a first labeled complex and the first labeled complex is detected to obtain a response emitted by each assayed known sample;\nassaying the unknown sample using the competitive binding assay, wherein each unknown sample is allowed to react with the binding partner and the labeled competitor to form a second labeled complex and the second labeled complex is detected to obtain a response emitted by the assayed unknown sample;\nsupplying a prior probability density for the unknown concentration and a probability model which specifies a standard curve relating an expected response to a concentration of the analyte;\ngenerating a posterior density for the unknown concentration based on the supplied prior density, the supplied probability model, and the responses for the assayed known samples and the assayed unknown sample, by applying Bayes' rule; and\nproviding a characteristic of the posterior density as a measure of the concentration of the analyte in the unknown sample.\n3. The method of claim 1 or claim 2, wherein the posterior density has a dispersion, a coefficient of variation, a variance, and a resolution, and further comprising the step of providing a measure of accuracy of the provided measure of concentration, wherein the measure of accuracy is one of a summary of the dispersion, the coefficient of variation, the resolution and the variance.\n4. The method of claim 1 or claim 2, further comprising the step of providing a measure of accuracy of the measure of concentration of the analyte, wherein the measure of accuracy is defined in terms of the posterior density.\n5. The method of claim 1 or claim 2, further comprising the step of determining a minimal detectable dose, thereby defining a lowest analyte concentration which can be detected.\n6. The method of claim 4, further comprising the step of decomposing the measure of accuracy into an experimental error and a response error.\n7. The method of claim 1 or claim 2, wherein the posterior density is determined using estimated parameters of the supplied probability model.\n8. The method of claim 7, wherein the estimated parameters are determined using a weighted least-squares technique and using the responses obtained for the known samples.\n9. The method of claim 7, wherein the estimated parameters are determined using maximum likelihood estimation and using the responses obtained for the known samples.\n10. The method of claim 7, wherein the estimated parameters of the probability model are derived using the responses for the known samples and the unknown sample.\n11. The method of claim 7, wherein the estimated parameters are derived using the responses for the known samples.\n12. The method of claim 7, further comprising the step of integrating out the estimated parameters of the probability model to account for uncertainty in these parameters while deriving an inference for the measure of the analyte concentration of the unknown sample.\n13. The method of claim 1 or claim 2, wherein the probability model has a standard curve which is derived from a mass-action law for an underlying chemical reaction of the binding assay.\n14. The method of claim 1 or claim 2, wherein the probability model used to specify the standard curve includes a random variable which represents variations in concentration of analyte due to variability in preparation of samples, whereby the posterior density is a mixture of random variables.\n15. The method of claim 5, further comprising the step of determining a posterior density for apparently blank known samples, and a highest probability density interval having a left endpoint and a right endpoint, such that the minimum detectable dose is a maximum value of a set of medians of probability densities of random variables Hy for which zero is the left endpoint of the highest probability density interval of random variables Hy -Hy|0.\n16. The method of claim 1, wherein the step of assaying a known sample includes the steps of:\nmixing the known sample with the labeled binding partner to allow the analyte and the labeled binding partner to react and to form the first labeled complex;\nseparating the first labeled complex from other material; and\ndetecting the response emitted by the first labeled complex as the response emitted by the known sample.\n17. The method of claim 1, wherein the step of assaying an unknown sample includes the steps of:\nmixing the unknown sample with the labeled binding partner to allow the analyte and the labeled binding partner to react and to form the first labeled complex;\nseparating the first labeled complex from other material; and\ndetecting the response emitted by the first labeled complex as the response emitted by the unknown sample.\n18. The method of claim 2, wherein the step of assaying a known sample includes the steps of:\nmixing the known sample with the binding partner and the labeled competitor to allow the analyte and the labeled competitor to compete for the binding to the binding partner;\nseparating bound material from unbound material; and\ndetecting the response emitted by the bound material as the response emitted by the known sample.\n19. The method of claim 2, wherein the step of assaying an unknown sample includes the steps of:\nmixing the unknown sample with the binding partner and the labeled competitor to allow the analyte and the labeled competitor to compete for the binding to the binding partner;\nseparating bound material from unbound material; and\ndetecting the response emitted by the bound material as the response emitted by the unknown sample.\n20. A system for measuring a concentration of an analyte in a sample having an unknown concentration of the analyte using a binding assay including a labeled binding partner having a tag which emits an experimental indicator and wherein an assayed sample emits, in a predetermined period of time, an amount of the experimental indicator, which amount is a response emitted by the assayed sample, comprising:\na detector arranged to detect the response of the assayed sample, and providing an output indicative of the response detected; and\na computer system having an input connected to receive the output from the detector, and including a memory and a processing unit, the memory having stored therein a prior probability density for the unknown concentration and a probability model which specifies a standard curve relating an expected response to a concentration of the analyte, the processing unit including:\nmeans for controlling the binding assay and the detector to detect a response of a plurality of known samples and the unknown sample in the predetermined period of time;\nmeans for generating a posterior density for the unknown concentration based on the stored prior density, the stored probability model, and the responses for the known samples and the unknown samples, by applying Bayes' rule; and\nmeans for communicating a characteristic of the posterior density as a measure of the concentration of analyte in the unknown sample.\n21. The system of claim 20, wherein the posterior density has a dispersion, a coefficient of variation, a variance, and a resolution, and further comprising means for communicating a measure of accuracy of the measure of concentration, wherein the measure of accuracy is one of a summary of the dispersion, the coefficient of variation, the resolution and the variance.\n22. The system of claim 20, further comprising means for communicating a measure of accuracy of the measure of concentration of the analyte, wherein the measure of accuracy is defined in terms of the posterior density.\n23. The system of claim 20, further comprising means for determining a minimal detectable dose, thereby defining a lowest analyte concentration which can be detected.\n24. The system of claim 22, further comprising means for decomposing the measure of accuracy into an experimental error and a response error.\n25. The system of claim 20, wherein the posterior density is determined using estimated parameters for the supplied probability model.\n26. The system of claim 25, wherein the estimated parameters are determined using a weighted least-squares technique and using the responses obtained for the known samples.\n27. The system of claim 25, wherein the estimated parameters are determined using maximum likelihood estimation and using the responses obtained for the known samples.\n28. The system of claim 25, wherein the estimated parameters are derived using the responses for the known sample and the unknown samples.\n29. The system of claim 25, wherein the estimated parameters are derived using the responses for the known samples.\n30. The system of claim 25, further comprising means for integrating out the estimated parameters of the probability model to account for uncertainty in these parameters while deriving an inference for the measure of the analyte concentration of the unknown sample.\n31. The system of claim 20, wherein the probability model specifies a standard curve which is derived from a mass-action law for an underlying chemical reaction of the binding assay.\n32. The system of claim 20, wherein the probability model includes a random variable which represents variations in concentration of analyte due to variability in preparation of samples, whereby the posterior density is a mixture of random variables.\n33. The system of claim 20, further comprising means for determining a posterior density for apparently blank known samples, and a highest probability density interval having a left endpoint and a right endpoint, such that the minimum detectable dose is a maximum value of a set of medians of probability densities of random variables Hy for which zero is the left endpoint of the highest probability density intervals of the random variables Hy -Hy|0.\n34. The method of claim 3, further comprising the step of decomposing the measure of accuracy into an experimental error and a response error.\n35. The system of claim 21, further comprising means for decomposing the measure of accuracy into an experimental error and a response error.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "EP0368462A1",
        "EP0505003A2"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6292761B1",
        "WO2002065119A1",
        "US6556960B1",
        "US20040018484A1",
        "WO2004084708A3",
        "EP1835291A2",
        "US20080161655A1",
        "US20090055101A1",
        "US20100010373A1",
        "US20130151189A1",
        "US8903192B2",
        "CN107356650A",
        "CN109690318A",
        "CN112782413A",
        "CN113405958A",
        "US11243785B2"
    ],
    "citedby_ftf": []
}