{
    "patent_id": "US-11350929-B2",
    "title": "Surgical instrument with wireless communication between control unit and sensor transponders ",
    "assignee": "Cilag Gmbh International",
    "publication_date": "2022-06-07",
    "patent_link": "https://patents.google.com/patent/US11350929B2/en",
    "inventors": [
        "James R. Giordano",
        "Frederick E. Shelton, IV",
        "Jeffrey S. Swayze"
    ],
    "classifications": [
        "A61B17/07207",
        "A61B17/068",
        "A61B17/00",
        "A61B50/30",
        "A61B90/98",
        "A61B17/00234",
        "A61B2017/00022",
        "A61B2017/00039",
        "A61B2017/00212",
        "A61B2017/00221",
        "A61B2017/00362",
        "A61B2017/00398",
        "A61B2017/00734",
        "A61B2017/0688",
        "A61B2017/07214",
        "A61B2017/2927",
        "A61B2017/320052",
        "A61B2050/3015",
        "A61B2050/314",
        "A61B2090/065",
        "A61B2090/0811",
        "A61B2560/0266"
    ],
    "abstract": "A surgical instrument is disclosed. The surgical instrument includes a control unit and a staple cartridge including a transponder. The control unit is configured to transmit a first wireless signal to the transponder and to receive a second wireless signal from the transponder to determine one of a first electronic state and a second electronic state of the transponder based on the second wireless signal.",
    "claims": "\n1. A surgical system, comprising:\na stapling instrument comprising a firing drive including an electric motor and a control system; and\na staple cartridge, comprising:\na cartridge body comprising a proximal end and a distal end;\nstaples removably stored in said cartridge body;\na firing member movable from said proximal end toward said distal end during a staple firing stroke; and\na sensor system comprising a wireless RFID transponder in communication with said control system, wherein said staple cartridge is configurable in a plurality of states, wherein said plurality of states comprises a used state and an unused state, wherein said wireless RFID transponder is configured to transmit a status of said staple cartridge to said control system, and wherein said status is indicative of said used state or said unused state of said staple cartridge.\n2. The surgical system of claim 1, wherein said sensor system further comprises a position sensor configured to sense the position of said firing member during said staple firing stroke, wherein said position sensor is in communication with said control system, and wherein said control system is configured to control the operation of said electric motor based on data received from said sensor system.\n3. The surgical system of claim 1, wherein said stapling instrument comprises a first jaw and a second jaw, wherein said second jaw is movable between an open position and a clamped position, wherein said second jaw is configured to apply a clamping pressure to tissue positioned intermediate said first jaw and said second jaw when said second jaw is in said clamped position, wherein said sensor system comprises a pressure sensor configured to sense the clamping pressure, wherein said pressure sensor is in communication with said control system, and wherein said control system is configured to control the operation of said electric motor based on data received from said sensor system.\n4. The surgical system of claim 1, wherein said staple cartridge further comprises a memory device in communication with said RFID transponder, and wherein said RFID transponder is configured to transmit data stored on said memory device to said control system.\n5. A staple cartridge for use with a surgical instrument, comprising:\na cartridge body comprising a proximal end and a distal end;\nstaples removably stored in said cartridge body;\na firing member movable from said proximal end toward said distal end during a staple firing stroke; and\na sensor system comprising a wireless RFID transponder in communication with a control system of the surgical instrument, wherein the control system of the surgical instrument is configured to control the operation of an electric motor of the surgical instrument based on data received from said sensor system, wherein said wireless RFID transponder is configured to transmit a status of said staple cartridge to the control system, and wherein said status of said staple cartridge is indicative of whether or not said staple cartridge has been fired.\n6. The staple cartridge of claim 5, wherein said sensor system further comprises a position sensor configured to sense the position of said firing member during said staple firing stroke.\n7. The staple cartridge of claim 6, wherein said sensor system comprises a pressure sensor configured to sense clamping pressure between a first jaw and a second jaw of the surgical instrument.\n8. The staple cartridge of claim 5, wherein said staple cartridge further comprises a memory device in communication with said RFID transponder, and wherein said RFID transponder is configured to transmit data stored on said memory device to the control system.\n9. A surgical system, comprising:\na stapling instrument comprising a firing drive including an electric motor and a control system; and\na staple cartridge, comprising:\na cartridge body comprising a proximal end and a distal end;\nstaples removably stored in said cartridge body;\na firing member movable from said proximal end toward said distal end during a staple firing stroke; and\na sensor system comprising a wireless RFID transponder in communication with said control system, wherein said staple cartridge is transitionable from a first physical state to a second physical state that is different from said first physical state, wherein said wireless RFID transponder is configured to transmit a status of said staple cartridge to said control system, and wherein said status is indicative of said first physical state or said second physical state."
}