{
    "patent_link": "https://patents.google.com/patent/US20100057682A1/en",
    "patent_id": "US20100057682A1",
    "title": "Information Feeds of a Social Network",
    "abstract": "Various embodiments can be configured to provide a social networking computing environment. In an embodiment, a networked computing system can be used to provide informational feeds and commenting functionality to users of a social computing environment. In one embodiment, an enterprise-based social computing system can be configured to provide informational feeds to social networking application users. An informational feed can be populated with events and other information associated with one or more users of interest of an application user, but is not so limited. In one embodiment, a social computing environment can be configured to allow user commenting to feed items or events that are associated with a user or group of users.",
    "inventors": [
        "Donald A. Ramsay, JR.",
        "Gary Caldwell",
        "Ning Jiang",
        "Venkatesh Veeraraghavan",
        "Gail Borod Giacobbe"
    ],
    "assignee": "Microsoft Technology Licensing LLC",
    "classifications": [],
    "claims": "\n1. A method of providing information to one or more users of a social networking computing environment comprising:\ngenerating an informational feed that includes system-generated events associated with one or more users of interest of a social computing network;\nproviding a comment to a system-generated event associated with a defined user of interest;\nupdating the informational feed to delineate the comment; and,\nproviding the updated informational feed to a tracking user.\n2. The method of claim 1, expanding an enterprise-based social network to include a commenting user who commented on the system-generated event.\n3. The method of claim 1, further comprising providing comments to one or more of the system-generated events as part of an Intranet-based social networking computing system.\n4. The method of claim 1, further comprising generating a message to inform the tracking user of one or more comments.\n5. The method of claim 1, further comprising providing the comment to one or more users being tracked by the tracking user.\n6. The method of claim 5, further comprising expanding the social network to one or more users of interest of the tracking user.\n7. The method of claim 1, further comprising:\nretrieving events associated with one more monitored users from back-end systems of an enterprise computing network; and,\nincluding the events in the informational feed.\n8. The method of claim 1, further comprising including one or more comments in an event feed of another user based in part on an affiliation with a commenting user.\n9. The method of claim 1, further comprising including one or more comments in an event feed of another user based in part on an affiliation with a tracking user.\n10. The method of claim 1, further comprising including adding a commenting user as a user of interest to a tracking list.\n11. The method of claim 11, further comprising compressing a comment by an associated event when the comment and associated event occur within a defined amount of time.\n12. The method of claim 1, further comprising including the comment and information associated with a commenting user as part of the informational feed.\n13. A system configured to provide a social computing environment comprising:\na collector to collect information associated with users of the system;\na filter to filter the collected information and provide events associated with one or more users of interest;\na comment component configured to provide commenting functionality to system users; and,\na feed generator to create an event feed that includes the one or more filtered events, including information associated with one or more user comments, and provide the event feed to a target user.\n14. The system of claim 13, wherein the comment component can operate to inform a user of a user comment.\n15. The system of claim 13, wherein the feed generator can populate an event feed with a user comment, including a time and an identity of a commenting user.\n16. The system of claim 13, further comprising a user relation management component that can be used to expand a user's social network by automatically adding a commenting user to a tracking list.\n17. The system of claim 16, wherein the feed generator can provide one or more events associated with the tracking user in an event feed of the commenting user.\n18. A computer-readable storage medium with instructions which, when executed, provide an interactive social network by:\ncreating an event stream that includes events associated with one or more enterprise users, wherein the event stream can be tailored for a tracking user;\nreceiving a comment associated with a system-generated event of the informational feed;\ninterspersing the comment with the event feed; and,\nproviding the event feed to the tracking user.\n19. The computer-readable storage medium of claim 18, wherein the instructions, when executed, further provide the interactive social network by expanding a personalized social network of the tracking user by adding the commenting user to a tracking list.\n20. The computer-readable storage medium of claim 18, wherein the instructions, when executed, further provide the interactive social network by alerting the tracking user of a user comment.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US20050198021A1",
        "US20050234851A1",
        "US20050240623A1",
        "US20060259957A1",
        "US20060282304A1",
        "US20060284744A1",
        "US20070100863A1",
        "US20070118801A1",
        "US20070233551A1",
        "US7370285B1",
        "US20080229215A1",
        "US20080294663A1",
        "US20090094048A1",
        "US20100049534A1"
    ],
    "citations_ftf": [
        "US20020059343A1",
        "WO2007135688A2",
        "US20080215589A1"
    ],
    "citedby_own": [
        "US20100131860A1",
        "US20100199184A1",
        "US20110113332A1",
        "US20110113133A1",
        "US20110238758A1",
        "US20120151383A1",
        "US20120151377A1",
        "US20120223951A1",
        "US8341148B1",
        "US20130018955A1",
        "US20130024795A1",
        "US20130132861A1",
        "US20130253991A1",
        "US8560554B2",
        "US20140006142A1",
        "US20140082525A1",
        "WO2013121106A3",
        "US20140081690A1",
        "US20140095599A1",
        "US8738603B2",
        "CN103942213A",
        "US20140214980A1",
        "US8818985B2",
        "US20140298201A1",
        "US8930819B1",
        "US20150100576A1",
        "US9177267B2",
        "US9208187B2",
        "US9215286B1",
        "US9240970B2",
        "US9275161B2",
        "US9443225B2",
        "CN107330016A",
        "US9817637B2",
        "US20180121849A1",
        "US20220103681A1"
    ],
    "citedby_ftf": [
        "US8218744B2",
        "US8918517B2",
        "US20110173570A1",
        "US10217142B1",
        "US9406043B1",
        "US8707246B2",
        "US8538742B2",
        "US9037681B2",
        "US9256859B2",
        "US8549047B2",
        "US9098176B1",
        "WO2013173232A1",
        "US10147054B2"
    ]
}