{
    "patent_id": "US-10747823-B1",
    "title": "Interactive and conversational data exploration ",
    "assignee": "Narrative Science Inc.",
    "publication_date": "2020-08-18",
    "patent_link": "https://patents.google.com/patent/US10747823B1/en",
    "inventors": [
        "Lawrence A. Birnbaum",
        "Kristian J. Hammond"
    ],
    "classifications": [
        "G06F16/95",
        "G06F40/30",
        "G06F16/3329",
        "G06F40/35",
        "G06N5/041",
        "G06F16/20",
        "G06F40/253",
        "G06N20/00"
    ],
    "abstract": "Example embodiments are disclosed where a narrative generation platform is integrated with a conversational interface such as a Chatbot to support interactive and dynamic narrative generation in response to speech inputs from users. Such a system can be further integrated with a visualization platform to allow the speech input through the conversational interface to interactively and dynamically focus and control visualizations and/or narratives that accompany the visualizations.",
    "claims": "\n1. An apparatus comprising:\na narrative generation artificial intelligence platform comprising (1) an interface through which the narrative generation artificial intelligence platform is configured to communicate with a natural language conversational interface, and (2) logic that the narrative generation artificial intelligence platform uses to generate natural language for narrative stories;\nwherein the natural language artificial intelligence platform is configured to receive data from the natural language conversational interface via the interface, wherein the received data is derived from a natural language input and is indicative of a communication goal with respect to a data set, and wherein the narrative generation artificial intelligence platform is further configured to interactively generate narrative stories based on the received data using the logic;\nwherein the narrative generation artificial intelligence platform is further configured to (1) determine, from the logic, a natural language expression for referring to an element in a narrative story, and (2) provide the determined natural language expression to the natural language conversational interface; and\nwherein the natural language conversational interface is configured to use the provided natural language expression as a language pattern for identifying a reference to the element in natural language input to the natural language conversational interface.\n2. The apparatus of claim 1 wherein the natural language conversational interface comprises a chatbot.\n3. The apparatus of claim 1 wherein the narrative generation artificial intelligence platform is further configured to (1) parameterize a narrative analytics model and a story outline in response to the received data, and (2) generate a narrative story about the data set in accordance with the communication goal based on the parameterized narrative analytics model and the story outline.\n4. The apparatus of claim 3 wherein the narrative generation artificial intelligence platform further comprises a second interface configured to communicate with a visualization platform through which the narrative generation artificial intelligence platform receives visualization parameter data corresponding to a visualization produced by the visualization platform, the visualization parameter data for use with the parameterization of the narrative analytics model and story outline, and wherein the narrative story is about data included in the visualization.\n5. The apparatus of claim 1 wherein the narrative generation artificial intelligence platform is further configured to (1) receive a command from the natural language conversational interface, and (2) generate a narrative story based on the received command.\n6. The apparatus of claim 5 wherein the narrative generation artificial intelligence platform is further configured to generate the narrative story based on the received command in combination with visualization parameter data from a visualization platform.\n7. The apparatus of claim 5 wherein the command includes a specification of an entity.\n8. The apparatus of claim 7 wherein the entity comprises a specific entity identified in a natural language input to the natural language conversational interface.\n9. The apparatus of claim 7 wherein the entity comprises a notional entity that is notionally identified in a natural language input to the natural language conversational interface.\n10. The apparatus of claim 5 wherein the command corresponds to at least one of a focus task and/or a drill down task.\n11. The apparatus of claim 1 wherein the natural language input includes a specification of a notional entity;\nwherein the narrative generation artificial intelligence platform is configured to (1) determine a specific entity to which the notional entity refers based on an analysis of the data set, and (2) determine a natural language expression for referring to the specific entity corresponding to the notional entity.\n12. The apparatus of claim 11 wherein the specific entity comprises a plurality of specific entities to which the notional entity refers.\n13. The apparatus of claim 11 wherein the determined natural language expression for referring to the specific entity corresponding to the notional entity serves as the determined natural language expression that is provided to the natural language conversational interface.\n14. The apparatus of claim 13 wherein the natural language conversational interface is further configured to use the provided natural language expression as a language pattern for identifying a reference in natural language input to the specific entity corresponding to the notional entity.\n15. The apparatus of claim 1 wherein the natural language input includes a specification of a notional entity;\nwherein the narrative generation artificial intelligence platform is configured to determine a natural language expression for referring to the notional entity.\n16. The apparatus of claim 15 wherein the determined natural language expression for referring to the notional entity serves as the determined natural language expression that is provided to the natural language conversational interface.\n17. The apparatus of claim 16 wherein the natural language conversational interface is further configured to use the provided natural language expression as a language pattern for identifying a reference in natural language input to the notional entity.\n18. The apparatus of claim 1 wherein the element comprises an entity.\n19. The apparatus of claim 18 wherein the entity comprises a notional entity.\n20. The apparatus of claim 1 wherein the narrative generation artificial intelligence platform is further configured to (1) derive information from logic that the narrative generation artificial intelligence platform uses to generate natural language, wherein the derived information comprises information about a command corresponding to the natural language input, and (2) provide the derived information to the natural language conversational interface;\nwherein the natural language conversational interface is further configured define a language pattern for identifying a pattern in natural language input based on the provided information such that the identified pattern comprises the corresponding command.\n21. The apparatus of claim 1 wherein the natural language input comprises speech input.\n22. The apparatus of claim 1 wherein the natural language input comprises text input.",
    "status": "Active",
    "citations_own": [
        "US4992939A",
        "WO1996030844A1",
        "US5734916A",
        "US5802495A",
        "US6144938A",
        "US6289363B1",
        "US20020083025A1",
        "US20020107721A1",
        "US20030061029A1",
        "US20030216905A1",
        "US20040034520A1",
        "US6757362B1",
        "US20040138899A1",
        "US20040225651A1",
        "US20040255232A1",
        "US20050027704A1",
        "US20050028156A1",
        "US20050033582A1",
        "US20050049852A1",
        "US20050125213A1",
        "US20050137854A1",
        "US6917936B2",
        "US6968316B1",
        "US20050273362A1",
        "US6976031B1",
        "US20060031182A1",
        "US20060101335A1",
        "US20060181531A1",
        "WO2006122329A2",
        "US20070132767A1",
        "US7246315B1",
        "US20070185863A1",
        "US20070250479A1",
        "US20070250826A1",
        "US7324936B2",
        "US7333967B1",
        "US20080250070A1",
        "US20080256066A1",
        "US20080304808A1",
        "US20080306882A1",
        "US20080313130A1",
        "US20090019013A1",
        "US20090049041A1",
        "US7496621B2",
        "US20090083288A1",
        "US20090119584A1",
        "US20090144608A1",
        "US20090175545A1",
        "US20090248399A1",
        "US7716116B2",
        "US20100146393A1",
        "US20100161541A1",
        "US7778895B1",
        "US7865496B1",
        "US20110022941A1",
        "US20110044447A1",
        "US20110078105A1",
        "US20110077958A1",
        "US20110087486A1",
        "US7930169B2",
        "US20110099184A1",
        "US20110113315A1",
        "US20110213642A1",
        "US20110246182A1",
        "US20110249953A1",
        "US8046226B2",
        "US20110288852A1",
        "US20110295903A1",
        "US20110314381A1",
        "US20120011428A1",
        "US20120041903A1",
        "US20120069131A1",
        "US20120109637A1",
        "US20120158850A1",
        "US8355903B1",
        "US8374848B1",
        "US20130041677A1",
        "US20130091031A1",
        "US8447604B1",
        "US20130174026A1",
        "US20130211855A1",
        "US20130246934A1",
        "US20130262092A1",
        "US20130304507A1",
        "US20130316834A1",
        "US8630844B1",
        "US8630912B2",
        "WO2014035402A1",
        "WO2014035400A1",
        "WO2014035407A1",
        "WO2014035447A1",
        "WO2014035406A1",
        "WO2014035403A1",
        "US8688434B1",
        "WO2014070197A1",
        "WO2014076525A1",
        "WO2014076524A1",
        "US20140163962A1",
        "US8762133B2",
        "US8762134B2",
        "WO2014102569A1",
        "WO2014102568A1",
        "US8775161B1",
        "US20140200878A1",
        "WO2014111753A1",
        "US8812311B2",
        "US20140314225A1",
        "US8886520B1",
        "US8892417B1",
        "US20140356833A1",
        "US20140372850A1",
        "US20150049951A1",
        "WO2015028844A1",
        "US20150078232A1",
        "US20150142704A1",
        "US20150169548A1",
        "US20150186504A1",
        "US20150199339A1",
        "US20150227588A1",
        "US20150227508A1",
        "US20150242384A1",
        "US9135244B2",
        "US20150261745A1",
        "WO2015159133A1",
        "US20150324347A1",
        "US20150331846A1",
        "US20150331850A1",
        "US20150347901A1",
        "US9208147B1",
        "US20150356967A1",
        "US20150370778A1",
        "US9244894B1",
        "US20160026253A1",
        "US20160027125A1",
        "US9336193B2",
        "US9396181B1",
        "US9396758B2",
        "US20160232221A1",
        "US9430557B2",
        "US9460075B2",
        "US9529795B2",
        "US20170004415A1",
        "US20170017897A1",
        "US20170026705A1",
        "US9576009B1",
        "US20170060857A1",
        "US20170061093A1",
        "US20170116327A1",
        "US20170199928A1",
        "US9720899B1",
        "US20170242886A1",
        "US20170270105A1",
        "US20170358295A1",
        "US20170371856A1",
        "US20180025726A1",
        "US20180082184A1",
        "US20180114158A1",
        "US20180293483A1",
        "US10115108B1",
        "US20180314689A1",
        "US10185477B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US10963649B1",
        "US11030408B1",
        "US11042708B1",
        "US11042713B1",
        "US11068661B1",
        "US11144838B1",
        "US11170038B1",
        "US11222184B1",
        "US11232268B1",
        "US11238090B1",
        "US11256484B2",
        "US11288328B2",
        "US11347803B2",
        "US11394799B2",
        "US20220269589A1",
        "US11501220B2",
        "US20220374209A1",
        "US11521079B2",
        "US11562146B2",
        "US11561684B1",
        "US11568148B1",
        "US11790164B2",
        "US11809843B2"
    ],
    "citedby_ftf": []
}