{
    "patent_link": "https://patents.google.com/patent/US20030018601A1/en",
    "patent_id": "US20030018601A1",
    "title": "Execution of multiple models using data segmentation",
    "abstract": "A method executed on a computer for modeling expected behavior is described. The method includes scoring records of a dataset that is segmented into a plurality of data segments using a plurality of models and converting scores of the records into probability estimates. Two of the techniques described for converting scores into probability estimates are a technique that transforms scores into the probabilities estimates based on an equation and a binning technique that establishes a plurality of bins and maps records based on a score for the record to one of the plurality of bins.",
    "inventors": [
        "Yuchun Lee",
        "Ruby Kennedy",
        "Robert Crites"
    ],
    "assignee": "International Business Machines Corp",
    "classifications": [
        "G06F16/2465",
        "G06F2216/03",
        "Y10S707/99932",
        "Y10S707/99933",
        "Y10S707/99942",
        "Y10S707/99943"
    ],
    "claims": "\n1. A method executed on a computer for modeling expected behavior comprises:\nscoring records of a dataset that is segmented into a plurality of data segments using a plurality of models.\n2. The method of claim 1 further comprising:\nconverting scores of the records into probability estimates.\n3. The method of claim 2 further comprising:\ncombining results obtained from converting scores of the records into probability estimates into a single representation of the expected behavior.\n4. The method of claim 3 wherein the representation is a visual representation.\n5. The method of claim 4 wherein the visual representation is a lift chart.\n6. The method of claim 2 wherein the converting further comprises:\nadjusting probabilities assigned to scores of records based on whether data used to train models had adjusted weights assigned to positive and negative examples of the data.\n7. The method of claim 6 wherein converting is provided in accordance with:\n8. The method of claim 7 wherein for y≧1, the algorithm will return 1 and for y≦0, it returns 0.\n9. The method of claim 3 wherein combining further comprises:\nsorting records by probability estimates.\n10. The method of claim 9 wherein probability estimates are provided in accordance with:\n11. The method of claim 1 wherein each one of the models is designed to score a corresponding one of the plurality of data segments.\n12. The method of claim 1 wherein the models are designed to score the plurality of data segments with at least some of the data segment being score by two of the models.\n13. The method of claim 1 wherein scoring further comprises:\nsorting records based scores for the records produced by executing the models;\ngenerating a gains table based on the sorted records; and\nconverting sorted scores of the records into probability estimates.\n14. The method of claim 13 wherein converting is provided in accordance with:\n15. The method of claim 14 wherein combining further comprises:\nsorting records by probability estimates.\n16. A computer program product residing on a computer readable medium for modeling expected behavior comprises instructions for causing a computer to:\nscore with a plurality of models records of a dataset that is segmented into a like plurality of data segments.\n17. The computer program product of claim 16 further comprising instructions for causing a computer to: convert scores of the records into probability estimates.\n18. The computer program product of claim 17 further comprising instructions for causing a computer to:\ncombine results obtained from the converted scores of the records into a single representation of the expected behavior.\n19. A method executed on a computer for modeling expected behavior comprises:\nscoring records of a dataset that is segmented into a plurality of data segments using a like plurality of models;\ncombining results obtained from scoring the records into a single representation of the expected behavior.\n20. The method of claim 19 wherein the representation is a visual representation.\n21. The method of claim 20 wherein the visual representation is a lift chart.\n22. The method of claim 19 wherein the representation is a value that can be used to optimize selection from among multiple sources or models.\n23. The method of claim 19 wherein each one of the models is designed to score a corresponding one of the plurality of data segments.\n24. The method of claim 19 wherein combining combines results in accordance with the scores assigned from scoring the records.\n25. The method of claim 19 wherein scoring further comprises:\nestablishing a plurality of bins; and\nassigning each of the records based on a score for the record to one of the plurality of bins.\n26. The method of claim 25 wherein combining further comprises:\nresorting bins for all of the models in an order based upon an average score determined for each of the bins.\n27. The method of claim 26 wherein scoring further comprises reassigning response rates for at least one of the bins to produce a monotonically decreasing response rate within a single model instance for the plurality of bins.\n28. The method of claim 27 wherein combining further comprises resorting bins in accordance with the reassigned response rates.\n29. The method of claim 19 wherein combining further comprises for each segment:\nestablishing a plurality of bins to assign records to;\nassigning each record to one of the bins based on the record's score;\ncomputing an average response rate for each bin based on scores of records in the bin; and\nassigning bin numbers to each record with the bin number being assigned consecutively across all data segments of all models.\n30. The method of claim 29 wherein combining further comprises:\nreassigning response for bins that have response rates that are non-monotonically decreasing over the bin numbers, to produce monotonically decreasing response rates over bins of a single model instance, as a function of increasing bin number.\n31 The method of claim 29 wherein combining further comprises:\nresorting the bins based upon the newly assigned response rate.\n32. The method of claim 31 wherein combining further comprises:\ngenerating a summary lift chart that combines results from all of the model executions from the resorted bins.\n33. The method of claim 1 wherein the models are designed to score the plurality of data segments with at least some of the data segment being score by two of the models.\n34. A computer program product residing on a computer readable medium for modeling expected behavior comprises instructions for causing a computer to:\nscore with a plurality of models records of a dataset that is segmented into a like plurality of data segments;\ncombine results obtained from scoring the multiple models into a single representation of the expected behavior.\n35. The computer program product of claim 34 wherein each one of the models is designed to score a corresponding one of the plurality of data record segments.\n36. The computer program product of claim 34 wherein instructions that cause the computer to combine, combines results in accordance with the scores assigned from scoring the records.\n37. The computer program product of claim 34 wherein instructions that cause the computer to score further comprises instructions that cause the computer to:\nestablish a plurality of bins for each data segment; and\nassign each of the records to one of the plurality of bins.\n38. The computer program product of claim 37 wherein instructions that cause the computer to combine, further comprises instructions that cause the computer to:\nresort bins for all of the models in an order based upon an average score determined for each of the bins.\n39. The computer program product of claim 36 wherein instructions that cause the computer to score further comprises instructions that cause the computer to\nreassign response rates for at least one of the bins to produce a monotonically decreasing response rate for the plurality of bins.\n40. The computer program product of claim 36 wherein instructions that cause the computer to combine further comprises instructions that cause the computer to:\nresort bins in accordance with the reassigned response rates.\n41. The computer program product of claim 34 wherein instructions that cause the computer to combine further comprises instructions that cause the computer to:\nestablish a plurality of bins to assign records to;\nassign each record to one of the bins based on the record's score;\ncompute a response rate for each bin based on scores of records in last bin; and\nassign bin numbers to each record with the bin number assigned consecutively across all segments of all models.\n42. The computer program product of claim 41 wherein instructions that cause the computer to combine further comprises instructions that cause the computer to:\nreassign a response rate for selected bins to produce a monotonic response as a function of increasing bin number.\n43. The computer program product of claim 42 wherein instructions that cause the computer to combine further comprises instructions that cause the computer to:\nresorting the bins based upon the newly assigned response rate.\n44. The computer program product of claim 43 wherein instructions that cause the computer to combine further comprises instructions that cause the computer to:\ngenerating a summary lift chart that combines results from all of the model executions from the resorted bins.\n45. A method of determining likely responders to a mailing campaign, said method executed on a computer, comprises:\nanalyzing a dataset to determine at least one variable that is suitable to use to segment the dataset;\npartitioning the dataset into a plurality of data segments based on the at least one variable;\nexecuting a like plurality of models to score the records with each model designed for a particular one of the data segments; and\ncombining results obtained from executing each model on its corresponding data segment into a single summary representation.\n46. A method of combining lift charts that represent predicted response rates comprises:\nestablishing a plurality of bins for each lift chart;\nassigning records for each lift chart into one of the bins established for its corresponding lift chart;\nsorting bins based on an average response rate for each bin; and\ncombining results of sorting the bins into a summary lift chart representation.\n47. The method of claim 46 wherein sorting combines the bins having the highest response rate to the lowest response rate.\n48. The method of claim 46 wherein the lift charts represent predicted response rates for a corresponding number of mailing lists.\n49. The method of claim 46 wherein data from the lift charts are derived from a corresponding gains table.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US5426780A",
        "US6154739A",
        "US6182133B1",
        "US6301579B1"
    ],
    "citations_ftf": [
        "US5692107A",
        "US5842200A",
        "US5909681A",
        "US5842199A",
        "US6038538A",
        "US6012056A",
        "US6044366A",
        "US6061658A",
        "US6189005B1",
        "US6263334B1",
        "US6542894B1",
        "US6317752B1"
    ],
    "citedby_own": [
        "US20030176931A1",
        "US20050234697A1",
        "US20050234762A1",
        "US20050234698A1",
        "US20050234763A1",
        "US20050234761A1",
        "US20050234688A1",
        "US20050234760A1",
        "US20050234753A1",
        "US20070112614A1",
        "US20070226039A1",
        "US20090089036A1",
        "US8126767B1",
        "US20190102703A1",
        "US11341156B2"
    ],
    "citedby_ftf": [
        "US7318046B1",
        "US11026768B2",
        "US6542894B1",
        "US7006994B1",
        "US7010495B1",
        "US6937966B1",
        "IL146597A0",
        "US7035811B2",
        "US6636860B2",
        "US20020174088A1",
        "US6898737B2",
        "US20030083924A1",
        "US7143046B2",
        "US9569797B1",
        "US8019788B1",
        "US7360215B2",
        "US7558726B2",
        "US7370316B2",
        "US7373633B2",
        "US20050033723A1",
        "WO2005020031A2",
        "US7617205B2",
        "US7231399B1",
        "US8606603B2",
        "US9492245B2",
        "US11298209B2",
        "US7987099B2",
        "US7904308B2",
        "US8874452B2",
        "IL161217A",
        "US7716225B1",
        "US9223868B2",
        "US8732004B1",
        "US7870147B2",
        "US7509337B2",
        "US7451155B2",
        "US20080243680A1",
        "US20080221971A1",
        "US20080033852A1",
        "US20080228541A1",
        "US7711636B2",
        "US8315904B2",
        "US8473344B2",
        "US8521786B2",
        "US20080033809A1",
        "US8473343B2",
        "US8036979B1",
        "US20080104066A1",
        "US7657569B1",
        "US7778885B1",
        "US8606626B1",
        "US8606666B1",
        "US7975299B1",
        "US7742982B2",
        "US20080294540A1",
        "US7878805B2",
        "US9727877B2",
        "US8301574B2",
        "US20090089190A1",
        "US9690820B1",
        "US8738394B2",
        "US7996521B2",
        "US8108189B2",
        "US9492243B2",
        "US8092215B2",
        "US8172569B2",
        "US10373198B1",
        "US7991689B1",
        "US8152518B2",
        "US20100174638A1",
        "US8292617B2",
        "US8765031B2",
        "US9652802B1",
        "US10453093B1",
        "US9241774B2",
        "US9211166B2",
        "US8738440B2",
        "US8862498B2",
        "WO2012112781A1",
        "US9403238B2",
        "US11030562B1",
        "US9375300B2",
        "US9220580B2",
        "US9414897B2",
        "US8977589B2",
        "US8812387B1",
        "US10262362B1",
        "US9610141B2",
        "US10449016B2",
        "US10339527B1",
        "US9744001B2",
        "US10445152B1",
        "US10504386B2",
        "US11151468B1",
        "US11554000B2",
        "US11410230B1",
        "US10757154B1",
        "US11103330B2",
        "US11596502B2",
        "US10877943B1",
        "US10579753B2",
        "EP3471599A4",
        "EP3988048A1",
        "US10380212B2",
        "US10595966B2",
        "WO2018102702A1",
        "EP3824843A1",
        "US11376101B2",
        "CA3043049A1",
        "US10548700B2",
        "EP3555837A4",
        "US10779718B2",
        "US10613515B2",
        "US11045283B2",
        "US10639134B2",
        "US10885521B2",
        "US11419702B2",
        "CN116327391A",
        "US11633268B2",
        "WO2019035979A1",
        "US11123156B2",
        "US10699028B1",
        "US10813720B2",
        "CN114939001A",
        "EP3703608B1",
        "EP3703607A2",
        "US10896472B1",
        "WO2019100022A1",
        "CN111417357B",
        "WO2019118876A1",
        "US10980613B2",
        "CN114587237A",
        "CA3096417A1",
        "US11265324B2",
        "CN112465393B"
    ]
}