{
    "patent_link": "https://patents.google.com/patent/US4819629A/en",
    "patent_id": "US4819629A",
    "title": "Method and apparatus for delivering aerosol to the airways and/or lungs of a patient",
    "abstract": "A method and apparatus for delivering aerosol to the airways and/or lungs of a patient employ a separate inspiration line and expiration line connected to the patient, with an aerosol generator connected to the inspiration line. A respiration monitor is provided which generates signals corresponding to the breathing cycle of the patient, which is used to control the aerosol generator. Aerosol is generated during the expiration phase, and is deposited in the inspiration line. This permits adequate time to elapse before the aerosol is actually inhaled by the patient so that a stable droplet spectrum can be established. Moreover, a percisely controlled volume of respirator gas enriched with aerosol in the inspiration line can be supplied to the patient at exactly the proper point in time, independently of the flow volume.",
    "inventors": [
        "Bjorn Jonson"
    ],
    "assignee": "Maquet Critical Care AB",
    "classifications": [
        "A61M15/00",
        "A61M11/001",
        "A61M15/0015",
        "A61M15/0016",
        "A61M15/0018",
        "A61M16/125",
        "A61M11/06",
        "A61M16/0093",
        "A61M2016/0024",
        "A61M2016/0042"
    ],
    "claims": "\n1. An apparatus for delivering aerosol to the airways and/or lungs of a patient, comprising:\nan inspiration line and a separate expiration line connected to said patient;\nan aerosol generator connected to said inspiration line;\nmeans for monitoring the respiration cycle of said patient and generating control signals corresponding thereto; and\nsaid aerosol generator being connected to said means for monitoring and being supplied with a control signal therefrom such, that said aerosol generator generates aerosol only during the expiration phase of said patient and deposits the generated aerosol in said inspiration line during said expiration phase.\n2. An apparatus as claimed in claim 1, further comprising a cavity in said inspiration line and connected to said aerosol generator into which said aerosol generator deposits the generated aerosol.\n3. An apparatus as claimed in claim 2, wherein said cavity has an adjustable volume.\n4. An apparatus as claimed in claim 2, wherein said cavity is disposed in said inspiration line at a distance spaced from said airways of said patient.\n5. An apparatus as claimed in claim 2, further comprising an aerosol filter connected in said inspiration line between said cavity and the environment.\n6. An apparatus as claimed in claim 1 further comprising:\na cavity disposed in said inspiration line into said aerosol is deposited by said aerosol generator, said cavity being disposed in said inspiration line with a portion of said inspiration line extending between said cavity and said patient; and\na valve disposed between said cavity and said portion of said inspiration, said valve being connected to said means for monitoring and being controlled thereby such that said valve is closed during the expiration phase of said patient.\n7. An apparatus as claimed in claim 2, further comprising a check valve disposed in said inspiration line between said cavity and said patient which permits gas flow only in a direction toward said patient.\n8. An apparatus as claimed in claim 7, wherein said check valve opens to permit gas flow therethrough at a predetermined pressure.\n9. An apparatus as claimed in claim 8, further comprising a further check valve disposed in said expiration line permitting gas flow only in a direction away from said patient, said further check valve opening at a further predetermined pressure, said further predetermined pressure for said further check valve being less than the predetermined pressure for said check valve in said inspiration line.\n10. An apparatus as claimed in claim 1, further comprising a plurality of lines connecting said aerosol generator to said inspiration line at respectively different locations of said inspiration line, each of said plurality of lines having a valve therein which controls flow of gas through the line, each valve in each line being connected to said means for monitoring and being chronologically controlled thereby.\n11. An apparatus as claimed in claim 1 for use with a gas source, and further comprising a valve connected between said aerosol generator and said gas source, and to said means for monitoring for control thereby, such that said means for monitoring controls said valve to regulate the flow of gas through said aerosol generator.\n12. An apparatus as claimed in claim 11, wherein said means for monitoring regulates the duration during which gas flows through said aerosol generator.\n13. An apparatus as claimed in claim 1, wherein said means for monitoring includes a flowmeter disposed in said inspiration line for acquiring the respiration rhythm of said patient.\n14. An apparatus as claimed in claim 1, wherein said means for monitoring includes a flowmeter disposed in said expiration line for acquiring the respiration rhythm of said patient.\n15. An apparatus as claimed in claim 1, wherein said means for monitoring includes means for adjusting the flow of respiratory gas during the inspiration phase of said patient.\n16. An apparatus as claimed in claim 15, wherein said means for adjusting the flow of regulatory gas includes means for interrupting the flow of respiratory gas to said patient at a predetermined point in time and for a predetermined duration.\n17. An apparatus as claimed in claim 1, further comprising a respirator connected to said inspiration and expiration lines for artificial or supportive ventilation of said patient.\n18. A method for supplying aerosol to the airways and/or lungs of a patient comprising the steps of:\nmonitoring the respiration rhythym of said patient and generating control signals corresponding thereto;\ngenerating aerosol based on said control signals only during the expiration phase of said patient; and\ndepositing the generated aerosol in an inspiration line connected to said patient during said expiration phase.\n19. A method as claimed in claim 18, wherein said aerosol is generated in an aerosol generator, and comprising the additional step of regulating the duration during which gas flows through said aerosol generator.\n20. A method as claimed in claim 18, comprising the additional step of regulating the flow of respiration gas during the inspiration phase of said patient.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "DE2346730A1",
        "US3923056A",
        "US3991304A",
        "US4106503A",
        "US4186737A",
        "DE2936433A1",
        "US4279250A",
        "US4340044A",
        "US4462398A",
        "EP0178925A2"
    ],
    "citations_ftf": [
        "US4094317A"
    ],
    "citedby_own": [
        "US4984158A",
        "US5063922A",
        "US5322057A",
        "US5377688A",
        "US5392768A",
        "US5394866A",
        "US5404871A",
        "GB2283179A",
        "US5419315A",
        "US5443059A",
        "US5450336A",
        "US5458135A",
        "US5479920A",
        "US5497764A",
        "US5515860A",
        "US5558085A",
        "US5617844A",
        "WO1997022376A1",
        "US5672581A",
        "US5727546A",
        "US5743250A",
        "GB2320900A",
        "US5780014A",
        "US5873358A",
        "US5884620A",
        "US5915378A",
        "US5964219A",
        "US5970973A",
        "US5997848A",
        "US6012450A",
        "US6024090A",
        "US6029665A",
        "USD421298S",
        "US6029660A",
        "US6032665A",
        "US6036655A",
        "FR2783431A1",
        "US6044844A",
        "USD423096S",
        "US6051256A",
        "US6091973A",
        "USD428987S",
        "US6112746A",
        "US6119723A",
        "US6119693A",
        "US6123071A",
        "US6123082A",
        "US6131567A",
        "US6152129A",
        "US6182657B1",
        "US6186143B1",
        "US6213119B1",
        "US6216691B1",
        "FR2801221A1",
        "US6237592B1",
        "US6237593B1",
        "US6240921B1",
        "US6253764B1",
        "US6253765B1",
        "US6269810B1",
        "US20010013554A1",
        "US6332463B1",
        "US6336454B1",
        "US6355003B1",
        "US6367470B1",
        "US6367474B1",
        "US6397841B1",
        "US20020117177A1",
        "US20020124848A1",
        "US6509006B1",
        "US20030019495A1",
        "US6513526B2",
        "US20030034034A1",
        "US20030035778A1",
        "US6532957B2",
        "US6543448B1",
        "US20030068279A1",
        "US6546929B2",
        "US20030072718A1",
        "US20030086877A1",
        "US6561190B1",
        "US6561191B1",
        "US6584971B1",
        "US20030140921A1",
        "US6615824B2",
        "US20030168057A1",
        "US20030171282A1",
        "WO2003077978A1",
        "US6635021B1",
        "US20030205229A1",
        "US20030217749A1",
        "US20030232020A1",
        "US20040004133A1",
        "US6681767B1",
        "US20040031484A1",
        "US20040045550A1",
        "US20040050860A1",
        "US20040055598A1",
        "US20040118407A1",
        "US20040123866A1",
        "US20040153262A1",
        "US20040170568A1",
        "US20040188534A1",
        "US20040219206A1",
        "EP1474198A1",
        "USD498529S1",
        "US20040256488A1",
        "US20050005940A1",
        "US20050087189A1",
        "US6889690B2",
        "US20050103337A1",
        "US20050109659A1",
        "US20050139219A1",
        "US20050178847A1",
        "US20050199236A1",
        "US20050205089A1",
        "US20050229928A1",
        "US20050229926A1",
        "US20050241644A1",
        "US6962151B1",
        "US20050267628A1",
        "US20050274377A1",
        "WO2006000812A1",
        "US20060107947A1",
        "US20060191538A1",
        "US7100610B2",
        "US20060196509A1",
        "US20060243278A1",
        "US20070031342A1",
        "US20070044792A1",
        "US20070065369A1",
        "EP1772165A1",
        "US20070097852A1",
        "US20070119454A1",
        "US7290546B2",
        "EP1857133A1",
        "US7306787B2",
        "US7320323B2",
        "US20080047553A1",
        "US20080066761A1",
        "US7406965B2",
        "US20080212517A1",
        "US20080308101A1",
        "WO2009002267A1",
        "US20090107503A1",
        "US20090285905A1",
        "US7621274B2",
        "US20090308384A1",
        "US20100034910A1",
        "US20100263666A1",
        "US20100329984A1",
        "US7871598B1",
        "US20110079220A1",
        "US7946291B2",
        "US7971588B2",
        "US20120085344A1",
        "US8336545B2",
        "US8353294B2",
        "US8404217B2",
        "US20130112197A1",
        "FR2982493A1",
        "US8485192B2",
        "US8505535B2",
        "US8517023B2",
        "US8522784B2",
        "US8522785B2",
        "US8539944B2",
        "US8561604B2",
        "US8616195B2",
        "US8709484B2",
        "US8715623B2",
        "US8844537B1",
        "US8869797B2",
        "US8869793B1",
        "US8944061B2",
        "US9072853B2",
        "US9108211B2",
        "US9381316B2",
        "US9700529B2",
        "US9802021B2",
        "US10173025B2",
        "US10561814B2",
        "US10905837B2",
        "US11331447B2",
        "US11351325B2"
    ],
    "citedby_ftf": [
        "GB8908647D0",
        "ATE139131T1",
        "IT1255181B",
        "US5287849A",
        "DE19726110C2",
        "FR2799978A1",
        "DE10118146A1",
        "FR2915106B3"
    ]
}