{
    "patent_id": "US-11039649-B2",
    "title": "Electronic cigarette ",
    "assignee": "Fontem Holdings 1 B.V.",
    "publication_date": "2021-06-22",
    "patent_link": "https://patents.google.com/patent/US11039649B2/en",
    "inventors": [
        "Lik Hon"
    ],
    "classifications": [
        "A24F40/51",
        "A24F47/008",
        "A61K9/007",
        "A24B15/167",
        "A24F40/10",
        "A24F40/40",
        "A24F40/42",
        "A24F40/485",
        "A24F40/60",
        "A24F47/002",
        "A61M15/008",
        "A61M15/06",
        "H02J7/00",
        "H02J7/0045",
        "H05B1/0202",
        "H05B1/0244",
        "H05B3/0014",
        "A24F40/90",
        "A61M2205/18",
        "A61M2205/8206"
    ],
    "abstract": "An electronic cigarette comprises nicotine without harmful tar. The cigarette includes a shell, a cell, nicotine solution, control circuit, and an electro-thermal vaporization nozzle installed in the air suction end of the shell. The advantages of the present invention are smoking without tar, reducing the risk of cancer, the user still gets a smoking experience, the cigarette is not lit, and there is no fire danger.",
    "claims": "\n1. A vaporizing device, comprising:\na first housing removably attached to a second housing via screw threads;\nat least one air inlet for allowing air into the second housing;\na battery in the first housing;\na vaporization tube in the second housing;\na heating element inside of the vaporization tube;\na liquid in the second housing;\nthe device having a central longitudinal axis, the first housing, the battery, the second housing, the heating element and the vaporization tube aligned on the central longitudinal axis;\nthe liquid heated by the heating element in the vaporization tube to create vapor in the vaporization tube, the heating element in contact with an inner cylindrical surface of the vaporization tube.\n2. The vaporizing device of claim 1 further including a switch and a control circuit in the first housing, the switch, the heating element and the battery electrically connected to the control circuit.\n3. The vaporizing device of claim 2 further including an inhalation sensor and a control circuit, the inhalation sensor, the heating element and the battery electrically connected to the control circuit.\n4. The vaporizing device of claim 1 wherein the vaporization tube has a screw thread at a first end of the vaporization tube, the screw thread aligned on the central longitudinal axis, and the vaporization tube having an open second end.\n5. The vaporizing device of claim 1 wherein the heating element is in the shape of a straight line, single spiral, double spiral, cluster or spiral cluster.\n6. The vaporizing device of claim 1 further including a liquid passageway supplying liquid into the vaporization tube towards the heating element.\n7. The vaporizing device of claim 1 wherein the vaporization tube is made of ceramics, aluminum silicate ceramics, titanium oxide, zirconium dioxide, yttrium oxide ceramics, molten silicon, silicon dioxide, and/or molten aluminum oxide.\n8. The vaporizing device of claim 2 further including a display screen in the first housing electrically connected to the control circuit for showing operating state parameters.\n9. The vaporizing device of claim 1 wherein the vaporization tube comprises a fibrous or ceramic material.\n10. The vaporizing device of claim 1 with the second housing including an outlet in a mouthpiece, and an unobstructed flow path from the vaporization tube to the outlet.\n11. The vaporizing device of claim 5 wherein the heating element comprises nickel chromium alloy, iron chromium aluminum alloy, stainless steel, gold, platinum, and/or tungsten molybdenum alloy.\n12. A vaporizing device, comprising:\na first housing removably attached to a second housing by screw threads;\na battery in the first housing electrically connected to a control circuit in the first housing;\na charging connector in the first housing for charging the battery;\nan LED in the first housing, the LED connected to the control circuit;\nat least one air inlet for allowing air into the second housing;\na wire coil heating element inside of a vaporization tube in the second housing, an outer surface of the wire coil heating element in contact with an inner cylindrical surface of the vaporization tube;\nthe second housing containing a liquid and the second housing including an outlet in a mouthpiece, and an unobstructed flow path from the vaporization tube to the outlet;\na passageway in the second housing for moving liquid towards the wire coil heating element, to create vapor in the vaporization tube;\nthe first and second housings together forming the vaporizing device;\nthe vaporizing device having a central longitudinal axis, the first housing, the battery, the second housing, the wire coil heating element and the vaporization tube aligned on the central longitudinal axis.\n13. The vaporizing device of claim 12 wherein the vaporization tube comprises a fiber material.\n14. The vaporizing device of claim 12 further including a display screen in the first housing electrically connected to the control circuit for showing operating state parameters.\n15. The vaporizing device of claim 12 wherein the vaporization tube comprises a ceramic material.\n16. A vaporizing device, comprising:\na first housing attachable to and detachable from a second housing, the first and second housings aligned on a longitudinal axis of the vaporizing device;\na battery in the first housing electrically connected to a control circuit;\na charging connector in the first housing for charging the battery;\nan LED in the first housing electrically connected to the control circuit;\nat least one air inlet for allowing air to flow into the second housing;\nthe second housing including an outlet in a mouthpiece;\na heating element inside of a vaporization tube in the second housing, the heating element electrically connected to the control circuit, and an outer surface of the heating element in contact with an inner cylindrical surface of a fiber material component; and\na passageway in the second housing for moving liquid towards the heating element, to create vapor in the vaporization tube;\nthe vaporizing device having a central longitudinal axis, the first housing, the battery, the second housing, the heating element and the vaporization tube aligned on the central longitudinal axis.\n17. The vaporizing device of claim 16 with the control circuit in the first housing, and the control circuit electrically connected to a switch in the first housing.\n18. The vaporizing device of claim 16 further including an inhalation sensor electrically connected to the control circuit.\n19. The vaporizing device of claim 16 wherein the heating element comprises a wire coil.\n20. The vaporizing device of claim 1 wherein the vaporization tube has a length of 3-20 mm."
}