{
    "patent_id": "US-11496498-B2",
    "title": "Statistical analysis of network behavior using event vectors to identify behavioral anomalies using a composite score ",
    "assignee": "Webroot Inc.",
    "publication_date": "2022-11-08",
    "patent_link": "https://patents.google.com/patent/US11496498B2/en",
    "inventors": [
        "William Wright",
        "George D. Kellerman"
    ],
    "classifications": [
        "H04L63/1425",
        "G06F21/552",
        "G06N7/005",
        "G06N7/01",
        "H04L63/1416"
    ],
    "abstract": "Examples of the present disclosure describe systems and methods for identifying anomalous network behavior. In aspects, a network event may be observed network sensors. One or more characteristics may be extracted from the network event and used to construct an evidence vector. The evidence vector may be compared to a mapping of previously-identified events and/or event characteristics. The mapping may be represented as one or more clusters of expected behaviors and anomalous behaviors. The mapping may be modeled using analytic models for direction detection and magnitude detection. One or more centroids may be identified for each of the clusters. A “best fit” may be determined and scored for each of the analytic models. The scores may be fused into single binocular score and used to determine whether the evidence vector is likely to represent an anomaly.",
    "claims": "\n1. A system for identifying anomalous network behavior, comprising:\nat least a first processor; and\nmemory coupled to the at least one processor, the memory comprising computer executable instructions that, when executed by the at least one processor, performs a method for identifying anomalous network behavior, the method comprising:\nreceiving sensor data for an event representative of a network flow;\nextracting characteristics of the sensor data and normalizing the data to generate an evidence vector for the event;\nevaluating the evidence vector against a directional cluster mapping of previously observed events;\nevaluating the evidence vector against a magnitude cluster mapping of previously observed events;\ngenerating a composite score from the directional cluster mapping evaluation and the magnitude cluster mapping evaluation, the composite score representing a probability that the evidence vector for the event represents a network anomaly; and\ncomparing the probability with a threshold for identifying the network anomaly and, based said comparing, executing a network countermeasure.\n2. The system of claim 1, wherein the sensor data is stored in a sensor data store and the sensor data is aggregated over a time period for the network flow.\n3. The system of claim 1, wherein one or more of the extracted characteristics are predictive of whether the event is an anomaly.\n4. The system of claim 1, further comprising applying the evidence vector to an analytics model to provide directional cluster mapping representing an expected behavior comprising protocol vectors and comparing the evidence vector to the protocol vectors to identify the most similar protocol vector, the protocol vectors representing an expected network behavior.\n5. The system of claim 1, further comprising applying the evidence vector to an analytics model to provide magnitude cluster mapping representing an expected behavior comprising protocol vectors and comparing the evidence vector to the protocol vectors to identify the most similar protocol vector, the protocol vectors representing an expected network behavior.\n6. The system of claim 1, wherein generating the composite score further comprises applying contextual factors including trending anomalies.\n7. The system of claim 1, further comprising, providing the composite score to a policy engine to provide threat intelligence and the network countermeasure.\n8. The system of claim 1, further comprising executing machine learning to classify the event, modify the composite score, and determine the network countermeasure.\n9. The system of claim 1, further comprising training a model for determining expected network anomalies and emergent network behaviors.\n10. The system of claim 1, further comprising categorizing a behavior of the network anomaly using binocular fusion.\n11. A method for identifying anomalous network behavior, comprising:\nreceiving sensor data for an event representative of a network flow;\nextracting characteristics of the sensor data and normalizing the data to generate an evidence vector for the event;\nevaluating the evidence vector against a directional cluster mapping of previously observed events;\nevaluating the evidence vector against a magnitude cluster mapping of previously observed events;\ngenerating a composite score from the directional cluster mapping evaluation and the magnitude cluster mapping evaluation, the composite score representing a probability that the evidence vector for the event represents a network anomaly; and\ncomparing the probability with a threshold for identifying the network anomaly and, based said comparing, executing a network countermeasure.\n12. The method of claim 11, wherein the sensor data is stored in a sensor data store and the sensor data is aggregated over a time period for the network flow.\n13. The method of claim 11, wherein one or more of the extracted characteristics are predictive of whether the event is an anomaly.\n14. The method of claim 11, further comprising applying the evidence vector to an analytics model to provide directional cluster mapping representing an expected behavior comprising protocol vectors and comparing the evidence vector to the protocol vectors to identify the most similar protocol vector, the protocol vectors representing an expected network behavior.\n15. The method of claim 11, further comprising applying the evidence vector to an analytics model to provide magnitude cluster mapping representing an expected behavior comprising protocol vectors and comparing the evidence vector to the protocol vectors to identify the most similar protocol vector, the protocol vectors representing an expected network behavior.\n16. The method of claim 11, wherein generating the composite score further comprises applying contextual factors including trending anomalies.\n17. The method of claim 11, further comprising, providing the composite score to a policy engine to provide threat intelligence and the network countermeasure.\n18. The method of claim 11, further comprising executing machine learning to classify the event, modify the composite score, and determine the network countermeasure.\n19. The method of claim 11, further comprising training a model for determining expected network anomalies and emergent network behaviors.\n20. The method of claim 11, further comprising categorizing a behavior of the network anomaly using binocular fusion.",
    "status": "Active",
    "citations_own": [
        "US20120072983A1",
        "US20120131674A1",
        "US20150128263A1",
        "US20150235379A1",
        "US20150379887A1",
        "US20160028750A1",
        "US20160267408A1",
        "US9516053B1",
        "US20160359872A1",
        "US20160381057A1",
        "US20170099304A1",
        "US20170149813A1",
        "US20170364819A1"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "US9774604B2",
        "US10594710B2",
        "US10032463B1",
        "RU2649793C2",
        "US10218718B2",
        "US10380348B2",
        "RU2671991C2",
        "RU2637477C1",
        "EP3343968B1",
        "US10397259B2",
        "US10587635B2",
        "US11070568B2",
        "US20190116193A1",
        "US11082296B2",
        "CA3079913A1",
        "RU2689816C2",
        "US11509540B2",
        "US10867055B2",
        "US10904290B2",
        "RU2677368C1",
        "RU2677361C1",
        "RU2680736C1",
        "RU2676247C1",
        "RU2668710C1",
        "CN108509975B",
        "WO2019152521A1",
        "RU2681699C1",
        "US10984122B2",
        "US20190377984A1",
        "CN112640381A",
        "US10740656B2",
        "US20200162341A1",
        "US11451571B2",
        "RU2708508C1",
        "RU2701040C1",
        "US11689573B2",
        "JP7051724B2",
        "US11263104B2",
        "CN110460639A",
        "CN110414855A",
        "RU2728498C1",
        "RU2728497C1",
        "RU2743974C1",
        "CN111107107B",
        "US20210243210A1",
        "SG10202001963TA",
        "US20210326741A1",
        "US11637858B2",
        "US11115799B1",
        "US11620578B2",
        "US11475090B2",
        "GB2597909B",
        "US11647034B2",
        "US20220164648A1",
        "GB2602967A",
        "US11552975B1"
    ]
}