{
    "patent_link": "https://patents.google.com/patent/US6016475A/en",
    "patent_id": "US6016475A",
    "title": "System, method, and article of manufacture for generating implicit ratings based on receiver operating curves",
    "abstract": "An electronic rating broker is provided. The rating broker includes an input mechanism for obtaining an implicit measure concerning items presented to a user. A processor is operatively coupled to the input mechanism and an output device to cooperatively perform several functions. These functions include generating an implicit rating as a function of the implicit measure using a receiver operating curve (ROC). The output device is provided the implicit rating by the processor. In addition, a method is provided for operating an electronic rating broker on a computer system in order to provide an implicit rating generated with an ROC. Also, a storage device readable by a computer system for implementing this method is provided.",
    "inventors": [
        "Bradley N. Miller",
        "Joseph A. Konstan",
        "John T. Riedl"
    ],
    "assignee": "University of Minnesota",
    "classifications": [
        "G06Q30/0201",
        "G06F16/9535",
        "G06Q30/0204",
        "G06Q30/0631",
        "Y10S707/99932"
    ],
    "claims": "\n1. A collaborative filtering electronic rating broker, comprising:\n(a) input means for obtaining an implicit measure concerning items presented to a user;\n(b) processing means, operatively coupled to the input means, for generating an implicit rating as a function of the implicit measure using a receiver operating curve (ROC); and\n(c) output means, operatively coupled to the processing means, for providing the implicit rating to collaborative filter.\n2. The rating broker of claim 1 wherein the processing means comprises collaborative filtering means for deriving recommendations based on the implicit rating and the output means comprises means for providing the recommendations to an output device.\n3. The rating broker of claim 2 wherein the collaborative filtering means comprises means for deriving the recommendations based on both the implicit rating and at least one rating from another user.\n4. A recommender system comprising the rating broker of claim 2 further comprising a client device operatively coupled to the collaborative filtering rating broker through an interactive network, the client device comprising:\n(a) user interface means for presenting the items and the recommendations to the user;\n(b) user input means for receiving data input by the user;\n(c) client processing means, operatively coupled to the user interface means and user input means, for obtaining the implicit measure, providing the implicit measure to the input means of the collaborative filtering rating broker, receiving the recommendations from the the collaborative filtering rating broker, and presenting the recommendations to the user on the user interface means.\n5. The recommender system of claim 4 wherein the collaborative filtering rating broker and the client device are located within a single apparatus.\n6. The recommender system of claim 4 wherein the collaborative filtering rating broker and the client device are remotely located from one another in separate apparatuses.\n7. The recommender system of claim 4 wherein the client processing means comprises means for obtaining the implicit measure from the user through the user input means based on criteria selected from a group consisting of: user time spent viewing a particular item, user time spent listening to a particular item, and user time spent sampling a particular item.\n8. The recommender system of claim 4 wherein the client processing means comprises means for obtaining the implicit measure from a user through the user input means based on subsequent actions taken by the user, the subsequent actions taken being selected from a group consisting of: a user viewing details of a particular item after viewing only a title, saving a particular item, forwarding a particular item, saving a return address of a particular item, deleting a particular item, replying to a particular item, and printing a particular item.\n9. The rating broker of claim 1 wherein the input means comprises means for obtaining a plurality of implicit measures including the implicit measure and the processing means comprises means for generating the implicit rating as a function of the plurality of implicit measures.\n10. The rating broker of claim 1 wherein the input means comprises means for obtaining a plurality of implicit measures, the plurality of implicit measures including the implicit measure and the processing means comprises means for generating a plurality of implicit ratings as a function of the plurality of implicit measures.\n11. The rating broker of claim 1 wherein the processing means comprises means for deriving the ROC from the items, a signal to noise characterization, and a plurality of implicit measures including the implicit measure.\n12. The rating broker of claim 11 wherein the processing means comprises means for deriving the signal to noise characterization from a set of explicit ratings.\n13. The rating broker of claim 11 wherein the processing means comprises means for deriving rating threshold values for converting a plurality of implicit measures to implicit ratings from the ROC curve, the plurality of implicit measures including the particular implicit measure.\n14. The rating broker of claim 1 wherein the processing means comprises means for deriving a quality metric receiver operating curve (ROC) of a mapping between an implicit measure and an implicit rating, the mapping being based on the items, a signal to noise characterization, and recommendations from a recommendation engine.\n15. The rating broker of claim 14 wherein the processing means comprises means for deriving a plurality of quality metric ROCs each of which corresponds to a different mapping and for selecting one of the mappings for subsequent use based on the plurality of quality metric ROCs.\n16. The rating broker of claim 14 wherein the processing means comprises means for determining if a plurality of implicit ratings including the particular implicit measure are better than a set of explicit ratings based on the quality metric ROC.\n17. A method of operating a collaborative filtering electronic rating broker in order to provide an implicit preference rating, comprising steps of:\n(a) obtaining an implicit measure concerning items presented to a user;\n(b) generating an implicit rating as a function of the implicit measure using a receiver operating curve (ROC); and\n(c) providing the implicit rating to a collaborative filter.\n18. The method of claim 17 further comprising steps of:\n(d) deriving recommendations based on the implicit rating; and\n(e) providing the recommendations to an output device.\n19. The method of claim 17 wherein the deriving step comprises deriving the recommendations based on both the implicit rating and at least one rating from another user.\n20. The method of claim 18 further comprising steps of\n(f) receiving the recommendations from the output device;\n(g) receiving data input by the user; and\n(h) presenting items and the recommendations to the user on a display device.\n21. The method of claim 17 wherein the obtaining step comprises deriving the implicit measure based on criteria selected from a group consisting of: user time spent viewing a particular item, user time spent listening to a particular item, and user time spent sampling a particular item.\n22. The method of claim 17 wherein the obtaining step comprises deriving the implicit measure based on subsequent actions taken, the subsequent actions taken being selected from a group consisting of: a user viewing details of a particular item after viewing only a title, saving a particular item, forwarding a particular item, saving a return address of a particular item, deleting a particular item, replying to a particular item, and printing a particular item.\n23. The method of claim 17 wherein the generating step comprises deriving the implicit rating as a function of a plurality of implicit measures including the particular implicit measure.\n24. The method of claim 17 wherein the generating step comprises generating a plurality of implicit ratings as a function of a plurality of implicit measures including the particular implicit measure.\n25. The method of claim 17 wherein the generating step further comprises deriving the ROC from the items, a signal to noise characterization, and a plurality of implicit measures including the particular implicit measure.\n26. The method of claim 25 wherein the generating step further comprises deriving the signal to noise characterization from a set of explicit ratings.\n27. The method of claim 25 wherein the generating step further comprises deriving rating threshold values for converting a plurality of implicit measures to implicit ratings from the ROC curve, the plurality of implicit measures including the particular implicit measure.\n28. The method of claim 17 further comprising a step of deriving a quality metric receiver operating curve (ROC) of a mapping between an implicit measure and an implicit rating, the mapping being based on the items, a signal to noise characterization, and predictions from a prediction engine.\n29. The method of claim 19 wherein the deriving step comprises deriving a plurality of quality metric ROCs each of which corresponds to a different mapping, the method further comprising a step of selecting one of the mappings for subsequent use based on the plurality of quality metric ROCs.\n30. The method of claim 19 further comprising a step of determining if a plurality of implicit ratings including the particular implicit measure are better than a set of explicit ratings based on the quality metric ROC.\n31. A program storage device readable by a computer system tangibly embodying a program of instructions executable by the computer system to perform a method of operating a collaborative filtering electronic rating broker in order to provide an implicit rating, the method comprising steps of:\n(a) obtaining an implicit measure concerning items presented to a user;\n(b) generating an implicit rating as a function of the implicit measure using a receiver operating curve (ROC); and\n(c) providing the implicit rating to a collaborative filter.\n32. The program storage device of claim 31 wherein the method further comprises steps of:\n(d) deriving recommendations based on the implicit rating; and\n(e) providing the recommendations to an output device.\n33. The program storage device of claim 32 wherein the method further comprises steps of:\n(f) receiving the recommendations from the output device;\n(g) receiving data input by the user; and\n(h) presenting items and the recommendations to the user on a display device.\n34. The recommender system of claim 5, wherein the collaborative filtering rating broker and the client device are located within a single processor.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3952184A",
        "US4041617A",
        "US4205464A",
        "FR2461302A1",
        "US4331973A",
        "US4348740A",
        "US4546382A",
        "US4602279A",
        "US4627818A",
        "US4630108A",
        "US4646145A",
        "US4647964A",
        "US4658290A",
        "US4682956A",
        "US4745549A",
        "US4781596A",
        "US4870579A",
        "US4872113A",
        "US4930077A",
        "US4996642A",
        "US5386104A",
        "US5410344A",
        "US5544281A",
        "US5704017A",
        "US5708591A",
        "US5754938A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6249785B1",
        "US6321221B1",
        "US6334127B1",
        "US20020049641A1",
        "US6412012B1",
        "US6415368B1",
        "US20020161664A1",
        "US6507847B1",
        "US20030016130A1",
        "US20030067541A1",
        "US20030093312A1",
        "US20030193404A1",
        "US20030206102A1",
        "US20030236695A1",
        "US20040015416A1",
        "US20040073625A1",
        "US20040078214A1",
        "US6742032B1",
        "US20040138966A1",
        "US20040153413A1",
        "US20040158504A1",
        "US20040158503A1",
        "US20040160319A1",
        "US20040162783A1",
        "US20040172342A1",
        "US20040172275A1",
        "US20040172274A1",
        "US20040199527A1",
        "US20040243480A1",
        "US20040243479A1",
        "US20040243570A1",
        "US20040260621A1",
        "US20040267669A1",
        "US20050021626A1",
        "US20050086127A1",
        "US20050102202A1",
        "US20050120015A1",
        "US20050125307A1",
        "US6925442B1",
        "US20050177401A1",
        "US6947922B1",
        "US20050248444A1",
        "US20060015352A1",
        "US7024381B1",
        "US7031931B1",
        "US20060116957A1",
        "US20060200556A1",
        "US20060212367A1",
        "US20060229932A1",
        "US20060242269A1",
        "US20060288000A1",
        "EP1782350A1",
        "US20070150515A1",
        "US20070271272A1",
        "US20080168045A1",
        "US7403910B1",
        "US7406436B1",
        "US20080228746A1",
        "US20080228745A1",
        "US20080270250A1",
        "US20080294617A1",
        "US7461058B1",
        "US20090037355A1",
        "US7490148B1",
        "US7496947B1",
        "US7650304B1",
        "US20100017398A1",
        "US7676034B1",
        "US20100191619A1",
        "US7788123B1",
        "US20100293474A1",
        "US20100312613A1",
        "US7894595B1",
        "US7916858B1",
        "US20110256520A1",
        "US8051040B2",
        "US8190681B2",
        "US20120192085A1",
        "US8255325B2",
        "US8260656B1",
        "US8266270B1",
        "US8275673B1",
        "US8300798B1",
        "US8315895B1",
        "US8453044B2",
        "US8510247B1",
        "US8577886B2",
        "US8635217B2",
        "US20140157295A1",
        "US9075136B1",
        "US9153141B1",
        "US20150371241A1",
        "US9390402B1",
        "US9438615B2",
        "US9560984B2",
        "US9571877B2",
        "US9628573B1",
        "US9680858B1",
        "US9830569B2",
        "US9836765B2",
        "US9936250B2",
        "US9973524B2",
        "US10055746B1",
        "US10127572B2",
        "US10140628B2",
        "US10176445B2",
        "US10216393B2",
        "US10425380B2",
        "US10462508B2",
        "US10521583B1",
        "US10546441B2",
        "US10567975B2",
        "US10580018B2",
        "US10580031B2",
        "US10594723B2",
        "US10657585B2",
        "US10679241B2",
        "US10726136B1",
        "US10733625B2",
        "US10749893B1",
        "US10791140B1",
        "US10796268B2",
        "US10812520B2",
        "US10893067B1",
        "US10943273B2",
        "US10963895B2",
        "US10987015B2",
        "US11023585B1",
        "US11032244B2",
        "US11200323B2",
        "USRE48904E1",
        "US11265330B2",
        "US11329878B2",
        "US11481788B2",
        "US11689555B2",
        "US11704681B2",
        "US11760227B2"
    ],
    "citedby_ftf": []
}