{
    "patent_id": "US-11599660-B2",
    "title": "Dynamic policy based on user experience ",
    "assignee": "Sophos Limited",
    "publication_date": "2023-03-07",
    "patent_link": "https://patents.google.com/patent/US11599660B2/en",
    "inventors": [
        "Joseph H. Levy",
        "Andrew J. Thomas",
        "Daniel Salvatore Schiappa",
        "Kenneth D. Ray"
    ],
    "classifications": [
        "G06F21/6218",
        "G06F21/45",
        "G06F16/137",
        "G06F16/285",
        "G06F16/93",
        "G06F21/577",
        "G06F21/64",
        "G06N20/00",
        "G06N3/0675",
        "G06N5/046",
        "G06N5/048",
        "H04L41/20",
        "H04L41/22",
        "H04L63/08",
        "H04L63/0807",
        "H04L63/083",
        "H04L63/0838",
        "H04L63/0861",
        "H04L63/101",
        "H04L63/102",
        "H04L63/1408",
        "H04L63/1416",
        "H04L63/1425",
        "H04L63/1433",
        "H04L63/1441",
        "H04L63/20",
        "H04L63/205",
        "H04L9/0891",
        "H04L9/16",
        "H04L9/3226",
        "H04L9/3265",
        "H04L9/50",
        "G06F2221/034",
        "H04L2463/082",
        "H04L9/3213",
        "H04L9/3228",
        "H04L9/3231",
        "H04L9/3271"
    ],
    "abstract": "Entity models are used to evaluate potential risk of entities, either individually or in groups, in order to evaluate suspiciousness within an enterprise network. These individual or aggregated risk assessments can be used to adjust the security policy for compute instances within the enterprise network. A security policy may specify security settings such as network speed, filtering levels, network isolation, levels of privilege, and the like.",
    "claims": "\n1. A computer program product comprising computer executable code embodied in a non-transitory computer readable medium that, when executing on one or more computing devices, performs the steps of:\nstoring an entity model for an entity at a threat management facility for an enterprise network, the entity including at least one of an identity and access management system, a domain controller, a physical device, a user, an operating system, or an application associated with the enterprise network, and the entity model characterizing a baseline of expected events based on events from the entity over an historical window as a vector in an event vector space;\ninstrumenting a compute instance associated with the entity to report event vectors based on one or more events from one or more sensors associated with the compute instance;\nreceiving an event stream at the threat management facility, the event stream including a plurality of event vectors from the compute instance;\nmonitoring the event stream and creating the entity model based on a baseline of event vectors for the entity in the event stream over an interval, wherein the interval is algorithmically determined;\ncalculating a risk score for the compute instance based on a distance between the entity model and one or more event vectors in the event stream in the event vector space; and\nadjusting local monitoring activity on the compute instance to increase a level of local activity monitoring when the risk score indicates a deviation from the baseline.\n2. The computer program product of claim 1, wherein the historical window is algorithmically determined.\n3. The computer program product of claim 1, wherein the threat management facility stores a plurality of entity models for a plurality of different entity types within the enterprise network.\n4. The computer program product of claim 1, wherein the event stream includes event vectors from a plurality of compute instances associated with the enterprise network.\n5. The computer program product of claim 1, wherein the event stream includes event vectors from two or more different entities associated with the compute instance.\n6. The computer program product of claim 1, further comprising code that performs the step of refining the entity model based on additional event vectors in the event stream received after the entity model is created.\n7. The computer program product of claim 6, wherein the step of refining the entity model is based on an interval determined from information contained in the additional event vectors.\n8. The computer program product of claim 7, wherein refining the entity model is based on a distance in the event vector space between the entity model and one or more of the additional event vectors in the event stream.\n9. The computer program product of claim 1, wherein instrumenting the compute instance includes configuring the compute instance to normalize at least one of the events from at least one of the one or more sensors.\n10. The computer program product of claim 1, wherein instrumenting the compute instance includes configuring the compute instance to tokenize at least one of the events from at least one of the one or more sensors.\n11. The computer program product of claim 1, wherein instrumenting the compute instance includes configuring the compute instance to encrypt at least one of the events from at least one of the one or more sensors.\n12. The computer program product of claim 1, wherein instrumenting the compute instance includes prioritizing at least one of the events from at least one of the one or more sensors.\n13. The computer program product of claim 1, wherein the distance is at least one of a Mahalanobis distance, a Euclidean distance, and a Minkowski distance.\n14. The computer program product of claim 1, wherein the distance is evaluated using a k-nearest neighbor algorithm.\n15. A method, comprising:\nstoring an entity model at a threat management facility for an enterprise network, the entity model characterizing expected events for an entity;\ninstrumenting a compute instance in the enterprise network to detect one or more events and report a number of event vectors including the one or more events to the threat management facility;\nreceiving an event stream of the number of event vectors from the compute instance at the threat management facility;\nmonitoring the event stream and creating the entity model based on a baseline of event vectors for the entity in the event stream over an interval, wherein the interval is algorithmically determined;\ncalculating a risk score for the compute instance based on a comparison of one or more of the event vectors in the event stream with the entity model for the entity; and\nadjusting local monitoring activity on the compute instance to increase a level of local activity monitoring when the risk score indicates a deviation from the baseline.\n16. The method of claim 15, further comprising refining the entity model based on additional event vectors in the event stream received after the entity model is created.\n17. The method of claim 16, wherein refining the entity model is based on an interval determined from information contained in the additional event vectors.\n18. The method of claim 15, wherein the event stream includes event vectors from a plurality of compute instances associated with the enterprise network.\n19. The method of claim 15, wherein the event stream includes event vectors from two or more different entities associated with the compute instance.\n20. A system, comprising:\na compute instance in an enterprise network, the compute instance configured to detect one or more events associated with the compute instance and to report an event vector including the one or more events to a remote resource; and\na threat management facility, the threat management facility including a memory storing an entity model characterizing expected events for an entity, and the threat management facility configured to receive an event stream including the event vector, to monitor the event stream, to create the entity model based on a baseline of event vectors for the entity in the event stream over an algorithmically determined interval, to calculate a risk score for the compute instance based on a comparison of the event vector with the entity model, and to adjust local monitoring activity on the compute instance to increase a level of local activity monitoring when the risk score indicates a deviation from the baseline.",
    "status": "Active",
    "citations_own": [
        "US7660981B1",
        "US8181244B2",
        "US8201243B2",
        "US8418250B2",
        "US20130191919A1",
        "US8769676B1",
        "US20140279641A1",
        "US8856505B2",
        "US20150229662A1",
        "US20150317325A1",
        "US20150373043A1",
        "US20160125183A1",
        "US20160156460A1",
        "US20160173509A1",
        "US9413721B2",
        "US9426185B1",
        "US20170046604A1",
        "US9578045B2",
        "US20170054729A1",
        "US20170085539A1",
        "US20170134162A1",
        "US20170149701A1",
        "US20170185930A1",
        "US20180048668A1",
        "US20180139227A1",
        "US20180191766A1",
        "US20180247713A1",
        "US20190036952A1",
        "US20190068627A1",
        "US20190116193A1",
        "US10284591B2",
        "US20190166141A1",
        "US10367842B2",
        "WO2019200317A1",
        "US10594710B2",
        "US10599844B2",
        "US20200213341A1",
        "US10887326B2"
    ],
    "citations_ftf": [
        "US7194681B1",
        "JP4404246B2",
        "US7324473B2",
        "US7954151B1",
        "US8108914B2",
        "US8627403B1",
        "US8396838B2",
        "US8296301B2",
        "US8286255B2",
        "US9781148B2",
        "US8407805B2",
        "US8627039B2",
        "US20100274750A1",
        "US8601531B1",
        "US9215236B2",
        "US8806578B2",
        "US9183560B2",
        "JP5517162B2",
        "US8751424B1",
        "US8600995B1",
        "US10043022B2",
        "US9235812B2",
        "US20150206082A1",
        "US9160757B1",
        "US9787723B2",
        "KR101620931B1",
        "US9414938B2",
        "US20160179828A1",
        "US10147065B1",
        "US9594906B1",
        "US20170154188A1",
        "US9992217B2",
        "US11425169B2",
        "US10826940B2",
        "CN105868305B",
        "US10498605B2",
        "US10177919B2",
        "US20180367540A1",
        "US10176309B2",
        "US20180211292A1",
        "US10783246B2",
        "US10834099B2",
        "US11100144B2",
        "US10523699B1",
        "WO2019157333A1",
        "WO2020006415A1",
        "US11271931B2"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US8579853B2",
        "US11172470B1",
        "US9912689B2",
        "US10235176B2",
        "US11153383B2",
        "US11609835B1",
        "US11429589B2",
        "WO2018170318A1",
        "US10999296B2",
        "US11632382B2",
        "US10318729B2",
        "US10999324B2",
        "US11010233B1",
        "JP7039716B2",
        "US20210042100A1",
        "US10984122B2",
        "WO2019213061A1",
        "US20190362075A1",
        "US11249783B1",
        "US11017100B2",
        "DE102018213304A1",
        "US11297073B2",
        "GB2614426B",
        "US11036856B2",
        "US11074354B2",
        "US10805154B2",
        "US20200125713A1",
        "US11410109B2",
        "US10885186B2",
        "US10439825B1",
        "US10938846B1",
        "US10776137B2",
        "US11283825B2",
        "US20200204572A1",
        "US11050793B2",
        "US20210329036A1",
        "US11449491B2",
        "US11321716B2",
        "US11281629B2",
        "US11449623B2",
        "US11330005B2",
        "US11392467B2",
        "US11429743B2",
        "US11381567B2",
        "US11023863B2",
        "US11475125B2",
        "US11411959B2",
        "US20200396259A1",
        "US11443263B2",
        "US11386198B1",
        "EP3764263A1",
        "US20210019301A1",
        "US10826801B1",
        "US11115310B2",
        "US11537668B2",
        "US11470046B2",
        "US11736466B2",
        "US11755734B2",
        "US11132687B2",
        "CA3100378A1",
        "US11651075B2",
        "US11720714B2",
        "US11675898B2",
        "US11615185B2",
        "US11755751B2",
        "US11500788B2",
        "US11341236B2",
        "US11657155B2",
        "US11645162B2",
        "US11625481B2",
        "US11687418B2",
        "US11720692B2",
        "US11520907B1",
        "US11291077B2",
        "US11449811B2",
        "US11341463B2",
        "US11200548B2",
        "US10902705B1",
        "US10873578B1",
        "US11113665B1",
        "US11514019B1",
        "US11562068B2",
        "US11489862B2",
        "RU2746687C1",
        "US20210248258A1",
        "WO2021160499A1",
        "US11463468B2",
        "EP3872665A1",
        "US11477234B2",
        "US11394750B1",
        "US11790060B2",
        "US11252189B2",
        "US11223470B1",
        "US11768945B2",
        "EP3901800A1",
        "US11704414B2",
        "US11575697B2",
        "US20210397940A1",
        "WO2021260398A1",
        "US11249750B2",
        "US20210409426A1",
        "CN111526166B",
        "CN111930610A",
        "US20220014522A1",
        "US11483213B2",
        "US11438370B2",
        "GB2597909B",
        "US11563764B1",
        "RU2762527C1",
        "CN112597100B",
        "US20220103586A1",
        "US11546368B2",
        "US11496522B2",
        "US11803864B2",
        "US11606694B2",
        "US11528242B2",
        "WO2022087510A1",
        "US20220131894A1",
        "WO2022100868A1",
        "US11687648B2",
        "US11755445B2",
        "US20220327216A1",
        "CN112989333B",
        "US20220407893A1",
        "US11783073B2",
        "US20230017384A1",
        "WO2023018753A1",
        "US11509682B1",
        "CN114500063B",
        "WO2023163960A1",
        "US20230319047A1",
        "US20230336575A1",
        "US11681805B1",
        "CN115022018B",
        "US11716346B1",
        "US11775904B1"
    ]
}