{
    "patent_link": "https://patents.google.com/patent/US5842199A/en",
    "patent_id": "US5842199A",
    "title": "System, method and article of manufacture for using receiver operating curves to evaluate predictive utility",
    "abstract": "An electronic information system is provided for determining predictive utility of prediction techniques in ascertaining which items are valued. The information system includes an input mechanism for obtaining a set of measurements of actual value of items presented to a user. The items presented to the user are derived from a plurality of items by utilizing predictions from a prediction technique. A processor is operatively coupled to the input mechanism to generate a quality metric receiver operating curve (ROC) from the set of measurements which corresponds to a measure of effectiveness of the prediction technique in predicting which items are valued by the user. In addition, a method is provided for operating this electronic information system. Also, a storage device readable by a computer system for implementing this method is provided.",
    "inventors": [
        "Bradley N. Miller",
        "John T. Riedl",
        "Joseph A. Konstan"
    ],
    "assignee": "University of Minnesota",
    "classifications": [],
    "claims": "\n1. An electronic information system for determining predictive utility of recommendation techniques in ascertaining which items are preferred by a user, comprising:\n(a) input means for obtaining a set of measurements of user preference of items recommended to a user, the items presented to the user being derived from a plurality of items by utilizing recommendations from an adaptive recommendation technique; and\n(b) processing means, operatively coupled to the input means, generating a quality metric receiver operating curve (ROC) from the set of measurements which corresponds to a measure of effectiveness of the adaptive recommendation technique in predicting which items are preferred by the user.\n2. The information system of claim 1 wherein:\n(a) the input means comprises means for obtaining a first and a second set of measurements of actual preference of a first and a second set of items recommended to the user, respectively, each set of items presented to the user being derived from the plurality of items by utilizing recommendations from different adaptive recommendation techniques; and\n(b) the processing means comprises means for generating a first and a second quality metric ROC from the first and the second set of measurements, respectively, and comparing the first and the second quality metric ROC to compare effectiveness of each different adaptive recommendation technique to each other in recommending items preferred by the user.\n3. The information system of claim 2 wherein the processing means comprises means for selecting one of the different adaptive recommendation techniques for subsequent use based on the comparison of the first and the second quality metric ROC.\n4. The information system of claim 3 wherein the different adaptive recommendation techniques utilize different underlying recommendation algorithms such that the comparison of the first and the second quality metric ROC selects which underlying recommendation algorithm is subsequently used.\n5. The information system of claim 3 wherein the different adaptive recommendation techniques utilize a single underlying recommendation algorithm with different operating parameters such that the comparison of the first and the second quality metric ROC selects which operating parameters are subsequently used with the recommendation algorithm.\n6. The information system of claim 5 wherein the operating parameters comprise partitioning schemes for the plurality of items.\n7. The information system of claim 1 wherein the input means comprises means for generating a set of implicit measures from user input as the set of measurements of actual user preference of items recommended to the user.\n8. The information system of claim 7 wherein the input means comprises means for generating the set of implicit measures based on criteria selected from a group consisting of: user time spent viewing a particular item, user time spent listening to a particular item, and user time spent sampling a particular item.\n9. The information system of claim 7 wherein the input means comprises means for generating the set of implicit measures based on subsequent actions taken, the subsequent actions taken being selected from a group consisting of: the user viewing details of a particular item after viewing only a title, saving a particular item, forwarding a particular item, saving a return address of a particular item, deleting a particular item, replying to a particular item, and printing a particular item.\n10. The information system of claim 1 wherein the input means and processing means together form a quality metric device, the information system further comprising a client device operatively coupled to the quality metric device, the client device comprising:\n(a) user interface means for recommending the items to the user;\n(b) user input means for receiving data input by the user from which a set of measurements of actual user preference of items recommended to a user is obtained;\n(c) client processing means, operatively coupled to the user interface means and user input means, for receiving items to recommend to the user from an output mechanism of the quality metric device, obtaining the set of measurements of actual user preference of items based on the data input by the user, and providing the set of measurements of actual user preference of items to the input means of the quality metric device.\n11. The information system of claim 10 wherein the quality metric device and the client device are located within a single apparatus.\n12. The information system of claim 10 wherein the quality metric device and the client device each comprise means for communicating with each other through an interactive network such that the quality metric device and the client device can be remotely located from one another in separate apparatuses.\n13. A method of operating an electronic information system in order to determine predictive utility of recommendation techniques in ascertaining which items are preferred by a user, comprising:\n(a) deriving particular items from a plurality of items by utilizing recommendations from an adaptive recommendation technique;\n(b) presenting the particular items to a user on a user interface device;\n(c) obtaining a set of measurements of actual value of the particular items presented to a user through an input device; and\n(d) generating a quality metric receiver operating curve (ROC) from the set of measurements which corresponds to a measure of effectiveness of the adaptive recommendation technique in predicting which items are preferred by the user.\n14. The method of claim 13:\n(a) wherein the deriving step comprises deriving a first and a second set of particular items from a plurality of items by utilizing recommendations from different adaptive recommendation techniques;\n(b) wherein the presenting step comprises presenting the first and the second set of particular items to the user;\n(c) wherein the obtaining step comprises obtaining a first and a second set of measurements of actual user preference of the first and the second set of items presented to the user, respectively;\n(d) wherein the generating step comprises generating a first and a second quality metric ROC from the first and the second set of measurements, respectively; and\n(e) further comprises a step of comparing the first and the second quality metric ROC to compare effectiveness of each different adaptive recommendation technique to each other in predicting items preferred by the user.\n15. The method of claim 14 further comprising a step of selecting one of the different adaptive recommendation techniques for subsequent use based on the comparing step.\n16. The method of claim 15 wherein the different adaptive recommendation techniques utilize different underlying recommendation algorithms such that the selecting step comprises selecting which underlying recommendation algorithm is subsequently used.\n17. The method of claim 15 wherein the different adaptive recommendation techniques utilize a single underlying recommendation algorithm with different operating parameters such that the selecting step comprises selecting which operating parameters are subsequently used with the recommendation algorithm.\n18. The method of claim 17 wherein the operating parameters comprise partitioning schemes for the plurality of items.\n19. The method of claim 18 wherein the obtaining step comprises generating a set of implicit measures from user input through the input device as the set of measurements of actual user preference of items presented to the user.\n20. The method of claim 19 wherein the obtaining step comprises deriving the implicit measure based on criteria selected from a group consisting of: user time spent viewing a particular item, user time spent listening to a particular item, and user time spent sampling a particular item.\n21. The method of claim 19 wherein the obtaining step comprises deriving the implicit measure based on subsequent actions taken, the subsequent actions taken being selected from a group consisting of: a user viewing details of a particular item after viewing only a title, saving a particular item, forwarding a particular item, saving a return address of a particular item, deleting a particular item, replying to a particular item, and printing a particular item.\n22. A program storage device readable by a computer system tangibly embodying a program of instructions executable by the computer system to perform a method of operating an electronic information system in order to determine predictive utility of recommendation techniques in ascertaining which items are preferred by a user, the method comprising steps of:\n(a) deriving particular items from a plurality of items by utilizing recommendations from an adaptive recommendation technique;\n(b) presenting the particular items to a user on a user interface device;\n(c) obtaining a set of measurements of actual user preference of the particular items presented to a user through an input device; and\n(d) generating a quality metric receiver operating curve (ROC) from the set of measurements which corresponds to a measure of effectiveness of the adaptive recommendation technique in predicting which items are preferred by the user.\n23. The program storage device of claim 22 wherein:\n(a) the method deriving step comprises deriving a first and a second set of particular items from a plurality of items by utilizing recommendations from different adaptive recommendation techniques;\n(b) the method presenting step comprises presenting the first and the second set of particular items to the user;\n(c) the method obtaining step comprises obtaining a first and a second set of measurements of actual user preference of the first and the second set of items presented to the user, respectively;\n(d) the method generating step comprises generating a first and a second quality metric ROC from the first and the second set of measurements, respectively; and\n(e) the method further comprises a step of comparing the first and the second quality metric ROC to compare effectiveness of each different recommendation technique to each other in predicting items preferred by the user.\n24. The program storage device of claim 23 wherein the method further comprises a step of selecting one of the different recommendation techniques for subsequent use based on the comparing step.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3952184A",
        "US4041617A",
        "US4205464A",
        "US4331973A",
        "US4348740A",
        "US4546382A",
        "US4602279A",
        "US4627818A",
        "US4630108A",
        "US4646145A",
        "US4647964A",
        "US4658290A",
        "US4682956A",
        "US4745549A",
        "US4781596A",
        "US4870579A",
        "US4872113A",
        "US4930077A",
        "US4996642A",
        "US5386104A",
        "US5410344A",
        "US5544281A",
        "US5704017A",
        "US5708591A",
        "US5754939A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5918014A",
        "US6014654A",
        "US6029161A",
        "US6061722A",
        "US6101460A",
        "US6108493A",
        "US6115718A",
        "US6144964A",
        "WO2001006415A1",
        "WO2001053973A2",
        "US6314420B1",
        "US6317752B1",
        "US6321221B1",
        "US6334127B1",
        "US20020042914A1",
        "US20020049641A1",
        "US20020055906A1",
        "US6412012B1",
        "US6415368B1",
        "US20020087967A1",
        "US20020143607A1",
        "WO2002087132A2",
        "US20020161664A1",
        "US20020174445A1",
        "US20030005465A1",
        "US6542894B1",
        "US20030101325A1",
        "US6581054B1",
        "US20030172374A1",
        "US6655963B1",
        "US20040015416A1",
        "US20040078214A1",
        "US20040138962A1",
        "US20040153413A1",
        "US20040158503A1",
        "US20040158504A1",
        "US6778982B1",
        "US20040162783A1",
        "US20040172342A1",
        "US20040172274A1",
        "US20040172275A1",
        "US6826552B1",
        "US20040243570A1",
        "US20040243479A1",
        "US20040243480A1",
        "US20040260621A1",
        "US20040267669A1",
        "US6842758B1",
        "US20050049941A1",
        "US20050086127A1",
        "US20050125307A1",
        "US20050177401A1",
        "US6947922B1",
        "US20050248444A1",
        "US20050288954A1",
        "US20060015352A1",
        "US6993204B1",
        "US7024381B1",
        "US7031952B1",
        "WO2006043925A1",
        "US7039599B2",
        "US7051074B1",
        "US7072863B1",
        "US20060212367A1",
        "US20060229932A1",
        "US20060242269A1",
        "US20060253850A1",
        "US20060288000A1",
        "US7159011B1",
        "US20070100683A1",
        "US20070219995A1",
        "US7275254B1",
        "US7280979B1",
        "WO2008002937A2",
        "US7328182B1",
        "US20080066156A1",
        "US7364068B1",
        "US20080133330A1",
        "US7386485B1",
        "US7403910B1",
        "US7406436B1",
        "US7437313B1",
        "US20080270250A1",
        "US20080310392A1",
        "US20090094313A1",
        "US20090100455A1",
        "US20090259599A1",
        "US7644366B1",
        "US20100004977A1",
        "US7650304B1",
        "US7729945B1",
        "US20100145790A1",
        "US7739162B1",
        "US20100198773A1",
        "US20100211439A1",
        "US7797343B2",
        "USRE41754E1",
        "US7827062B2",
        "US20100312613A1",
        "US7899712B2",
        "US7941818B2",
        "US7962573B2",
        "US7996864B2",
        "US8051040B2",
        "US20110321078A1",
        "US8181200B2",
        "US8200683B2",
        "US8255325B2",
        "US8272011B2",
        "US8275673B1",
        "US8306908B1",
        "US8315909B1",
        "US8336071B2",
        "US8359616B2",
        "US8370884B2",
        "US8429026B1",
        "US8566154B2",
        "US8578403B2",
        "US8613024B2",
        "US8612310B2",
        "US8613020B2",
        "US8626615B2",
        "US20140013345A1",
        "US8646005B2",
        "US8650125B2",
        "US8684742B2",
        "US8712857B1",
        "US8762310B2",
        "US8769567B1",
        "US8793738B2",
        "US8806536B2",
        "US8832742B2",
        "US8863170B2",
        "US8918807B2",
        "US8931008B2",
        "US8943540B2",
        "US9015750B2",
        "US9021538B2",
        "US9032451B2",
        "US9075136B1",
        "US9075861B2",
        "US9113107B2",
        "US9113207B2",
        "US9125169B2",
        "US9122701B2",
        "US9147198B2",
        "US9166714B2",
        "US9172987B2",
        "US9177081B2",
        "US9204376B2",
        "US9226012B2",
        "US9294799B2",
        "US9292858B2",
        "US9319735B2",
        "US9326025B2",
        "US9426509B2",
        "US9445353B2",
        "US9451310B2",
        "US9451303B2",
        "US9514439B2",
        "US9521451B2",
        "US9560984B2",
        "US9569986B2",
        "US9571877B2",
        "US9591251B2",
        "US9736524B2",
        "US9749693B2",
        "US9788069B1",
        "US9848276B2",
        "US9936250B2",
        "US9986277B2",
        "US10003780B1",
        "US10011247B2",
        "US10055746B1",
        "US10063934B2",
        "US10127572B2",
        "US10140628B2",
        "US10182261B2",
        "US10182259B2",
        "US10192166B2",
        "US10546441B2",
        "US10562492B2",
        "US10580018B2",
        "US10580031B2",
        "US10657585B2",
        "US10679241B2",
        "US10733625B2",
        "US10796268B2",
        "US10963895B2",
        "US10987015B2",
        "US11375276B2",
        "US11481788B2",
        "US11700421B2",
        "US11704681B2",
        "US11715132B2"
    ],
    "citedby_ftf": []
}