{
    "patent_link": "https://patents.google.com/patent/US3982070A/en",
    "patent_id": "US3982070A",
    "title": "Phase vocoder speech synthesis system",
    "abstract": "Disclosed is a system for synthesizing speech from stored signals representative of words precoded in accordance with phase vocoder techniques. The stored signals comprise short-time Fourier transform parameters which describe the magnitude and phase derivative of the short-time signal spectrum. Speech synthesis is achieved by extracting the stored signals of chosen words under control of a duration factor signal, by concatenating the extracted signals, by operating on the phase derivative parameters to effect a desired speech pitch change, by interpolating the magnitude parameters of the short-time Fourier transform in response to the pitch and duration changes, and by decoding the resultant signals in accordance with phase vocoder techniques.",
    "inventors": [
        "James Loton Flanagan"
    ],
    "assignee": "AT&T Corp",
    "classifications": [],
    "claims": "\n1. Apparatus for synthesizing a natural sounding speech message from phase vocoder stored signals representative of a vocabulary of words comprising:\nmeans for selectively extracting preselected locations of said stored signals for constructing a predetermined sequence of signals representative of said speech message;\nmeans for altering the pitch parameters of said extracted signals; and\nmeans for combining said pitch modified signals.\n2. Apparatus for synthesizing a natural sounding speech message comprising:\nmeans for storing phase vocoder signals representative of a vocabulary of words;\nfirst means, responsive to an applied duration control signal, for selectively extracting from said means for storing preselected signals to form a duration modified sequence of signals representative of said speech message;\nmeans for altering the pitch parameters of said extracted signals; and\nmeans for combining said signals modified in pitch and duration to form a sum signal for activating a speech synthesizer.\n3. Apparatus for generating natural sounding synthesized speech comprising:\na memory for storing phase vocoder encoded signals representative of a vocabulary of words;\nmeans for extracting signals from selected storage locations of said memory to affect the duration of said synthesized speech;\nmeans for altering the pitch parameters of said extracted signals to affect the pitch of said synthesized speech; and\nmeans for phase vocoder decoding of said altered signals to form said synthesized speech signal.\n4. A system for synthesizing speech messages from phase vocoder encoded word signals stored in a memory comprising:\nmeans for extracting selected signals from said memory a repeated number of times to affect the duration of said speech messages;\nmeans for altering the pitch parameters of said extracted signals; and\nmeans for decoding said pitch and duration altered signals to form said speech messages.\n5. A system for composing speech messages from phase vocoder encoded and stored words comprising:\nmeans for extracting selected signals from said encoded stored words a repeated number of times to affect the duration of said composed speech;\nmeans for altering the pitch parameters of said extracted signals;\nmeans for interpolating the spectrum parameters of said extracted signals; and\nmeans for decoding said interpolated and pitch altered signals to form a composed speech message signal.\n6. Apparatus for synthesizing natural sounding speech comprising:\na phase vocoder analyzer responsive to an applied vocabulary of words;\nmeans for storing the output signals of said analyzer;\nmeans for extracting the signals of selected storage locations in said means for storing;\nmeans for modifying the pitch parameters of said extracted signals; and\nmeans for converting said pitch modified signals in accordance with phase vocoder techniques to develop a natural sounding speech signal.\n7. Apparatus for processing phase vocoder type representations of selected prerecorded spoken words to form a description of a desired message suitable for actuating a speech synthesizer to develop synthesized speech, which comprises:\nfirst means, for encoding said prerecorded words in accordance with phase vocoder techniques to form short-time Fourier transform signal vectors and phase derivative signal vectors;\nsecond means, for storing said phase derivative and said short-time Fourier transform signal vectors;\nthird means, for extracting selected locations of said stored signals a preselected number of times of control the duration of said synthesized speech;\nfourth means, for modifying said phase derivative signal vectors to control the pitch of said synthesized speech;\nfifth means, for interpolating the shorttime Fourier transform signal vectors in accordance with predetermined rules responsive to an applied duration control signal and to the modified phase derivative signal vectors to effect a smooth spectrum envelope; and\nsixth means, for combining said modified phase derivative signal vector and said spectrum interpolated short-time Fourier transform signal vector in accordance with phase vocoder techniques to form a synthesized speech signal suitable for actuating said speech synthesizer.\n8. The apparatus defined in claim 7 wherein said fourth means comprises:\nseventh means, for adding to each phase derivative signal an appropriate corresponding frequency signal; and\neighth means, for multiplying each of said added signals by an applied pitch control signal.\n9. The apparatus defined in claim 7 wherein said fourth means comprises:\nseventh means, for adding to each phase derivative signal an appropriate frequency signal to form a pitch signal vector;\neighth means, for ascertaining the true pitch of said pitch signal vector;\nninth means, responsive to an applied pitch control signal and to said eighth means for computing a pitch alteration multiplicative factor; and\ntenth means for multiplying each of said added signals with said multiplicative factor.\n10. The apparatus defined in claim 7 wherein said fifth means comprises:\nmeans for modifying each component of said short-time Fourier transform signal vectors to account for the pitch and duration modifications in adjacent components of said short-time Fourier transform signal vectors.\n11. Apparatus for processing phase vocoder type representations of selected prerecorded spoken words to form a description of a desired message suitable for actuating a speech synthesizer to develop synthesized speech, which comprises:\nfirst means, for encoding said prerecorded words in accordance with phase vocoder techniques to form short-time Fourier transform signal vectors and phase derivative signal vectors;\nsecond means, for storing said phase derivative and said short-time Fourier transform signal vectors;\nthird means, for extracting selected locations of said stored signals a preselected number of times to control the duration of said synthesized speech;\nfourth means, for modifying said phase derivative signal vectors to control the pitch of said synthesized speech; and\nfifth means, for combining said modified phase derivative signal vector and said duration controlled short-time Fourier transformed signal vector in accordance with phase vocoder techniques to form a synthesized speech signal suitable for actuating said speech synthesizer.\n12. A method for synthesizing a natural sounding speech message from phase vocoder stored signals representative of a vocabulary of words comprising the steps of:\nselectively extracting preselected locations of said stored signals for the construction of a predetermined sequence of signals representative of said speech message;\naltering the pitch parameters of said extracted signals; and\ncombining said pitch modified signals.\n13. A method for synthesizing a natural sounding speech message comprising the steps of:\nstoring phase vocoder signals representative of a vocabulary of words;\nselectively extracting from said stored signals preselected signals forming a duration modified predetermined sequence of signals representative of said speech message;\naltering the pitch parameters of said extracted signals; and\ncombining said pitch and function modified signals to form a sum signal for activating a speech synthesizer.\n14. A method for composing speech message from phase vocoder encoded and stored words comprising the steps of:\nextracting selected signals from said encoded stored words a repeated number of times to affect the duration of synthesized speech;\naltering the pitch parameters of said extracted signals;\ninterpolating the spectrum parameters of said extracted signal; and\nphase vocoder decoding of said interpolated and pitch and duration altered signals to form a speech message signal.\n15. A method for processing phase vocoder type representations of selected prerecorded spoken words to form a description of a desired message suitable for actuating a speech synthesizer to develop synthesized speech, which comprises the steps of:\nencoding said prerecorded words in accordance with phase vocoder techniques to form short-time Fourier transform signal vectors and phase derivative signal vectors;\nstoring said phase derivative and said short-time Fourier transform signal vectors;\nextracting selected locations of said stored signals a preselected number of times to control the duration of said synthesized speech;\nmodifying said phase derivative signal vectors to control the pitch of said synthesized speech;\ninterpolating the short-time Fourier transform signal vectors in accordance with predetermined rules responsive to an applied duration control signal and to the modified phase derivative signal vectors to effect a smooth spectrum envelope; and\ncombining said modified phase derivative signal vectors and said spectrum interpolated shorttime Fourier transform signal vectors in accordance with phase vocoder techniques to form a synthesized speech signal suitable for actuating said speech synthesizer.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3360610A",
        "US3369077A",
        "US3450838A",
        "US3828132A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4076958A",
        "US4189779A",
        "US4281994A",
        "US4366471A",
        "US4379640A",
        "US4415767A",
        "US4441201A",
        "US4624012A",
        "US4716591A",
        "US4815135A",
        "US4827517A",
        "WO1989009985A1",
        "US4885790A",
        "US4937868A",
        "US5009143A",
        "US5081681A",
        "US5179626A",
        "US5195166A",
        "USRE34247E",
        "US5216747A",
        "US5226084A",
        "US5247579A",
        "US5388181A",
        "US5425130A",
        "US5517511A",
        "US5630011A",
        "US5664051A",
        "US5701390A",
        "US5715365A",
        "US5754974A",
        "US5826222A",
        "US5839099A",
        "US5870704A",
        "US5915237A",
        "US5928311A",
        "US5970440A",
        "US6131084A",
        "US6161089A",
        "US6182042B1",
        "US6199037B1",
        "US6324501B1",
        "US6377916B1",
        "US6526325B1",
        "US6804649B2",
        "US7088835B1",
        "US9865247B2"
    ],
    "citedby_ftf": [
        "US3995116A",
        "US4210781A",
        "JPH0215177B2",
        "EP3998607A1",
        "EP2988300A1"
    ]
}