{
    "patent_link": "https://patents.google.com/patent/US20110040701A1/en",
    "patent_id": "US20110040701A1",
    "title": "Method and System for High Speed Options Pricing",
    "abstract": "A high speed technique for options pricing in the financial industry is disclosed that can provide both high throughput and low latency. Parallel/pipelined architectures are disclosed for computing an option's theoretical fair price. Preferably these parallel/pipelined architectures are deployed in hardware, and more preferably reconfigurable logic such as Field Programmable Gate Arrays (FPGAs) to accelerate the options pricing operations relative to conventional software-based options pricing operations.",
    "inventors": [
        "Naveen Singla",
        "Scott Parsons",
        "Mark A. Franklin",
        "David E. Taylor"
    ],
    "assignee": "Exegy Inc",
    "classifications": [
        "G06Q40/04",
        "G06Q40/06"
    ],
    "claims": "\n1. An apparatus for computing a price for an option, the apparatus comprising:\nan options pricing engine that is configured to receive a data stream comprising financial market data, the financial market data comprising a plurality of data messages corresponding to a plurality of options on at least one underlying financial instrument, the data messages comprising data that describes the options, wherein the options pricing engine comprises a plurality of parallel computational units, each of the plurality of parallel computational units configured to (1) receive a volatility value and a portion of the data stream representative of a particular option, (2) compute a theoretical fair market price for the particular option based on the received volatility value, and (3) return the computed theoretical fair market price as an output such that the plurality of parallel computational units are configured to simultaneously compute a plurality of theoretical fair market prices.\n2. The apparatus of claim 1 wherein at least one of the parallel computational units comprises a plurality of pipelined stages, the plurality of pipelined stages comprising a plurality of parallel computational nodes, each of the computational nodes being configured to compute a step of a stepwise option pricing model, and wherein the computational nodes are cascaded such that each successive pipelined stage is configured to receive as its input the output from at least two computational nodes in the immediately preceding pipelined stage, wherein the output of the last pipelined stage comprises the computed theoretical fair market price for an option.\n3. The apparatus of claim 2 wherein the pipelined stages are arranged in a binomial tree of computational nodes, wherein the tree is of depth n.\n4. The apparatus of claim 3 wherein the options pricing engine is configured to partition the binomial tree across a plurality of processing resources.\n5. The apparatus of claim 4 wherein the plurality of processing resources comprise processing resources of different types.\n6. The apparatus of claim 1 wherein at least one of the parallel computational units comprises a plurality of pipelined stages, the plurality of pipelined stages configured to compute a plurality of financial instrument prices for the option pricing model based on an upward multiplicative factor and a downward multiplicative factor, the upward multiplicative factor and the downward multiplicative factor being functions of the received volatility value.\n7. The apparatus of claim 6 wherein the at least one parallel computational unit further comprises a second set of the pipelined stages, wherein the second set of pipelined stages are configured to compute a plurality of probability terms for an option pricing model that are used in the theoretical fair market price computation.\n8. The apparatus of claim 7 wherein the two sets of pipelined stages are arranged in parallel with each other.\n9. The apparatus of claim 7 further comprising a combinatorial logic stage downstream from the two sets of pipelined stages, wherein the combinatorial logic stage is configured to compute the theoretical fair market price for the option based on a plurality of terminal financial instrument prices generated by the first set of pipelined stages and the computed probability terms from the second set of pipelined stages.\n10. The apparatus of claim 1 wherein the options pricing engine comprises a lookup table, the lookup table configured to store a plurality of precomputed terms for use in the theoretical fair market price computation, and wherein at least one of the parallel computational units is configured to, for each of a plurality of the options, (1) retrieve precomputed terms from the lookup table using an index based at least in part upon a volatility for the underlying financial instrument for the option, and (2) compute the theoretical fair market price for the options based at least in part on the retrieved precomputed terms.\n11. The apparatus of claim 10 wherein the lookup table comprises (1) a first lookup table in which a plurality of volatility values for a plurality of different financial instruments are stored, wherein the first lookup table is indexed by financial instrument, and (2) a second lookup table in which the plurality of precomputed terms are stored, wherein the second lookup table is indexed by a volatility for the underlying financial instrument and a time to maturity for the option; and\nwherein the at least one parallel computational unit comprises (1) a lookup unit that is configured to (i) process the data describing the option, the data describing the option comprising an identifier for the underlying financial instrument and a time to maturity for the option, (ii) access the first lookup table based on an identity of the underlying financial instrument for the option to thereby retrieve the volatility value for that underlying financial instrument, and (iii) access the second lookup table based on the retrieved volatility value and a time to maturity for the option to thereby retrieve the plurality of precomputed terms applicable to that option; and\na combinatorial logic stage that is configured to compute the theoretical fair market price according to an option pricing model based at least in part upon the data describing the option, the retrieved volatility value and the retrieved precomputed terms.\n12. The apparatus of claim 11 wherein the combinatorial logic stage comprises a plurality of parallel computational pipelines and an adder downstream from the parallel computational pipelines, wherein each computational pipeline is configured to compute, in parallel with the other parallel computational pipelines, a subcomponent of the theoretical fair market price based at least in part upon the data describing the option, the retrieved volatility value and the retrieved precomputed terms, and wherein the adder is configured to compute the theoretical fair market price for the option by summing the computed subcomponents produced by the parallel computational pipelines.\n13. The apparatus of claim 1 wherein the data describing the options comprises a flag for identifying whether a subject option is a call option or a put option, wherein at least one of the parallel computational units comprises a first computational path configured to compute a theoretical fair market price for a call option and a second computational path configured to compute a theoretical fair market price for a put option, and wherein the at least one parallel computational unit is further configured to selectively route data describing the options to the first or second computational path based on the flag for the subject option.\n14. The apparatus of claim 1 wherein the options pricing engine further comprises a plurality of pipelined computational modules for computing an implied volatility for each of a plurality of options over a plurality of iterations, wherein each computational module in the pipeline corresponds to a different iteration of the implied volatility computation such that the computational modules in the pipeline are configured to simultaneously perform different iterations of the implied volatility computation for different options, each pipelined computational module comprising at least two of the parallel computational units.\n15. The apparatus of claim 14 wherein the parallel computational units of a computational module are seeded with different volatility values, wherein the parallel computational units of the computational module corresponding to a first iteration of the implied volatility computation are configured to compute a plurality of theoretical fair market prices for a band of volatility values, and wherein the parallel computational units of the computational modules corresponding to subsequent iterations of the implied volatility computation are configured to compute a plurality of theoretical fair market prices for progressively narrower bands of volatility values.\n16. The apparatus of claim 1 further comprising a processor in communication with the options pricing engine, the processor configured to deliver the financial market data stream to the options pricing engine.\n17. The apparatus of claim 1 further comprising a processor configured to execute a black box trading algorithm, and wherein the options pricing engine is further configured to feed a computed theoretical fair market price for an option to the processor, and wherein the processor is further configured to automatically generate a financial instrument trade via the black box trading algorithm based at least in part upon the computed theoretical fair market price for the option.\n18. The apparatus of claim 1 further comprising a processor in communication with the options pricing engine, wherein the options pricing engine serves as an offload engine relative to the processor, the options pricing engine being deployed on a computational resource separate from the processor.\n19. The apparatus of claim 18 wherein the processor comprises a general purpose processor (GPP) configured to execute software to manage an interface with the options pricing engine.\n20. The apparatus of any of claims 1-19 wherein the parallel computational units are deployed on at least one member of the group consisting of a reconfigurable logic device, a graphics processor unit (GPU), and a chip multi-processor.\n21. A method for computing a price for an option, the method comprising:\nreceiving an electronic data stream comprising financial market data, the financial market data comprising a plurality of data messages corresponding to a plurality of options on at least one underlying financial instrument, the data messages comprising data that describes the options; and\nwith each of a plurality of parallel computational units, (1) receiving a volatility value and a portion of the data stream representative of a particular option, (2) computing a theoretical fair market price for the particular option based on the received volatility value, and (3) returning the computed theoretical fair market price as an output such that the plurality of parallel computational units simultaneously compute a plurality of theoretical fair market prices.\n22. The method of claim 19 wherein the parallel computational units are deployed on at least one member of the group consisting of a reconfigurable logic device, a graphics processor unit (GPU), and a chip multi-processor.",
    "status": "Active",
    "citations_own": [
        "US3082402A",
        "US3296597A",
        "US4081607A",
        "US4314356A",
        "US4903201A",
        "US5101353A",
        "US5101424A",
        "US5179626A",
        "US5297032A",
        "US5388259A",
        "US5396253A",
        "US5481735A",
        "US5488725A",
        "US5497317A",
        "US5497488A",
        "US5500793A",
        "US5721898A",
        "US5857176A",
        "US5864738A",
        "US5870730A",
        "US5873071A",
        "US5884286A",
        "US6016483A",
        "US6023760A",
        "US6023755A",
        "US6028939A",
        "US6044407A",
        "US6169969B1",
        "US6173270B1",
        "US6173276B1",
        "US6178494B1",
        "US6195024B1",
        "US6336150B1",
        "US20020010825A1",
        "US20020019812A1",
        "US20020023010A1",
        "US20030009693A1",
        "US20030014662A1",
        "US20030018630A1",
        "US20030021043A1",
        "US20030023876A1",
        "US20030023653A1",
        "US20030028690A1",
        "US20030028408A1",
        "US20030028864A1",
        "US20030033234A1",
        "US20030033588A1",
        "US20030033594A1",
        "US20030033240A1",
        "US20030037037A1",
        "US20030035547A1",
        "US20030037321A1",
        "US20030046668A1",
        "US20030043805A1",
        "US6535868B1",
        "US20030055770A1",
        "US20030055769A1",
        "US20030055658A1",
        "US20030055771A1",
        "US20030061409A1",
        "US20040015633A1",
        "US6691301B2",
        "US20040028047A1",
        "US20040034587A1",
        "US6704816B1",
        "US20040049596A1",
        "US6711558B1",
        "US6839686B1",
        "US20050005145A1",
        "US6850906B1",
        "US20050033672A1",
        "US20060020715A1",
        "US20060020536A1",
        "US20060031154A1",
        "US20060031156A1",
        "US7003488B2",
        "US20060047636A1",
        "US20060053295A1",
        "US20060059067A1",
        "US20060059065A1",
        "US20060059066A1",
        "US20060059064A1",
        "US7161506B2",
        "US20070011183A1",
        "US7167980B2",
        "US7177833B1",
        "US7181608B2",
        "US7321937B2",
        "US20100005036A1",
        "US7660761B2",
        "US7668849B1",
        "US20110010287A1",
        "US8095508B2"
    ],
    "citations_ftf": [
        "US2046381A",
        "US3581072A",
        "US3601808A",
        "US3573747A",
        "US3611314A",
        "US3824375A",
        "US3729712A",
        "US3848235A",
        "US3906455A",
        "US4412287A",
        "US4044334A",
        "US4300193A",
        "US4298898A",
        "FR2481026B1",
        "US4464718A",
        "US4550436A",
        "US5270922A",
        "US4674044A",
        "US4941178A",
        "US4823306A",
        "US5038284A",
        "US5023910A",
        "JPH0219963A",
        "US5050075A",
        "JPH02224060A",
        "JPH03505498A",
        "US5249292A",
        "US5077665A",
        "JPH0314075A",
        "AU620994B2",
        "US5126936A",
        "JPH03179863A",
        "US5163131A",
        "US5243655A",
        "US5319776A",
        "US5313560A",
        "US5255136A",
        "US5063507A",
        "GB9023096D0",
        "US5258908A",
        "US5615309A",
        "US5339411A",
        "DE69229521T2",
        "US5477451A",
        "US5265065A",
        "US5826075A",
        "US5375055A",
        "WO1993018505A1",
        "US5524268A",
        "US5684980A",
        "GB9220404D0",
        "EP0664910A1",
        "US5432822A",
        "US5546462A",
        "US5544352A",
        "US6456982B1",
        "EP0651321B1",
        "US5371794A",
        "US5813000A",
        "US5465353A",
        "US5461712A",
        "US5809483A",
        "US5987432A",
        "US5623652A",
        "US6263321B1",
        "JP2964879B2",
        "SE505156C2",
        "US5493239A",
        "CN100452072C",
        "US5819290A",
        "US5845266A",
        "GB2300991B",
        "US5943421A",
        "JPH0981574A",
        "US5701464A",
        "US6134551A",
        "US5774839A",
        "US20050267836A1",
        "US5713793A",
        "US5781921A",
        "US6147976A",
        "US5995963A",
        "US6061662A",
        "US5991881A",
        "US5963923A",
        "JP3231673B2",
        "DE19651075A1",
        "US5905974A",
        "US6073160A",
        "US5911778A",
        "US6070172A",
        "US5930753A",
        "JPH10326287A",
        "US6236727B1",
        "US6067569A",
        "US6317795B1",
        "US5950196A",
        "US6772136B2",
        "JPH11110320A",
        "GB2330682A",
        "US6442533B1",
        "US6138176A",
        "US6594643B1",
        "US6412000B1",
        "US7124106B1",
        "US6058391A",
        "US6147890A",
        "US5987610A",
        "US6304858B1",
        "KR100441171B1",
        "JP4536833B2",
        "US6279113B1",
        "JP4073536B2",
        "US6236980B1",
        "US6397259B1",
        "US6415269B1",
        "US6105067A",
        "US6289461B1",
        "US6272616B1",
        "GB9819183D0",
        "US6226676B1",
        "US6317728B1",
        "WO2000031963A1",
        "US6499107B1",
        "US6578147B1",
        "US6604158B1",
        "US6778968B1",
        "US6993504B1",
        "US6278982B1",
        "AU779731B2",
        "US6597812B1",
        "US6765918B1",
        "US6463474B1",
        "US7002986B1",
        "US7996296B2",
        "US6418419B1",
        "JP2002032564A",
        "US20030093343A1",
        "US6546375B1",
        "US7181424B1",
        "US7251629B1",
        "US6886103B1",
        "AU1606201A",
        "US6804667B1",
        "US7356498B2",
        "US20030191876A1",
        "US6877044B2",
        "US7127424B2",
        "US7228289B2",
        "US6772132B1",
        "US20030093347A1",
        "US7103569B1",
        "US7099838B1",
        "US7571130B2",
        "US6941280B1",
        "JP2001283000A",
        "US8799138B2",
        "CA2406418C",
        "WO2001080558A2",
        "GB2366957A",
        "US7685052B2",
        "US6981054B1",
        "US7089206B2",
        "US20020100029A1",
        "US8692695B2",
        "US9143546B2",
        "US7417568B2",
        "US20020069375A1",
        "US20020072893A1",
        "US7065475B1",
        "WO2002061525A2",
        "US6807156B1",
        "US7184984B2",
        "US7178100B2",
        "JP2002183449A",
        "US20020101425A1",
        "US20020180742A1",
        "US20020199173A1",
        "US20030074177A1",
        "US20030105620A1",
        "US7386046B2",
        "WO2002071227A1",
        "JP2002269343A",
        "US7681032B2",
        "US20030079060A1",
        "US7325249B2",
        "US6785677B1",
        "US6944168B2",
        "US7558753B2",
        "US20030009411A1",
        "US7149715B2",
        "JP2003036360A",
        "US7046848B1",
        "US6978223B2",
        "EP1436936A4",
        "CA2403699C",
        "US20030065943A1",
        "US20030187662A1",
        "US20030184593A1",
        "US7181765B2",
        "US7716330B2",
        "AU2002349906A1",
        "US20030117971A1",
        "US20030121010A1",
        "US20030120460A1",
        "US20030140337A1",
        "US6772345B1",
        "US7454603B2",
        "US7225188B1",
        "JP2003256660A",
        "US7249118B2",
        "US7277887B1",
        "US8027893B1",
        "US7093023B2",
        "US7224185B2",
        "US7953820B2",
        "US7761459B1",
        "WO2004042562A2",
        "KR101035646B1",
        "US7373432B2",
        "US7769668B2",
        "US6901461B2",
        "US7752117B2",
        "WO2004072797A2",
        "TW591532B",
        "US7440917B2",
        "US7640201B2",
        "US7593880B2",
        "US20040186804A1",
        "EP1627331B1",
        "US7058735B2",
        "US20040267657A1",
        "US7756782B2",
        "US7444515B2",
        "US7222114B1",
        "US7287037B2",
        "US20050080649A1",
        "US10002385B2",
        "US20050097027A1",
        "US7529703B2",
        "US20050216384A1",
        "US7602785B2",
        "US8219477B2",
        "US20050187845A1",
        "US7542932B2",
        "US7630928B2",
        "US7469228B2",
        "US8126795B2",
        "US7711628B2",
        "US7835961B2",
        "US20050197938A1",
        "US7411957B2",
        "US7457834B2",
        "EP1589450A1",
        "US7756033B2",
        "US20050283743A1",
        "US7305383B1",
        "US7555449B2",
        "JP4484756B2",
        "JP4397761B2",
        "US7593877B2",
        "US7428508B2",
        "US20060143099A1",
        "US7461064B2",
        "US8321465B2",
        "US20060129745A1",
        "US7788293B2",
        "US7917299B2",
        "WO2006108158A2",
        "US7765183B2",
        "EP1910992A4",
        "US8024253B2",
        "US7782873B2",
        "US8140362B2",
        "US20070061241A1",
        "US8073763B1",
        "US7801910B2",
        "EP1952335A4",
        "US20090119224A1",
        "US7702629B2",
        "WO2007074903A1",
        "US7954114B2",
        "US20070179935A1",
        "US8379841B2",
        "US20070244859A1",
        "US7752123B2",
        "US7636703B2",
        "US7606968B2",
        "US20060282369A1",
        "JP5108009B2",
        "US7840482B2",
        "US7921046B2",
        "WO2008014494A2",
        "US7856546B2",
        "WO2008022036A2",
        "US8244718B2",
        "US7930314B2",
        "US20080084573A1",
        "US20080104542A1",
        "US8326819B2",
        "US7660793B2",
        "CA2691336A1",
        "JP4180644B1",
        "US10229453B2",
        "US8374986B2",
        "JP5871619B2",
        "FR2945394B1",
        "EP2577936A2",
        "CA2820898C",
        "US9047243B2",
        "US10121196B2"
    ],
    "citedby_own": [
        "US20070078837A1",
        "US20090182683A1",
        "US20110288979A1",
        "WO2012079041A1",
        "US8301545B1",
        "US8326819B2",
        "US8374986B2",
        "WO2013090363A2",
        "WO2013148693A1",
        "US8751452B2",
        "US8763018B2",
        "US20140180904A1",
        "US8996644B2",
        "US9003053B2",
        "US9258390B2",
        "US9300599B2",
        "US9391840B2",
        "US9391841B2",
        "US9426124B2",
        "US9600429B2",
        "US9633097B2",
        "US9633093B2",
        "US9674318B2",
        "US9730648B2",
        "US9912665B2",
        "US9990393B2",
        "US20180189674A1",
        "US10121196B2",
        "US10146845B2",
        "US10394751B2",
        "US10505747B2",
        "US10572824B2",
        "US10650452B2",
        "US10742604B2",
        "US10846624B2",
        "US10873613B2",
        "US10902013B2",
        "US10942943B2",
        "WO2022177975A1",
        "US11436672B2"
    ],
    "citedby_ftf": [
        "US7917299B2",
        "US7801801B2",
        "WO2006130650A2",
        "US7734533B2",
        "US7702629B2",
        "US7954114B2",
        "US7840482B2",
        "US7921046B2",
        "US7660793B2",
        "US20080147767A1",
        "US8117137B2",
        "US20100057634A1",
        "US8131659B2",
        "GB2478093B",
        "JP5871619B2",
        "FR2945394B1",
        "US9727913B2",
        "US10529020B2",
        "TWI410883B",
        "CA2681251A1",
        "US8751352B2",
        "US9959572B2",
        "US9940670B2",
        "US9979589B2",
        "SG10201704581VA",
        "US10057333B2",
        "US10771536B2",
        "WO2011150327A2",
        "US10572937B2",
        "US9547874B2",
        "US8510546B2",
        "US20120317051A1",
        "US20130151438A1",
        "US10127612B2",
        "WO2014065869A1",
        "US8548900B1",
        "JP2016510923A",
        "CN104077693B",
        "EP2858025A1",
        "US10467693B2",
        "US10929926B2",
        "US11037239B2",
        "US10692143B2",
        "US10366452B2",
        "US20150127509A1",
        "US10332206B2",
        "US9691102B2",
        "US20160098795A1",
        "BR112017018133B1",
        "US20160267591A1",
        "US11164248B2",
        "US11288739B2",
        "US10692144B2",
        "US10580100B2",
        "US11514448B1",
        "US10417217B2",
        "US10748210B2",
        "US10943297B2",
        "US20190279100A1",
        "US10861094B1",
        "WO2020232294A1",
        "CN111221770A",
        "CN112036937A",
        "CN113312024B"
    ]
}