{
    "patent_link": "https://patents.google.com/patent/US3933205A/en",
    "patent_id": "US3933205A",
    "title": "Hydraulic fracturing process using reverse flow",
    "abstract": "Well productivity is increased by multiple hydraulic fracturing cycles. A double cycle first creates a long primary fracture by fluid injection and forms spalls by subsequently allowing the pressure in the fracture to drop below the initial fracturing pressure by discontinuing injection and shutting the well in or allowing it to flow back, resuming injection to displace said spalls longitudinally in said fracture and again discontinuing injection, whereupon the fracture is propped open by the displaced spalls.",
    "inventors": [
        "Othar Meade Kiel"
    ],
    "assignee": "Individual",
    "classifications": [],
    "claims": "\n1. A method of well treatment by hydraulic fracturing of the formation to be treated, said fracturing including at least one double cycle comprising injection of fluid into the formation for a period of at least three minutes under pressure throughout said period sufficient to fracture the formation; planned discontinuance of said fluid injection and at least one period of reverse flow of said fluid from said formation for a period of time at least long enough to allow a significant pressure drop in said fluid, resumption of injection, and discontinuance of injection.\n2. Method according to 1 including two double cycles.\n3. Method according to 1 including three double cycles.\n4. Method according to 1 including a plurality of double cycles.\n5. Method according to 1 incuding injecting fine sand with the fracturing fluid to limit the vertical conductive extent of the fracturing.\n6. Method according to 1 including injecting fine sand for fluid loss control.\n7. Method according to claim 1 wherein said period of reverse flow is sufficient to return .25 to 1.00 percent by volume, of the fluid injected into the formation.\n8. Method according to claim 1 where said period of reverse flow is sufficient to allow flow back of more than five and less than 50 barrels of said fluid.\n9. Method according to claim 1 wherein said period of reverse flow is greater than 20 seconds and less than 10 minutes.\n10. Method according to claim 1 wherein said period of reverse flow is sufficient to allow flow back of less than all recoverable fracturing fluid.\n11. Method according to claim 1 wherein said fluid is substantially incompressible.\n12. Method according to claim 1 wherein said fluid is gas free at formation and surface ambiant conditions.\n13. Method according to claim 1 wherein said fluid is injected into the formation for at least several minutes.\n14. A method of well treatment by hydraulic fracturing of the formation to be treated, said fracturing including a plurality of double cycles each of which double cycle comprises:\ninjecting fracturing fluid into the formation at a pressure sufficient to fracture the formation, maintaining said pressure for at least three minutes, discontinuing injecting fracturing fluid into the formation, allowing at least one period of reverse flow from said formation for a period of time at least long enough to allow a significant pressure drop in said fluid, and again injecting fracturing fluid into the formation.\n15. Method according to 14 wherein the number of double cycles is two.\n16. Method according to 14 wherein the number of double cycles is three.\n17. Method according to 14 wherein the well is not produced between double cycles.\n18. Method according to 14 wherein each period of said discontinuing injecting fracturing fluid, except the last such period, lasts for from 5 minutes to one hour.\n19. Method according to 14 wherein the injection pressure during each double cycle subsequent to the first double cycle is significantly greater than during the first double cycle, i.e. is at least 10 percent greater.\n20. Method according to 14 wherein the period of the even numbered injection is of the order 1/4 to 1/3 the period of the immediately preceding odd numbered injection, considering that the several injections are numbered consequently in chronological order.\n21. Method of 14 wherein the periods of the several consecutive pairs of injection periods, considering the first and second injection periods as the first such pair are approximately proportional to the square root of the number of such pair, considering that the several pairs are numbered consecutively in chronological order.\n22. Method according to 14 wherein the periods of discontinuance of injection and reverse flow, other than the last one, are such that the shut in pressure does not fall to less than 1/3 of the amount of the increase in pressure during the previous injection, thereby to avoid excessive fluid loss.\n23. Method according to 14 wherein the fracturing fluid is of the formation pressure increasing type, i.e., if injection were at constant rate, the injection pressure measured at the well head initially increases.\n24. Method according to claim 14 wherein said period of reverse flow is sufficient to return .25 to 1.00 percent, by volume, of said fluid injected into the formation.\n25. Method according to claim 14 wherein said period of reverse flow is sufficient to allow flow back of more than 5 and less than 50 barrels of said fluid.\n26. Method according to claim 14 wherein said period of reverse flow is greater than 20 seconds and less than 10 minutes.\n27. Method according to claim 14 wherein said period of reverse flow is sufficient to allow flow back of less than all recoverable fracturing fluid.\n28. Method according to claim 14 wherein said fluid is substantially incompressable.\n29. Method according to claim 14 wherein said fluid is gas free at formation and surface ambiant conditions.\n30. Method according to claim 14 wherein said fluid is injected into the formation for at least several minutes.\n31. Method of well treatment by hydraulic fracturing of the formation to be treated, said fracturing including at least one double cycle comprising\ninjection of fluid into the formation for a period of at least three minutes under pressure throughout said period sufficient to fracture the formation, said fluid being capable of undergoing fluid loss to said formation once said formation is fractured,\nplanned discontinuation of said fluid injection for a period of time at least long enough to allow a pressure reduction in said fluid,\nresumption of injection with at least a portion of the formation exposed to fluid pressure during the first said injection being the same as a portion of the formation again exposed to fluid pressure during said resumed injection, and\ndiscontinuance of injection.\n32. Method according to claim 31 including two double cycles.\n33. Method according to claim 31 including three double cycles.\n34. Method according to claim 31 including a plurality of double cycles.\n35. Method according to claim 31 including injecting fine sand with the fracturing fluid to limit the vertical conductive extent of the fracturing.\n36. Method according to claim 31 including injecting fine sand for fluid loss control.\n37. Method according to claim 31 wherein said injection into the formation of fluid under pressure sufficient to fracture the formation lasts from 3 minutes to one hour.\n38. Method according to claim 37 wherein said planned discontinuance of such fluid injection lasts not more than 10 minutes.\n39. Method of well treatment by hydraulic fracturing of the formation to be treated, said fracturing including a plurality of double cycles each of which double cycle comprises:\ninjecting fracturing fluid into the formation at a pressure sufficient to fracture the formation, said fluid being capable of undergoing fluid loss to said formation once said formation is fractured,\nmaintaining said pressure for at least three minutes,\ndiscontinuing injecting fracturing fluid into the formation for a period of time at least long enough to allow a pressure reduction,\nagain injecting fracturing fluid into the formation with at least a portion of the formation exposed to fluid pressure during the first said injection being the same as a portion of the formation again exposed to fluid pressure during said resumed injection, and\nagain discontinuing injecting fracturing fluid into the formation.\n40. Method according to claim 39 wherein the number of double cycles is two.\n41. Method according to claim 39 wherein the number of double cycles is three.\n42. Method according to claim 39 wherein the well is not produced between double cycles.\n43. Method according to claim 39 wherein each period of said discontinuing injecting fracturing fluid, except the last such period, lasts for from 5 minutes to one hour.\n44. Method according to claim 39 wherein the injection pressure during each double cycle subsequent to the first double cycle is significantly greater than during the first double cycle, i.e. is at least 10 percent greater.\n45. Method according to claim 39 wherein the period of the even numbered injection is of the order 1/4 to 1/3 the period of the immediately preceding odd numbered injection, considering that the several injections are numbered consecutively in chronological order.\n46. Method of claim 39 wherein the periods of the several consecutive pairs of injection periods, considering the first and second injection periods as the first such pair are approximately proportional to the square root of the number of such pair, considering that the several pairs are numbered consecutively in chronological order.\n47. Method according to claim 39 wherein the periods of discontinuance of injection, other than the last one, are such that the shut in pressure does not fall to less than 1/3 of the amount of the increase in pressure during the previous injection, thereby to avoid excessive fluid loss.\n48. Method according to claim 39 wherein the fracturing fluid is of the formation pressure increasing type, i.e., if injection were at constant rate, the injection pressure measured at the well head initially increases.\n49. Method of well treatment by hydraulic fracturing of the formation to be treated, said fracturing including at least one double cycle comprising:\ninjecting into said formation a fluid capable of undergoing fluid loss to said formation once said formation is fractured,\ncontinuing said injection for a period of at least three minutes.\nat all times during said period maintaining said fluid under a pressure sufficient to fracture the formation.\nthen dropping the fluid pressure to give an opportunity for spalling to occur at the fracture faces,\nresuming injection at a time beginning at least three minutes later than the first period of injection, and\ndiscontinuing of said injection,\nat least a portion of the formation exposed to fluid pressure during the first period of injection being the same as a portion of the formation exposed to fluid pressure during the second period of injection.\n50. Method of well treatment by hydraulic fracturing of the formation to be treated, said fracturing including at least one double cycle comprising:\ninjecting into said formation a fluid capable of undergoing fluid loss to said formation once said formation is fractured,\ncontinuing said injection for a period of at least three minutes,\nat all times during said period maintaining said fluid under a pressure sufficient to fracture the formation,\ndiscontinuing injection for a period of at least three minutes to give an opportunity for spalling to occur at the fracture faces,\nresuming injection, and\ndiscontinuing injection;\nthe same formation being treated during the entire treatment.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US2769497A",
        "US2915122A",
        "US3048226A",
        "US3189092A",
        "US3245470A",
        "US3302720A",
        "US3378074A",
        "US3592266A",
        "US3710865A",
        "US3722595A",
        "US3743017A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4078609A",
        "US4186802A",
        "US4220205A",
        "US4398769A",
        "EP0145540A2",
        "US4724905A",
        "US4834181A",
        "US4995463A",
        "US5241475A",
        "US5341879A",
        "US5536115A",
        "US5964289A",
        "WO2000065196A1",
        "US6367566B1",
        "US6776235B1",
        "US20040162224A1",
        "US6793018B2",
        "US6877561B2",
        "US20050089631A1",
        "US20050230117A1",
        "US20050257929A1",
        "US20050267001A1",
        "US20060076138A1",
        "US20060086504A1",
        "US20060113080A1",
        "US20060116296A1",
        "US20060113078A1",
        "US20060124303A1",
        "US20060219408A1",
        "US20060219405A1",
        "US20060240995A1",
        "US20070007003A1",
        "US20070007009A1",
        "US20070023184A1",
        "US20070114032A1",
        "US20070125543A1",
        "US20070151731A1",
        "US20070173414A1",
        "US20070173413A1",
        "US20070179065A1",
        "US20070187097A1",
        "US20070193745A1",
        "US20080006405A1",
        "US20080006406A1",
        "US20080060809A1",
        "US20080083531A1",
        "US20080083532A1",
        "US20080099207A1",
        "US20080115692A1",
        "US20080135251A1",
        "US20080196897A1",
        "US20080197085A1",
        "US20080236818A1",
        "US20080243675A1",
        "US20080251252A1",
        "US20080257556A1",
        "US20080269082A1",
        "US20080271890A1",
        "US20080283242A1",
        "US20080287325A1",
        "US20080314124A1",
        "US20080318812A1",
        "US20090095482A1",
        "US20090151943A1",
        "US20090194273A1",
        "US20090200027A1",
        "US20090205830A1",
        "US20090275488A1",
        "US20090283260A1",
        "US20100000795A1",
        "US20100012901A1",
        "US20100077938A1",
        "US7712531B2",
        "US20100122815A1",
        "US20100132943A1",
        "US20100181071A1",
        "US7762329B1",
        "US7766099B2",
        "US20100197968A1",
        "US20100212905A1",
        "US7789147B2",
        "US20100252262A1",
        "US20100305010A1",
        "US20100311620A1",
        "US20110001083A1",
        "US20110005756A1",
        "US20110048719A1",
        "US20110108276A1",
        "US20110118155A1",
        "US7992653B2",
        "EP2374861A1",
        "WO2012085646A1",
        "CN102733789A",
        "US8393390B2",
        "US20130140020A1",
        "US8466094B2",
        "CN103244094A",
        "US8524639B2",
        "US8596911B2",
        "US8689872B2",
        "US8714257B2",
        "US8841240B2",
        "US8846585B2",
        "US8851174B2",
        "US8899328B2",
        "US8932996B2",
        "US8944164B2",
        "US9022120B2",
        "CN104594868A",
        "US9062241B2",
        "US9085724B2",
        "US9234125B2",
        "US9334713B2",
        "US9447657B2",
        "US9464504B2",
        "US9581004B2",
        "RU2620099C1",
        "US9909404B2",
        "US9945220B2",
        "US9982523B2",
        "US10001769B2",
        "US10012064B2",
        "US10202828B2",
        "US10241225B2",
        "US10344204B2",
        "US10494564B2",
        "US20200056465A1",
        "US10604693B2",
        "US10669468B2",
        "US10753181B2",
        "CN111636855A",
        "US10801307B2",
        "CN111827993A",
        "US10954774B2",
        "US10982520B2",
        "US11028679B1",
        "US11125068B2",
        "US11131174B2",
        "US11143008B1",
        "US11209558B2",
        "US11236609B2",
        "US11248163B2",
        "US11280170B2",
        "US11365617B1",
        "US11434738B1"
    ],
    "citedby_ftf": []
}