{
    "patent_id": "US-11568035-B2",
    "title": "Deep neural network for iris identification ",
    "assignee": "Magic Leap, Inc.",
    "publication_date": "2023-01-31",
    "patent_link": "https://patents.google.com/patent/US11568035B2/en",
    "inventors": [
        "Alexey SPIZHEVOY",
        "Adrian Kaehler",
        "Gary Bradski"
    ],
    "classifications": [
        "G06F21/32",
        "G06N3/04",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/08",
        "G06N7/005",
        "G06N7/01",
        "G06V10/82",
        "G06V40/19",
        "G06V40/197",
        "H04L63/0861"
    ],
    "abstract": "Systems and methods for iris authentication are disclosed. In one aspect, a deep neural network (DNN) with a triplet network architecture can be trained to learn an embedding (e.g., another DNN) that maps from the higher dimensional eye image space to a lower dimensional embedding space. The DNN can be trained with segmented iris images or images of the periocular region of the eye (including the eye and portions around the eye such as eyelids, eyebrows, eyelashes, and skin surrounding the eye). With the triplet network architecture, an embedding space representation (ESR) of a person's eye image can be closer to the ESRs of the person's other eye images than it is to the ESR of another person's eye image. In another aspect, to authenticate a user as an authorized user, an ESR of the user's eye image can be sufficiently close to an ESR of the authorized user's eye image.",
    "claims": "\n1. A wearable display system comprising:\na display;\nan image capture device configured to capture eye images of a wearer;\na non-transitory computer readable medium having software instructions stored thereon, the software instructions executable by a hardware computer processor to perform operations comprising:\nreceiving a first eye image from the image capture device;\nreceiving, from an authentication training system, an embedding configured to determine embedding space representations of eye images using a deep neural network and at least one classifier usable to determine a likelihood that respective embedding space representations of images are associated with an authorized user;\nprocessing the first eye image to generate a representation of the first eye image in polar coordinates;\nprocessing the representation of the first eye image using the embedding to generate a first embedding space representation of the first eye image, wherein the first embedding space representation is an n-dimensional vector, and wherein a majority of elements of the first embedding space representation are statistically independent;\nprocessing the first embedding space representation using the at least one classifier to calculate a likelihood score that the first eye image is associated with the authorized user; and\ngranting or denying access to the wearable display system based on the likelihood score.\n2. The system of claim 1,\nwherein the one or more deep neural networks comprise a plurality of layers, and\nwherein the plurality of layers comprises a pooling layer, a brightness normalization layer, a convolutional layer, an inception-like layer, a rectified linear layer, a softsign layer, or any combination thereof.\n3. The system of claim 2, wherein the brightness normalization layer comprises a local contrast normalization layer, a local response normalization layer, or a combination thereof.\n4. The system of claim 1, wherein the first embedding space representation has unit length.\n5. The system of claim 1, wherein the at least one classifier determines the likelihood score based on a Euclidian distance.\n6. The system of claim 1, wherein the at least one classifier is a binary classifier, a logistic regression classifier, a support vector machine classifier, a Bayesian classifier, a softmax classifier, or any combination thereof.\n7. The system of claim 1,\nwherein the wearable display system is configured to: segment the first eye image to generate a second eye image, and\nwherein to process the first eye image, the wearable display system is configured to: process the second eye image using the embedding to generate the first embedding space representation.\n8. The system of claim 1, wherein the deep neural network is trained using a triplet network.\n9. The system of claim 8,\nwherein the triplet network is configured to learn the deep neural network from eye images of a plurality of persons, and\nwherein a distance in an embedding space representation based on eye images from the first eye of an individual person is smaller than a distance in an embedding space representation based on eye images from different persons and smaller than a distance in an embedding space representation based on eye images from the second eye of the individual person.\n10. The system of claim 8, wherein the first eye image comprises mostly of the iris and the retina of the first eye.\n11. The system of claim 8, wherein the first eye image comprises mostly of the retina of the first eye.\n12. The system of claim 1, wherein the deep neural network is configured to learn the embedding from a set of biometric information, wherein the set of biometric information comprises at least one of skin tone, skin texture, fingerprints, or voice.\n13. The system of claim 1, wherein the deep neural network is further configured to learn a co-embedding for secondary biometric information and wherein the wearable display system is further programmed to:\nprocess biometric data using the co-embedding to generate a co-embedding space representation based on the biometric data; and\nprocess the co-embedding space representation using the at least one classifier to calculate the likelihood score that the first eye image of the eye is an image of an eye of an authorized user.",
    "status": "Active",
    "citations_own": [
        "US5291560A",
        "US5583795A",
        "US20040130680A1",
        "US6850221B1",
        "USD514570S1",
        "US20060028436A1",
        "US20060036596A1",
        "US20060088193A1",
        "US20060147094A1",
        "US20060228005A1",
        "US20070052672A1",
        "US20070081123A1",
        "US20070140531A1",
        "US20070189742A1",
        "US20080310687A1",
        "US20090129591A1",
        "US20090141947A1",
        "US20090163898A1",
        "US20090232365A1",
        "US20100014718A1",
        "US20100131096A1",
        "US20100208951A1",
        "US20100220906A1",
        "US20100232654A1",
        "US20100284576A1",
        "US20110182469A1",
        "US20110202046A1",
        "US8077914B1",
        "US8098891B2",
        "US8165406B2",
        "US20120127062A1",
        "US20120162549A1",
        "US20120163678A1",
        "US8341100B2",
        "US20130082922A1",
        "US20130117377A1",
        "US20130125027A1",
        "US20130208234A1",
        "US20130242262A1",
        "US20140071539A1",
        "US20140126782A1",
        "US20140161325A1",
        "US20140177023A1",
        "US20140279774A1",
        "US20140267420A1",
        "US20140270405A1",
        "US20140306866A1",
        "WO2014182769A1",
        "US20140341441A1",
        "US20140380249A1",
        "US20150016777A1",
        "US8950867B2",
        "US20150103306A1",
        "US20150117760A1",
        "US20150125049A1",
        "US20150134583A1",
        "US20150154758A1",
        "US20150170002A1",
        "US20150178939A1",
        "US20150205998A1",
        "US20150205126A1",
        "US20150205995A1",
        "US20150222884A1",
        "US20150222883A1",
        "US9141916B1",
        "US20150268415A1",
        "US20150278642A1",
        "US20150302652A1",
        "WO2015164807A1",
        "US20150326570A1",
        "US20150346490A1",
        "US20150346495A1",
        "US20160012292A1",
        "US20160012304A1",
        "US20160011419A1",
        "US20160026253A1",
        "US20160034811A1",
        "US20160035078A1",
        "US20160034679A1",
        "US20160078359A1",
        "USD752529S1",
        "US20160098844A1",
        "US9310559B2",
        "US20160104053A1",
        "US20160104056A1",
        "US20160135675A1",
        "USD758367S1",
        "US20160162782A1",
        "US20160171280A1",
        "USD759657S1",
        "US20160180151A1",
        "US20160232408A1",
        "US9430829B2",
        "US20160291327A1",
        "US20160299685A1",
        "US9514405B2",
        "US20160364609A1",
        "US20170053165A1",
        "US20170132250A1",
        "US20170161506A1",
        "US20170168566A1",
        "US20170186236A1",
        "US20170228641A1",
        "USD794288S1",
        "US20170308734A1",
        "USD805734S1",
        "WO2018013200A1",
        "US20180018515A1",
        "WO2018039269A1",
        "US20180089834A1",
        "US20180096226A1",
        "US20180137642A1",
        "US20180285738A1",
        "US20190080204A1",
        "US10592732B1"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "CN107533642B",
        "CN115345278A",
        "WO2018013200A1",
        "CN109661194B",
        "CA3034644A1",
        "RU2016138608A",
        "CA3038967A1",
        "KR20180053108A",
        "CA3043352A1",
        "AU2017370555B2",
        "US10275648B2",
        "KR20230087622A",
        "CA3055597A1",
        "KR102368661B1",
        "CN107679448B",
        "CN107516080A",
        "CN111033524A",
        "AU2018354257A1",
        "CN111433843A",
        "US11556741B2",
        "US11393251B2",
        "WO2019154509A1",
        "CN108388858B",
        "US11392802B2",
        "US10938852B1",
        "US11210375B2",
        "US11265168B2",
        "US10419221B1",
        "US11170084B2",
        "US11789699B2",
        "US11394552B2",
        "US10721070B2",
        "US11138333B2",
        "US11489866B2",
        "US11502841B2",
        "GB2574372B",
        "US10789696B2",
        "JP7057717B2",
        "CN108766440B",
        "JP2021530790A",
        "US11386719B2",
        "CN109240510A",
        "EP3893718A4",
        "JP7258540B2",
        "US11537202B2",
        "WO2020181098A1",
        "US11442417B2",
        "EP3973468A4",
        "US11720790B2",
        "CN112016065B",
        "EP3979896A1",
        "US11737665B2",
        "CN110263755B",
        "US11698529B2",
        "US11195172B2",
        "CN110532880B",
        "EP3796234A1",
        "CN110909601B",
        "US10607077B1",
        "CN111507952A",
        "US20210365533A1",
        "KR102472368B1",
        "CN112699874B",
        "CN112801182B",
        "CN112818938B",
        "KR102538080B1",
        "CN113674245B",
        "JP7335651B1",
        "US11762969B1"
    ]
}