{
    "patent_id": "US-7937358-B2",
    "title": "System and method for building and merging a rulebase with object oriented software ",
    "assignee": "Computer Associates Think, Inc.",
    "publication_date": "2011-05-03",
    "patent_link": "https://patents.google.com/patent/US7937358B2/en",
    "inventors": [
        "Peter J. Herrera",
        "Ronald Cass",
        "Kirk D. Wilson",
        "It-Beng Tan"
    ],
    "classifications": [
        "G06F17/00",
        "G06N5/022",
        "G06N5/00",
        "G06N5/046"
    ],
    "abstract": "A method for building a rulebase includes receiving a plurality of rulebase components. The method also includes merging the rulebase components to create a consolidated rulebase.",
    "claims": "\n1. A non-transitory computer-readable medium having computer executable instructions thereon, the computer-executable instructions, when executed by one or more processing devices, causing the one or more processing devices to implement a rulebase, the rulebase comprising:\na class element identifying one or more fields and one or more methods;\na constraint element identifying a condition placed on a value of at least one field, the constraint element further identifying a violation action to be performed when the condition is violated; and\na rule element identifying a rule associated with at least one of the fields,\nwherein at least one of the fields is associated with a number datatype, the number datatype representing both integer and floating point values, the number datatype having a corresponding precision indicator identifying a number of decimal places associated with the number datatype.\n2. The computer-readable medium of claim 1, wherein the rule comprises a decision tree rule, the decision tree rule comprising at least one expression dividing the rule into a plurality of subtrees.\n3. The computer-readable medium of claim 1, wherein the rule comprises a pattern matching rule, the pattern matching rule comprising one or more bind variables identifying data objects to be monitored, a premise representing a condition, and an action, wherein the action is executed when one or more of the data objects identified by the bind variables satisfy the condition in the premise.\n4. The computer-readable medium of claim 1, wherein a method that returns a value has no side effects.\n5. The computer-readable medium of claim 1, wherein the rulebase further comprises an association element identifying a relationship between two classes.\n6. The computer-readable medium of claim 5, wherein the rule comprises a pattern matching rule, the pattern matching rule comprising one or more bind variables, and the one or more processing devices are further caused to implement one or more pointers that are used with the association element or with the one or more bind variables.\n7. The computer-readable medium of claim 1, wherein the rule element supports at least one of decision tree rules or pattern matching rules.\n8. The computer-readable medium of claim 1, wherein the class element comprises a first class element and the constraint element comprises a first constraint element, and the rulebase further comprises: a first initialization method element, a first association element, and a domain element,\nwherein the domain element comprises a second initialization method element, a second association element, a second constraint element, a second class element, and a ruleset element, and\nwherein the ruleset element comprises a third initialization method element, a third association element, a third constraint element, a third class element, and the rule element.\n9. The computer-readable medium of claim 1, wherein at least one other of the fields is associated with a boolean representing a value of true or false, a string representing a sequence of characters, or a set representing an unordered collection of unique elements.\n10. A computer-implemented process for implementing a rulebase, the process being executed by one or more processors configured to perform a plurality of operations, the operations comprising:\ninstantiating a class element that identifies one or more fields and one or more methods;\ninstantiating a constraint element that identifies a condition placed on a value of at least one field, and a violation action that is performed when the condition is violated; and\ninstantiating a rule element that identifies a rule associated with at least one of the fields,\nwherein at least one of the fields is associated with a number datatype, the number datatype representing both integer and floating point values, the number datatype having a corresponding precision indicator identifying a number of decimal places associated with the number datatype.\n11. The process of claim 10, wherein the rule comprises a decision tree rule, the decision tree rule comprising at least one expression dividing the rule into a plurality of subtrees.\n12. The process of claim 10, wherein the rule comprises a pattern matching rule, the pattern matching rule comprising one or more bind variables identifying data objects to be monitored, a premise representing a condition, and an action, wherein the action is executed when one or more of the data objects identified by the bind variables satisfy the condition in the premise.\n13. The process of claim 10, wherein a method that returns a value has no side effects.\n14. The process of claim 10, the operations further comprising instantiating an association element that identifies a relationship between two classes.\n15. The process of claim 14, wherein the rule comprises a pattern matching rule, the pattern matching rule comprising one or more bind variables, and the operations further comprise instantiating one or more pointers that are used with the association element or with the one or more bind variables.\n16. The process of claim 10, wherein the rule element supports at least one of decision tree rules or pattern matching rules.\n17. The process of claim 10, wherein the class element comprises a first class element and the constraint element comprises a first constraint element, and the operations further comprise:\ninstantiating a first initialization method element;\ninstantiating a first association element; and\ninstantiating a domain element,\nwherein the domain element comprises a second initialization method element, a second association element, a second constraint element, a second class element, and a ruleset element, and\nwherein the ruleset element comprises a third initialization method element, a third association element, a third constraint element, a third class element, and the rule element.\n18. The process of claim 10, wherein at least one other of the fields is associated with a boolean representing a value of true or false, a string representing a sequence of characters, or a set representing an unordered collection of unique elements.\n19. A computer-implemented system for implementing a rulebase, the system comprising one or more processors configured to:\ninstantiate a class element that identifies one or more fields and one or more methods;\ninstantiate a constraint element that identifies a condition placed on a value of at least one field, and a violation action that is performed when the condition is violated; and\ninstantiate a rule element that identifies a rule associated with at least one of the fields,\nwherein at least one of the fields is associated with a number datatype, the number datatype representing both integer and floating point values, the number datatype having a corresponding precision indicator identifying a number of decimal places associated with the number datatype.\n20. The system of claim 19, wherein the rule comprises a decision tree rule, the decision tree rule comprising at least one expression dividing the rule into a plurality of subtrees.\n21. The system of claim 19, wherein the rule comprises a pattern matching rule, the pattern matching rule comprising one or more bind variables identifying data objects to be monitored, a premise representing a condition, and an action, wherein the action is executed when one or more of the data objects identified by the bind variables satisfy the condition in the premise.\n22. The system of claim 19, wherein a method that returns a value has no side effects.\n23. The system of claim 19, wherein the one or more processors are further configured to instantiate an association element that identifies a relationship between two classes.\n24. The system of claim 23, wherein the rule comprises a pattern matching rule, the pattern matching rule comprising one or more bind variables, and the one or more processors are further configured to instantiate one or more pointers that are used with the association element or with the one or more bind variables.\n25. The system of claim 19, wherein the rule element supports at least one of decision tree rules or pattern matching rules.\n26. The system of claim 19, wherein the class element comprises a first class element and the constraint element comprises a first constraint element, and the one or more processors are further configured to:\nInstantiate a first initialization method element;\ninstantiate a first association element; and\ninstantiate a domain element,\nwherein the domain element comprises a second initialization method element, a second association element, a second constraint element, a second class element, and a ruleset element, and\nwherein the ruleset element comprises a third initialization method element, a third association element, a third constraint element, a third class element, and the rule element.\n27. The system of claim 19, wherein at least one other of the fields is associated with a boolean representing a value of true or false, a string representing a sequence of characters, or a set representing an unordered collection of unique elements.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US6356885B2",
        "US20020062475A1",
        "US7191163B2",
        "US20100094871A1"
    ],
    "citations_ftf": [
        "US5175696A",
        "US4884217A",
        "US4885705A",
        "US5218669A",
        "US5121496A",
        "US5165011A",
        "JPH07100262B2",
        "US5058043A",
        "US5355444A",
        "US5122976A",
        "US5367619A",
        "US5276775A",
        "US5363473A",
        "FR2720846B1",
        "US5706406A",
        "US6058387A",
        "US5778157A",
        "US5826250A",
        "GB2318479B",
        "US6167520A",
        "US6092033A",
        "US6067637A",
        "US6536935B2",
        "US6092064A",
        "US6606616B1",
        "US6826552B1",
        "US6535864B1",
        "US6829604B1",
        "US20010029499A1",
        "US6519580B1",
        "US20020046047A1",
        "WO2002021254A2",
        "US6965887B2",
        "US20040030710A1",
        "US6910028B2",
        "US20030037063A1",
        "US6868411B2"
    ],
    "citedby_own": [
        "US8423495B1",
        "US8965877B2",
        "US9519631B2"
    ],
    "citedby_ftf": [
        "US20090106353A1",
        "BR0309333A",
        "AU2002952648A0",
        "US7831905B1",
        "US7296263B1",
        "US7409440B1",
        "US7530015B2",
        "US7873668B2",
        "US7827591B2",
        "US7752608B1",
        "US7617531B1",
        "US7720877B1",
        "US7613666B1",
        "US7620935B2",
        "US7802231B2",
        "US7480302B2",
        "WO2005116827A1",
        "US7499850B1",
        "US7613676B2",
        "US8050907B2",
        "US7742406B1",
        "US7926029B1",
        "US7343364B2",
        "US8103640B2",
        "US20060259342A1",
        "EP1964038A4",
        "US7987149B2",
        "US8205189B2",
        "KR100860407B1",
        "US9088554B1",
        "US9330127B2",
        "US7584294B2",
        "US8504775B2",
        "US8103783B2",
        "US8037126B2",
        "US8701010B2",
        "US7783757B2",
        "US7720936B2",
        "US8069129B2",
        "DE102007033019B4",
        "JP5023865B2",
        "US8121117B1",
        "US8078556B2",
        "US8165984B2",
        "US20090326924A1",
        "US20090326925A1",
        "JP5331203B2",
        "US8332870B2",
        "US9111030B1",
        "US20120102421A1",
        "US9558164B1",
        "US20100217737A1",
        "CN101938368A",
        "US8352402B2",
        "US10721269B1",
        "US8806056B1",
        "US11140178B1",
        "US8850071B2",
        "US9503375B1",
        "US9420049B1",
        "US8347100B1",
        "US10296653B2",
        "US8281236B2",
        "US8538903B2",
        "US8494999B2",
        "US8600914B2",
        "KR101296279B1",
        "US9262719B2",
        "WO2012158854A1",
        "US8396836B1",
        "US8935136B2",
        "US8930285B2",
        "US8463850B1",
        "KR101329951B1",
        "US9384711B2",
        "US10230566B1",
        "US9244843B1",
        "US9020912B1",
        "WO2013163648A2",
        "US9235925B2",
        "US9230517B2",
        "US9177533B2",
        "US9286122B2",
        "US9135244B2",
        "US10033837B1",
        "US20140107932A1",
        "US9578090B1",
        "US10375155B1",
        "US9497614B1",
        "US9317805B1",
        "KR101458693B1",
        "US9305111B1",
        "US9307007B2",
        "US9946711B2",
        "PL405176A1",
        "US9396181B1",
        "KR102349573B1",
        "US10187317B1",
        "EP3092579A4",
        "EP3026601A1",
        "US10182013B1",
        "US20170024653A1",
        "US10834065B1",
        "US10505818B1",
        "US11350254B1",
        "US10476992B1",
        "US11757946B1",
        "US10404698B1",
        "US10797888B1",
        "US11178150B1",
        "US10185720B2",
        "US10412198B1",
        "US10467347B1",
        "US11063758B1",
        "US10505792B1",
        "FR3061337A1",
        "US10812266B1",
        "US11122042B1",
        "US11343237B1",
        "CN108304164B",
        "US11223689B1",
        "US10929778B1",
        "US10929760B1",
        "US10929779B1",
        "US11657124B2",
        "CN109919315B",
        "US20200387835A1",
        "KR102185379B1",
        "CN111898761B",
        "US11461300B2",
        "CN112907234B"
    ]
}