{
    "patent_id": "US-10958748-B2",
    "title": "Resource push method and apparatus ",
    "assignee": "Tencent Technology (Shenzhen) Company Limited",
    "publication_date": "2021-03-23",
    "patent_link": "https://patents.google.com/patent/US10958748B2/en",
    "inventors": [
        "Wenyao GAO",
        "Lingling Yi",
        "Peng He",
        "Liwei Qiu"
    ],
    "classifications": [
        "G06N20/10",
        "H04L67/26",
        "G06F16/9535",
        "G06F18/22",
        "G06F18/2411",
        "G06K9/6201",
        "G06K9/6269",
        "G06N20/20",
        "G06Q30/0271",
        "G06Q50/01",
        "H04L67/306",
        "H04L67/55",
        "H04W4/21"
    ],
    "abstract": "A resource-push method is disclosed. The method includes obtaining, by a resource-push server, a target relationship chain of a benchmark user; determining at least one relational user of the benchmark user according to the benchmark user and the target relationship chain; and obtaining parameter characteristics of the at least one relational user from a preset database. The method also includes determining a similarity value between each of the at least one relational user and the benchmark user according to the parameter characteristics, or a probability value of each of the at least one relational user according to the parameter characteristics; and determining at least one push user from the at least one relational user according to the similarity value or the probability value, so as to push a target resource to the at least one push user.",
    "claims": "\n1. A resource-push method, comprising:\nobtaining, by a resource-push server, a target relationship chain of a benchmark user;\ndetermining at least one relational user of the benchmark user according to the benchmark user and the target relationship chain;\nobtaining parameter characteristics of the at least one relational user from a preset database, the parameter characteristics comprising a user portrait feature and an embedding vector mapped by a network node in a homogeneous network in which the benchmark user or the at least one relational user is located;\ndetermining a similarity value between each of the at least one relational user and the benchmark user according to the parameter characteristics, or a probability value of each of the at least one relational user according to the parameter characteristics; and\ndetermining at least one push user from the at least one relational user according to the similarity value or the probability value, so as to push a target resource to the at least one push user,\nwherein determining the similarity value between each of the at least one relational user and the benchmark user according to the parameter characteristics comprises:\ncombining the parameter characteristics of each of the at least one relational user to obtain a first preset-dimension target vector of each of the at least one relational user, and combining the parameter characteristics of the benchmark user to obtain a second preset-dimension target vector of the benchmark user, and\ncalculating similarity between the second preset-dimension target vector of the benchmark user and the first preset-dimension target vector of each of the at least one relational user according to a preset function, to obtain the similarity value between each of the at least one relational user and the benchmark user.\n2. The method according to claim 1, wherein, after determining at least one push user in the at least one relational user according to the similarity value or the probability value, the method further comprises:\nselecting, from the at least one push user, a benchmark user who is used to push the target resource for next time.\n3. The method according to claim 2, wherein the selecting, from the at least one push user, a benchmark user who is to push the target resource for next time comprises:\nsetting a positive feedback user from the at least one push user as the benchmark user who is used to push the target resource for the next time.\n4. The method according to claim 1, wherein the determining a probability value of each of the at least one relational user according to the parameter characteristics comprises:\ninputting the parameter characteristics to a logistic regression (LR)/support vector machine (SVM) model, and\npredicting the probability value of each of the at least one relational user using the LR/SVM model,\nwherein the LR/SVM model is trained according to a gradient boosting decision tree (GBDT) leaf node sequence and the embedding vector, and the GBDT leaf node sequence is obtained by inputting a preset sample training set to the GBDT model for conversion.\n5. The method according to claim 1, wherein the preset function comprises any one of a Pearson correlation coefficient, cosine similarity, Jaccard similarity, and a Euclidean distance.\n6. The method according to claim 1, wherein the parameter characteristics further comprise an interest tag used for reflecting a favored resource type of a benchmark user or a relational user.\n7. The method according to claim 1, wherein, before the determining a similarity value between each of the at least one relational user and the benchmark user according to the parameter characteristics, or a probability value of each of the at least one relational user according to the parameter characteristics, the method further comprises:\nfiltering the parameter characteristics according to a similarity calculation condition, to obtain filtered parameter characteristics; and\ndetermining the similarity value between each relational user and the corresponding benchmark user according to the filtered parameter characteristics, or the probability value of each of the at least one relational user according to the filtered parameter characteristics.\n8. A resource-push apparatus, comprising:\na memory storing computer program instructions; and\na processor coupled to the memory and, when executing the computer program instructions, configured to perform:\nobtaining a target relationship chain of a benchmark user;\ndetermining at least one relational user of the benchmark user according to the benchmark user and the target relationship chain;\nobtaining parameter characteristics of the at least one relational user from a preset database, the parameter characteristics comprising a user portrait feature and an embedding vector mapped by a network node in a homogeneous network in which the benchmark user or the at least one relational user is located;\ndetermining a similarity value between each of the at least one relational user and the benchmark user according to the parameter characteristics, or a probability value of each of the at least one relational user according to the parameter characteristics; and\ndetermining at least one push user from the at least one relational user according to the similarity value or the probability value, so as to push a target resource to the at least one push user,\nwherein determining the similarity value between each of the at least one relational user and the benchmark user according to the parameter characteristics comprises:\ncombining the parameter characteristics of each of the at least one relational user to obtain a first preset-dimension target vector of each of the at least one relational user, and combining the parameter characteristics of the benchmark user to obtain a second preset-dimension target vector of the benchmark user, and\ncalculating similarity between the second preset-dimension target vector of the benchmark user and the first preset-dimension target vector of each of the at least one relational user according to a preset function, to obtain the similarity value between each of the at least one relational user and the benchmark user.\n9. The apparatus according to claim 8, wherein, after determining at least one push user in the at least one relational user according to the similarity value or the probability value, the processor is further configured to perform:\nselecting, from the at least one push user, a benchmark user who is used to push the target resource for next time.\n10. The apparatus according to claim 9, wherein the selecting, from the at least one push user, a benchmark user who is to push the target resource for next time comprises:\nsetting a positive feedback user from the at least one push user as the benchmark user who is used to push the target resource for the next time.\n11. The apparatus according to claim 8, wherein the determining a probability value of each of the at least one relational user according to the parameter characteristics comprises:\ninputting the parameter characteristics to a logistic regression (LR)/support vector machine (SVM) model, and\npredicting the probability value of each of the at least one relational user using the LR/SVM model,\nwherein the LR/SVM model is trained according to a gradient boosting decision tree (GBDT) leaf node sequence and the embedding vector, and the GBDT leaf node sequence is obtained by inputting a preset sample training set to the GBDT model for conversion.\n12. A non-transitory computer-readable storage medium storing computer program instructions executable by at least one processor to perform:\nobtaining a target relationship chain of a benchmark user;\ndetermining at least one relational user of the benchmark user according to the benchmark user and the target relationship chain;\nobtaining parameter characteristics of the at least one relational user from a preset database, the parameter characteristics comprising a user portrait feature and an embedding vector mapped by a network node in a homogeneous network in which the benchmark user or the at least one relational user is located;\ndetermining a similarity value between each of the at least one relational user and the benchmark user according to the parameter characteristics, or a probability value of each of the at least one relational user according to the parameter characteristics; and\ndetermining at least one push user from the at least one relational user according to the similarity value or the probability value, so as to push a target resource to the at least one push user,\nwherein determining the similarity value between each of the at least one relational user and the benchmark user according to the parameter characteristics comprises:\ncombining the parameter characteristics of each of the at least one relational user to obtain a first preset-dimension target vector of each of the at least one relational user, and combining the parameter characteristics of the benchmark user to obtain a second preset-dimension target vector of the benchmark user; and\ncalculating similarity between the second preset-dimension target vector of the benchmark user and the first preset-dimension target vector of each of the at least one relational user according to a preset function, to obtain the similarity value between each of the at least one relational user and the benchmark user.\n13. The non-transitory computer-readable storage medium according to claim 12, wherein, after determining at least one push user in the at least one relational user according to the similarity value or the probability value, the computer program instructions are executable by at least one processor to further perform:\nselecting, from the at least one push user, a benchmark user who is used to push the target resource for next time.\n14. The non-transitory computer-readable storage medium according to claim 13, wherein the selecting, from the at least one push user, a benchmark user who is to push the target resource for next time comprises:\nsetting a positive feedback user from the at least one push user as the benchmark user who is used to push the target resource for the next time.\n15. The apparatus according to claim 8, wherein the preset function comprises any one of a Pearson correlation coefficient, cosine similarity, Jaccard similarity, and a Euclidean distance.\n16. The apparatus according to claim 8, wherein the parameter characteristics further comprise an interest tag used for reflecting a favored resource type of a benchmark user or a relational user.\n17. The apparatus according to claim 8, wherein, before the determining a similarity value between each of the at least one relational user and the benchmark user according to the parameter characteristics, or a probability value of each of the at least one relational user according to the parameter characteristics, the method further comprises:\nfiltering the parameter characteristics according to a similarity calculation condition, to obtain filtered parameter characteristics; and\ndetermining the similarity value between each relational user and the corresponding benchmark user according to the filtered parameter characteristics, or the probability value of each of the at least one relational user according to the filtered parameter characteristics.\n18. The non-transitory computer-readable storage medium according to claim 12, wherein the determining a probability value of each of the at least one relational user according to the parameter characteristics comprises:\ninputting the parameter characteristics to a logistic regression (LR)/support vector machine (SVM) model, and\npredicting the probability value of each of the at least one relational user using the LR/SVM model,\nwherein the LR/SVM model is trained according to a gradient boosting decision tree (GBDT) leaf node sequence and the embedding vector, and the GBDT leaf node sequence is obtained by inputting a preset sample training set to the GBDT model for conversion.\n19. The non-transitory computer-readable storage medium according to claim 12, wherein the preset function comprises any one of a Pearson correlation coefficient, cosine similarity, Jaccard similarity, and a Euclidean distance.\n20. The non-transitory computer-readable storage medium according to claim 12, wherein the parameter characteristics further comprise an interest tag used for reflecting a favored resource type of a benchmark user or a relational user.",
    "status": "Active",
    "citations_own": [
        "US6020883A",
        "CN104038517A",
        "CN104199836A",
        "CN104199838A",
        "CN104951465A",
        "US20150326679A1",
        "CN106326228A",
        "CN106446100A",
        "CN106503022A",
        "US20170118298A1",
        "CN107103057A"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "CN107103057B",
        "CN109446171B",
        "CN109428928B",
        "CN108305181B",
        "CN107741986B",
        "CN108304480B",
        "CN108596774B",
        "CN108877946A",
        "CN110210884B",
        "CN108932658B",
        "CN110163644A",
        "KR20210028269A",
        "CN109242537A",
        "CN109190807B",
        "CN110147882B",
        "CN110033156B",
        "CN110399550B",
        "CN109992606A",
        "CN110288366B",
        "WO2020252742A1",
        "CN110324418B",
        "CN110765358B",
        "CN111178944B",
        "CN111400600A",
        "CN111478963B",
        "CN111973996A",
        "CN112069414A",
        "CN112148937B",
        "CN112256973B",
        "CN112270492A",
        "CN112990270B",
        "CN112685377B",
        "CN113761386A",
        "CN113420096A",
        "CN113221016A",
        "CN113824974B"
    ]
}