{
    "patent_link": "https://patents.google.com/patent/US5617509A/en",
    "patent_id": "US5617509A",
    "title": "Method, apparatus, and radio optimizing Hidden Markov Model speech recognition",
    "abstract": "In a statistical based speech recognition system, one of the key issues is the selection of the Hidden Markov Model that best matches a given sequence of feature observations. The problem is usually addressed by the calculation of the maximum likelihood, ML, state sequence by means of a Viterbi or other decoder. Noise or inadequate training can produce a ML sequence associated with a Hidden Markov Model other than the correct model. The method of the present invention provides improved robustness by combining the standard ML state sequence score (416) with an additional path score (418) derived from the dynamics of the ML score as a function of time. These two scores, when combined, form a hybrid metric (420) that, when used with the decoder, optimizes selection of the correct Hidden Markov Model (422).",
    "inventors": [
        "William M. Kushner",
        "Edward Srenger",
        "Matthew A. Hartman"
    ],
    "assignee": "Motorola Solutions Inc",
    "classifications": [],
    "claims": "\n1. A method for optimizing Hidden Markov Model recognition of an input speech signal corresponding to a plurality of frame feature vectors, the method comprising:\n1A) storing, in a memory unit, a plurality of predetermined Hidden Markov Models;\n1B) determining, in a decoder for a frame feature vector, a plurality of current maximum likelihood scores each corresponding to a distinct Hidden Markov Model in the plurality of predetermined Hidden Markov Models;\n1C) computing, in a decoder for the frame feature vector, a plurality of current path scores each corresponding to the distinct Hidden Markov Model in the plurality of predetermined Hidden Markov Models, wherein each path score quantifies a variation in the maximum likelihood score as a function of time, and for the distinct Hidden Markov Model:\n1C1) computing a difference between the current maximum likelihood score and an immediately previous maximum likelihood score;\n1C2) adding a square of the difference to a previous path score to provide the current path score; and\n1C3) repeating steps 1C1 and 1C2 for each Hidden Markov Model to provide the plurality of current path scores;\n1D) computing, in a decoder for the frame feature vector, a plurality of current hybrid scores each corresponding to the distinct Hidden Markov Model in the plurality of predetermined Hidden Markov Models, wherein each hybrid score is a combination of the maximum likelihood score and the path score;\n1E) repeating steps 1B through 1D until all frame feature vectors have been processed; and\n1F) selecting the Hidden Markov Model with a lowest current hybrid score.\n1A) storing, in a memory unit, a plurality of predetermined Hidden Markov Models;\n1B) determining, in a decoder for a frame feature vector, a plurality of current maximum likelihood scores each corresponding to a distinct Hidden Markov Model in the plurality of predetermined Hidden Markov Models;\n1C) computing, in a decoder for the frame feature vector, a plurality of current path scores each corresponding to the distinct Hidden Markov Model in the plurality of predetermined Hidden Markov Models, wherein each path score quantifies a variation in the maximum likelihood score as a function of time, and for the distinct Hidden Markov Model:\n1C1) computing a difference between the current maximum likelihood score and an immediately previous maximum likelihood score;\n1C2) adding a square of the difference to a previous path score to provide the current path score; and\n1C3) repeating steps 1C1 and 1C2 for each Hidden Markov Model to provide the plurality of current path scores;\n1C1) computing a difference between the current maximum likelihood score and an immediately previous maximum likelihood score;\n1C2) adding a square of the difference to a previous path score to provide the current path score; and\n1C3) repeating steps 1C1 and 1C2 for each Hidden Markov Model to provide the plurality of current path scores;\n1D) computing, in a decoder for the frame feature vector, a plurality of current hybrid scores each corresponding to the distinct Hidden Markov Model in the plurality of predetermined Hidden Markov Models, wherein each hybrid score is a combination of the maximum likelihood score and the path score;\n1E) repeating steps 1B through 1D until all frame feature vectors have been processed; and\n1F) selecting the Hidden Markov Model with a lowest current hybrid score.\n2. The method of claim 1, wherein the plurality of current maximum likelihood scores are determined by a Viterbi decoder.\n3. The method of claim 1, wherein the method further comprises:\n4A) selecting a minimum path score from the plurality of current path scores; and\n4B) normalizing the plurality of current path scores by subtracting the minimum path score from each current path score.\n4A) selecting a minimum path score from the plurality of current path scores; and\n4B) normalizing the plurality of current path scores by subtracting the minimum path score from each current path score.\n4. The method of claim 1, wherein step 1D further comprises:\nfor the Hidden Markov Model:\n5A) multiplying each current path score by the current maximum likelihood score to provide a product;\n5B) adding a square of the product to a previous hybrid score to provide the current hybrid score; and\n5C) repeating steps 5A and 5B for each Hidden Markov Model to provide a plurality of current hybrid scores.\n5A) multiplying each current path score by the current maximum likelihood score to provide a product;\n5B) adding a square of the product to a previous hybrid score to provide the current hybrid score; and\n5C) repeating steps 5A and 5B for each Hidden Markov Model to provide a plurality of current hybrid scores.\n5. An apparatus for optimizing Hidden Markov Model recognition of an input speech signal corresponding to a plurality of frame feature vectors, the apparatus comprising:\nA) a memory unit, operably coupled to receive a plurality of predetermined Hidden Markov Models;\nB) a decoder, operably coupled to receive the plurality of frame feature vectors and operably coupled to the memory unit, for determining, for each frame feature vector, a plurality of current maximum likelihood scores each corresponding to a distinct Hidden Markov Model in the plurality of predetermined Hidden Markov Models;\nC) a path score determiner, operably coupled to the decoder, for computing, for each frame feature vector, a plurality of current path scores each corresponding to the distinct Hidden Markov Model in the plurality of predetermined Hidden Markov Models, wherein each path score quantifies a variation in the maximum likelihood score as a function of time, and\nwherein the path score determiner comprises a plurality of path subcircuits one for each Hidden Markov Model, wherein each path subcircuit comprises:\nC1) a subtracting circuit, operably coupled to the decoder, for computing a difference between the current maximum likelihood score and an immediately, previous maximum likelihood score;\nC2) a squaring circuit, operably coupled to the subtracting circuit, for providing a squared difference; and\nC3) a summing circuit, operably coupled to the squaring circuit, for adding the squared difference to a previous path score to provide the current path score;\nD) a hybrid score determiner, operably coupled to the path score determiner and the decoder, for computing, for each frame feature vector, a plurality of current hybrid scores each corresponding to the distinct Hidden Markov Model in the plurality of predetermined Hidden Markov Models, wherein each hybrid score is a combination of the maximum likelihood score and the path score for the Hidden Markov Model;\nE) a model selector, operably coupled to the hybrid score determiner, for selecting the Hidden Markov Model for the plurality of frame feature vectors with a lowest current hybrid score.\n6. The apparatus of claim 5, wherein the decoder is a Viterbi decoder.\n7. The apparatus of claim 5, wherein the apparatus further comprises a normalizing circuit, operably coupled to the plurality of path subcircuits, for normalizing the plurality of current path scores by subtracting a minimum path score from each current path score.\n8. The apparatus of claim 5, wherein the hybrid score determiner comprises a plurality of hybrid subcircuits one for each Hidden Markov Model, wherein a hybrid subcircuit comprises:\nA) a multiplier, operably coupled to the decoder and path score determiner, for multiplying the current path score by the current maximum likelihood score to provide a product; and\nB) a squaring circuit, operably coupled to the multiplier, for providing a squared product; and\nC) a summing circuit, operably coupled to the squaring circuit, for adding the squared product to a previous hybrid score to provide the current hybrid score.\n9. A radio comprising an apparatus for optimizing Hidden Markov Model recognition of an input speech signal corresponding to a plurality of frame feature vectors, the apparatus comprising:\nA) a memory unit, operably coupled to receive a plurality of predetermined Hidden Markov Models;\nB) a decoder, operably coupled to receive the plurality of frame feature vectors and operably coupled to the memory unit, for determining, for each frame feature vector, a plurality of current maximum likelihood scores each corresponding to a distinct Hidden Markov Model in the plurality of predetermined Hidden Markov Models;\nC) a path score determiner, operably coupled to the decoder, for computing, for each frame feature vector, a plurality of current path scores each corresponding to the distinct Hidden Markov Model in the plurality of predetermined Hidden Markov Models, wherein each path score quantifies a variation in the maximum likelihood score as a function of time, and\nwherein the path score determiner comprises a plurality of path subcircuits one for each Hidden Markov Model, wherein each path subcircuit comprises:\nC1) a subtracting circuit, operably coupled to the decoder, for computing a difference between the current maximum likelihood score and an immediately previous maximum likelihood score;\nC2) a squaring circuit, operably coupled to the subtracting circuit, for providing a squared difference; and\nC3) a summing circuit, operably coupled to the squaring circuit, for adding the squared difference to a previous path score to provide the current path score;\nD) a hybrid score determiner, operably coupled to the path score determiner, for computing, for each frame feature vector, a plurality of current hybrid scores each corresponding to the distinct Hidden Markov Model in the plurality of predetermined Hidden Markov Models, wherein each hybrid score is a combination of the maximum likelihood score and the path score for the Hidden Markov Model;\nE) a model selector, operably coupled to the hybrid score determiner, for selecting the Hidden Markov Model for the plurality of frame feature vectors with a lowest current hybrid score.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4348553A",
        "US5440662A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5778341A",
        "US5970446A",
        "US20020046021A1",
        "US20020165715A1",
        "US6542866B1",
        "US6629073B1",
        "US20030187813A1",
        "US6662158B1",
        "US20070198263A1",
        "US20070198261A1",
        "US20100010805A1",
        "US20100211391A1",
        "US20100211376A1",
        "US20100211387A1",
        "US7970613B2",
        "US8560469B2",
        "US20150127350A1",
        "US20150127349A1",
        "US9153235B2",
        "US10320523B2"
    ],
    "citedby_ftf": [
        "SE9903553D0",
        "AU2000276394A1",
        "US9311430B2"
    ]
}