{
    "patent_link": "https://patents.google.com/patent/US4752906A/en",
    "patent_id": "US4752906A",
    "title": "Temporal sequences with neural networks",
    "abstract": "A sequence generator employing a neural network having its output coupled to at least one plurality of delay elements. The delayed outputs are fed back to an input interconnection network, wherein they contribute to the next state transition through an appropriate combination of interconnections.",
    "inventors": [
        "David Kleinfeld"
    ],
    "assignee": "AT&T Corp",
    "classifications": [],
    "claims": "\n1. A sequence generator comprising:\na neural network responsive to input signals applied to a plurality of inputs that are internally connected to a cross-connect network, where said neural network develops a plurality of output signals responsive to said input signals and to interconnection values within said cross-connect network;\na delay/averaging network responsive to said plurality of output signals of said neural network, for developing a delayed plurality of output signals that are related to said plurality of output signals of said neural network; and\nan input interconnection network responsive to said plurality of delayed output signals of said delay network for developing said plurality of input signals of said neural network; WHERE\nthe interconnections within said cross-connect network develop specified local minima in the energy function describing the response of said neural network to said input signals, and said input interconnection network determines the sequence of neural network output signals developed by the sequence generator.\n2. The generator of claim 1, wherein each input signal in said plurality of input signals is related to said delayed output signals through a summing interconnection of preselected summing strengths.\n3. The arrangement of claim 1 wherein each ith input signal of said plurality of input signals, where i is a number, is related to ##EQU7## where ##EQU8## is the jth delayed output signal of said plurality of delayed output signals and j is a number, D(x) is a preselected delay function characterizing said delay/averaging network as a function of the integration variable x, Vj (t-x) is the jth output voltage at time (t-x), each Qij is a preselected constant, and the summation is over all values of j from 1 to N where N is the number of delayed output signals in said plurality output signals.\n4. The arrangement of claim 3 for developing a sequence M1, M2, . . . M.sup.μ, M.sup.μ+1, . . . Mm, of said plurality of output signals, with each M.sup.μ representing said plurality of output signals at a point in time, wherein ##EQU9## for i≠j and 0 otherwise.\n5. The arrangement of claim 3 for developing a cyclic sequence M1, M2, . . . M.sup.μ, M.sup.μ+1, . . . Mm, M1, . . . , of said plurality of output signals, with each M.sup.μ representing said plurality of output signals at a point in time, wherein ##EQU10## for i≠j and 0 otherwise, and Mm+1 =M1.\n6. The arrangement of claim 1 further comprising a gating network interposed in the signal loop created by said neural network, said delay network and said input interconnection network.\n7. The arrangement of claim 6 wherein said gating means, under influence of an applied control signal, either transmits its input signal to its output or inhibits said transmitting.\n8. The arrangement of claim 6 wherein said gating means, under influence of an applied control signal, transmits to its output either its input signal or a preselected different signal.\n9. The arrangement of claim 1 further comprising a gating network interposed between said delay network and said input interconnection network.\n10. A sequence generator comprising:\na neural network, developing a plurality of output signals in response to a plurality of input signals and characterized by an internal cross-connect network with interconnections that develop specified local minima in the energy function describing the response of said neural network to said input signals;\na delay network responsive to said plurality of output signals of said neural network, developing K delayed pluralities of output signals with each delayed plurality of said K delayed pluralities having a different delay from said plurality of output signals of said neural network; and\nan input interconnection network responsive to said K pluralities of delayed output signals of said delay network for supplying a plurality of input signals to said neural network and for providing the connectivity that defines the sequence of signals generated by the sequence generator.\n11. The arrangement of claim 10 further comprising a gating network interposed in the signal loop created by said neural network, said delay network and said input interconnection network.\n12. A sequence generator comprising:\na neural network, developing a plurality of output signals in response to a plurality of input signals and characterized by an internal cross-connect network with interconnections that develop specified local minima in the energy function describing the response of said neural network to said input signals;\nat least one delay/averaging network responsive to said plurality of output signals of said neural network, each developing a set of delayed plurality of output signals; and\nat least one input interconnection network each responsive to a set of said plurality of delayed output signals for supplying a plurality of input signals to said neural network and for providing the connectivity that defines the sequence of signals generated by the sequence generator.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3774019A",
        "US4034156A",
        "US4344150A",
        "US4393272A",
        "US4438504A",
        "US4536844A",
        "US4558454A",
        "US4563681A",
        "US4569030A",
        "US4630299A",
        "US4719591A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4849925A",
        "US4866645A",
        "WO1989009449A1",
        "US4897811A",
        "US4903226A",
        "US4918618A",
        "US4937872A",
        "US4975961A",
        "WO1990015390A1",
        "US4979124A",
        "US4983962A",
        "US5004309A",
        "US5083285A",
        "US5119468A",
        "US5132813A",
        "WO1992015072A1",
        "US5253329A",
        "US5263122A",
        "US5276771A",
        "US5355438A",
        "US5361328A",
        "US5371835A",
        "US5412754A",
        "US5479571A",
        "US5504841A",
        "US5538915A",
        "US5615305A",
        "US20090132452A1",
        "US10514799B2"
    ],
    "citedby_ftf": []
}