{
    "patent_link": "https://patents.google.com/patent/US20030177054A1/en",
    "patent_id": "US20030177054A1",
    "title": "Generating marketing information for non-purchased items of a gift registry",
    "abstract": "The invention is directed to techniques for generating marketing information based on non-purchased items of a gift registry. A system is described that includes a database to store data identifying items registered by a customer in a gift registry. The data identifies whether the items of the registry have been purchased. A generation module generates marketing information for a customer based on the data. A data-mining module selectively retrieves the data from the database, and communicates the data to the generation module. The data-mining module selects items from the registry, and possibly non-registry items, based on a variety of factors, such as retail cost of the items, profit margin of the items, a manufacturer of the items, customer loyalty data, and a profile of the customer that may include demographic information as well as spending pattern data for the customer.",
    "inventors": [
        "Russell J. Reinbold",
        "Scott T. Lidberg"
    ],
    "assignee": "Clarendon Photonics",
    "classifications": [
        "G06Q30/02",
        "G06Q10/06375",
        "G06Q30/0201",
        "G06Q30/0204"
    ],
    "claims": "\n1. A method comprising:\nreceiving data identifying items registered by a customer in a gift registry, wherein the data identifies whether the items of the registry have been purchased; and\ngenerating marketing information based on the data.\n2. The method of claim 1, further comprising communicating the marketing information to the customer.\n3. The method of claim 1, wherein receiving data comprises receiving the data from one or more retailers.\n4. The method of claim 1, further comprising:\nreceiving purchase requests for the items;\nupdating the data based on the purchase; and\ngenerating new marketing information based the updated data.\n5. The method of claim 1, further comprising:\nreceiving gift selection input from the customer; and\ngenerating the data based on the gift selection input.\n6. The method of claim 5, further comprising:\nreceiving demographic input from the customer; and\ngenerating the marketing information based on the demographic information.\n7. The method of claim 6, further comprising:\nreceiving data for non-registry items; and\ngenerating the marketing information for a subset of the non-registry items and a subset of the non-purchased items of the registry.\n8. The method of claim 7, further comprising selecting the subset of the non-registry items and the subset of the non-purchased items of the registry in accordance with at least one of a retail cost of the items, a profit margin of the items, a customer profile including demographic data and purchase pattern data, a manufacturer of the items, and customer loyalty data.\n9. The method of claim 1, wherein generating marketing information comprises generating marketing certificates.\n10. The method of claim 1, further comprising selecting a subset of the items for which to generate marketing information.\n11. The method of claim 10, wherein selecting a subset of the items comprises selecting the subset of the items based on retail cost of the items.\n12. The method of claim 10, wherein selecting a subset of the items comprises selecting the items based on profit margin of the items.\n13. The method of claim 10, wherein selecting a subset of the items comprises selecting the items based on a manufacturer of the items.\n14. The method of claim 10, wherein selecting a subset of the items comprises selecting the items based on a profile of the customer.\n15. The method of claim 10, wherein selecting a subset of the items comprises selecting the items based on a loyalty data for the customer.\n16. The method of claim 10, further comprising:\nselecting a second subset of items from the data; and\ngenerating additional marketing information for the customer based on second subset.\n17. The method of claim 1, wherein the data identifies at least some items of a product set, and further wherein the non-purchased items includes some but not all of the items of the product set, and wherein generating marketing information comprises generating market information for the non-purchased items in the product set.\n18. The method of claim 1, further comprising assigning customer purchase probabilities customer to the items.\n19. The method of claim 18, further comprising generating marketing information for the identified items based on the assigned probabilities.\n20. The method of claim 18, wherein assigning probabilities includes assigning probabilities to the purchased items.\n21. The method of claim 18, wherein assigning probabilities includes assigning probabilities to the non-purchased items.\n22. The method of claim 18, further comprising assigning the probabilities based on a profile of the customer.\n23. The method of claim 1, further comprising generating marketing information for a customer based on spending patterns of the customer.\n24. The method of claim 1, wherein the marketing information includes marketing certificates for products manufactured by a number of different manufacturers.\n25. The method of claim 1, further comprising generating marketing information for a customer based data identifying non-purchased items registered by the customer in gift registries for a plurality of different events.\n26. The method of claim 25, wherein generating the marketing information comprises selecting items based on dates for the different events.\n27. The method of claim 1, wherein the marketing information includes marketing certificates that offer the customer discounts on one or more of the non-purchased items.\n28. The method of claim 27, wherein the marketing certificates include images of the discounted items.\n29. The method of claim 1, wherein the marketing information includes a congratulatory message to the customer.\n30. A method comprising:\nreceiving data identifying non-purchased items of registry programs from one or more retail establishments;\nselecting a subset of the items;\ngenerating marketing information for the customer based on the selected subset of items; and\ncommunicating the marketing information to the customer.\n31. The method of claim 30, wherein selecting a subset of the items comprises selecting the subset of the items based on at least one of a retail cost of each item, a profit margin of each item, a manufacturer of each item, a profile of the customer, and loyalty data for the customer.\n32. The method of claim 30, further comprising sending the marketing information to the customer via e-mail.\n33. The method of claim 30, wherein selecting a subset of the items comprises assigning probabilities of purchase by the customer to the items.\n34. The method of claim 30, further comprising:\nreceiving demographic information about the customer; and\ngenerating the marketing information for the customer based on the demographic information.\n35. A computer-readable medium comprising program code that generates marketing information for a customer based on registry data, wherein the registry data identifies items registered by a customer in a gift registry, and identifies whether the items of the registry have been purchased.\n36. The computer-readable medium of claim 35, further comprising program code to communicate the marketing information to the customer.\n37. The computer-readable medium of claim 35, further comprising program code to receive the registry data from one or more retail establishments.\n38. The computer-readable medium of claim 35, further comprising program code that generates the registry data by tracking purchases of the items and updating the registry data.\n39. The computer-readable medium of claim 35, further comprising program code that receives gift selection input from the customer, and generates the registry data based on the gift selection input.\n40. The computer-readable medium of claim 35, further comprising program code to select a subset of items for which to generate marketing information.\n41. The computer-readable medium of claim 40, further comprising program code to select the subset based at least one of a retail cost of each of the items, a profit margin of each of the items, a manufacturer of each of the items, and a profile of the customer.\n42. The computer-readable medium of claim 35, further comprising program code to receive purchase requests for the items, update the registry data, and generate marketing information for the customer based on the updated registry data.\n43. The computer-readable medium of claim 35, wherein at least some of the non-purchased items belong to a product set, the medium further comprising program code that generates marketing information for the non-purchased items in the product set.\n44. The computer-readable medium of claim 35, further comprising program code that assigns purchase probabilities to the items and generates the marketing information for the customer based on the purchase probabilities.\n45. The computer-readable medium of claim 44, further comprising program code to assign the purchase probabilities based on a profile of the customer.\n46. The computer-readable medium of claim 35, further comprising program code that generates the marketing information to include marketing certificates for the identified items.\n47. The computer-readable medium of claim 35, further comprising program code to generate the marketing information for the customer based on spending patterns of the customer.\n48. A system comprising:\na database that data identifying items registered by a customer in a gift registry, wherein the data identifies whether the items of the registry have been purchased; and\na generation module that generates marketing information for a customer based on the data.\n49. The system of claim 48, further comprising a data-mining module that selectively retrieves the data from the database, and communicates the data to the generation module.\n50. The system of claim 49, wherein the data-mining module selects items based on retail cost of the items.\n51. The system of claim 49, wherein the data-mining module selects items based on profit margin of the items.\n52. The system of claim 49, wherein the data-mining module selects items based on a manufacturer of the items.\n53. The system of claim 49, wherein the data-mining module selects items based on a profile of the customer.\n54. The system of claim 49, wherein the database stores information about the customer, and wherein the data-mining module selects items based on the information.\n55. The system of claim 49, wherein the data-mining module predicts likely to purchase items and selects items based on the likely to purchase items.\n56. The system of claim 49, further comprising a printing device that prints the marketing information as marketing certificates.\n57. A system comprising:\na receiving module that receives data identifying items registered by a customer in a gift registry, wherein the data identifies whether the items of the registry have been purchased;\na database that stores the data;\na data-mining module that selectively retrieves the data from the database;\na generation module that generates marketing information for a customer for the selected items; and\na printing device that prints the marketing information.\n58. The system of claim 57, wherein the data-mining module selects items based on retail cost of the items.\n59. The system of claim 57, wherein the data-mining module selects items based on profit margin of the items.\n60. The system of claim 57, wherein the data-mining module selects items based on a manufacturer of the items.\n61. The system of claim 57, wherein the data-mining module selects items based on a profile of the customer.\n62. The system of claim 57, wherein the database stores information about the customer, and wherein the data-mining module selects items based on the information about the customer.\n63. The system of claim 57, wherein the mining module assigns purchase probabilities to the items and selects the items based on the probabilities.",
    "status": "Abandoned",
    "citations_own": [
        "US5192854A",
        "US5208445A",
        "US5754981A",
        "US5774874A",
        "US5970474A",
        "US6134532A",
        "US6246994B1",
        "US6490602B1",
        "US6611814B1",
        "US6618753B2",
        "US6925444B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20030195889A1",
        "US20040236758A1",
        "US20050203754A1",
        "US20060293967A1",
        "US20070233650A1",
        "US20070239517A1",
        "US20070239535A1",
        "US20070239518A1",
        "US20070260596A1",
        "US20070260624A1",
        "US20080154746A1",
        "US20080243705A1",
        "US20090063295A1",
        "US20090327121A1",
        "US20110125607A1",
        "US20110218848A1",
        "US20130254293A1",
        "US8554592B1",
        "US8606654B2",
        "US8893966B2",
        "US9990641B2",
        "US11501174B2"
    ],
    "citedby_ftf": []
}