{
    "patent_link": "https://patents.google.com/patent/US20030220860A1/en",
    "patent_id": "US20030220860A1",
    "title": "Knowledge discovery through an analytic learning cycle",
    "abstract": "Knowledge discovery through analytic learning cycles is founded on a coherent, real-time view of data from across an enterprise, the data having been captured and aggregated and is available in real-time at a central repository. Knowledge discovery is an iterative process where each cycle of analytic learning employs data mining. Thus, an analytic learning cycle includes defining a problem, exploring the data at the central repository in relation to the problem, preparing a modeling data set from the explored data, building a model from the modeling data set, assessing the model, deploying the model back to the central repository, and applying the model to a set of inputs associated with the problem. Application of the model produces results and, in turn, creates historic data that is saved at the central repository. Subsequent iterations of the analytic learning cycle use the historic data, as well as current data accumulated in the central repository, thereby creating up-to-date knowledge for evaluating and refreshing the model.",
    "inventors": [
        "Michael Heytens",
        "Steven Carr",
        "Gregory Battas",
        "Philip Bosinoff"
    ],
    "assignee": "Hewlett Packard Development Co LP",
    "classifications": [
        "G06Q30/02",
        "G06N5/022",
        "G06Q30/0201",
        "G06Q40/00"
    ],
    "claims": "\n1. A method for knowledge discovery through analytic learning cycles, comprising:\ndefining a problem associated with an enterprise;\nexecuting a cycle of analytic learning which is founded on a view of data from across the enterprise, the data having been captured and aggregated and is available at a central repository, the analytic learning cycle employs data mining including\nexploring the data at the central repository in relation to the problem,\npreparing a modeling data set from the explored data,\nbuilding a model from the modeling data set,\nassessing the model,\ndeploying the model back to the central repository, and\napplying the model to a set of inputs associated with the problem to produce results, thereby creating historic data that is saved at the central repository; and\nrepeating the cycle of analytic learning using the historic as well as current data accumulated in the central repository, thereby creating up-to-date knowledge for evaluating and refreshing the model.\n2. The method of claim 1, wherein the enterprise experiences a plurality of events occurring at a plurality of sites across the enterprise in association with its operations, wherein a plurality of applications are run in conjunction with these operations, wherein the operations, the plurality of events and applications, and the data are integrated so as to achieve the view as a coherent, real-time view of the data from across the enterprise as well as to achieve enterprise-wide coherent and zero latency operations, and wherein the integration is backed by the central repository.\n3. The method of claim 1, wherein the data is explored using enterprise-specific predictors related to the problem such that through the analytic learning cycle the data is analyzed in relation to the problem in order to establish patterns in the data.\n4. The method of claim 1, wherein a plurality of organizations includes a retail organization, a healthcare organization, a research institute, a financial institution, an insurance company, a manufacturing organization, and a government entity, wherein the enterprise is one of the plurality of organizations, and wherein the problem is defined in relation to operations of the enterprise.\n5. The method of claim 1, wherein the problem is defined in the context of asset protection and is formulated for fraud detection.\n6. The method of claim 1, wherein the problem is defined in the context of financial transactions with a bank representative or via an ATM (automatic teller machine), the problem being formulated for presenting customer-specific offers in the course of such transactions.\n7. The method of claim 1, wherein the problem is defined in the context of business transactions conducted at a point of sale, via a call center, or via a web browser, the problem being formulated for presenting customer-specific offers in the course of such transactions.\n8. The method of claim 1, wherein the problem definition creates a statement of the problem and a way of assessing and later evaluating the model, and wherein, based on model assessment and evaluation results, the problem is redefined before the analytic learning cycle is repeated.\n9. The method of claim 1, wherein the results are patterns established through the application of the model, wherein the results are logged in the central repository and used for formalizing responses to events, the responses becoming part of the historic data and along with the responses are used in preparing modeling data sets for subsequent analytic earning cycles.\n10. The method of claim 1, wherein the data is held at the central repository in the form of tables in relational databases and is explored using database queries.\n11. The method of claim 1, wherein the preparation of modeling data set includes transforming explored data to suit the problem and the model.\n12. The method of claim 11, wherein the transformation includes reformatting the data to suit the set of inputs.\n13. The method of claim 1, wherein the modeling data set holds data in denormalized form.\n14. The method of claim 13, wherein the denormalized form is fashioned by taking data in normalized form and lining it up flatly and serially end-to-end in a logically contiguous record so that it is becomes retrievable more quickly relative to normalized data.\n15. The method of claim 1, wherein the modeling data set is held at the central repository in a table containing one record per entity.\n16. The method of claim 15, wherein the modeling data set is provided to a target file, and wherein the table holding the modeling data set is identified along with the target file and a transfer option.\n17. The method of claim 16, wherein the modeling data set is provided to the target file in bulk via multiple concurrent streams, and wherein the transfer option determines the number of concurrent streams.\n18. The method of claim 1, wherein the modeling data set is provided from the central repository to a mining server in bulk via multiple concurrent streams.\n19. The method of claim 1, wherein based on the assessment of the model one or more of the defining, exploring, preparing, building, and assessing steps are reiterated in order to create another version of the model that more closely represents the problem and provide predictions with better accuracy.\n20. The method of claim 1, wherein the data set is prepared using part of the explored data and wherein the model is assessed using a remaining part of the explored data in order to determine whether the model provides predictions with expected accuracy in view of the problem.\n21. The method of claim 1, wherein the model is formed with a structure, including one of a decision tree model, a logistic regression model, a neural network model, a nearest neighbor model, a Naïve Bayes model, or a hybrid model.\n22. The method of claim 21, wherein the decision tree contains a plurality of nodes in each of which there being a test corresponding to a rule that leads to decision values corresponding to the results of the test.\n23. The method as in claim 21, wherein the neural network includes input and output layers and any number of hidden layers.\n24. The method as in claim 1, wherein the defining, exploring, preparing, building, and assessing steps are used to build a plurality of models that upon being deployed are placed in a table at the central repository and are differentiated from one another by their respective identification information.\n25. The method as in claim 1, wherein the model is applied to the set of inputs in response to a prompt from an application to which the results or information associated with the results are returned.\n26. A system for knowledge discovery through analytic learning cycles, comprising:\na central repository;\nmeans for providing a definition of a problem associated with an enterprise;\nmeans for executing a cycle of analytic learning which is founded on a view of data from across the enterprise, the data having been captured and aggregated and is available at the central repository, the analytic learning cycle execution means employs data mining means including\nmeans for exploring the data at the central repository in relation to the problem,\nmeans for preparing a modeling data set from the explored data,\nmeans for building a model from the modeling data set,\nmeans for assessing the model,\nmeans for deploying the model back to the central repository, and\nmeans for applying the model to a set of inputs associated with the problem to produce results, thereby creating historic data that is saved at the central repository; and\nmeans for repeating the cycle of analytic learning using the historic as well as current data accumulated in the central repository, thereby creating up-to-date knowledge for evaluating and refreshing the model.\n27. The system of claim 26, further comprising:\na plurality of applications, wherein the enterprise experiences a plurality of events occurring at a plurality of sites across the enterprise in association with its operations, wherein the plurality of applications are run in conjunction with these operations; and\nmeans for integrating the operations, the plurality of events and applications, and the data so as to achieve the view as a coherent, real-time view of the data from across the enterprise as well as to achieve enterprise-wide coherent and zero latency operations, and wherein the integration means is backed by the central repository.\n28. The system of claim 26, wherein the data is explored using enterprise-specific predictors related to the problem such that through the analytic learning cycle the data is analyzed in relation to the problem in order to establish patterns in the data.\n29. The system of claim 26, wherein a plurality of organizations includes a retail organization, a healthcare organization, a research institute, a financial institution, an insurance company, a manufacturing organization, and a government entity, wherein the enterprise is one of the plurality of organizations, and wherein the problem is defined in relation to operations of the enterprise.\n30. The system of claim 26, wherein the problem is defined in the context of asset protection and is formulated for fraud detection.\n31. The method of claim 26, wherein the problem is defined in the context of financial transactions with a bank representative or via an ATM (automatic teller machine), the problem being formulated for presenting customer-specific offers in the course of such transactions.\n32. The method of claim 26, wherein the problem is defined in the context of business transactions conducted at a point of sale, via a call center, or via a web browser, the problem being formulated for presenting customer-specific offers in the course of such transactions.\n33. The system of claim 26, wherein the means for providing the problem definition is configured for\ncreating a statement of the problem as defined for the enterprise and a way of assessing and later evaluating the model, and\nproviding a modified definition of the problem, if necessary based on model assessment and evaluation results, before the analytic learning cycle is repeated.\n34. The system of claim 26, wherein the results are patterns established through the means for applying the model, wherein the results are logged in the central repository and used for formalizing responses to events, the responses becoming part of the historic data and along with the responses are used in preparing modeling data sets for subsequent analytic earning cycles.\n35. The system of-claim 26, wherein the central repository is configured to hold the data in the form of tables in relational databases, and wherein the data exploring means is configured to explore the data at the central repository using database queries.\n36. The system of claim 26, wherein the modeling data set preparation means includes means for transforming explored data to suit the problem and the model.\n37. The system of claim 36, wherein the transforming means is configured for reformatting the data to suit the set of inputs.\n38. The system of claim 26, wherein the modeling data set holds data in denormalized form.\n39. The system of claim 38, wherein the preparing means is configured for fashioning the denormalized form by taking data in normalized form and lining it up flatly and serially end-to-end in a logically contiguous record so that it is becomes retrievable more quickly relative to normalized data.\n40. The system of claim 26, wherein the modeling data set is held at the central repository in a table containing one record per entity.\n41. The system of claim 40, further comprising:\nmeans for providing the modeling data set to a target file, the providing means being configured for identifying the table holding the modeling data along with the target file and a transfer option.\n42. The system of claim 41, the modeling data set is provided to the target file in bulk via multiple concurrent streams, and wherein the transfer option determines the number of concurrent streams.\n43. The system of claim 26, further comprising:\na mining server, wherein the modeling data set is provided from the central repository to the mining server in bulk via multiple concurrent streams.\n44. The system of claim 26, wherein, based on an assessment of the model, the system is further configured to prompt one or more of the defining means, exploring means, preparing means, building means, and assessing means to reiterated their operation in order to create another version of the model that more closely represents the problem and provide predictions with better accuracy.\n45. The system of claim 26, wherein the data set is prepared using part of the explored data and wherein the model is assessed using a remaining part of the explored data in order to determine whether the model provides predictions with expected accuracy in view of the problem.\n46. The system of claim 26, wherein the model is formed with a structure, including one of a decision tree model, a logistic regression model, a neural network model, a nearest neighbor model, a Naïve Bayes model, or a hybrid model.\n47. The system of claim 46, wherein the decision tree contains a plurality of nodes in each of which there being a test corresponding to a rule that leads to decision values corresponding to the results of the test.\n48. The system as in claim 46, wherein the neural network includes input and output layers and any number of hidden layers.\n49. The system as in claim 26, wherein the defining, exploring, preparing, building, and assessing means are used to build a plurality of models that upon being deployed are placed in a table at the central repository and are differentiated from one another by their respective identification information.\n50. The system as in claim 26, further comprising:\na plurality of applications, wherein the applying means is configured for applying the model to the set of inputs in response to a prompt from one of the applications to which the results or information associated with the results are returned.\n51. A computer readable medium embodying a program for knowledge discovery through analytic learning cycles, comprising:\nprogram code configured to cause a computer to provide a definition of a problem associated with an enterprise;\nprogram code configured to cause a computer system to execute a cycle of analytic learning which is founded on a view of data from across the enterprise, the data having been captured and aggregated and is available at a central repository in real time, wherein the analytic learning cycle employs data mining including\nexploring the data at the central repository in relation to the problem,\npreparing a modeling data set from the explored data,\nbuilding a model from the modeling data set,\nassessing the model,\ndeploying the model back to the central repository, and\napplying the model to a set of inputs associated with the problem to produce results, thereby creating historic data that is saved at the central repository; and\nprogram code configured to cause a computer system to repeat the cycle of analytic learning using the historic as well as current data accumulated in the central repository, thereby creating up-to-date knowledge for evaluating and refreshing the model.\n52. A system for knowledge discovery through analytic learning cycles, comprising:\na central repository at which the real-time data is available having been aggregated from across the enterprise, the real-time data being associated with events occurring at one or more sites throughout an enterprise;\nenterprise applications;\nenterprise application interface which is configured for integrating the applications and real-time data and is backed by the central repository so as to provide a coherent, real-time view of enterprise operations and data;\na data mining server configured to participate in an analytic learning cycle by building one or more models from the real-time data in the central repository, wherein the central repository is designed to store such models;\na hub with core services including a scoring engine configured to obtain a model from the central repository and apply the model to a set of inputs from among the real-time data in order to produce results, wherein the central repository is configured for containing the results along with historic and current real-time data for use in subsequent analytic learning cycles.\n53. The system of claim 52, wherein the scoring engine has a companion calculation engine configured to calculate scoring engine inputs by aggregating real-time and historic data in real time.\n54. The system of claim 52, wherein the central repository contains one or more data sets prepared to suit a problem and a set of inputs from among the real-time data to which a respective model is applied, the problem being defined for finding a pattern in the events and to provide a way of assessing the respective model.\n55. The system as in claim 54, wherein, based on results of the respective model assessment, the problem is redefined before an analytic learning cycle is repeated.\n56. The system of claim 52, further comprising:\ntools for data preparation configured to provide intuitive and graphical interfaces for viewing the structure and contents of the real-time data at the central repository as well as for providing interfaces that specify data transformation.\n57. The system of claim 52, further comprising:\ntools for data transfer and model deployment configured to provide intuitive and graphical interfaces for viewing the structure and contents of the real-time data at the central repository as well as for providing interfaces that specify transfer options.\n58. The system of claim 52, wherein the central repository contains relational databases in which the real-time data is held in normalized form and a space for modeling data sets in which reformatted data is held in denormalized form.\n59. The system of claim 52, wherein the central repository is associated with a relational database management system configured to support database queries.\n60. The system of claim 52, wherein the central repository contains a table for holding models, each model being associated with an identifier, and one or more of a version number, names and data types of the set of inputs, and a description of model prediction logic formatted as IF-THEN rules.\n61. The system of claim 59, wherein the description of model prediction logic consists of JAVA code.",
    "status": "Abandoned",
    "citations_own": [
        "US20020107957A1",
        "US20020133491A1",
        "US20020156693A1",
        "US20020165907A1",
        "US20020188485A1",
        "US20020188430A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20020107957A1",
        "US20040049477A1",
        "US20040225473A1",
        "US20040225520A1",
        "US20040230977A1",
        "US20040236758A1",
        "US20040250255A1",
        "US20040249867A1",
        "US20040267770A1",
        "US20050038805A1",
        "US20050125401A1",
        "US20050182740A1",
        "WO2005091183A1",
        "US20050234753A1",
        "US20050234762A1",
        "US20050278362A1",
        "US20060010093A1",
        "US20060041588A1",
        "US20060047640A1",
        "WO2006050245A2",
        "US20060184527A1",
        "US20060265257A1",
        "US20060277022A1",
        "US20070005523A1",
        "US20070073754A1",
        "US20070156720A1",
        "US7299216B1",
        "EP1895410A1",
        "US20080091767A1",
        "US7389301B1",
        "US20080208720A1",
        "US7461063B1",
        "US20080301019A1",
        "US20090030710A1",
        "US20090083306A1",
        "US20090106151A1",
        "US7533095B2",
        "US20090157723A1",
        "US20090157724A1",
        "US7562063B1",
        "US20090228330A1",
        "US20090259685A1",
        "US20090259664A1",
        "US20100005029A1",
        "US20100036874A1",
        "US7668917B2",
        "US20100070424A1",
        "US20100121833A1",
        "WO2010071845A1",
        "US20100306591A1",
        "US20100305993A1",
        "US7899879B2",
        "US7904823B2",
        "US7912899B2",
        "US20110071956A1",
        "US7941542B2",
        "US7945846B2",
        "US7949553B1",
        "US8001185B2",
        "US20110296419A1",
        "US8165993B2",
        "US8171474B2",
        "US20120150764A1",
        "US20120173465A1",
        "US8255454B2",
        "US8266477B2",
        "US20120323884A1",
        "US8402095B2",
        "US8429182B2",
        "US8473078B1",
        "US20130173663A1",
        "US20130198120A1",
        "US8560365B2",
        "US8968197B2",
        "CN104636954A",
        "US9292577B2",
        "US9443211B2",
        "US20160283573A1",
        "US20160328658A1",
        "US9582759B2",
        "US9646271B2",
        "US20170270435A1",
        "US10048971B2",
        "US20180307986A1",
        "US10318864B2",
        "CN110119551A",
        "US10509593B2",
        "US10587916B2",
        "CN111177220A",
        "US10671926B2",
        "US10706359B2",
        "US10764440B2",
        "US10824950B2",
        "US11042884B2",
        "CN113128837A",
        "US11171835B2",
        "US11227217B1",
        "US11354583B2",
        "CN114663219A",
        "US11379870B1",
        "US11507947B1",
        "US11538063B2",
        "WO2023028695A1",
        "US11823072B2"
    ],
    "citedby_ftf": []
}