{
    "patent_link": "https://patents.google.com/patent/US20060294068A1/en",
    "patent_id": "US20060294068A1",
    "title": "Adding dominant media elements to search results",
    "abstract": "A method and system for determining dominance of the media elements of display pages is provided. The dominance system provides a scoring mechanism for scoring the dominance of media elements of display pages based on features of each media element of the display page. To generate the scores for the media elements of the display page, the dominance system first identifies the media elements and then identifies the features of the media elements. The dominance system then scores the identified media elements using the provided scoring mechanism and the identified features.",
    "inventors": [
        "Ming Li",
        "Shuming Shi",
        "Wei-Ying Ma",
        "Zhiwei Li"
    ],
    "assignee": "Microsoft Technology Licensing LLC",
    "classifications": [
        "G06F16/9538",
        "G06F16/951",
        "Search",
        "Add to query",
        "G06F16/957",
        "Y10S707/99933",
        "Y10S707/99935",
        "Y10S707/99945",
        "Y10S707/99948"
    ],
    "claims": "\n1. A method for determining dominance of media elements of display pages, the method comprising:\nproviding a scoring mechanism for scoring dominance of a media element of display pages based on features of each media element;\nidentifying media elements of a display page;\nfor each identified media element, identifying the features of the media element; and\nscoring the identified media element of the display page using the provided scoring mechanism and the identified features of each media element.\n2. The method of claim 1 wherein the media elements are images.\n3. The method of claim 2 wherein the display page is part of a query result and including displaying a most dominant image of the display page based on the scoring as part of the query result.\n4. The method of claim 2 wherein the features include image level features and display page level features.\n5. The method of claim 4 wherein the display page is a web page and the features further include web site level features.\n6. The method of claim 2 wherein the features are selected from the group consisting of image size, image aspect ratio, image quality, and image category.\n7. The method of claim 2 wherein the features are selected from the group consisting of display page position of image and ratio of image area to display page area.\n8. The method of claim 2 wherein the display page is a web page of a web site and the features are selected from the group consisting of an indicator of whether the image is provided by the web site and an indication of whether the image occurs frequently on the web pages of the web site.\n9. A method for providing query results of a query for web pages, the method comprising:\nproviding an indication of dominance of images of web pages;\nreceiving an indication of web pages of a query result; and\nfor each of the web pages,\nidentifying a most relevant image of the web page based on the indicated dominance of the images; and\nproviding the identified image as part of the query result.\n10. The method of claim 9 wherein dominance of an image is determined using a classifier that is trained to score dominance of images of web pages.\n11. The method of claim 10 wherein the dominance of images of web pages is determined before web pages of the query result are identified.\n12. The method of claim 10 wherein the dominance of images of web pages is determined based on recent crawling of a web site.\n13. The method of claim 10 wherein the classifier is trained by generating a feature vector for each image of a web page, normalizing the feature vectors for the images of the web page, and receiving an indication of dominance of each image.\n14. The method of claim 9 wherein the relevance of an image is further based on similarity of the query to text surrounding the image.\n15. The method of claim 9 wherein the dominance of images of a web page is determined after the web page is included in a query result.\n16. The method of claim 9 wherein the images are represented by features selected from the group consisting of image size, image aspect ratio, image quality, and image category.\n17. A method for presenting a query result of a query for web pages, the method comprising:\nreceiving a query for web pages;\nsubmitting the query to a search engine to generate a query result;\nreceiving a generated query result that identifies web pages and dominant images of the web pages; and\ndisplaying an indication of the web pages and the dominant images of the web pages.\n18. The method of claim 17 including displaying text associated with the web pages.\n19. The method of claim 17 wherein dominance of an image of a web page is determined by the search engine before receiving the query.\n20. The method of claim 17 wherein dominance of an image of a web page is determined using a classifier that is trained on a training set of images of web pages that have been manually classified based on dominance.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US20040101156A1",
        "US20050120311A1"
    ],
    "citations_ftf": [
        "US6271840B1",
        "EP1516264B1",
        "US6816847B1",
        "EP1089198A3",
        "US6643641B1",
        "KR100403714B1",
        "EP1354257A4",
        "US6748398B2",
        "JP3857589B2",
        "US7043474B2",
        "US6892352B1",
        "US6701228B2",
        "US7076498B2",
        "DE60320829D1",
        "GB2402470B",
        "US20050223027A1",
        "US7433895B2"
    ],
    "citedby_own": [
        "US20070061319A1",
        "US20070171482A1",
        "US20070217688A1",
        "US20090106232A1",
        "US20090106229A1",
        "US20090112830A1",
        "US20090228817A1",
        "US20090228811A1",
        "US20090259632A1",
        "US20100082661A1",
        "US20100082421A1",
        "US7996519B1",
        "US20110264641A1",
        "US20150112976A1",
        "CN106547928A",
        "WO2018013400A1",
        "US20210342404A1",
        "CN114205318A"
    ],
    "citedby_ftf": [
        "US7433895B2",
        "US10848590B2",
        "US10585934B2",
        "US10949773B2",
        "US10691642B2",
        "US8818916B2",
        "US10380164B2",
        "US10372746B2",
        "US9646005B2",
        "US10776585B2",
        "US11003706B2",
        "US9558449B2",
        "US9489431B2",
        "US11620327B2",
        "US11386139B2",
        "US11032017B2",
        "US10621988B2",
        "US9218606B2",
        "US9087049B2",
        "US10387914B2",
        "US9639532B2",
        "US9466068B2",
        "US8326775B2",
        "US9747420B2",
        "US10193990B2",
        "US11403336B2",
        "US10614626B2",
        "US9384196B2",
        "US10607355B2",
        "US9396435B2",
        "US9191626B2",
        "US8312031B2",
        "US9330189B2",
        "US9235557B2",
        "US11216498B2",
        "US9286623B2",
        "US10742340B2",
        "US11019161B2",
        "US10380623B2",
        "US11604847B2",
        "US20160321253A1",
        "EP2049983A2",
        "US8943401B2",
        "US10733326B2",
        "US9582804B2",
        "US7840502B2",
        "US9639531B2",
        "US20100080411A1",
        "US8683311B2",
        "US8346815B2",
        "US9218365B2",
        "US20130166394A1",
        "US9218419B2",
        "US9529926B2",
        "US20140281980A1",
        "US20140372419A1",
        "US9576052B2",
        "US9832284B2",
        "US9639526B2",
        "US10133710B2",
        "US10698591B2",
        "US10567327B2",
        "CN106202089B",
        "WO2017105641A1",
        "US11195043B2",
        "WO2019008581A1",
        "CN110555114A",
        "US10846544B2",
        "US11181911B2",
        "US11126870B2",
        "US20200133308A1",
        "US10839694B2",
        "US11700356B2",
        "US10748038B1",
        "US10789535B2",
        "US11643005B2",
        "US11285963B2",
        "US11694088B2",
        "US11132548B2",
        "US10789527B1",
        "US10796444B1",
        "US11222069B2",
        "US10776669B1",
        "US11593662B2",
        "US10748022B1",
        "US11590988B2",
        "US11756424B2"
    ]
}