{
    "patent_link": "https://patents.google.com/patent/US4184049A/en",
    "patent_id": "US4184049A",
    "title": "Transform speech signal coding with pitch controlled adaptive quantizing",
    "abstract": "To improve the speech quality at lower bit rates within a digital communication system in which the coefficients of a frequency transform (e.g. discrete cosine transform) are adaptively encoded with adaptive quantization and adaptive bit-assignment, the adaptation is controlled by a short-term spectral estimate signal formed by combining the formant spectrum and the pitch excitation spectrum of the coefficient signals.",
    "inventors": [
        "Ronald E. Crochiere",
        "Jose M. N. S. Tribolet"
    ],
    "assignee": "AT&T Corp",
    "classifications": [],
    "claims": "\n1. A speech signal processing circuit comprising:\nmeans (101, 103) for sampling a speech signal at a predetermined rate;\nmeans (105) for partitioning said speech signal samples into blocks;\nmeans (107) responsive to each block of speech samples for generating a set of first signals each representative of a discrete frequency domain transform coefficient of said block of speech samples at a predetermined frequency;\nmeans (134) responsive to said first signals for generating a set of adaptation signals; and\nmeans (109) jointly responsive to said adaptation signals and said first signals for producing a set of adaptively quantized discrete transform coefficient coded signals for said block; CHARACTERIZED IN THAT\nsaid adaptation signal generating means (134) includes means (115, 124, 126) for generating a set of second signals representative of the formant spectrum of said block first signals;\nmeans (117, 128) for generating a set of third signals representative of the pitch excitation spectrum of said block first signals;\nmeans (130) for combining said set of second signals and said set of third signals to form a set of first pitch excitation controlled spectral level signals for said block first signals; and\nmeans (132) responsive to said first pitch excitation controlled spectral level signals for producing said adaptation signals.\n2. A speech processing circuit according to claim 1 wherein said adaptation signal producing means (132) is CHARACTERIZED IN THAT\na bit assignment signal and a step-size control signal for each first signal frequency are generated responsive to said first pitch excitation controlled spectral level signals; said bit assignment signals and said step-size control signals being applied to said adaptively quantized discrete transform coefficient coded signal producing means (109).\n3. A speech processing circuit according to claim 2 further CHARACTERIZED IN THAT\nmeans (113) responsive to said block first signals are operative to form a signal representative of the autocorrelation of said block first signals;\nsaid second signal generating means (115, 124, 126) being responsive to said autocorrelation representative signal to generate a formant spectral level signal at each first signal frequency;\nsaid third signal generating means (117, 128) being responsive to said autocorrelation representative signal to generate a pitch excitation spectral level signal at each first signal frequency; and\nsaid combining means (130) being operative to combine the formant spectral level and the pitch excitation spectral level signals at each first signal frequency to form a first pitch excitation controlled spectral level signal at each first signal frequency.\n4. A speech signal processing circuit according to claim 3 further CHARACTERIZED IN THAT said third signal generating means (117, 128) comprises:\nmeans (117, FIG. 6, FIG. 7) responsive to said block autocorrelation representative signal for forming an impulse train signal representative of the pitch excitation of said block first signals; and means (FIG. 8) responsive to said pitch representative impulse train signal for generating a set of signals each representative of the pitch excitation spectral level at a first signal frequency.\n5. A speech signal processing circuit according to claim 4 wherein said second signal generating means (115, 124, 126) is CHARACTERIZED BY\nmeans (115, 124) responsive to said block autocorrelation representative signal for generating a set of signals representative of the prediction parameters of said block first signals; and\nmeans (126) responsive to said prediction parameter signals for generating a formant spectral level signal at each first signal frequency.\n6. A speech signal processing circuit according to claim 5 wherein said pitch representative impulse train signal forming means (117, FIG. 6, FIG. 7) is CHARACTERIZED BY\nmeans (603, 605, 607) responsive to said block autocorrelation signal for determining a signal (Rmax) corresponding to the maximum value of said autocorrelation signal in said block and a pitch period signal (P) corresponding to the time of occurrence of said maximum value of said autocorrelation signal;\nmeans (609) responsive to said determined autocorrelation signal maximum value (Rmax) and the initial value of said block autocorrelation signal (R(0)) in said block for forming a pitch gain signal (PG) corresponding to the ratio of said autocorrelation signal maximum value to said autocorrelation signal initial value; and\nmeans (701, 703, 707, 709, 713, 715-0-715-N-1) jointly responsive to said pitch gain and said pitch period signal for generating said pitch representative impulse train signal\nZ(n)=P.sub.G.sup.k\nfor n=kP+P/2 and zero for all other n < N-1; where n=0,1,2, . . . , N-1; k=0,1, . . . , (N-1-P/2)/P and N is the number of discrete cosine transform coefficients.\n7. A speech processing circuit according to claim 6 further comprising:\nmeans (112) for multiplexing said adaptively quantized discrete transform coefficient coded signals, said prediction parameter signals, said pitch period signal and said pitch gain signal for said block of first signals;\nmeans (201) connected to said multiplexing means (112) for separating the adaptively quantized discrete transform coefficient coded signals of said block from said prediction parameter signals, said pitch period signal and said pitch gain signal of said block;\nmeans (234) responsive to said block prediction parameter signals, said pitch period signal and said pitch gain signal from said separating means (201) for forming a set of adaptation signals for said block;\nmeans (203) jointly responsive to said adaptively quantized discrete transform coefficient coded signals of said block and said adaptation signals from said adaptation signal forming means (234) for decoding said block adaptively quantized discrete transform coefficient coded signals;\nmeans (207) responsive to said set of decoded discrete cosine transform coefficient coded signals from said decoding means (203) for producing a set of fourth signals representative of the speech samples of the block; and\nmeans (208, 209, 211) for converting said fourth signals into a replica of said sampled speech signals CHARACTERIZED IN THAT said adaptation signal forming means (234) comprises:\nmeans (222, 224, 226) responsive to said prediction parameter signals from said separating means (201) for generating a set of fifth signals representative of the formant spectrum of said block first signals;\nmeans (222, 228) responsive to said pitch period and pitch gain signals from separating means (201) for generating a set of sixth signals representative of the pitch excitation spectrum of said block first signals;\nmeans (230) for combining said sets of fifth and sixth signals to form a set of second pitch excitation controlled spectral level signals for said block; and\nadaptation computing means (232) responsive to said set of second pitch excitation controlled spectral level signals for generating a bit assignment signal and a step-size control signal for each adaptively quantized discrete transform coefficient coded signal.\n8. A speech signal processing circuit according to any of claims 1 through 7 further CHARACTERIZED IN THAT each first signal is representative of a discrete cosine transform coefficient of said block of speech samples at a predetermined frequency; and each adaptively quantized discrete transform coefficient coded signal is an adaptively quantized discrete cosine transform coefficient coded signal.\n9. A method for processing a speech signal comprising the steps of:\nsampling a speech signal at a predetermined rate;\npartitioning said speech signal samples into blocks;\nresponsive to each block of speech signal samples, generating a set of first signals each representative of a discrete frequency domain transform coefficient of said block of speech samples at a predetermined frequency;\nforming a set of first adaptation signals from said block first signals; and\nproducing a set of adaptively quantized discrete transform coefficient coded signals for each block jointly responsive to said set of first adaptation signals and said block first signals CHARACTERIZED IN THAT:\nthe forming of said first adaptation signals includes generating a set of second signals representative of the formant spectrum of the block first signals;\ngenerating a set of third signals representative of the pitch excitation spectrum of the block first signals;\ncombining said second and third signals to form a set of first pitch excitation controlled spectral level signals; and\ngenerating a set of first adaptation signals responsive to said first pitch excitation controlled spectral level signals.\n10. A method for processing a speech signal according to claim 9 wherein said adaptation signal generation is CHARACTERIZED IN THAT:\na bit assignment signal and a step-size control signal for each first signal frequency is generated responsive to said first pitch excitation controlled spectral level signal at said first signal frequency, said bit assignment and step-size control signals being the first adaptation signals for adaptively quantizing said first signals.\n11. A method for processing a speech signal according to claim 10 further CHARACTERIZED IN THAT:\nsaid set of second signals is generated by forming a signal representative of the autocorrelation of the block first signals and generating a formant spectral level signal at each first signal frequency from said autocorrelation representative signal;\nsaid set of third signals is generated by producing a pitch excitation spectral level signal at each first signal frequency responsive to said autocorrelation representative signal; and\ncombining the pitch excitation spectral level signal and the formant spectral level signal for each first signal frequency to produce a first pitch excitation controlled spectral level signal at said first signal frequency.\n12. A method for processing a speech signal according to claim 11 wherein said pitch excitation spectral level signal formation is CHARACTERIZED IN THAT:\nan impulse train signal representative of the pitch excitation of said block first signals is formed responsive to said autocorrelation representative signal; and\nresponsive to said impulse train signal, a set of signals each representative of the pitch excitation spectral level at a first signal frequency is generated.\n13. A method for processing a speech signal according to claim 12 wherein the forming of said second signals is CHARACTERIZED IN THAT:\na set of signals representative of the prediction parameters of said block first signals is formed from said autocorrelation representative signal; and\nsaid formant spectral level signals are generated responsive to said block prediction parameter signals.\n14. A method for processing a speech signal according to claim 13 wherein the forming of said pitch excitation impulse train signal is CHARACTERIZED IN THAT:\na signal (Rmax) representative of the maximum value of said autocorrelation signal in said block and a pitch period signal (P) corresponding to the time of occurrence of said maximum value aotocorrelation signal are determined;\nresponsive to said determined maximum autocorrelation signal and the initial value of said autocorrelation signal in said block, a pitch gain signal PG corresponding to the ratio of said maximum value autocorrelation signal to said initial value of said autocorrelation signal is formed; and\njointly responsive to said pitch gain signal and said pitch period signal, an impulse train signal\nZ(n)=P.sub.G.sup.k\nfor n=kP+P/2 and zero for all other n<N+1; where n=0,1, . . . , N-1, k=0,1, . . . , (N-1-P/2)/P and N is the number of discrete cosine transform coefficients in said block, is generated.\n15. A method for processing a speech signal according to claim 14 further comprising the steps of:\nmultiplexing said adaptively quantized discrete transform coefficient coded signals, said prediction parameter signals, said pitch period signal and said pitch gain signal for said block of first signals;\napplying said multiplexed signals to a communication channel;\nseparating the multiplexed adaptively quantized discrete transform coefficient coded signals of the block from the multiplexed prediction parameter signals, the pitch period signal and the pitch gain signal;\nresponsive to the separated prediction parameter signals, pitch period signal and pitch gain signal, forming a set of second adaptation signals for the block;\njointly responsive to said adaptively quantized discrete transform coefficient coded signals of said block and said second adaptation signals, decoding said separated block adaptively quantized discrete transform coefficient coded signals;\nproducing a set of fourth signals representative of the speech samples of the block from said decoded adaptively quantized discrete transform coefficient coded signals; and\nconverting said fourth signals into replica of said spech signal samples;\nCHARACTERIZED IN THAT the forming of said second adaptation signals includes:\ngenerating a set of fifth signals representative of the formant spectrum of the block first signals responsive to the separated prediction parameter signals;\ngenerating a set of sixth signals representative of the pitch excitation spectrum of said block first signals from the separated pitch period and pitch gain signals;\ncombining the sets of fifth and sixth signals to form a set of second pitch excitation controlled spectral level signals for said block; and\nresponsive to said second pitch excitation controlled spectral level signals, producing a bit assignment adaptation signal and a step-size control adaptation signal for each adaptively quantized discrete transform coefficient coded signal.\n16. A method for processing a speech signal according to any of claims 9 through 15 further CHARACTERIZED IN THAT each first signal is representative of a discrete cosine transform coefficient of said block of speech samples at a predetermined frequency; and each adaptively quantized discrete transform coefficient coded signal is an adaptively quantized discrete cosine transform coefficient coded signal.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3681530A",
        "US4142071A"
    ],
    "citations_ftf": [
        "JPS6339964B2"
    ],
    "citedby_own": [
        "US4360708A",
        "US4401855A",
        "US4464783A",
        "US4470146A",
        "US4472832A",
        "US4516258A",
        "US4536886A",
        "US4538234A",
        "US4544919A",
        "US4569075A",
        "US4710891A",
        "US4713776A",
        "USRE32580E",
        "US4790016A",
        "US4809334A",
        "US4809332A",
        "US4817158A",
        "US4820059A",
        "US4827517A",
        "US4837828A",
        "WO1989011718A1",
        "US4926482A",
        "US4949383A",
        "US4961160A",
        "US4965789A",
        "WO1990013111A1",
        "US4989246A",
        "US4991213A",
        "US5012517A",
        "US5023910A",
        "US5105464A",
        "US5109451A",
        "US5127053A",
        "EP0495501A2",
        "US5142581A",
        "EP0501421A2",
        "US5179626A",
        "US5206884A",
        "USRE34247E",
        "US5216748A",
        "US5235671A",
        "US5263088A",
        "US5301205A",
        "US5307441A",
        "US5381143A",
        "US5414795A",
        "US5438643A",
        "US5454011A",
        "US5461378A",
        "US5487086A",
        "US5491773A",
        "US5504832A",
        "US5530750A",
        "US5548574A",
        "US5559900A",
        "US5581654A",
        "US5583967A",
        "US5590108A",
        "US5590241A",
        "US5608713A",
        "US5621856A",
        "US5642111A",
        "US5657358A",
        "US5684923A",
        "US5717821A",
        "US5717819A",
        "US5737720A",
        "US5752224A",
        "US5752225A",
        "US5758316A",
        "US5765126A",
        "US5774844A",
        "US5781586A",
        "US5781452A",
        "US5805770A",
        "US5819214A",
        "US5825979A",
        "US5832426A",
        "US5832424A",
        "US5852604A",
        "US5870703A",
        "US5924060A",
        "US5930750A",
        "US5999899A",
        "US6003000A",
        "US6012025A",
        "USRE36559E",
        "USRE36683E",
        "US6081784A",
        "US6104321A",
        "JP3111459B2",
        "US6163577A",
        "US6311154B1",
        "US6313765B1",
        "US20030065506A1",
        "US6647063B1",
        "US20070239440A1",
        "US20080031365A1",
        "US20090198500A1",
        "TWI387270B",
        "US20130085752A1",
        "US8428957B2"
    ],
    "citedby_ftf": [
        "JPS5913758B2",
        "JPH0446440B2",
        "IT1179803B",
        "JP3185214B2",
        "DE4101022A1",
        "JP2778567B2",
        "JP3255022B2"
    ]
}