{
    "patent_link": "https://patents.google.com/patent/US20100179930A1/en",
    "patent_id": "US20100179930A1",
    "title": "Method and System for Developing Predictions from Disparate Data Sources Using Intelligent Processing",
    "abstract": "Provided herein is a platform for prediction based on extraction of features and observations collected from a large number of disparate data sources that uses machine learning to reinforce quality of collection, prediction and action based on those predictions.",
    "inventors": [
        "Eric Teller",
        "Dave Andre",
        "John Stivoric"
    ],
    "assignee": "BlackRock Advisors LLC",
    "classifications": [],
    "claims": "\n1-37. (canceled)\n38. A system, comprising:\na collection facility for taking data from a plurality of disparate sources and characterizing a plurality of features within the data sources;\na prediction facility for making a prediction based on the plurality of features;\nan agent for taking an action based on a prediction of the prediction facility;\na reward identification facility for determining at least one of a reward and a punishment based on the outcome of the action taken by the agent;\na feedback facility for feeding the reward or punishment to a machine learning facility; and\na machine learning facility for improving the selection of features within the collection facility.\n39. The system of claim 38, wherein the machine learning facility improves a method of prediction within the prediction facility.\n40. The system of claim 38, wherein the machine learning facility improves the determination of an action within the agent.\n41. The system of claim 38, further comprising providing an analytic facility for generating a hypothesis for use by the prediction facility.\n42. The system of claim 38, further comprising an assessment module for assessing the validity of the hypothesis.\n43. The system of claim 38, wherein the prediction is used to inform an application, wherein the application is selected from the group consisting of trading strategy, supply chain management applications, marketing applications, entertainment applications, personal management applications, security applications, military applications, securities analysis applications, enterprise resource planning applications, competitive strategy applications, gaming applications, political applications, health care applications, investment strategy applications, dashboard applications, scientific applications, research applications, intellectual property applications, government applications, and engineering applications.\n44. The system of claim 38, further comprising an analytic facility for deriving an explanation for a cause and effect relationship based on the nature of the inputs that have a favorable influence on the prediction.\n45. The system of claim 38, further comprising a generalization facility for assessing the extent to which a prediction based on an input can be generalized.\n46. The system of claim 38, wherein the machine learning facility uses a partially specified program.\n47. A system, comprising:\na collection facility for taking data from a plurality of disparate sources and characterizing a plurality of features within the data sources;\na prediction facility for making a prediction based on the plurality of features;\nan agent for taking an action based on a prediction of the prediction facility;\na reward identification facility for determining at least one of a reward and a punishment based on the outcome of the action taken by the agent;\na feedback facility for feeding the reward or punishment to a machine learning facility; and\na machine learning facility for improving a method of prediction within the prediction facility.\n48. The system of claim 47, wherein the machine learning facility improves identification of features within the collection facility.\n49. The system of claim 47, wherein the machine learning facility improves the determination of an action within the agent.\n50. The system of claim 47, further comprising providing an analytic facility for generating a hypothesis for use by the prediction facility.\n51. The system of claim 47, further comprising an assessment module for assessing the validity of the hypothesis.\n52. The system of claim 47, wherein the prediction is used to inform an application, wherein the application is selected from the group consisting of trading strategy, supply chain management applications, marketing applications, entertainment applications, personal management applications, security applications, military applications, securities analysis applications, enterprise resource planning applications, competitive strategy applications, gaming applications, political applications, health care applications, investment strategy applications, dashboard applications, scientific applications, research applications, intellectual property applications, government applications, and engineering applications.\n53. The system of claim 47, further comprising an analytic facility for deriving an explanation for a cause and effect relationship based on the nature of the inputs that have a favorable influence on the prediction.\n54. The system of claim 47, further comprising a generalization facility for assessing the extent to which a prediction based on an input can be generalized.\n55. The system of claim 47, wherein the machine learning facility uses a partially specified program.\n56. A system, comprising:\na collection facility for taking data from a plurality of disparate sources and characterizing a plurality of features within the data sources;\na prediction facility for making a prediction based on the plurality of features;\nan agent for taking an action based on a prediction of the prediction facility;\na reward identification facility for determining at least one of a reward and a punishment based on the outcome of the action taken by the agent;\na feedback facility for feeding the reward or punishment to a machine learning facility; and\na machine learning facility for improving the determination of an action within the agent.\n57. The system of claim 56, wherein the machine learning facility improves a method of prediction within the prediction facility.\n58-61. (canceled)",
    "status": "Abandoned",
    "citations_own": [
        "US20040244029A1",
        "US20090157714A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20100241498A1",
        "US20110184908A1",
        "US20120004925A1",
        "US20120036092A1",
        "US20120173468A1",
        "WO2012103403A1",
        "WO2012103400A1",
        "US20130006592A1",
        "US20130138590A1",
        "US20130159289A1",
        "US20130159059A1",
        "US8583470B1",
        "US20140019305A1",
        "US8712931B1",
        "WO2014028648A3",
        "EP2778966A3",
        "US20150161636A1",
        "US20150178286A1",
        "US9104683B2",
        "US20150264075A1",
        "WO2015148304A1",
        "US9159056B2",
        "US9171079B2",
        "US20150317561A1",
        "US9256371B2",
        "US9275093B2",
        "WO2016036958A1",
        "US20160078361A1",
        "US20160104173A1",
        "US20160162991A1",
        "US20160163158A1",
        "WO2016112213A3",
        "WO2016191349A1",
        "JP2016540319A",
        "US20170076219A1",
        "CN106575318A",
        "US20180040062A1",
        "US10176157B2",
        "US10185996B2",
        "US20190122321A1",
        "US10290058B2",
        "JP2019079568A",
        "US10303447B2",
        "US10310846B2",
        "US10334026B2",
        "US20190197549A1",
        "CN109993004A",
        "US20190217183A1",
        "US10360631B1",
        "US10425295B1",
        "US10540592B2",
        "US10545938B2",
        "US20200106677A1",
        "US10621511B2",
        "US10621233B2",
        "US10621510B2",
        "US10621182B2",
        "US10628491B2",
        "WO2020113128A1",
        "US20200175391A1",
        "US10684851B2",
        "US20200202436A1",
        "US10719771B2",
        "US10726346B2",
        "US10726342B2",
        "US10726343B2",
        "US20200250623A1",
        "US10749881B2",
        "US10795326B2",
        "US10846616B1",
        "US10923213B2",
        "US20210056459A1",
        "US10990890B2",
        "WO2021090327A1",
        "US11030557B2",
        "JP2021093210A",
        "US11062333B2",
        "US20210223434A1",
        "US11093884B2",
        "WO2021167997A1",
        "US20210350225A1",
        "US11182729B2",
        "WO2021236098A1",
        "WO2021242329A1",
        "US11205028B2",
        "US20210406799A1",
        "US20220023719A1",
        "US11311808B2",
        "WO2022109150A1",
        "US11392854B2",
        "WO2022170251A1",
        "US11443250B1",
        "US11475357B2",
        "US20220351220A1",
        "KR20220153774A",
        "WO2022226143A3",
        "US11537847B2",
        "US11537944B2",
        "US11544724B1",
        "US11551305B1",
        "US11550766B2",
        "US11568713B2",
        "EP3966669A4",
        "US11664108B2",
        "US11687842B2",
        "US11720727B2",
        "WO2023158330A1",
        "US11790368B2",
        "US11804103B2",
        "US11822609B2"
    ],
    "citedby_ftf": [
        "US11263603B1",
        "US11373200B2",
        "US11368358B2",
        "US11310250B2",
        "US11763919B1",
        "US11100753B1",
        "US11127250B1",
        "US20220148369A1",
        "US11487799B1",
        "US11151665B1",
        "EP4113522A1",
        "CN116227778B"
    ]
}