{
    "patent_link": "https://patents.google.com/patent/US20080170551A1/en",
    "patent_id": "US20080170551A1",
    "title": "Idle connection state power consumption reduction in a wireless local area network using beacon delay advertisement",
    "abstract": "A novel and useful apparatus for and method of improving idle connection state power consumption in wireless local area network (WLAN) system. Beacon transmission delay information is determined by the access points and advertised to the stations via a Beacon Transmission Delay Information Element. In response, the stations adjust their Wake For Beacon Reception time accordingly to wake up at a time much closer to the actual receipt of the Beacon, thereby reducing power consumption due to the reduced time the receive circuits need to be powered on.",
    "inventors": [
        "Artur Zaks"
    ],
    "assignee": "Texas Instruments Inc",
    "classifications": [
        "H04W52/0229",
        "Y02D30/70"
    ],
    "claims": "\n1. A method for use in an access point in a wireless local area network (WLAN) system, said method comprising the steps of:\nmeasuring beacon transmission delay on said access point; and\nadvertising said measured beacon transmission delay in messages thereby permitting recipient stations to schedule wake up times for beacon reception with significantly improved accuracy.\n2. The method according to claim 1, wherein said step of measuring said beacon transmission delay comprises the steps of:\ndetermining the number of processing instructions executed from receipt of a Target Beacon Transmission Time (TBTT) interrupt until the programming of the beacon frame pointer into the channel access block; and\nmultiplying said number of processing instructions executed by an instruction execution time to yield said beacon transmission delay.\n3. The method according to claim 1, wherein said step of measuring said beacon transmission delay comprises calculating a weighted average access delay.\n4. The method according to claim 3, wherein said weighted average access delay is calculated as a function of a forgettance factor, previous weighted average access delay and a last beacon transmission delay, wherein said last beacon transmission delay comprises the time duration from Target Beacon Transmission Time (TBTT) timer expiration to when the beacon message is input to said channel access block.\n5. The method according to claim 1, wherein said step of advertising comprises inserting said measured beacon transmission delay in a beacon transmission delay information element included in media access control (MAC) management frames.\n6. The method according to claim 1, wherein said message comprises a message from the group consisting of Beacon, Probe response, Association Response, Re-association Response and Neighbor Report.\n7. A method for use in an access point in a wireless local area network (WLAN) system, said method comprising the steps of:\nmeasuring beacon transmission delay on said access point from a target beacon transmission time (TBTT) event to the time a beacon packet is forwarded to a channel access function; and\nadvertising said measured beacon transmission delay in beacon messages thereby permitting recipient stations to schedule wake up times for beacon reception with better accuracy.\n8. The method according to claim 7, wherein said channel access function comprises an IEEE 802.11 Enhanced Distributed Channel Access (EDCA).\n9. The method according to claim 7, wherein said step of measuring said beacon transmission delay comprises the steps of:\ndetermining the number of processing instructions executed from receipt of a Target Beacon Transmission Time (TBTT) interrupt until the programming of the beacon frame pointer into the channel access block; and\nmultiplying said number of processing instructions executed by an instruction execution time to yield said beacon transmission delay.\n10. The method according to claim 7, wherein said step of measuring said beacon transmission delay comprises calculating a weighted average access delay.\n11. The method according to claim 7, wherein said step of advertising comprises inserting said measured beacon transmission delay in a beacon transmission delay information element included in media access control (MAC) management frames.\n12. A method for use in an access point in a wireless local area network (WLAN) system, said method comprising the steps of:\ndetermining a delay in transmission of beacons beyond a time normally required for channel access; and\nadvertising said measured beacon transmission delay in beacon messages thereby permitting recipient stations to schedule wake up times for beacon reception with better accuracy.\n13. The method according to claim 12, wherein said step of measuring said beacon transmission delay comprises the steps of:\ndetermining the number of processing instructions executed from receipt of a Target Beacon Transmission Time (TBTT) interrupt until the programming of the beacon frame pointer into the channel access block; and\nmultiplying said number of processing instructions executed by an instruction execution time to yield said beacon transmission delay.\n14. The method according to claim 12, wherein said step of measuring said beacon transmission delay comprises calculating a weighted average access delay.\n15. A method for use in a station in a wireless local area network (WLAN) system, said method comprising the steps of:\nreceiving a message containing beacon transmission delay information transmitted by an access point; and\nupdating a wake for beacon reception time value in accordance with said beacon transmission delay information.\n16. The method according to claim 15, wherein said beacon transmission delay information is received in a Beacon Transmission Delay Information Element (IE).\n17. The method according to claim 15, wherein said step of updating comprises the step of calculating a new wake for beacon time value as a function of said beacon transmission delay information and a beacon interval advertised by said access point.\n18. The method according to claim 15, wherein said step of updating comprises the step of calculating a wake for beacon time value as the sum of said beacon transmission delay and a Target Beacon Transmission Time (TBTT) advertised by said access point.\n19. The method according to claim 15, further comprising the step of programming a hardware wake-up timer with said updated wake for beacon reception time value.\n20. The method according to claim 15, wherein said message comprises a message from the group consisting of Beacon, Probe response, Association Response, Re-association Response and Neighbor report.\n21. A mobile communication device, comprising:\na cellular radio;\na WLAN radio;\na processor communicatively coupled to said WLAN radio and said cellular radio, said processor operative to:\nreceive a message containing beacon transmission delay information transmitted by an access point; and\nadjust a wake for beacon reception time value in accordance with said beacon transmission delay information.\n22. The mobile communications device according to claim 21, wherein said measured beacon transmission delay is transmitted in a beacon transmission delay information element.\n23. The method according to claim 21, wherein said processor is operative to adjust said wake for beacon reception time value by calculating a new wake for beacon time value as a function of said beacon transmission delay information and a beacon interval advertised by said access point.\n24. The method according to claim 21, wherein said processor is operative to adjust said wake for beacon reception time value by calculating a wake for beacon time value as the sum of said beacon transmission delay and a Target Beacon Transmission Time (TBTT) advertised by said access point.\n25. The method according to claim 21, wherein said processor is further operative to program a hardware wake-up timer with said adjusted wake for beacon reception time value.",
    "status": "Active",
    "citations_own": [
        "US20050233789A1",
        "US20060171341A1",
        "US7151945B2",
        "US20070014269A1",
        "US20070093201A1",
        "US7245946B2",
        "US7295827B2"
    ],
    "citations_ftf": [
        "US6580700B1",
        "US5909651A",
        "US7483699B2",
        "US7248600B2",
        "JP4407126B2",
        "US6879567B2",
        "US7586948B2",
        "DE602004001389T2",
        "US8102835B2"
    ],
    "citedby_own": [
        "US20070270119A1",
        "US20100150113A1",
        "CN101909347A",
        "US20110150040A1",
        "US20110188391A1",
        "US20120051345A1",
        "US20120124606A1",
        "US20120182926A1",
        "WO2013019886A1",
        "US20130259148A1",
        "WO2013090234A3",
        "US8649755B2",
        "US8923137B2",
        "US20150085837A1",
        "US9003436B2",
        "US20150245305A1",
        "US9167622B2",
        "US9426738B2",
        "US9519728B2",
        "US9531760B2",
        "US9621939B2",
        "US9635421B2",
        "US9756549B2",
        "US9807691B2",
        "US9883223B2",
        "CN107734430A",
        "US9906838B2",
        "WO2018056674A1",
        "US10015369B2",
        "US10028025B2",
        "US10051304B2",
        "CN108616968A",
        "US10116676B2",
        "US10136172B2",
        "US10148623B2",
        "US10178435B1",
        "CN109565738A",
        "US10250932B2",
        "US10278008B2",
        "US10313755B2",
        "US10339281B2",
        "CN109996319A",
        "US10404758B2",
        "US10586023B2",
        "US10602231B2",
        "US10652607B2",
        "CN111448829A",
        "US10863238B2",
        "CN112511364A",
        "US10958629B2",
        "US11032518B2",
        "US11076189B2",
        "US11159851B2",
        "US11206647B2",
        "US11212593B2",
        "US11381549B2",
        "US11382041B2",
        "US11552999B2",
        "US11792462B2"
    ],
    "citedby_ftf": [
        "US7825871B2",
        "KR101397565B1",
        "US8254996B2",
        "US8228830B2",
        "US9088946B2",
        "US9445253B2",
        "US8675620B1",
        "TW201101712A",
        "US9060318B2",
        "CN102045132B",
        "CN101883446B",
        "US9072082B2",
        "US9088948B2",
        "US9379905B2",
        "US8725196B2",
        "WO2012113136A1",
        "US9137751B2",
        "US8879452B2",
        "US9001806B2",
        "KR102078893B1",
        "US9907098B2",
        "US9179455B2",
        "EP2936848A1",
        "US9462550B2",
        "CN104519555A",
        "CN103826284B",
        "US9485715B2",
        "US9357342B2",
        "US10503122B2",
        "US20190132796A1",
        "US10840921B2",
        "US10622959B2",
        "US11095296B2",
        "WO2020146408A1",
        "US10728851B1",
        "CN110489272A"
    ]
}