{
    "patent_id": "US-11705523-B2",
    "title": "Field-effect transistor including transparent oxide and light-shielding member, and display utilizing the transistor ",
    "assignee": "Canon Kabushiki Kaisha",
    "publication_date": "2023-07-18",
    "patent_link": "https://patents.google.com/patent/US11705523B2/en",
    "inventors": [
        "Ryo Hayashi",
        "Masafumi Sano",
        "Katsumi Abe",
        "Hideya Kumomi",
        "Kojiro Nishi"
    ],
    "classifications": [
        "H01L29/78633",
        "G02F1/1368",
        "H01L27/1225",
        "H01L29/7869",
        "H01L29/78693",
        "H10K59/123",
        "H10K59/126",
        "H10K2102/311"
    ],
    "abstract": "A field-effect transistor includes a substrate, a source electrode, a drain electrode, a gate electrode, a gate-insulating film, and an active layer. The active layer contains an oxide having a transmittance of 70% or more in the wavelength range of 400 to 800 nm. A light-shielding member is provided as a light-shielding structure for the active layer, for example, on the bottom face of the substrate.",
    "claims": "\n1. A display, comprising:\na field-effect transistor;\nan interlayer-insulating film covering the field-effect transistor;\na light-emitting device emitting light over the interlayer-insulating film; and\na light-shielding member containing a metal;\nthe field-effect transistor comprising an active layer containing a transparent oxide, a gate electrode containing a metal, a gate-insulating film between the active layer and the gate electrode, a first electrode in contact with the active layer, and a second electrode in contact with the active layer; and\nthe light-emitting device comprising a third electrode, a fourth electrode between the third electrode and the interlayer-insulating film, and a light-emitting layer between the third electrode and the fourth electrode, wherein\nthe gate electrode and the active layer are disposed between the fourth electrode and the light-shielding member in a first direction perpendicular to a surface of the light-shielding member, and\nthe gate electrode has both ends in a second direction perpendicular to the first direction, and both ends of the gate electrode are disposed between the fourth electrode and the light-shielding member in the first direction.\n2. The display according to claim 1, wherein the interlayer-insulating film is disposed between the fourth electrode and the field-effect transistor, and\nthe first electrode and the second electrode are arranged in a direction parallel to the second direction.\n3. The display according to claim 1, wherein the fourth electrode is electrically connected to the field-effect transistor.\n4. The display according to claim 1, wherein the fourth electrode is electrically connected to the second electrode.\n5. The display according to claim 1, wherein the second electrode is connected to the fourth electrode via the interlayer-insulating film.\n6. The display according to claim 1, wherein the light shielding member includes a first portion,\nthe interlayer-insulating film is disposed between the fourth electrode and the first portion of the light-shielding member in a direction perpendicular to a surface of the first portion, and\nthe gate electrode, the first electrode, the second electrode and the active layer are not disposed between the fourth electrode and the first portion of the light-shielding member in the direction perpendicular to the surface of the first portion.\n7. The display according to claim 1, wherein the light-shielding member includes a second portion,\nthe second electrode is disposed between the fourth electrode and the second portion of the light-shielding member in a direction perpendicular to a surface of the second portion, and\nthe active layer is not disposed between the fourth electrode and the second portion of the light-shielding member in the direction perpendicular to the surface of the second portion.\n8. The display according to claim 7, wherein an insulating film is disposed between the fourth electrode and the second portion of the light-shielding member in the direction perpendicular to the surface of the second portion.\n9. The display according to claim 7, wherein the gate-insulating film is disposed between the fourth electrode and the second portion of the light-shielding member in the direction perpendicular to the surface of the second portion.\n10. The display according to claim 1, wherein the light shielding member includes a third portion,\nthe active layer is disposed between the fourth electrode and the third portion of the light-shielding member in a direction perpendicular to a surface of the third portion, and\nthe gate electrode, the first electrode and the second electrode are not disposed between the fourth electrode and the third portion of the light-shielding member in the direction perpendicular to the surface of the third portion.\n11. The display according to claim 1, wherein the active layer is disposed between the gate electrode and the light-shielding member.\n12. The display according to claim 1, wherein the active layer is disposed between the second electrode and the light-shielding member.\n13. The display according to claim 1, further comprising a substrate containing glass or resin.\n14. The display according to claim 13, wherein the light-shielding member contacts the substrate.\n15. The display according to claim 13, wherein the active layer is disposed between the gate electrode and the substrate, and the active layer is disposed between the second electrode and the substrate.\n16. The display according to claim 13, wherein the gate-insulating film is disposed between the first electrode and the substrate.\n17. The display according to claim 1, wherein the gate-insulating film is disposed between the second electrode and the light-shielding member.\n18. The display according to claim 1, wherein the light-shielding member is not electrically connected with the gate electrode.\n19. The display according to claim 1, wherein the field-effect transistor is configured to control a current flowing into the light-emitting device by a voltage imposed to the gate electrode of the field-effect transistor.\n20. The display according to claim 1, wherein the field-effect transistor is a switching element.\n21. The display according to claim 1, wherein no metal member is disposed between the light-shielding member and the active layer in the first direction perpendicular to the surface of the light-shielding member.\n22. The display according to claim 1, wherein no metal member is disposed between both ends of the gate electrode and the fourth electrode in the first direction perpendicular to the surface of the light-shielding member.\n23. Display according to claim 1, wherein the light-shielding member is a multilayer film composed of different materials.\n24. The display according to claim 1, wherein the light-shielding member contains at least one member of the group consisting of Ti, Cr, W, Ta, Mo and Pb.\n25. The display according to claim 1, wherein a thickness of the light-shielding member is in a range of several tens of nanometers to several tens of micrometers.\n26. The display according to claim 1, wherein the interlayer-insulating film is formed of an organic material.\n27. The display according to claim 1, wherein the transparent oxide contains In and at least one of Ga, Zn and Sn.\n28. The display according to claim 1, wherein the transparent oxide contains In and at least two of Ga, Zn and Sn.\n29. The display according to claim 1, wherein the transparent oxide contains In, Ga and Zn.\n30. The display according to claim 1, wherein the transparent oxide contains In, Sn and Zn.\n31. The display according to claim 1, wherein the transparent oxide contains 15 at % or more of In as an atomic ratio excluding oxygen.\n32. The display according to claim 1, wherein the active layer contains an amorphous oxide.\n33. The display according to claim 1, wherein the active layer contains a microcrystalline material.\n34. The display according to claim 1, wherein the active layer contains an amorphous oxide and a microcrystal in the amorphous oxide.\n35. The display according to claim 1, wherein the active layer contains a polycrystal oxide.\n36. Display according to claim 1, wherein the field-effect transistor is a normally-off type transistor, and the active layer has an electronic carrier concentration of lower than 1018/cm3.\n37. The display according to claim 1, wherein the active layer has a light transmittance of 70% or more in a wavelength range of 400 to 800 nm, and the light-shielding member shields light in a wavelength range of 400 to 800 nm.\n38. The display according to claim 1, wherein the light-emitting device includes an organic material between the third electrode and the fourth electrode,\nthe organic material is in contact with the fourth electrode, and\nthe organic material is, over the filed-effect transistor, not in contact with the interlayer-insulating film.\n39. The display according to claim 1, wherein the light-emitting device has a top emission structure.\n40. The display according to claim 39, wherein the fourth electrode serves as a light-insulating film or functions as a light-shielding layer.\n41. The display according to claim 13, wherein the first electrode and the second electrode are arranged between the substrate and the fourth electrode in a direction parallel to the first direction."
}