{
    "patent_link": "https://patents.google.com/patent/US4578747A/en",
    "patent_id": "US4578747A",
    "title": "Selective parametric self-calibrating control system",
    "abstract": "A controlled system (10) has a control means (12) supplying a manipulated input, Y, to a plant (14). The control means (12) has external inputs V, input control model parameters C, and a predetermined mathematical model to compute a desired controlled system output XD into Y as a function of V and C. The method for operating the controlled system (10) includes establishing an initial value for C, measuring V, and generating an initial model for generating Y from XD as a function of V and C. The method also includes correcting C as a function of the difference between XD and the actual controlled system output, X, and as a function of measured external inputs V.",
    "inventors": [
        "Laszlo Hideg",
        "Paul L. Koller"
    ],
    "assignee": "Ford Motor Co",
    "classifications": [],
    "claims": "\n1. In a controlled system having a control means supplying a manipulated input to a plant, said control means having a first plurality of external inputs designated V, measurable by sensing means, and a second plurality of input control model parameters designated C, alterable in said controlled system by calibration means, said control means including a predetermined mathematical model to compute a desired controlled system output XD into a manipulated input Y as a function of V and C, a method for operating the controlled system to meet specified system output requirements comprising the steps of:\nestablishing an initial value for input control parameters, C;\nmeasuring external inputs, V;\ngenerating an initial model for generating a manipulated input, Y, from a desired controlled system output, XD, as a function of V and C; and\ncorrecting the input control model parameters C as a function of the difference between the desired controlled system output XD and the actual controlled system output, X, and as a function of measured external inputs, V, by including the steps of comparing the actual controlled system output to the desired controlled system output and generating an output error; measuring external inputs V; and updating sequentially the values of the input control parameters as a function of output error and measured external inputs, V;\nsaid step of updating sequentially including:\nselecting the input control parameter having the largest contribution to the output error, by taking the partial derivative of the manipulated input, Y, with respect to each of the input control parameters; determining whether each of the partial derivatives is within predetermined boundaries; selecting to adjust the value of that input control parameter associated with the largest partial derivative; and\nadjusting the value of the selected input control parameter to reduce the output error, by incrementing the previous value of the control parameter by an amount proportional to the integral of the output error during a predetermined period of time, so that C(1)=C(0)+K∫εdt\nwherein C(1) is the updated parameter\nC(0) is the previous parameter\nK is a constant\nε is the output error defined by the difference between the actual and the desired controlled system output.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US3466430A",
        "US3510635A",
        "US3828171A",
        "US3891836A",
        "US4349869A",
        "US4355358A",
        "US4358822A",
        "US4368509A",
        "US4407013A",
        "US4471447A"
    ],
    "citations_ftf": [
        "US3934124A",
        "US4054780A",
        "JPS5847042B2",
        "GB1603825A",
        "US4250543A",
        "US4349868A",
        "US4368510A",
        "DE3133222C2"
    ],
    "citedby_own": [
        "US4695941A",
        "US4740886A",
        "US4742444A",
        "US4755925A",
        "US4758967A",
        "US4852053A",
        "WO1990010270A1",
        "US4956776A",
        "US4990840A",
        "US5038269A",
        "US5117375A",
        "US5117377A",
        "US5119468A",
        "US5121332A",
        "US5130920A",
        "US5394322A",
        "FR2712097A1",
        "US5428559A",
        "US5457625A",
        "US5550759A",
        "US5682309A",
        "US5777872A",
        "US5796609A",
        "US5838599A",
        "US5852817A",
        "US5892679A",
        "US5901059A",
        "US6175775B1",
        "US20040117042A1",
        "US20050172470A1",
        "US20060069541A1",
        "US20060184255A1",
        "US7796960B1",
        "US20110301724A1",
        "US8886341B1"
    ],
    "citedby_ftf": [
        "IL94626A",
        "US5479356A",
        "DE4105321A1",
        "US5446648A",
        "US5402333A",
        "JP2779736B2",
        "GB2284906B",
        "DE29610789U1",
        "DE19711484C1",
        "GB2404999B"
    ]
}