{
    "patent_link": "https://patents.google.com/patent/US5675581A/en",
    "patent_id": "US5675581A",
    "title": "Simulating user interference in a spread spectrum communication network",
    "abstract": "A method and apparatus for simulating signal interference within a communication system, such wireless or cellular communication systems. The communication system is preferably of a type in which code division multiple access (CDMA) spread spectrum communication signals are used. The method for simulating signal interference power received by a base station receiver includes estimating a first composite signal power corresponding to the sum of signal power transmitted by a first set of simulated users located in a first cell. An estimate is also made of a first normalized date rate for transmission of the composite signal. A first interference signal is then generated at a power level determined on the basis of the first composite signal power and normalized data rate. In a preferred implementation, the first interference signal power is adjusted in accordance with an average power fluctuation arising as a consequence of closed loop power control. Further, a second composite signal power is determined by estimating the sum of signal power transmitted by a second set of simulated users located outside of the first cell. A similar estimate is made of a second normalized data rate at which this signal power is transmitted by the second set of simulated users. This allows the generation of a second interference signal based on the second composite signal power and normalized data rate. Generation of the first interference signal will typically involve synthesis of electrical noise over a predetermined frequency band. The power of the electrical noise is then adjusted in accordance with the product of the first composite signal power and the first normalized data rate.",
    "inventors": [
        "Samir S. Soliman"
    ],
    "assignee": "Qualcomm Inc",
    "classifications": [
        "H04W52/343",
        "H04B1/7105",
        "H04B17/3912",
        "H04W16/10",
        "H04W52/18"
    ],
    "claims": "\n1. A method for simulating interfering signals useful for simulating interference in a communication system in which information signals are communicated over a plurality of communication channels, comprising the steps of:\nestablishing a first set of simulated users disposed within a first region of said communication system which comprises a desired number of users transmitting signals;\ndetermining a first composite signal power corresponding to a sum of signal power for signals transmitted by said first set of simulated users;\ndetermining a first normalized data rate for said signals transmitted by said first set of simulated users; and\ngenerating a first interference signal having a signal power based on said first composite signal power and first normalized data rate.\n2. The method of claim 1 further comprising the steps of:\nestablishing a second set of simulated users disposed within a second region of said communication system which comprises a second desired number of users transmitting signals;\ndetermining a second composite signal power corresponding to a sum of signal power for signals transmitted by said second set of simulated users;\ndetermining a second normalized data rate for said signals transmitted by said second set of simulated users; and\nmodifying said first interference signal in response to said second composite signal power and second normalized data rate.\n3. The method of claim 1 wherein said step of generating a first interference signal comprises the steps of:\ngenerating electrical noise over a predetermined frequency band;\nforming a product between said first composite signal power and first normalized data rate; and\nadjusting a power level of said electrical noise in response to a value of said product.\n4. The method of claim 1 wherein said step of determining a first composite signal power comprises the steps of:\ndetermining a number real users physically present in said first region;\ndetermining an equivalent number of users to be simulated within said first region by subtracting said number of real users from said first set of simulated users in said first set;\ndetermining a nominal first signal power based on said equivalent number of users; and\nproducing variations in said nominal first signal power using a random variable function.\n5. The method of claim 1 wherein said step of determining a first normalized data rate comprises the step of establishing a set of data rates for said first set of simulated users.\n6. The method of claim 1 wherein said step of determining a first composite signal power comprises the steps of:\nrepresenting variations in said signal power for said signals transmitted by said first set of simulated users as a Gaussian random variable; and\nforming a product of a nominal signal power for said first set of simulated users and said Gaussian random variable.\n7. The method of claim 1 wherein said step of establishing a first set of simulated users comprises the steps of:\ndetermining a desired overall capacity for said communication system;\ndetermining average individual user communication traffic load or data transfer volume expected for users in said first region; and\nselecting an average usage load in terms of number of users supportable based on expected user communication traffic in said first region.\n8. The method of claim 1 further comprising the step of transmitting at least a second interference signal which corresponds to simulated transmissions originating from regions other than said first region.\n9. In a wireless communication system in which users communicate information signals between one another using at least one base station that includes a base station receiver and multiple access communication signals, a method for simulating interfering signals useful for simulating interference power received by said base station receiver, comprising the steps of:\ndetermining a first composite signal power corresponding to a sum of signal power for signals transmitted by a predetermined first set of simulated users serviced by said first base station;\ndetermining a first normalized data rate for said signals transmitted by said first set of simulated users; and\ngenerating a first interference signal having a signal power based on said first composite signal power and first normalized data rate.\n10. The method of claim 9 further comprising the step of providing said first interference signal as an input to said base station receiver.\n11. The method of claim 9 wherein said step of generating a first interference signal comprises the steps of:\ngenerating electronic noise over a predetermined frequency band; and\nadjusting power of said electronic noise in accordance with the product of said first composite signal power and said first normalized data rate.\n12. The method of claim 9 wherein said users communicate using code division multiple access (CDMA) spread spectrum communication signals, and said base station and users are located in a first cell within the communication system, wherein the step of determining a first composite signal power comprises the steps of:\ndetermining an equivalent number of users to be simulated which corresponds to a difference between a predetermined total number of users in said first set and a number of real users actually present within said first cell; and\ndetermining a composite signal power by estimating a sum of signal power which is transmitted by said equivalent number of simulated users.\n13. The method of claim 12 wherein the step of determining a first normalized data rate comprises the step of determining a first normalized data rate at which said signal power is transmitted by said equivalent number of simulated remote users.\n14. A method of operating a wireless communication system having a plurality of cells in which remote users communicate information signals using at least one base station and code division multiple access (CDMA) spread spectrum communication signals, where one base station is located in a first cell and has a base station receiver, comprising the steps of:\nmonitoring the number of said users currently communicating within said first cell;\ndetermining a level of signal interference power received by said base station receiver when a predetermined number of users are communicating within said first cell;\ndetermining an equivalent number of simulated users corresponding to a difference between said predetermined number and said number of users currently communicating within said first cell; and\nproviding a first interference signal to said base station receiver wherein power of said interference signal depends upon said equivalent number of simulated users.\n15. The method of claim 14 wherein said step of providing a first interference signal comprises the steps of:\nestablishing a composite signal power by estimating a composite signal power associated with said equivalent number of simulated users; and\nestablishing a normalized data rate of said composite signal power.\n16. The method of claim 4 wherein said nominal signal power corresponds to signal power generated in response to an average simulated user voice activity factor.\n17. A system for simulating interfering signals useful for simulating interference between communication channels in a communication system in which users communicate information signals with other users over a plurality of such communication channels, comprising:\nmeans for providing an electronic noise signal;\ncontroller means for generating a noise intensity control signal based on a determination of signal power transmitted by simulated users located within a first region of said communication system; and\nmeans for adjusting the power of said noise signal in response to said noise intensity control signal.\n18. The system of claim 17 wherein said controller means further comprises means for determining a first normalized data rate at which said signal power would be transmitted by said simulated users, and said controller means is configured to additionally base said noise intensity control signal generation in part on this determination.\n19. The system of claim 17 wherein said controller means comprises means for determining signal power transmitted by other simulated users located elsewhere within said communication system, and said controller means is configured to additionally base said noise intensity control signal generation in part on said signal power transmitted by said other simulated users.\n20. The system of claim 19 further comprising means for transmitting a second interference signal in order to simulate transmissions made from regions other than said first region.\n21. The system of claim 17 wherein said communication system comprises a wireless communication system in which remote users are located within a plurality of cells and communicate information signals to at least one base station which has a receiver and is located in a first cell, using code division multiple access (CDMA) spread spectrum communication signals.\n22. The system of claim 17 wherein said means for providing electronic noise comprises means for producing noise with a relatively uniform spectral density over a predetermined bandwidth.\n23. The system of claim 17 wherein said controller means is configured to generate said noise intensity control signal using random Gaussian-controlled variables generated at preselected rates.\n24. The system of claim 23 wherein said controller means comprises:\nfirst means for generating a first binary sequence corresponding to a Gaussian random variable at one preselected rate; and\nmeans for filtering said first binary sequence based on an estimated correlation time of data signals carried by said transmitted signal power.\n25. The system of claim 23 wherein said controller means comprises:\nsecond means for generating a second binary sequence corresponding to a Gaussian random variable at a second preselected rate; and\nmeans for filtering said second binary sequence based on an average power fluctuation.\n26. A system for providing signals for simulating signal interference power received by a base station in a cellular communication system in which users within a plurality of cells communicate information signals between one another using at least one base station in a first cell that has a base station receiver, comprising:\nmeans for providing an electrical noise signal;\ncontroller means for generating a noise intensity control signal based on a determination of a first composite signal power transmitted by a first set of simulated users serviced by said base station; and\nmeans for adjusting power of said electrical noise signal in accordance with said noise intensity control signal.\n27. The system of claim 26 wherein said first set of simulated users are located within said first cell.\n28. The system of claim 26 further comprising:\nmeans for determining a second composite signal power by determining a sum of signal power transmitted by a second set of simulated users serviced by other base stations;\nmeans for determining a second normalized data rate at which said signal power is transmitted by said second set of simulated users; and\nmeans for generating a second interference signal based upon said second composite signal power and upon said second normalized data rate.\n29. The system of claim 28 wherein said second set of simulated users are operating within cells other than said first cell.\n30. The system of claim 26 wherein said controller means comprises a control network which generates a noise intensity control signal based on said first composite signal power and a first normalized data rate at which said signal power is transmitted, and said means for adjusting comprises a transmitter adjustment network, coupled to said noise source and control network, which adjusts said power level of said electrical noise in response to said noise intensity control signal.\n31. The system of claim 30 wherein said controller means comprises an electronic processor element that determines said composite signal power.\n32. The system of claim 30 wherein said controller means further comprises an electronic processor element that determines a second composite signal power which is a sum of signal power which is transmitted by a second set of simulated users not located in said first cell, and said transmitter adjustment network also operates to generate a second interference signal based on said second composite signal power and a second normalized data rate.\n33. Apparatus for generating an interference signal for use in simulating signal interference between communication channels in a communication system in which information signals are communicated between users over a plurality of communication channels, comprising:\nmeans for determining a first composite signal power corresponding to a sum of signal power for signals transmitted by a first set of a desired number of simulated users disposed within a first region of said communication system;\nmeans for determining a first normalized data rate for said signals transmitted by said first set of simulated users; and\nmeans for generating a first interference signal with a signal power based on said first composite signal power and first normalized data rate.\n34. The apparatus of claim 33 further comprising:\nmeans for determining a second composite signal power corresponding to a sum of signal power for signals transmitted by a second set of simulated users;\nmeans for determining a second normalized data rate for said signals transmitted by said second set of simulated users; and\nmeans for modifying said first interference signal in response to said second composite signal power and second normalized data rate.\n35. The apparatus of claim 33 wherein said means for generating a first interference signal comprises:\nan electrical noise source operating over a predetermined frequency band;\nmeans for forming a product between said first composite signal power and first normalized data rate; and\nmeans for adjusting the power level of said electrical noise in response to a value of said product.\n36. The apparatus of claim 33 wherein said means for determining a first composite signal power comprises:\nmeans for determining a number of real users deployed in said first region;\nmeans for determining an equivalent number of users to be simulated within said first region by subtracting said number of real users from said first set of simulated users in said first set;\nmeans for determining a nominal first signal power based on said equivalent number of users; and\nmeans for producing variations in said nominal first signal power using a random variable function.\n37. Apparatus for generating an interference signal for use in simulating signal interference between communication channels in a communication system in which information signals are communicated between users over a plurality of communication channels, comprising:\na power selector which outputs a first composite signal power corresponding to a sum of signal power for signals transmitted by a first set of a desired number of simulated users disposed within said communication system;\na data rate generator configured to output a first normalized data rate for said signals transmitted by said first set of simulated users; and\na first interference signal generator coupled to said power selector and said data rate generator which produces a signal with a signal power based on said first composite signal power and first normalized data rate.\n38. The apparatus of claim 37 wherein said first interference signal generator comprises:\nat least one electrical noise signal generator having an output power intensity that is adjustable in response to a control signal input; and\nat least one noise intensity controller having a control signal output coupled to the control input of said noise source generator and inputs coupled to said power selector and data rate generator, with said control signal having a value that varies in response to changes in said signal power and data rate for simulated users.\n39. The apparatus of claim 38 further comprising at least a second power selector which outputs a second composite signal power corresponding to a sum of signal power for signals transmitted by a second set of a desired number of simulated users disposed within said communication system, and said noise intensity controller is configured to also receive input from said second power selector and base signal generation in part on said signal power which is transmitted by said other simulated users.\n40. The apparatus of claim 39 wherein said second set of users are located in a region different from said first set of users.\n41. The apparatus of claim 37 wherein said communication system is a cellular communication system in which users within a plurality of cells communicate information signals between one another using at least one base station included in a first of said cells and having a base station receiver.\n42. The apparatus of claim 37 wherein said communication system comprises a wireless telephone/data communication system in which remote users are located within a plurality of cells and communicate information signals to at least one base station which has a receiver and is located in a first cell, using code division multiple access (CDMA) spread spectrum communication signals.\n43. The apparatus of claim 37 wherein said power and signal rate are generated using random Gaussian-controlled variables generated at preselected rates.\n44. The apparatus of claim 38 wherein said noise intensity controller comprises:\nfirst binary sequence generator producing a Gaussian random variable at one preselected rate; and\nfirst sequence filter connected to receive and filter said first binary sequence based on an estimated correlation time of data signals carried by said transmitted signal power.\n45. The apparatus of claim 38 wherein said noise intensity controller comprises:\nsecond binary sequence generator producing a Gaussian random variable at a second preselected rate; and\nsecond sequence filter connected to receive and filter said second binary sequence based on an average power fluctuation.\n46. The method of claim 1 further comprising transferring said interference signal into said communication system.\n47. The system of claim 17 further comprising means for transmitting said electronic noise signal after being adjusted to said communication system.\n48. The system of claim 26 further comprising means for providing said electronic noise signal as an input to said base station receiver.\n49. The apparatus of claim 33 further comprising means for transmitting said interference signal on channels in said communication system.\n50. The apparatus of claim 37 further comprising means for transmitting said interference signal on channels in said communication system.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3806809A",
        "US4317214A",
        "US5220680A",
        "US5233628A",
        "US5596570A"
    ],
    "citations_ftf": [
        "JP2674404B2"
    ],
    "citedby_own": [
        "US5862453A",
        "US5974362A",
        "US5973638A",
        "US6034952A",
        "WO2000026589A1",
        "EP1039689A2",
        "WO2000079718A2",
        "US6236363B1",
        "US6246389B1",
        "US20010012317A1",
        "US6298242B1",
        "US20020027946A1",
        "US6405043B1",
        "US6463295B1",
        "US6487191B1",
        "US20020176384A1",
        "US6600914B2",
        "US20030156549A1",
        "US6615024B1",
        "US20030236089A1",
        "US20030236080A1",
        "US20040022207A1",
        "US6690747B2",
        "US20040066744A1",
        "US6744809B2",
        "US6775646B1",
        "US20040166862A1",
        "US20040180695A1",
        "US6795409B1",
        "US6801516B1",
        "US6816709B2",
        "US6816473B2",
        "US6839573B1",
        "US6882727B1",
        "US6885694B1",
        "WO2005053191A1",
        "US20050271071A1",
        "US6985466B1",
        "US20060046636A1",
        "US20060082494A1",
        "US7035346B1",
        "US7035661B1",
        "US7062294B1",
        "US20060159031A1",
        "US20060211427A1",
        "US20060291549A1",
        "US20070047626A1",
        "US7190688B1",
        "GB2437345A",
        "US7299071B1",
        "US20070270175A1",
        "US20070281728A1",
        "US20080205369A1",
        "US20080280566A1",
        "US20080297093A1",
        "US20090121749A1",
        "US7706332B2",
        "US7715461B2",
        "WO2010147767A1",
        "US7903613B2",
        "US7929498B2",
        "US20120069942A1",
        "US20120088506A1",
        "US20120109719A1",
        "WO2012107600A1",
        "US20130238292A1",
        "US8870791B2",
        "WO2015124422A1",
        "US9420479B2",
        "CN114389719A"
    ],
    "citedby_ftf": [
        "US7911993B2",
        "US8537656B2",
        "US6917581B2",
        "GB2386038A",
        "TWI364920B",
        "CN101483042B"
    ]
}