{
    "patent_link": "https://patents.google.com/patent/US5619709A/en",
    "patent_id": "US5619709A",
    "title": "System and method of context vector generation and retrieval",
    "abstract": "A system and method for generating context vectors for use in storage and retrieval of documents and other information items. Context vectors represent conceptual relationships among information items by quantitative means. A neural network operates on a training corpus of records to develop relationship-based context vectors based on word proximity and co-importance using a technique of \"windowed co-occurrence\". Relationships among context vectors are deterministic, so that a context vector set has one logical solution, although it may have a plurality of physical solutions. No human knowledge, thesaurus, synonym list, knowledge base, or conceptual hierarchy, is required. Summary vectors of records may be clustered to reduce searching time, by forming a tree of clustered nodes. Once the context vectors are determined, records may be retrieved using a query interface that allows a user to specify content terms, Boolean terms, and/or document feedback. The present invention further facilitates visualization of textual information by translating context vectors into visual and graphical representations. Thus, a user can explore visual representations of meaning, and can apply human visual pattern recognition skills to document searches.",
    "inventors": [
        "William R. Caid",
        "Pu Oing"
    ],
    "assignee": "Fair Isaac Corp",
    "classifications": [
        "G06F16/58",
        "G06F16/3347",
        "G06F16/338",
        "Y10S707/99932",
        "Y10S707/99935"
    ],
    "claims": "\n1. In a computer having a processor and storage, a computer-implemented process of generating a set of summary vectors in a relative vector space such that for any subset of summary vectors associated with a subset of records there is a single logical relative orientation of the summary vectors that defines the relative meaning of the records, and a plurality of absolute orientations of the summary records, comprising the steps of:\n(a) providing a training set of records for processing by the processor, each record containing a plurality of information elements;\n(b) assigning to selected information elements in each record an initial context vector consisting solely of a plurality of randomly generated component data values;\n(c) for selected information elements in each record, modifying the initial context vector of the selected information element by a function of the context vectors of information elements within a selected proximity to the selected information element and a proximity constraint that varies a magnitude of the modification to the initial context vector;\n(d) for each record, determining a summary vector by combining the modified context vectors of the information elements of the record according to program instructions in the storage and executed on the processor; and\n(e) storing the determined summary vectors in the computer storage.\n2. The computer-implemented process of claim 1, further comprising the steps of:\n(f) determining whether an additional iteration is required to modify the initial context vector using a stopping criterion; and\n(g) responsive to the results of step (f), selectively repeating steps (c) through (e).\n3. The computer-implemented process of claim 1, wherein:\nthe records comprise documents; and\nthe information elements comprise words.\n4. The computer-implemented process of claim 3, further comprising the steps of:\n(a.1) removing stop-listed words from the documents;\n(a.2) marking multiple-word phrases to be treated as single words; and\n(a.3) converting words into word stems.\n5. The computer-implemented process of claim 1, wherein:\nthe records comprise documents describing medical procedures; and\nthe information elements comprise ICD[9] codes.\n6. The computer-implemented process of claim 1, wherein step (c) comprises the substeps of, for selected information elements in each record:\n(c.1) designating the selected information element as a target element;\n(c.2) defining a window comprising the target element and a plurality of neighbor information elements within the selected proximity, each neighbor information element having a position in the window relative to the target element; and\n(c.3) modifying the context vector of the target element as a function of the context vectors of the neighbor elements, the position of the neighbor elements, a frequency function determined by a number of records containing each neighbor element, and the proximity constraint.\n7. The computer-implemented process of claim 6, wherein substep (c.3) comprises the substeps of, for selected neighbor elements:\n(c.3.1) determining an error vector representing a difference between the context vector of the target element and the context vector of the neighbor element; and\n(c.3.2) applying the error vector to the context vector of the target element.\n8. The computer-implemented process of claim 7, further comprising the substep of, for selected neighbor elements, adjusting the magnitude of the error vector according to the relative proximity of the neighbor element to the target element.\n9. The computer-implemented process of claim 7, further comprising the substep of, for selected neighbor elements, adjusting the magnitude of the error vector according to a function dependent on the relative proximity of the neighbor element to the target element.\n10. The computer-implemented process of claim 6, further comprising the substep of, for selected neighbor elements, determining the proximity constraint according to relative co-importance of the target element and the neighbor element.\n11. The computer-implemented process of claim 10, further comprising the substep of, for selected neighbor elements, determining the relative co-importance according to the relative importance of the target element and the relative importance of the neighbor element.\n12. The computer-implemented process of claim 11, further comprising the substeps of:\nfor the target element, determining the relative importance inversely according to the frequency of occurrence of the target element in the training set; and\nfor selected neighbor elements, determining the relative importance inversely according to the frequency of occurrence of the target element in the training set.\n13. The computer-implemented process of claim 11, further comprising the substeps of:\nfor the target element, determining the relative importance by the equation: ##EQU9## wherein: B represents a predefined lower bound;\nNDj represents the number of records containing the target element; and\nTND represents the total number of records; and\nfor selected neighbor elements, determining the relative importance by the equation: ##EQU10## wherein: B represents a predefined lower bound;\nNDj represents the number of records containing the neighbor element; and\nTND represents the total number of records.\n14. The computer-implemented process of claim 1, wherein step (d) comprises adding the context vectors of the information elements of the record.\n15. The computer-implemented process of claim 1, wherein step (d) comprises the substeps of:\n(d.1) for a selected information element, generating a weight depending inversely on the frequency of occurrence of the information element in the training set of records;\n(d.2) for a selected information element, applying the weight to the context vector to generate an adjusted context vector; and\n(d.3) adding the adjusted context vectors of the information elements of the record.\n16. The computer-implemented process of claim 1, further comprising the step of normalizing the summary vector for each record.\n17. The computer-implemented process of claim 1, wherein step (e) comprises storing the determined summary vectors using convergent k-means clustering.\n18. The computer-implemented process of claim 17, wherein the step of storing using convergent k-means clustering comprises the substeps of:\n(e.1) initially partitioning the summary vectors into a plurality of clusters, each cluster containing at least one summary vector;\n(e.2) determining a centroid vector for each cluster;\n(e.3) for each summary vector, performing the steps of:\n(e.3.1) determining the distance between the summary vector and each centroid vector;\n(e.3.2) determining which centroid vector has the smallest distance to the summary vector;\n(e.3.3) responsive to the determined centroid vector not being associated with the cluster containing the summary vector, adjusting the contents of the clusters so that the cluster associated with the determined centroid contains the summary vector;\n(e.4) adjusting the centroid vectors for the clusters that have been adjusted; and\n(e.5) responsive to a stopping criterion not having been achieved, repeating steps (e.1) through (e.5).\n19. The computer-implemented process of claim 1, wherein step (e) comprises storing the determined summary vectors using Kohonen self-organization with conscience.\n20. The computer-implemented process of claim 1, further comprising the steps of:\naccepting a query from a user containing at least one query information element;\ndetermining a query context vector as a function of context vectors for each of the query information elements;\ncomparing the query context vector with the summary vectors; and\naccumulating a list of summary vectors ranked according to the results the comparing step.\n21. The computer-implemented process of claim 20, further comprising the step of retrieving a subset of summary vectors according to the results of the comparing step.\n22. The computer-implemented process of claim 20, wherein the comparing step comprises the substep of performing a dot product operation with the query context vector and the summary vectors.\n23. The computer-implemented process of claim 20, further comprising the steps of:\naccepting a signal from the user indicating which summary vectors are most relevant;\ndetermining a revised query context vector based on the accepted signal; and\nrepeating the comparing and accumulating steps.\n24. A system for generating a set of summary vectors, comprising:\na storage device containing a training set of records, each record containing a plurality of information elements;\nan initial context vector generator, coupled to the storage device, for assigning to selected information elements in each record an initial context vector comprising solely a plurality of randomly generated component data values;\nan iterative training device, coupled to the storage device, for modifying the initial context vector of the selected information elements by a function of the context vectors of information elements within a selected proximity to the selected information element and a proximity constraint that varies a magnitude of the modification to the initial context vector;\na vector combiner, coupled to the storage device, for combining the context vectors of the information elements of each record to determine a summary vector for the record and storing the determined summary vectors in the storage device.\n25. The system of claim 24, wherein:\nthe records comprise documents; and\nthe information elements comprise words.\n26. The system of claim 25, further comprising a preprocessor, coupled to the storage device, for removing stop-listed words from the documents, marking multiple-word phrases to be treated as single words, and converting words into word stems.\n27. The system of claim 24, wherein the iterative training device comprises:\na function providing a movable window that iteratively selects a target element and a plurality of neighbor elements proximate to the target elements;\na proximity determiner that determines a proximity of each neighbor element to the target element;\na co-importance determiner that determines the relative importance of the target element and each of the neighbor elements in the window; and\na context vector modifier for modifying the context vector for the target element responsive to the results of the proximity determiner and the co-importance determiner for each neighbor element.\n28. The system of claim 24, further comprising:\nan input device for accepting a query from a user;\na query context vector determiner, coupled to the input device, for determining a query context vector;\na comparator, coupled to the query context vector determiner, for comparing the query context vector with the context vectors of the records in the corpus; and\na list generator, coupled to the comparator, for accumulating a list of records in the corpus ranked according to the results of the comparator.\n29. A computer-implemented process of generating a dictionary of information elements each associated with a context vector for a database of records, each record containing at least one information element, each information element having a determinate proximity to other information elements, comprising the steps of:\n(a) selecting a plurality of information elements for including in the dictionary;\n(b) assigning to the selected information elements an initial context vector consisting solely of a plurality of randomly generated component data values;\n(c) for each selected information element being a target information element, iteratively modifying its context vector by the context vectors of neighbor information elements as a function of the proximity of the neighbor information elements to the target information element, the modified context vectors of the selected information elements forming the dictionary of context vectors.\n30. The computer-implemented process of claim 29, wherein modifying the context vector of a target information element further comprises:\n(c.1) for each neighbor information element, modifying the context vector of the target information element by a function of:\ni) an error vector being the difference between the context vector of the target information element and the context vector of the neighbor information element; and,\nii) a proximity constraint being a function of the relative co-importance of the target information element and the neighbor information element in the database of records.\n31. The computer-implemented process of claim 30, further comprising determining the relative co-importance according to the relative importance of the target information element and the relative importance of the neighbor information element.\n32. The computer-implemented process of claim 31, wherein determining the relative co-importance comprises:\ndetermining the relative importance of the target information element, inversely according to the frequency of occurrence of the target information element in the training set of records; and,\ndetermining the relative importance of the neighbor information element inversely according to the frequency of occurrence of the neighbor information element in the training set.\n33. The computer-implemented process of claim 32, further comprising the substeps of:\ndetermining the relative importance of the target information element by the equation: ##EQU11## wherein: B represents a predefined lower bound;\nNDj represents the number of records containing the target information element; and\nTND represents the total number of records; and,\ndetermining the relative importance of the neighbor information element by the equation: ##EQU12## wherein: B represents a predefined lower bound;\nNDj represents the number of records containing the neighbor element; and,\nTND represents the total number of records.\n34. The computer-implemented process of claim 29, further comprising::\n(d) for at least one record in the database:\n(d.1) for each information element in the record that matches an information element in the dictionary, obtaining a modified context vector associated with the matching information element in the dictionary as the context vector for the information element; and,\n(d.2) summing the obtained context vectors to produce a summary vector for the record.\n35. The computer-implemented process of claim 29, wherein a proximity constraint varies a magnitude of the modification to the context vector of the target information element as a function of both the frequency of occurrence of the target information element and the frequency of the occurrence of each neighbor information element.\n36. The computer implemented process of claim 29, wherein the proximity between information elements is a quantifiable value based on at least one of:\na distance between the information elements;\nan orientation of an information element with respect to another information element;\na frequency of occurrence of an information element relative to a frequency of occurrence another information element; and\na temporal relationship between two or more information elements.\n37. In a computer system including a storage device containing a plurality of records, each record containing a plurality of information elements, a computer readable memory for configuring and controlling a processor in the computer system to generate a dictionary of context vectors, the computer readable memory comprising:\nan initial context vector generator, coupled to the storage device, for assigning to selected information elements in each record an initial context vector comprising solely of a plurality of randomly generated component data values; and,\nan iterative training device, coupled to the storage device, for iteratively modifying the context vector of each selected information element, being a target information element, by the context vectors of neighbor information elements as a function of the proximity of the neighbor information element to the target information element, the modified context vectors of the selected information elements forming the dictionary of context vectors.\n38. The computer readable memory of claim 37, wherein a proximity constraint varies a magnitude of the modification to the context vector of the target information element as a function of both the frequency of occurrence of the target information element and the frequency of the occurrence of each neighbor information element.\n39. The computer readable memory of claim 37, further comprising:\na vector combiner, coupled to the storage device, for combining the context vectors of the information elements of each record to determine a summary vector for the record, and for storing the determined summary vector of each record in the storage device.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4730259A",
        "US4949250A",
        "US5008812A",
        "US5043867A",
        "US5113521A",
        "US5197138A",
        "US5301105A",
        "US5317507A",
        "US5325298A"
    ],
    "citations_ftf": [
        "JPH03129472A",
        "US5488725A",
        "US5442778A",
        "US5619709A"
    ],
    "citedby_own": [
        "WO1997034242A1",
        "US5717914A",
        "US5778362A",
        "US5781879A",
        "US5781898A",
        "US5794178A",
        "US5812998A",
        "US5819258A",
        "US5835758A",
        "US5845049A",
        "US5852822A",
        "US5852820A",
        "US5857179A",
        "US5864855A",
        "US5873056A",
        "US5892960A",
        "WO1999019816A1",
        "US5905981A",
        "US5915250A",
        "US5926812A",
        "US5930787A",
        "US5930784A",
        "US5943669A",
        "US5960430A",
        "US5963954A",
        "US5966703A",
        "US5974412A",
        "US5973690A",
        "GB2336696A",
        "US5983216A",
        "US5987470A",
        "US5987446A",
        "US5991755A",
        "US5990880A",
        "US5995962A",
        "WO1999062007A1",
        "US5999927A",
        "WO1999066378A2",
        "EP0967557A2",
        "US6038557A",
        "EP1006458A1",
        "US6076082A",
        "US6076051A",
        "EP1008019A1",
        "US6078913A",
        "US6078878A",
        "US6101515A",
        "US6101491A",
        "WO2000046701A1",
        "WO2000051026A1",
        "US6128613A",
        "US6131091A",
        "US6134532A",
        "US6138116A",
        "US6151595A",
        "WO2000079433A1",
        "US6173275B1",
        "US6175828B1",
        "US6189002B1",
        "US6191792B1",
        "US6212509B1",
        "US6216129B1",
        "EP1090362A1",
        "US6226638B1",
        "US6253169B1",
        "US6269368B1",
        "US6298174B1",
        "US20010027408A1",
        "US6317707B1",
        "US6327574B1",
        "US6336112B2",
        "US6338060B1",
        "WO2002008953A1",
        "WO2002008950A2",
        "WO2002017128A1",
        "US6356864B1",
        "US20020049792A1",
        "US6389418B1",
        "US6393425B1",
        "WO2002041557A2",
        "US20020062481A1",
        "US6405190B1",
        "US6411962B1",
        "WO2002054265A1",
        "US6430539B1",
        "US6434542B1",
        "US20020123928A1",
        "US6460034B1",
        "US6466946B1",
        "US6466211B1",
        "US20020161747A1",
        "WO2002091215A1",
        "US20020174005A1",
        "US20020178445A1",
        "US20020184206A1",
        "US20020194176A1",
        "US20020194058A1",
        "US20020194158A1",
        "US20020198885A1",
        "US6502091B1",
        "US20030004996A1",
        "US6510406B1",
        "US20030023422A1",
        "US6515683B1",
        "US20030028512A1",
        "US20030033138A1",
        "US20030033265A1",
        "US20030050798A1",
        "US6539115B2",
        "US20030061242A1",
        "US20030061023A1",
        "US20030061025A1",
        "EP1302864A1",
        "US20030074368A1",
        "US6564198B1",
        "US6567797B1",
        "US20030097375A1",
        "US20030101089A1",
        "US6578032B1",
        "US6581049B1",
        "US20030125959A1",
        "US20030131081A1",
        "US6598054B2",
        "WO2003060766A1",
        "US20030145002A1",
        "US20030160817A1",
        "WO2003079221A1",
        "US6629097B1",
        "US6633868B1",
        "US6643639B2",
        "US20030217066A1",
        "US6654725B1",
        "WO2003098396A2",
        "US20030221171A1",
        "US20040010485A1",
        "US20040029085A1",
        "US6697793B2",
        "US6701294B1",
        "US6701311B2",
        "US20040064303A1",
        "US6717728B2",
        "US6721728B2",
        "US6721795B1",
        "US20040088156A1",
        "US6735578B2",
        "US6738759B1",
        "US6741981B2",
        "US20040103116A1",
        "US20040103070A1",
        "US6745194B2",
        "US6748398B2",
        "US20040117449A1",
        "US20040117340A1",
        "US6757646B2",
        "US20040128277A1",
        "US6760714B1",
        "US20040133574A1",
        "US6766316B2",
        "US20040143580A1",
        "US20040158562A1",
        "US20040158580A1",
        "US20040158561A1",
        "US6778995B1",
        "US6778193B2",
        "US6785676B2",
        "US20040172267A1",
        "DE10307372A1",
        "US20040193582A1",
        "US6810376B1",
        "US20040215663A1",
        "GB2401225A",
        "US20040221235A1",
        "US6816857B1",
        "US6823333B2",
        "US20040236737A1",
        "US20040243565A1",
        "US20040243581A1",
        "US6839680B1",
        "US6842876B2",
        "WO2005008519A1",
        "US6853998B2",
        "US6862710B1",
        "US6868389B1",
        "US6873990B2",
        "US6882998B1",
        "US20050094805A1",
        "US20050099637A1",
        "US20050102251A1",
        "US6898586B1",
        "US6898530B1",
        "US6901392B1",
        "US6904423B1",
        "US20050131721A1",
        "US20050137854A1",
        "US6912250B1",
        "US6915254B1",
        "US20050149351A1",
        "US20050171948A1",
        "US6941321B2",
        "US6944607B1",
        "US6944619B2",
        "US20050216516A1",
        "US20050228783A1",
        "US20050246330A1",
        "US6968565B1",
        "US6970881B1",
        "US20050267871A1",
        "US20050267869A1",
        "US20050273839A1",
        "EP1612701A2",
        "US6990238B1",
        "US20060020591A1",
        "US6993532B1",
        "US20060026013A1",
        "US7016540B1",
        "US7016872B1",
        "US20060074907A1",
        "US7027974B1",
        "US20060080314A1",
        "US20060089927A1",
        "US20060106798A1",
        "US7062510B1",
        "US7062572B1",
        "US20060129843A1",
        "US7106329B1",
        "US20060206574A1",
        "US7113958B1",
        "US20060235843A1",
        "US20060248068A1",
        "US20060253781A1",
        "US20060265666A1",
        "US7150030B1",
        "US7152031B1",
        "US20060294084A1",
        "US7158983B2",
        "US20070011154A1",
        "US20070016559A1",
        "US20070016399A1",
        "US20070027902A1",
        "US7177922B1",
        "US7191150B1",
        "US20070061319A1",
        "US7194483B1",
        "US7194477B1",
        "US7197451B1",
        "US20070073669A1",
        "US20070073531A1",
        "US20070073678A1",
        "US7213205B1",
        "US7216088B1",
        "US20070106651A1",
        "US20070106491A1",
        "US20070124301A1",
        "US20070130239A1",
        "US20070136288A1",
        "US20070136408A1",
        "US20070136276A1",
        "US7240355B1",
        "US20070156669A1",
        "US20070162272A1",
        "US20070192272A1",
        "US20070203908A1",
        "US20070203940A1",
        "US20070206918A1",
        "US20070226211A1",
        "US20070239431A1",
        "US20070239707A1",
        "US20070255686A1",
        "WO2004088475A3",
        "US20070276830A1",
        "US20070282811A1",
        "US20070282824A1",
        "US20070299797A1",
        "US20070300173A1",
        "US20080005651A1",
        "US20080027915A1",
        "US20080040660A1",
        "US20080052268A1",
        "US20080059451A1",
        "US20080065603A1",
        "US20080091727A1",
        "US20080091421A1",
        "US20080091672A1",
        "US20080104032A1",
        "US20080109284A1",
        "US7376618B1",
        "US20080133516A1",
        "US20080133213A1",
        "US20080140643A1",
        "US7389225B1",
        "US7392262B1",
        "US20080154902A1",
        "US20080154848A1",
        "US20080154886A1",
        "US20080162554A1",
        "US7398201B2",
        "US20080172380A1",
        "US20080177717A1",
        "US7406456B2",
        "US20080201655A1",
        "US20080215585A1",
        "US20080215367A1",
        "US20080235218A1",
        "US20080256108A1",
        "US20080256329A1",
        "US20080262931A1",
        "US20080300833A1",
        "US20080306930A1",
        "US20080313184A1",
        "US20080313633A1",
        "US20080313617A1",
        "US20080313213A1",
        "US20080320021A1",
        "WO2009002526A1",
        "WO2009002525A1",
        "US20090006304A1",
        "US20090013053A1",
        "US20090019020A1",
        "US20090037431A1",
        "US7500258B1",
        "US20090063537A1",
        "US20090070140A1",
        "US7529743B1",
        "US20090119281A1",
        "US7536413B1",
        "US20090150388A1",
        "US20090177656A1",
        "US20090193022A1",
        "US20090195796A1",
        "US20090210218A1",
        "US20090210902A1",
        "US20090216693A1",
        "US20090228296A1",
        "US20090234718A1",
        "US20090240680A1",
        "US20090254540A1",
        "US7603349B1",
        "US20090265338A1",
        "US7610185B1",
        "US20090282012A1",
        "US7624274B1",
        "US7627588B1",
        "US20090300008A1",
        "US20090300046A1",
        "US20090300006A1",
        "US20090307202A1",
        "US20100033485A1",
        "US20100039431A1",
        "US20100049770A1",
        "US20100049708A1",
        "US20100057566A1",
        "US7689536B1",
        "US7690013B1",
        "US20100083105A1",
        "US20100082333A1",
        "US20100094840A1",
        "US20100094879A1",
        "US20100122312A1",
        "US7725475B1",
        "US20100138217A1",
        "US7734627B1",
        "US20100169314A1",
        "US20100169315A1",
        "US20100169337A1",
        "US20100169299A1",
        "US7778519B2",
        "US7788358B2",
        "US7788681B1",
        "US20100223261A1",
        "US20100250479A1",
        "US20100262620A1",
        "US20100268600A1",
        "US7822621B1",
        "USRE41899E1",
        "US7831442B1",
        "US7856441B1",
        "US20110029530A1",
        "US20110035403A1",
        "US20110047111A1",
        "US20110047156A1",
        "US20110066497A1",
        "US20110078098A1",
        "US20110106823A1",
        "US20110103689A1",
        "US20110107271A1",
        "US20110103688A1",
        "US20110119243A1",
        "US7949565B1",
        "US20110125767A1",
        "US20110125751A1",
        "US7996208B2",
        "US20110196665A1",
        "US20110202334A1",
        "US20110202848A1",
        "US20110202332A1",
        "US20110221774A1",
        "US8032714B2",
        "US8051096B1",
        "US8065227B1",
        "US20120035912A1",
        "US8126826B2",
        "US20120088219A1",
        "US20120095997A1",
        "US8166039B1",
        "US8175989B1",
        "US8190513B2",
        "US20120150531A1",
        "US8229844B2",
        "US8244795B2",
        "US20120233127A1",
        "US8275661B1",
        "US20120304055A1",
        "US8326861B1",
        "US20120311139A1",
        "US8380718B2",
        "US20130145256A1",
        "US20130155068A1",
        "US8473532B1",
        "US20130166303A1",
        "US20130179439A1",
        "US8515959B2",
        "US20130262983A1",
        "US8589413B1",
        "US8594996B2",
        "US8630942B2",
        "US8645125B2",
        "US20140067847A1",
        "US8700396B1",
        "US8725739B2",
        "US20140225889A1",
        "US8838633B2",
        "US8843536B1",
        "US9116995B2",
        "US9159584B2",
        "US9165040B1",
        "US20160154844A1",
        "US9405848B2",
        "US9679304B1",
        "US9710556B2",
        "JP2017152042A",
        "US9754038B2",
        "US9760553B1",
        "US9779168B2",
        "US9779135B2",
        "US9846744B2",
        "USRE46973E1",
        "US20180322131A1",
        "US10134388B1",
        "US20190019515A1",
        "US20190121849A1",
        "US10325304B2",
        "US10360229B2",
        "CN110298402A",
        "US10445809B2",
        "US10445356B1",
        "US10452691B2",
        "US10528668B2",
        "US20200218780A1",
        "US10754897B2",
        "CN111581401A",
        "US10762298B2",
        "US10769383B2",
        "US10846483B2",
        "US10915543B2",
        "US11068546B2",
        "US11103787B1",
        "US11200379B2",
        "US11237802B1",
        "US11250212B2",
        "US11256869B2",
        "US11281993B2",
        "US11328128B2",
        "US11397776B2",
        "US20220300283A1",
        "US11480052B2",
        "US11562813B2",
        "US11761330B2",
        "WO2023175480A1"
    ],
    "citedby_ftf": [
        "JP4044971B2",
        "US6139330A",
        "US6688888B1",
        "US5863208A",
        "US5995921A",
        "JPH1049549A",
        "US6457004B1",
        "US6199080B1",
        "JP3814903B2",
        "US5924105A",
        "US6023729A",
        "US6735253B1",
        "US6209125B1",
        "US6047277A",
        "US6134344A",
        "US5907840A",
        "GB2328849B",
        "IL121431A",
        "US5865862A",
        "US6006223A",
        "US6081774A",
        "US7434172B1",
        "JP3356667B2",
        "US6353824B1",
        "US6185592B1",
        "US6442986B1",
        "US6598045B2",
        "US6101496A",
        "US9792659B2",
        "US6126448A",
        "US6398556B1",
        "US6240421B1",
        "US6243093B1",
        "US6313833B1",
        "US6480843B2",
        "US7143434B1",
        "WO2000034845A2",
        "US6981217B1",
        "US6473755B2",
        "US6564200B1",
        "US6728752B1",
        "WO2000058863A1",
        "US6326988B1",
        "US6281899B1",
        "US6701305B1",
        "US6611825B1",
        "WO2000079426A1",
        "US7058817B1",
        "US6459809B1",
        "US6897866B1",
        "US6505168B1",
        "US6636248B1",
        "SE9903112L",
        "JP3463010B2",
        "US6684255B1",
        "WO2001033477A2",
        "US10275780B1",
        "US8571975B1",
        "US7310629B1",
        "US6742023B1",
        "US6366907B1",
        "US6897867B2",
        "WO2001046838A1",
        "US6775677B1",
        "US6728701B1",
        "US6912525B1",
        "US6865600B1",
        "US6697800B1",
        "AU2001268333A1",
        "EP1299820A4",
        "JP3672234B2",
        "US7426530B1",
        "US6941513B2",
        "US6822650B1",
        "US10185936B2",
        "US7089301B1",
        "US7787696B2",
        "US7395222B1",
        "US7236932B1",
        "US8335855B2",
        "WO2002027536A1",
        "US6940509B1",
        "US6718336B1",
        "US7831467B1",
        "US7308138B2",
        "JP2002197083A",
        "WO2002052565A1",
        "US8429051B1",
        "JP4393720B2",
        "EP1374094A4",
        "US7194461B2",
        "US20020129342A1",
        "JP2002297617A",
        "US8849716B1",
        "US7278134B2",
        "US6892193B2",
        "US7689506B2",
        "US6993535B2",
        "US7334196B2",
        "WO2003005166A2",
        "US7246118B2",
        "US7266839B2",
        "US7103576B2",
        "US7680817B2",
        "US7606819B2",
        "US20040205457A1",
        "CA2466071C",
        "US7987501B2",
        "US7339992B2",
        "US7158961B1",
        "US7061490B2",
        "US6952691B2",
        "US20030157470A1",
        "US7941533B2",
        "AU2003269808A1",
        "EP1378999B1",
        "US7143085B2",
        "US7466334B1",
        "US7536433B2",
        "US7058660B2",
        "US20080058106A1",
        "US8301493B2",
        "GB2395808A",
        "GB2395806A",
        "GB2395804A",
        "GB2395807A",
        "GB2395805A",
        "US7124149B2",
        "US7505931B2",
        "US7562814B1",
        "US7458508B1",
        "US8386377B1",
        "US7686214B1",
        "US10521857B1",
        "US7854009B2",
        "US7636901B2",
        "GB2403636A",
        "US8548794B2",
        "US8175908B1",
        "US8014997B2",
        "US20050065774A1",
        "US7555441B2",
        "US8190893B2",
        "US7240049B2",
        "US7249319B1",
        "US20050171940A1",
        "US7313552B2",
        "US8296127B2",
        "US8666725B2",
        "US20050283394A1",
        "US20060041375A1",
        "FR2875988A1",
        "JP5452868B2",
        "US20060095857A1",
        "US7620628B2",
        "JP2006163894A",
        "US20060149674A1",
        "US20060161587A1",
        "US20060161543A1",
        "US20060161553A1",
        "KR100703697B1",
        "US20060200461A1",
        "US20060200464A1",
        "US20060225055A1",
        "WO2006096158A1",
        "WO2006096612A2",
        "JP2006268787A",
        "GB2424972A",
        "AU2006255181A1",
        "US8886517B2",
        "US8676563B2",
        "US8185877B1",
        "US7321885B2",
        "US7813918B2",
        "US8583926B1",
        "US7475072B1",
        "US8005821B2",
        "US10319252B2",
        "US7769707B2",
        "US7818335B2",
        "US8683314B2",
        "US7676460B2",
        "CA2609873C",
        "US7747686B2",
        "US8943080B2",
        "US9639618B2",
        "US8793490B1",
        "US8886518B1",
        "JP4156639B2",
        "US7685201B2",
        "US20080065666A1",
        "US8433556B2",
        "US9122674B1",
        "US8150822B2",
        "US8468149B1",
        "US7890521B1",
        "US7437370B1",
        "US8615389B1",
        "JP4962561B2",
        "US20080249984A1",
        "US8831928B2",
        "US8473735B1",
        "US8190422B2",
        "US8826123B2",
        "US8825466B1",
        "CA2601154C",
        "US9405792B2",
        "US8601392B2",
        "US8321682B1",
        "CA2657835C",
        "US8180754B1",
        "WO2009126785A2",
        "WO2009155281A1",
        "US8607155B2",
        "US8671069B2",
        "US8407179B2",
        "US8301619B2",
        "US9608826B2",
        "US8990064B2",
        "US20110029926A1",
        "US8400458B2",
        "US8380486B2",
        "US10417646B2",
        "US20130085769A1",
        "US8510667B2",
        "US8909950B1",
        "US9177259B1",
        "US9189129B2",
        "US11003838B2",
        "US8694303B2",
        "CA2790799C",
        "US8886515B2",
        "US10339214B2",
        "US8909643B2",
        "JP2015004996A",
        "US8942973B2",
        "US9400983B1",
        "US10261994B2",
        "US9519693B2",
        "US8918891B2",
        "US9646080B2",
        "US9152622B2",
        "US9552135B2",
        "US9419957B1",
        "US9213694B2",
        "US10148726B1",
        "US10304114B2",
        "US9836765B2",
        "US10559034B2",
        "CN106649813B",
        "US10606878B2",
        "US10671266B2",
        "US10824317B2",
        "GB2591374B",
        "WO2020033410A1",
        "AU2022258962A1"
    ]
}