{
    "patent_id": "US-11676185-B2",
    "title": "System and methods of an expense management system based upon business document analysis ",
    "assignee": "Way2Vat Ltd.",
    "publication_date": "2023-06-13",
    "patent_link": "https://patents.google.com/patent/US11676185B2/en",
    "inventors": [
        "Amos Simantov",
        "Roy Shilkrot",
        "Arnon Yaar"
    ],
    "classifications": [
        "G06Q30/04",
        "G06F16/93",
        "G06N20/00",
        "G06Q40/12",
        "G06V30/413"
    ],
    "abstract": "The disclosure herein relates to business content analysis. In particular, the disclosure relates to systems and methods of an expense management system operable to perform automatic business documents' content analysis for generating business reports associated with automated value added tax (VAT) reclaim, Travel and Expenses (T&E) management, Import/Export management and the like. The system is further operable to provide various organizational expense management aspects for the corporate finance department and the business traveler based upon stored data. Additionally, the system is configured to use a content recognition engine, configured as an enhanced OCR mechanism used for extracting tagged text from invoice images and also provides continuous learning mechanism in a structured mode allowing classification of invoice images by type, providing continual process of improvement and betterment throughout.",
    "claims": "\n1. A method for performing digital invoice content analysis in an improved manner, said method comprising the steps of:\nproviding an expense management system operable to execute on at least one computing device, said system comprising an invoice content analyzer, an invoice content generator comprising a classifier, a machine learning engine, a communication interface and a tagging mechanism;\nreceiving, via said communication interface, at least one digital source comprising at least one digital invoice;\npre-processing, by said invoice content analyzer, said at least one digital invoice;\nproviding, by said tagging mechanism, at least one textual tag associated with a an invoice entity at a location in said at least one digital invoice;\nanalyzing, by said invoice content analyzer, said at least one digital invoice;\nproducing, by said invoice content analyzer, at least one analysis result;\ngenerating, by said invoice content analyzer, at least one business report comprising said at least one analysis result; and\ncommunicating, by said communication interface, said at least one business report.\n2. The method of claim 1, wherein the step of receiving further comprises pre-processing, by said invoice content analyzer, said at least one digital invoice.\n3. The method of claim 1, wherein the step of receiving further comprises:\nanalyzing, by said invoice content analyzer, quality of said at least one digital invoice;\ngenerating, by said invoice content analyzer, at least one quality assessment of said at least one digital invoice; and\ncommunicating, by said communication interface, at least one technical response comprising said at least one quality assessment.\n4. The method of claim 3, wherein said at least one quality assessment is a numeric representation assigned, indicating the technical ability of said expense management system to extract associated information from said at least one digital invoice.\n5. The method of claim 1, wherein the invoice content generator further comprises an optical character recognition (OCR) engine, and wherein the step of pre-processing further comprising generating, by said OCR engine, a textual representation of said at least one digital invoice.\n6. The method of claim 1, further comprising the invoice content analyzer directing operation of the invoice content generator and the machine learning engine."
}