{
    "patent_link": "https://patents.google.com/patent/US20070174114A1/en",
    "patent_id": "US20070174114A1",
    "title": "Method and system for scheduling electronic advertising",
    "abstract": "A method for scheduling advertising comprises the steps of: estimating a respective fraction of delivered advertisement impressions that result in a response from a user for each of a plurality of advertising contracts, estimating a value per impression for each of the advertising contracts, and scheduling an advertising line under the contract having the highest value per impression at a next available advertising window.",
    "inventors": [
        "Michael Bigby",
        "Britton Glasser",
        "Adam Taisch",
        "Andy Atherton",
        "Harry Fung"
    ],
    "assignee": "Altaba Inc",
    "classifications": [
        "G06Q30/0246",
        "G06Q30/02",
        "G06Q30/0254",
        "G06Q30/0264",
        "G06Q30/0272"
    ],
    "claims": "\n1. A method for scheduling advertising, comprising the steps of:\nestimating a respective fraction of delivered advertisement impressions that result in a response from a user for each of a plurality of advertising contracts,\nestimating a value per impression for each of the advertising contracts, and\nscheduling an advertising line under the contract having the highest value per impression at a next available advertising window.\n2. The method of claim 1, wherein the value per impression is estimated based on a moving average representing a fraction of trials in which an impression is delivered and the user responds to the impression.\n3. The method of claim 1, wherein a number of impressions to be delivered is calculated, based on a desired number of responses and an estimate of a fraction of the impressions that elicit a response from the user.\n4. The method of claim 1, wherein a sufficiently high value per impression is initially assumed for a new advertising contract, so as to ensure that sufficient trials are performed under the new contract to form an accurate estimate of the value per impression.\n5. The method of claim 1, wherein the value per impression is estimated in near-real time.\n6. The method of claim 1, wherein a number of advertising impressions to be delivered in any given interval is determined by a number of desired responses or acquisitions yet to be obtained, a current estimate of a fraction of the impressions that elicit a response from the user, and a plurality of weights assigned to respective remaining intervals within which impression delivery under the advertising contract is to be completed.\n7. The method of claim 1, wherein, if two of the advertising contracts have substantially the same value per impression, an advertising line is scheduled under the one of the two contracts for which advertising delivery has a greater urgency.\n8. The method of claim 7, wherein a measure of urgency for each contract is based on a ratio of a remaining fraction of the total impressions to be delivered under the contract divided by a remaining fraction of the total time during which the contract is to be fulfilled.\n9. The method of claim 1, wherein the next available advertising window is a time period after which a guaranteed-delivery advertisement is scheduled.\n10. The method of claim 1, wherein the advertising is transmitted electronically to a recipient using one of the group consisting of web pages, portions of web pages, banners, buttons, pop-up windows, placement within sponsored search listings, and streaming media.\n11. The method of claim 1, wherein the step of estimating a value per impression is performed using an electronic processor.\n12. A computer readable medium encoded with computer program code, wherein, when the computer program code is executed by a processor, the processor performs a method for scheduling advertising, comprising the steps of:\nestimating a respective fraction of delivered advertisement impressions that result in a response from a user for each of a plurality of advertising contracts,\nestimating a value per impression for each of the advertising contracts, and\nscheduling an advertising line under the contract having the highest value per impression at a next available advertising window.\n13. The computer readable medium of claim 12, wherein the value per impression is estimated based on a moving average representing a fraction of trials in which an impression is delivered and the user responds to the impression.\n14. The computer readable medium of claim 12, wherein a number of impressions to be delivered is calculated, based on a desired number of responses and an estimate of a fraction of the impressions that elicit a response from the user.\n15. The computer readable medium of claim 12, wherein a sufficiently high value per impression is initially assumed for a new advertising contract, so as to ensure that sufficient trials are performed under the new contract to form an accurate estimate of the value per impression.\n16. The computer readable medium of claim 12, wherein the value per impression is estimated in near-real time.\n17. The computer readable medium of claim 12, wherein a number of advertising impressions to be delivered in any given interval is determined by a number of desired responses or acquisitions yet to be obtained, a current estimate of a fraction of the impressions that elicit a response from the user, and a plurality of weights assigned to respective remaining intervals within which impression delivery under the advertising contract is to be completed.\n18. The computer readable medium of claim 12, wherein, if two of the advertising contracts have substantially the same value per impression, an advertising line is scheduled under the one of the two contracts for which advertising delivery has a greater urgency.\n19. The computer readable medium of claim 19, wherein a measure of urgency for each contract is based on a ratio of a remaining fraction of the total impressions to be delivered under the contract divided by a remaining fraction of the total time during which the contract is to be fulfilled.\n20. The computer readable medium of claim 12, wherein the next available advertising window is a time period after which a guaranteed-delivery advertisement is scheduled.\n21. A system for scheduling advertising, comprising:\nmeans for estimating a respective fraction of delivered advertisement impressions that result in a response from a user for each of a plurality of advertising contracts,\nmeans for estimating a value per impression for each of the advertising contracts, and\nmeans for scheduling an advertising line under the contract having the highest value per impression at a next available advertising window.\n22. The system of claim 21, wherein the value per impression is estimated based on a moving average representing a fraction of trials in which an impression is delivered and the user responds to the impression.\n23. The system of claim 21, wherein a number of impressions to be delivered is calculated, based on a desired number of responses and an estimate of a fraction of the impressions that elicit a response from the user.\n24. The system of claim 21, wherein a sufficiently high value per impression is initially assumed for a new advertising contract, so as to ensure that sufficient trials are performed under the new contract to form an accurate estimate of the value per impression.\n25. The system of claim 21, wherein the value per impression is estimated in near-real time.\n26. The system of claim 21, wherein a number of advertising impressions to be delivered in any given interval is determined by a number of desired responses or acquisitions yet to be obtained, a current estimate of a fraction of the impressions that elicit a response from the user, and a plurality of weights assigned to respective remaining intervals within which impression delivery under the advertising contract is to be completed.\n27. The system of claim 21, wherein, if two of the advertising contracts have substantially the same value per impression, an advertising line is scheduled under the one of the two contracts for which advertising delivery has a greater urgency.\n28. The method of claim 27, wherein a measure of urgency for each contract is based on a ratio of a remaining fraction of the total impressions to be delivered under the contract divided by a remaining fraction of the total time during which the contract is to be fulfilled.\n29. The system of claim 21, wherein the next available advertising window is a time period after which a guaranteed-delivery advertisement is scheduled.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US5937392A",
        "US5948061A",
        "US20030110171A1",
        "US20040044571A1",
        "US7260783B1"
    ],
    "citations_ftf": [
        "AU1798401A",
        "US7174305B2",
        "US8082174B1"
    ],
    "citedby_own": [
        "US20060095281A1",
        "US20070073579A1",
        "US20070088605A1",
        "US20070219859A1",
        "US20080275753A1",
        "US20080275777A1",
        "US20090013024A1",
        "US20090063377A1",
        "US20090089151A1",
        "US20100076894A1",
        "US20100082421A1",
        "US20100082438A1",
        "WO2010045191A2",
        "US20100262455A1",
        "US20100262497A1",
        "US20110196747A1",
        "US20130085872A1",
        "US20130339126A1",
        "JP2014096110A",
        "US20140156419A1",
        "US20140180885A1",
        "US8805552B2",
        "US8806239B2",
        "US8862279B2",
        "US8890505B2",
        "US8930038B2",
        "US8965786B1",
        "US8983669B2",
        "US20150120437A1",
        "US20150213500A1",
        "US9130402B2",
        "US9129313B1",
        "US9177323B2",
        "US9203912B2",
        "US9207698B2",
        "US9225173B2",
        "US9391789B2",
        "US9392074B2",
        "US9429974B2",
        "US9449231B2",
        "US9461471B2",
        "US9465398B2",
        "US9563248B2",
        "US9569787B2",
        "US10116560B2",
        "US10282758B1",
        "US10295969B2",
        "US10311486B1",
        "US20200175535A1",
        "US10861112B2",
        "US11004160B2",
        "US11132706B1",
        "US11212566B1",
        "US11334912B1",
        "US11334911B1",
        "US11562393B1",
        "US11823236B1"
    ],
    "citedby_ftf": [
        "CN107851262A",
        "US11314831B2"
    ]
}