{
    "patent_link": "https://patents.google.com/patent/US20020139837A1/en",
    "patent_id": "US20020139837A1",
    "title": "Purchasing card transaction risk model",
    "abstract": "A method for quantifying risk of fraud associated with a purchasing card transaction includes obtaining a charge-back history associated with a consumer involved in the purchasing card transaction; and determining a risk score based on the charge-back history. In one embodiment of the invention, the step of obtaining a charge-back history includes obtaining a reason code for each charge-back included in the charge-back history.",
    "inventors": [
        "Clayton Spitz",
        "Todd Anderson",
        "Thomas Latham",
        "David Guerin",
        "Ernest Arbour"
    ],
    "assignee": "First Data Corp",
    "classifications": [
        "G06Q20/10",
        "G06Q40/00",
        "G06Q40/03",
        "G06Q40/08"
    ],
    "claims": "\n1. A method for quantifying risk of fraud associated with a purchasing card transaction, the method comprising:\nobtaining a charge-back history associated with a consumer involved in the purchasing card transaction; and\ndetermining a risk score based on the charge-back history.\n2. The method of claim 1 wherein the step of obtaining a charge-back history includes obtaining a reason code for each charge-back included in the charge-back history.\n3. The method of claim 2 further comprising weighting each charge-back included in the charge-back history based on the corresponding reason code.\n4. The method of claim 1 further comprising determining how each charge-back included in the charge-back history is associated with the purchasing card transaction, and weighting each charge-back based on the corresponding association with the purchasing card transaction.\n5. The method of claim 1 further comprising obtaining additional charge-back history associated with a machine identification number of a machine involved in the purchasing card transaction, and wherein the step of determining a risk score includes determining the risk score based on the additional charge-back history.\n6. The method of claim 1 wherein the step of determining a risk score includes comparing the charge-back history to predetermined ranges of charge-backs.\n7. The method of claim 1 wherein the step of determining a risk score is performed using a linear risk model.\n8. The method of claim 1 wherein the step of determining a risk score is performed using a regression risk model.\n9. The method of claim 1 wherein the step of determining a risk score is performed using a decision tree risk model.\n10. The method of claim 1 wherein the step of determining a risk score is performed using a neural network risk model.\n11. The method of claim 1 wherein the step of determining a risk score includes determining the risk score based on a plurality of purchasing card transaction characteristics.\n12. A method for quantifying risk of fraud associated with a purchasing card transaction, the method comprising:\nobtaining a charge-back history associated with a consumer involved in the purchasing card transaction, wherein the charge-back history includes charge-backs associated with a particular purchasing card account of the consumer, and a reason code for each charge-back;\nweighting each charge-back based on the corresponding reason code; and\ndetermining a risk score based on the weighted charge-backs.\n13. A system for quantifying risk of fraud associated with a purchasing card transaction, the system comprising:\nan authorization source for obtaining a charge-back history associated with a consumer involved in the purchasing card transaction, the authorization source including a risk model for determining a risk score based on the charge-back history.\n14. The system of claim 13 wherein the authorization source includes a database for storing a reason code for each charge-back included in the charge-back history, and a processor in communication with the database and including the risk model, wherein the risk model includes instructions for determining the risk score based on the reason codes.\n15. The system of claim 14 wherein the risk model includes instructions for weighting each charge-back included in the charge-back history based on the corresponding reason code.\n16. The system of claim 13 wherein the risk model includes instructions for determining how each charge-back included in the charge-back history is associated with the purchasing card transaction, and instructions for weighting each charge-back based on the corresponding association with the purchasing card transaction.\n17. The system of claim 13 wherein the risk model includes instructions for comparing the charge-back history to predetermined ranges of charge-backs in order to determine the risk score.\n18. The system of claim 13 wherein the risk model comprises a linear risk model.\n19. The system of claim 13 wherein the risk model comprises a regression risk model.\n20. The system of claim 13 wherein the risk model comprises a decision tree risk model.\n21. The system of claim 13 wherein the risk model comprises a neural network risk model.\n22. A computer system for quantifying risk of fraud associated with a purchasing card transaction, the computer system comprising:\na database for storing a charge-back history associated with a consumer involved in the purchasing card transaction; and\na processor in communication with the database, the processor including a risk model for determining a risk score based on the charge-back history.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5883810A",
        "US6154729A",
        "US6332134B1",
        "US6516056B1"
    ],
    "citations_ftf": [
        "US4812628A",
        "US5177342A",
        "US5428210A",
        "US5819226A",
        "AU5538494A",
        "US5679938A",
        "US5671279A",
        "US5988497A",
        "US5930762A",
        "US6119103A",
        "US6018723A",
        "US6029154A",
        "US6216115B1"
    ],
    "citedby_own": [
        "US20020138371A1",
        "US20030187765A1",
        "US20040030644A1",
        "US20040054555A1",
        "WO2004084113A1",
        "US20040199462A1",
        "US20050044017A1",
        "US20050149455A1",
        "US6975996B2",
        "US20050279827A1",
        "US20070033135A1",
        "US20070250441A1",
        "WO2007125316A2",
        "US20080040275A1",
        "US20090327107A1",
        "US20100030633A1",
        "US20100106611A1",
        "US20110184861A1",
        "US8121937B2",
        "US8140415B2",
        "US8209246B2",
        "US8346638B2",
        "US20130311369A1",
        "US8762191B2",
        "US8832809B2",
        "US20140344898A1",
        "US8996481B2",
        "US9058581B2",
        "US9063985B2",
        "US20150235222A1",
        "US20150262185A1",
        "US20160217470A1",
        "WO2017105760A1",
        "US9727869B1",
        "US20190087822A1",
        "US10255561B2",
        "US10825012B1",
        "US10832176B2",
        "US10915900B1",
        "US11151573B2",
        "US11430070B1"
    ],
    "citedby_ftf": [
        "US6363164B1",
        "US7187795B2",
        "US8162125B1",
        "US8701857B2",
        "US8437529B1",
        "US8428332B1",
        "US8437530B1",
        "US8944234B1",
        "US20030135456A1",
        "US20030187786A1",
        "US7131571B2",
        "US20030187790A1",
        "US7925576B2",
        "US8171567B1",
        "US8627939B1",
        "EP1668490A4",
        "US8458073B2",
        "US8082207B2",
        "US8447686B1",
        "US20070262140A1",
        "US7533803B2",
        "US8109435B2",
        "US20080021829A1",
        "US8050983B1",
        "US8417017B1",
        "US8538123B1",
        "US8600870B2",
        "US9536221B2",
        "US8391583B1",
        "US8929640B1",
        "US8467591B1",
        "US8626663B2",
        "US9299655B2",
        "US9537706B2",
        "US10176478B2",
        "US9679259B1",
        "US9141876B1",
        "US11568008B2",
        "US20140380445A1",
        "US9672289B1",
        "US9870465B1",
        "US10540607B1",
        "US10108968B1",
        "US10387795B1",
        "US9836533B1",
        "US11037158B2",
        "US11151566B2",
        "US11210670B2",
        "US10776788B2",
        "US11282073B2",
        "US11741465B2"
    ]
}