{
    "patent_link": "https://patents.google.com/patent/US4254474A/en",
    "patent_id": "US4254474A",
    "title": "Information processing system using threshold passive modification",
    "abstract": "An adaptive information processing system includes input terminals adapted to receive N input signals s1, s2, . . . sN representing an \"input\"; output terminals adapted to present n output responses r1, R2, . . . rn representing a \"response\"; and information processing apparatus, connecting the input with the output terminals, and operative to carry out the processing steps required to \"map\" different inputs into responses in accordance with a particular passive modification algorithm. This algorithm permits the recognition of unknown inputs and separates inputs which are in different classes but which are originally close to one another.",
    "inventors": [
        "Leon N. Cooper",
        "Charles Elbaum"
    ],
    "assignee": "Nestor Inc",
    "classifications": [
        "G06F17/10",
        "G06F18/24143",
        "G06N3/063"
    ],
    "claims": "\n1. An information processing system comprising, in combination:\na. a plurality (n) of input terminals 1, 2 . . . ,j . . . , N adapted to receive N input signals s1, s2 . . . ,sj . . . ,sN, respectively;\nb. a plurality (n) of output terminals 1, 2 . . . , i . . . , n adapted to present n output responses r1,r2 . . . ,ri . . . , rn, respectively;\nc. a plurality of junction elements, called mnemonders, each mnemonder coupling one of said input terminals (input j) with one of said output terminal (output i) and providing a transfer of information from input j to output i in dependence upon the signal sj appearing at the input j and upon the mnemonder transfer function Aij ; and\nd. means for modifying the transfer function Aij of at least one of said mnemonders, when in a learning mode, in dependence upon the product of at least one of said input signals and one of said output responses;\nwherein modifications to the transfer functions of the mnemonders, when in a learning mode, take the form:\nA.sub.ij (t)=γA.sub.ij (t-1)+δA.sub.ij (t)\nwhere δAij (t) has the form:\nδA.sub.ij (t)=η(r.sub.i)r.sub.i s.sub.j\nwhere Aij (t) is the new (modified) transfer function, Aij (t-1) is the previous transfer function, γ is a decay constant in the range 0≦γ≦1 and η is a variable learning constant that is dependent upon the output ri.\n2. The information processing system defined in claim 1, further comprising logic element means, connected between each output terminal and the mnemonders coupled thereto, for receiving mnemonder outputs sj ' and producing an output response ri in dependence upon said mnemonder outputs.\n3. The information processing system defined in claim 2, wherein each of said logic element means produces said output response ri in proportion to the sum of the mnemonder outputs sj ' applied thereto:\nwhereby said output response ri takes the form: ##EQU8##\n4. The information processing system defined in claim 1, wherein said modifying means includes means for changing all (n×N) of said transfer functions A11, A12, . . . A21, A22, . . . AnN in accordance with said formulae for Aij (t).\n5. The information processing system defined in claim 1, wherein said modifying means includes means for varying the modification of said transfer functions Aij.\n6. The information processing system defined in claim 5, wherein said modification varying means includes means for reducing the modification of said transfer functions Aij to zero,\nwhereby said information processing system operates as a distributed memory.\n7. The information processing system defined in any one of claims 1-6 wherein η is larger than zero for ri ≦θM, where θM is the modification threshold, and smaller than zero for ri <θM.\n8. The information processing system defined in claim 7 wherein δAij (t) has the form:\nδA.sub.ij (t)=±η.sup.± r.sub.i s.sub.j (t)\nwhere η is greater or equal to zero having one value η- if ri is less than said threshold value θM and another value η+ if ri is greater than said threshold value θM.\n9. The information processing system defined in claim 8, wherein η- and η+ are equal.\n10. The information processing system defined in claim 8, wherein η- and η+ are unequal.\n11. The information processing system defined in claim 7, wherein θM is a variable quantity.\n12. The information processing system defined in claim 11 wherein θM is a function of the output, ri.\n13. A method of processing information comprising the steps of:\na. receiving a plurality of input signals s1,s2 . . . , sj . . . ,sN,\nb. producing a plurality of intermediate signals s'i1, s'i2, . . . s'ij . . . ,s'iN, each s'ij of which is dependent upon a respective one of said input signals sj and an associated transfer function Aij ;\nc. producing an output response ri which is dependent upon at least one of said intermediate signals s'ij ; and\nd. modifying at least one of said transfer functions Aij, when in a learning mode, according to the formula:\nA.sub.ij (t)=γA.sub.ij (t-1)+δA.sub.ij (t)\nwhere δAij (t) has the form:\nδA.sub.ij (t)=η(r.sub.i)r.sub.i s.sub.j (t)\nwhere Aij (t) is the new (modified) transfer function, Aij (t-1) is the previous transfer function, γ is a decay constant in the range 0≦γ≦1 and η is a variable learning constant that is dependent upon the output ri.\n14. The method defined in claim 13, wherein said output response ri takes the form: ##EQU9##\n15. The method defined in claim 13, wherein said modifying step includes changing all (n×N) of said transfer functions A11, A12, . . . A21, A22, . . . AnN in accordance with said formula for Aij (t).\n16. The method defined in claim 13, wherein said modifying step includes varying the modification of said transfer functions Aij.\n17. The method defined in any one of claims 13-16 wherein η is larger than zero for ri ≦θM, where θM is the modification threshold, and smaller than zero for ri<θM.\n18. The method defined in claim 17 wherein δAij (t) has the form:\nδA.sub.ij (t) =±η.sup.± r.sub.i s.sub.j (t)\nwhere η is greater or equal to zero having one value η- if ri is less than said threshold value θM and another value η+ if ri is greater than said threshold value θM.\n19. The method defined in claim 18, wherein η- and η+ are equal.\n20. The method defined in claim 18, wherein η- and η+ are unequal.\n21. The method defined in claim 17, wherein θM is a variable quantity.\n22. The method defined in claim 21 wherein θM is a function of the output, ri.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3435422A",
        "US3440617A",
        "US3950733A",
        "US4044243A",
        "US4164025A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4450530A",
        "US4518866A",
        "US4658348A",
        "US4660166A",
        "US4670848A",
        "US4704695A",
        "US4704676A",
        "US4719588A",
        "US4755967A",
        "US4760604A",
        "US4773024A",
        "US4807168A",
        "US4835680A",
        "US4852018A",
        "US4912652A",
        "US4912647A",
        "US4912655A",
        "US4912649A",
        "US4912651A",
        "US4912654A",
        "US4912653A",
        "US4914708A",
        "US4914603A",
        "US4914604A",
        "US4920506A",
        "US4930099A",
        "US4931868A",
        "US4941122A",
        "EP0378115A2",
        "US4943931A",
        "US4958375A",
        "US4967340A",
        "US4974169A",
        "US4979124A",
        "US5001631A",
        "US5003490A",
        "US5008833A",
        "US5025406A",
        "US5033020A",
        "EP0438800A2",
        "US5040214A",
        "US5041976A",
        "US5060277A",
        "US5077807A",
        "US5093781A",
        "US5119469A",
        "US5136687A",
        "US5142590A",
        "US5155801A",
        "US5175794A",
        "FR2679355A1",
        "US5201029A",
        "US5204872A",
        "US5222195A",
        "US5276771A",
        "US5276770A",
        "US5299284A",
        "US5355438A",
        "US5357597A",
        "US5361328A",
        "US5473731A",
        "US5479574A",
        "US5615305A",
        "EP0834817A1",
        "US6052679A",
        "US6097834A",
        "US6167390A",
        "US20010029477A1",
        "US20010054022A1",
        "US20020052776A1",
        "US20040024671A1",
        "US20040148241A1",
        "US20040236647A1",
        "US6865547B1",
        "US7096192B1",
        "US20060190372A1",
        "US7212996B1",
        "US20080140576A1",
        "US7467109B1",
        "US7472088B2",
        "US7480631B1",
        "US7542921B1",
        "US7624068B1",
        "US7831467B1",
        "US7831509B2",
        "US7865427B2",
        "US7895098B2",
        "US7925578B1",
        "US7953663B1",
        "US20110156896A1",
        "US8175908B1",
        "US8364136B2",
        "US8429006B1",
        "US8489497B1",
        "US8533030B1",
        "US8751391B2",
        "US8892495B2",
        "US10133151B2",
        "US10361802B1"
    ],
    "citedby_ftf": []
}