{
    "patent_link": "https://patents.google.com/patent/US20020013763A1/en",
    "patent_id": "US20020013763A1",
    "title": "Real time auction with end game",
    "abstract": "A real time auction system operates in a non real time mode, and an end game mode in which the users are placed in a forum. In both modes the users are capable of placing bids along with times when those bids should be executed. An agent treats the bids as secret until the time, and then at the time executes those bids.",
    "inventors": [
        "Scott Harris"
    ],
    "assignee": "Advanced Auctions LLC",
    "classifications": [
        "G06Q30/08",
        "G06Q30/0601",
        "G06Q40/03"
    ],
    "claims": "\n1. A method of conducting an auction over a network, comprising:\ndisplaying an item which will be the subject of an auction, said displaying comprising providing a view of the item over the network, which allows the item to be viewed from at least multiple different perspectives; and\naccepting bids for purchase of the item over the network.\n2. A method as in claim 1, wherein said providing a view comprises allowing the item to be viewed three-dimensionally.\n3. A method as in claim 1, wherein said providing a view comprises first providing a first resolution view of the item, and loading views from said at least multiple perspectives while the first resolution view of the item is being displayed.\n4. A method as in claim 3, wherein said multiple perspectives include a three-dimensional view of the object.\n5. A method, comprising:\nallowing each of a plurality of users to submit bids for a specified item being auctioned, said bids being submitted from any of a number of clients over a network to a server which collects said bids; and\ndefining rules for actions in said auction, said rules including at least a time when the action will take place, and an actual action that will take place at the defined time.\n6. A method as in claim 5, wherein said actions are bids to take place at the defined time.\n7. A method as in claim 5, wherein said actions are allowing override of a previous bid.\n8. A method as in claim 5, wherein said rules are kept secret until the defined time.\n9. A method of conducting an auction over a network, comprising:\nfor any particular auction, sending information from a server computer to a local computer, which information enables the local computer to carry out some function associated with bidding on an item;\nmaking a decision at the local computer to accept or reject a new bid from a user at the local computer; and\nonly if the new bid is accepted at said local computer, sending information about the new bid to the server computer.\n10. A method as in claim 9, wherein said information includes information about a bid amount which will be necessary for the user at the local computer to be a highest bidder, and wherein said accepting a bid comprises comparing a local bid to said highest bid information, and sending said information to said server computer only when said local bid is higher than said highest bid information.\n11. A method as in claim 9, further comprising automatically updating each of a plurality of computers with new information.\n12. A method of conducting an auction over a network, comprising:\ndisplaying an item for sale on each of a plurality of client computers associated with the network, based on commands from a server computer;\naccepting bids from any of the client computers, and communicating information about accepted bids to said server computer; and\nwherein said displaying comprises displaying a winning bid amount which allows a user to automatically become the winning bidder.\n13. A method as in claim 12, wherein said winning bid amount is an amount higher then a current minimum bid amount.\n14. A method as in claim 12, further comprising automatically determining an action which represents change in an auction condition, and automatically updating said displaying to change based on said automatically determining.\n15. A method, comprising:\ndisplaying an item for sale by auction over a network; and\nallowing entering either a bid for said item, or an amount that automatically wins the auction.\n16. A method as in claim 15, further comprising automatically updating at least parts of the display seen by a plurality of users indicative of the item for sale.\n17. A method as in claim 15, wherein said displaying an item for sale comprises displaying a three-dimensional view of the item for sale.\n18. A method as in claim 15, further comprising displaying a screen tip indicating bid amounts.\n19. A method as in claim 15, wherein said network is the Internet.\n20. A method, comprising:\ndisplaying an item for sale over the Internet, by causing said item to be displayed on each of a plurality of client computers associated with the Internet, based on commands from a server computer; and\ndisplaying information associated with the bid for the item in a screen tip associated with the item when a cursor is placed over the item on one of the client computers.\n20. A method as in claim 19, wherein said information associated with the bid for the item is a current bid amount.\n21. A method as in claim 19, wherein said information associated with the bid for the item is a bid amount, and further comprising allowing the user to accept a bid amount associated with a screen tip.\n22. A method of conducting an auction over a network, comprising:\nfor any particular auction of an item, sending information to a plurality of local computers which enables the local computers to carry out some function associated with bidding on the item;\ndisplaying said information on said local computers;\nautomatically updating said displaying on each of said plurality of computers with new information.\n23. A method as in claim 22, wherein said automatically updating comprises automatically refreshing a Web browser running on computers associated with said at least some of said plurality of users.\n24. A method as in claim 22, wherein said automatically updating comprising using streaming video to form certain parts of said view.\n25. A method as in claim 22, wherein said automatically updating comprises using stop motion video to form certain parts of said view.\n26. A method as in claim 22, further comprising determining an action representing a change in an auction condition, and wherein said automatically updating is responsive to said determining.\n27. A method comprising:\nconducting an auction over a network by accepting bids for items, and establishing a highest bid for an item as being a winning bid; and\ntreating a bid received within a predetermined period of time before an end time of an auction less favorably than bids received prior to said predetermined period.\n28. A method as in claim 27, further comprising allowing a seller to select an amount of time defining said predetermined period.\n29. A method as in claim 27, further comprising determining a bid received within said predetermined period of time that was placed by a bidder who has previously participated in other bids prior to said predetermined period of time, and not treating said bid by said bidder less favorably.\n30. A method as in claim 27, wherein said conducting comprises accepting bids in a first way which keeps bids at a low level less than a maximum bid but high enough to win a specified auction, and said treating comprises accepting bids at a maximum amount without keeping them at said low level.\n31. A method comprising:\nconducting an auction over a network by accepting bids for items, and establishing a highest bid for an item as being a winning bid;\ndetermining identities of bidders bidding during said conducting; and\ntreating a bid from bidders whose identities have not been determined by said determining, and which bids are received within a predetermined period of time before an end time of an auction, less favorably than bids received prior to said predetermined period.",
    "status": "Abandoned",
    "citations_own": [
        "US4789928A",
        "US5794219A",
        "US5835896A",
        "US5845265A",
        "US5847971A",
        "US5890138A",
        "US5905975A",
        "US5924083A",
        "US5978842A",
        "US6012045A",
        "US6023398A",
        "US6026383A",
        "US6044363A",
        "US6101498A",
        "US6161099A",
        "US6202051B1",
        "US6243691B1",
        "US6285989B1",
        "US20010032175A1",
        "US6415269B1",
        "US6425269B1",
        "US6499018B1",
        "US6847939B1",
        "US6871190B1"
    ],
    "citations_ftf": [
        "GB9103907D0",
        "US6023686A",
        "US5627531A",
        "US8588729B2",
        "US5964821A",
        "US6055518A",
        "US7747507B2",
        "US6023685A",
        "US5700204A",
        "US6636197B1",
        "US6058379A",
        "US5960411A",
        "US6683653B1",
        "US7069243B2",
        "US6113504A",
        "US6533674B1",
        "US7249085B1",
        "US7792713B1",
        "US20050234811A1",
        "US7219080B1",
        "US7542920B1",
        "US6415270B1",
        "US7200571B1",
        "US7085740B1",
        "US6456232B1",
        "AU4509001A",
        "US20020013763A1",
        "CA2305834A1",
        "US6340800B1",
        "US6847357B2",
        "US6593914B1",
        "US6774932B1",
        "CA2329282A1",
        "US7801793B2",
        "US7220187B2",
        "US7255649B1"
    ],
    "citedby_own": [
        "WO2003058877A1",
        "US20040088241A1",
        "US20060149655A1",
        "US7085740B1",
        "US20070032286A1",
        "US20070143266A1",
        "US20070156757A1",
        "US20070162379A1",
        "US20080065525A1",
        "US20080102920A1",
        "US20080234048A1",
        "US20080306862A1",
        "US20090222371A1",
        "US20090307053A1",
        "US20090327096A1",
        "US20100121728A1",
        "US7895087B1",
        "US8170924B1",
        "US8216065B2",
        "US8266000B1",
        "US20140040352A1",
        "US20140324618A1",
        "US10475082B2",
        "US11625768B2"
    ],
    "citedby_ftf": [
        "US20120317474A1",
        "KR20130065813A",
        "US9911270B2",
        "US20160358248A1",
        "US11516300B2",
        "CN107507080A",
        "CN110012160B",
        "US10846732B1"
    ]
}