{
    "patent_id": "US-11556856-B2",
    "title": "Cloud assisted machine learning ",
    "assignee": "Intel Corporation",
    "publication_date": "2023-01-17",
    "patent_link": "https://patents.google.com/patent/US11556856B2/en",
    "inventors": [
        "Yen Hsiang Chew"
    ],
    "classifications": [
        "G06N20/00",
        "G06N3/08",
        "H04L41/142",
        "H04L41/16",
        "H04L67/10",
        "H04L67/1097",
        "H04L67/12",
        "H04L67/56",
        "H04L67/566",
        "G06N20/10",
        "G06N5/003",
        "G06N5/01",
        "G06N7/005",
        "G06N7/01"
    ],
    "abstract": "A method for training an analytics engine hosted by an edge server device is provided. The method includes determining a classification for data in an analytics engine hosted by an edge server and computing a confidence level for the classification. The confidence level is compared to a threshold. The data is sent to a cloud server if the confidence level is less than the threshold. A reclassification is received from the cloud server and the analytics engine is trained based, at least in part, on the data and the reclassification.",
    "claims": "\n1. An edge server comprising:\na processor; and\nmemory to store instructions to direct the processor to:\nanalyze data from an Internet-of-things (IoT) sensor to predict an event based on the data;\nidentify, using a prediction model, a first weighted average confidence level for a first analysis result relating to the event;\nseparate the analyzed data based on subject categories;\nassign a confidence level to the analyzed data for each subject category of the subject categories;\ncompute the first weighted average confidence level based on the assigned confidence levels;\nsend the data to a cloud server for processing if the first weighted average confidence level is less than a first threshold;\nreceive a second analysis result from the cloud server, wherein the second analysis result has a second weighted average confidence level greater than a second threshold; and\ntrain the prediction model based on the second analysis result.\n2. The edge server of claim 1, wherein the edge server is interconnected with a plurality of Internet-of-things (IoT) devices.\n3. The edge server of claim 1, wherein the memory includes instructions to direct the processor to:\ngenerate a unique identification code for the data; and\nsend the unique identification code to the cloud server.\n4. The edge server of claim 1, wherein the memory includes instructions to direct the processor to:\nstore the data sent to the cloud server in a data store; and\nassociate the data in the data store with a unique identification code.\n5. The edge server of claim 1, wherein the memory includes instructions to direct the processor to:\naccess the data in a data store using a unique identification code returned from the cloud server.\n6. The edge server of claim 1, wherein the first analysis result, the second analysis result, or both the first analysis result and the second analysis result includes a classification of the data.\n7. The edge server of claim 1, wherein data is discarded if the first weighted average confidence level is less than a threshold.\n8. The edge server of claim 1, comprising a display to display content based on the first analysis result or the second analysis result.\n9. The edge server of claim 1, wherein the cloud server is to implement cloud analytics.\n10. The edge server of claim 9, wherein the cloud analytics is to generate a reclassification confidence level for the second analysis result.\n11. The edge server of claim 10, wherein the cloud analytics is to discard the data if the reclassification confidence level is less than a cloud threshold.\n12. The edge server of claim 1, comprising an anonymous video analyzer (AVA).\n13. The edge server of claim 1, wherein the first threshold is the same as the second threshold.\n14. The edge server of claim 1, wherein the second threshold is higher than the first threshold.\n15. The edge server of claim 1, wherein the data comprises images of an object approaching a controlled roadway intersection, wherein the event comprises a time of arrival of the object at the controlled roadway intersection, and wherein the first analysis result comprises a prediction of when the object will arrive at the controlled roadway intersection.\n16. The edge server of claim 1, wherein the instructions stored in memory are implemented as a micro-service, and the micro-service is distributed to a remote device communicatively coupled to the edge server.\n17. The edge server of claim 16, wherein the remote device distributes the micro-service to another remote device.\n18. The edge server of claim 16, wherein the remote device removes the micro-service after being used.\n19. A method comprising:\nanalyzing data from an Internet-of-things (IoT) sensor to predict an event based on the data;\nidentifying, using a prediction model, a first weighted average confidence level for a first analysis result relating to the event;\nseparating the analyzed data based on subject categories;\nassigning a confidence level to the analyzed data for each subject category of the subject categories;\ncomputing the first weighted average confidence level based on the assigned confidence levels;\nsending the data to a cloud server for processing if the first weighted average confidence level is less than a first threshold;\nreceiving a second analysis result from the cloud server, wherein the second analysis result has a second weighted average confidence level greater than a second threshold; and\ntraining the prediction model based on the second analysis result.\n20. The method of claim 19, wherein the first analysis result, the second analysis result, or both the first analysis result and the second analysis result includes a classification of the data.\n21. The method of claim 19, wherein the cloud server is to implement cloud analytics to generate a reclassification confidence level for the second analysis result.\n22. The method of claim 21, wherein the cloud analytics is to discard the data if the reclassification confidence level is less than a cloud threshold.\n23. The method of claim 19, wherein the second threshold is higher than the first threshold.\n24. At least one non-transitory machine-readable medium including instructions, which when executed by a machine, cause the machine to:\nanalyze data from an Internet-of-things (IoT) sensor to predict an event based on the data;\nidentify, using a prediction model, a first weighted average confidence level for a first analysis result relating to the event;\nseparate the analyzed data based on subject categories;\nassign a confidence level to the analyzed data for each subject category of the subject categories;\ncompute the first weighted average confidence level based on the assigned confidence levels;\nsend the data to a cloud server for processing if the first weighted average confidence level is less than a first threshold;\nreceive a second analysis result from the cloud server, wherein the second analysis result has a second weighted average confidence level greater than a second threshold; and\ntrain the prediction model based on the second analysis result.\n25. The at least one non-transitory machine-readable medium of claim 24, wherein the second threshold is higher than the first threshold.",
    "status": "Active",
    "citations_own": [
        "US20090013177A1",
        "US20100161161A1",
        "US20100166272A1",
        "US20100188328A1",
        "US20110313958A1",
        "US20120136549A1",
        "CN102523240A",
        "US20120224706A1",
        "US20120314901A1",
        "US20130238538A1",
        "US20130293217A1",
        "US20140093131A1",
        "US20140129178A1",
        "US20140149060A1",
        "US20140189069A1",
        "US20140210625A1",
        "US20140237277A1",
        "US20140244209A1",
        "US20140247206A1",
        "US20140282945A1",
        "US20140354527A1",
        "US20150019620A1",
        "US20150058448A1",
        "US20150134460A1",
        "WO2015081063A1",
        "US20150185713A1",
        "US20150222477A1",
        "US20150317565A1",
        "US20160063503A1",
        "US20160088206A1",
        "US20160085324A1",
        "US20160112521A1",
        "US20160142868A1",
        "EP3032455A1",
        "US20160180197A1",
        "US20160209818A1",
        "US9465388B1",
        "US9473514B1",
        "US9706406B1",
        "US20170301213A1",
        "US20170364434A1",
        "US20180027080A1",
        "US20180039956A1",
        "WO2018182903A1",
        "US20180324540A1",
        "US10223751B1",
        "US10285611B1",
        "US10671925B2"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "WO2020131497A1",
        "US11790762B2",
        "US10878342B2",
        "US10229322B2",
        "US20180316555A1",
        "US10728151B2",
        "US10502443B2",
        "US11108575B2",
        "US10980085B2",
        "US10944766B2",
        "US10686611B2",
        "US10417501B2",
        "US11699093B2",
        "US11363031B2",
        "US11132721B1",
        "KR102091126B1",
        "US20200175419A1",
        "CN109379381B",
        "US10788798B2",
        "JP7262232B2",
        "US11681945B2",
        "US11356537B2",
        "DE102019205033A1",
        "US11336724B2",
        "US11646492B2",
        "US10498029B1",
        "US10461421B1",
        "US11468783B2",
        "US20200403935A1",
        "US10642719B1",
        "US11354222B2",
        "US11379292B2",
        "US10747544B1",
        "US10521235B1",
        "US10915428B2",
        "US11093378B2",
        "CN110557633B",
        "KR20190106944A",
        "FI20195790A1",
        "US20220392247A1",
        "CN111126153B",
        "US11108646B2",
        "CN113133105B",
        "US10972475B1",
        "US11611580B1",
        "US11489853B2",
        "CN111954236B",
        "US11720417B2",
        "US20220044101A1",
        "US11176016B1",
        "US11438404B2",
        "CN112272231B",
        "CN114581966A",
        "US20220232069A1",
        "CN114115392A",
        "CN115065727B"
    ]
}