{
    "patent_link": "https://patents.google.com/patent/US6629095B1/en",
    "patent_id": "US6629095B1",
    "title": "System and method for integrating data mining into a relational database management system",
    "abstract": "An integrated data mining and relational database management system is provided on a server. The data mining engine determines characteristics of relationships between input data values and an output data value that are obtained from a relational database (managed by the relational database management system). The integration allows direct conversion of data values from the relational database to data mining identifiers used for data mining operations by the data mining engine, and vice-versa. The integrated server also makes patterns uncovered during data mining (e.g., \"understand\" and \"predict\" information) available in virtual relational database tables that can be queried.",
    "inventors": [
        "William M. Wagstaff",
        "Donovan A. Schneider",
        "Ann M. Koehler",
        "Craig J. Bunger",
        "Richard L. Cole"
    ],
    "assignee": "Red Brick Systems Inc",
    "classifications": [
        "G06F16/284",
        "Y10S707/99933",
        "Y10S707/99934",
        "Y10S707/99935",
        "Y10S707/99936"
    ],
    "claims": "\n1. A computer program product, implemented on a machine readable medium, comprising instructions operable to:\n2. The computer program product of claim 1, further comprising instructions operable to construct rows corresponding to the relationships in the data mining model in response to user queries.\n3. The computer program product of claim 1, further comprising instructions to define one or more columns from a relational database as the inputs to the data mining model relational table.\n4. The computer program product of claim 3, further comprising instructions to integrate the data mining model relational table with the relational database on a server.\n5. The computer program product of claim 1, further comprising instructions to define a column from a relational database as the output of the data mining model relational table.\n6. The computer program product of claim 5, further comprising instructions to integrate the data mining model relational table with the relational database on a server.\n7. The computer program product of claim 1, further comprising instructions to indicate the importance of the relationships between the inputs and the output of the data mining model in one or more columns of the data mining model relational table.\n8. The computer program product of claim 7, further comprising instructions to indicate occurrence counts for the relationships between the inputs and the output of the data mining model in a column of the data mining model relational table.\n9. The computer program product of claim 7, further comprising instructions to to indicate occurrence frequencies for the relationships between the inputs and the output of the data mining model in a column of the data mining model relational table.\n10. The computer program product of claim 7, further comprising instructions to indicate correlations for the relationships between the inputs and the output of the data mining model in a column of the data mining model relational table.\n11. The computer program product of claim 1, further comprising instructions to define a data mining model relational table having multiple rows, each row providing a relationship between input data values and an output data value, and each row also providing correlations between the output data value and the input data values.\n12. The computer program product of claim 11, further comprising instructions to obtain the input data values and the output data value in a row of the data mining model from a relational database, and to calculate correlations between the input data values and the output data value with a data mining engine.\n13. The computer program product of claim 1, further comprising instructions to define a look up table to translate between data mining identifiers used by the data mining engine and input and output values used by the data mining model relational table.\n14. The computer program product of claim 13, further comprising instructions to define one or more look-up table indexes, including a forward translation index configured to translate data values from data stored in the relational database to data mining identifiers.\n15. The computer program product of claim 13, further comprising instructions to define one or more look-up table indexes, including a reverse translation index configured to translate data mining identifiers to corresponding data values of data stored in the relational database.\n16. The computer computer program product of claim 1, further comprising instructions to convert between data values of data stored in a relational database managed by the relational database management system and data mining identifiers representing the data values that are used by the data mining engine.\n17. The computer program product of claim 1, wherein the instruction to define a data mining model further includes instructions to define one or more data mining sub-tables.\n18. The computer program product of claim 1, wherein the data mining capabilities perform calculations without transferring large blocks of data from a remote database.\n19. The computer program product of claim 1, wherein the instruction to define a data mining model relational table further comprises instructions to define a relational predict table, the relational predict table providing multiple relationships between inputs and an output and configured to return a predicted output in response to a query containing one or more inputs.\n20. The computer program product of claim 19, wherein the instruction to define a relational predict table, further comprises instructions to indentify a column of the relational predict table to hold a confidence value for the output returned in response to the query.\n21. The computer program product of claim 19, further comprising instructions to construct one or more rows in the relational predict table in response to one or more corresponding user queries.\n22. The computer program product of claim 19, further comprising instructions to identify one or more columns of the relational predict table to receive user specified inputs from a relational database.\n23. The computer program product of claim 19, further comprising instructions to identify a column of the relational predict table to receive output from a data mining engine.\n24. The computer program product of claim 19, further comprising instructions to identify one or more columns of the relational predict table to receive a value indicating the confidence in the relationship between one or more user specified inputs and the output of the data mining engine.\n25. The computer program product of claim 24, further comprising instructions to identify one or more columns of the relational predict table to receive values discriminating the relationship between one or more user specified inputs and the output of the data mining engine.\n26. The computer program product of claim 19, wherein the instruction to define the relational predict table further comprises instructions to define multiple rows for the relational predict table, each row providing a relationship between input data values and an output data value and each row also providing a discrimination associated with the relationship.\n27. The computer program product of claim 26, further comprising instructions to obtain the input data values and the output data value in a row from a relational database, and to calculate the discrimination of the relationship between the input data values and the output data value with a data mining engine.\n28. A method of evaluating a query on a predict table in a data mining model, the predict table providing multiple relationships between input values and output values and configured to return a predicted output value in response to a query containing one or more input values, the method comprising:\n29. The method of claim 28, further comprising:\n30. The method of claim 29, wherein the second sub-expression is saved for binding to results of a data mining operation performed by the data mining engine on column values passed to it.\n31. The method of claim 30, wherein the determining whether the expression or sub-expression is an atomic conjunctive expression or sub-expression, further comprises determining whether the expression or sub-expression compares a bindable value to a model input.\n32. The method of claim 28, further comprising determining whether the expression or sub-expression is an atomic conjunctive expression or sub-expression, prior to identifying the start/stop condition.\n33. A computer system comprising:\n34. The computer system of claim 33, further comprising a data mining model including a model table specifying input columns and an output column for rows of values from the relational database, which rows specify the relationships between the input values and the output value.\n35. The computer system of claim 34, wherein the data mining model includes\n36. The computer system of claim 35, wherein the one or more data model indexes include a forward translation index configured to translate data values from the relational database to data mining identifiers.\n37. The computer system of claim 35, wherein the one or more data model indexes include a reverse translation index configured to translate data mining identifiers to corresponding data values from the relational database.\n38. A computer program product, implemented on a machine readable medium, comprising instructions operable to:\n39. The computer program product of claim 38, wherein the instructions are operable to:\n40. The computer program product of claim 38, wherein the instructions are operable to:\n41. The computer program product of claim 38, wherein the instructions are operable to:\n42. The computer program product of claim 38, wherein the computer program product is implemented on a machine readable medium at a server and wherein the instructions are operable to at least one of:",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5970482A",
        "US5991751A",
        "US6185559B1",
        "US6185561B1",
        "US6185549B1",
        "US6439783B1",
        "US6516310B2",
        "US6516308B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20020046273A1",
        "US20020107841A1",
        "US20020169824A1",
        "US20030023612A1",
        "US20030145000A1",
        "US20030195889A1",
        "US20030208706A1",
        "US20030212678A1",
        "US20030229635A1",
        "US20030236784A1",
        "US20040010505A1",
        "US20040039548A1",
        "US20040044662A1",
        "US20040049473A1",
        "US20040088730A1",
        "US20040095390A1",
        "US20050004907A1",
        "US20050033723A1",
        "US20050086076A1",
        "US20050114294A1",
        "US20050198041A1",
        "US20050251525A1",
        "US20060112048A1",
        "US7069197B1",
        "US20060282436A1",
        "US20070011135A1",
        "US20070011187A1",
        "US20070011188A1",
        "US20070027771A1",
        "US7194483B1",
        "US20070143547A1",
        "US20080154578A1",
        "US20080179229A1",
        "US20080183688A1",
        "US20080195601A1",
        "US7418431B1",
        "US7433879B1",
        "US7444291B1",
        "US20080270336A1",
        "US7536413B1",
        "US7627588B1",
        "US7640175B1",
        "US7676485B2",
        "US20100205171A1",
        "US7788251B2",
        "US7966343B2",
        "US20110153419A1",
        "US8355950B2",
        "US20130132400A1",
        "US8458129B2",
        "US20130218893A1",
        "US20130232296A1",
        "US8589413B1",
        "US20130325158A1",
        "US8713638B2",
        "US20140245207A1",
        "CN104050225A",
        "US20140278755A1",
        "US8862625B2",
        "US8965839B2",
        "US9245243B2",
        "US20160162575A1",
        "US9424315B2",
        "US9805029B2",
        "US9830386B2",
        "US9830404B2",
        "US9899020B2",
        "US20180137431A1",
        "US10002125B2",
        "US10002131B2",
        "USRE46973E1",
        "US10067936B2",
        "US10089299B2",
        "US10133738B2",
        "US10289681B2",
        "US10311364B2",
        "US10319031B2",
        "US10346537B2",
        "US10380249B2",
        "US10430848B2",
        "US10902221B1",
        "US10902215B1",
        "US11017027B2",
        "US11144525B2",
        "US11182394B2"
    ],
    "citedby_ftf": []
}