{
    "patent_id": "US-11231705-B2",
    "title": "Methods for data monitoring with changeable routing of input channels ",
    "assignee": "Strong Force Iot Portfolio 2016, Llc",
    "publication_date": "2022-01-25",
    "patent_link": "https://patents.google.com/patent/US11231705B2/en",
    "inventors": [
        "Charles Howard Cella",
        "Gerald William Duffy, JR.",
        "Jeffrey P. McGuckin",
        "Mehul Desai"
    ],
    "classifications": [
        "G05B19/0425",
        "A01B3/02",
        "G05B13/028",
        "G05B19/102",
        "G05B19/12",
        "G05B19/4183",
        "G05B19/4184",
        "G05B19/41845",
        "G05B19/4185",
        "G05B19/41865",
        "G05B19/41875",
        "G05B23/02",
        "G05B23/0221",
        "G05B23/0229",
        "G05B23/024",
        "G05B23/0264",
        "G05B23/0283",
        "G05B23/0286",
        "G05B23/0289",
        "G05B23/0291",
        "G05B23/0294",
        "G05B23/0297",
        "G06F18/00",
        "G06F18/217",
        "G06F18/2178",
        "G06K9/62",
        "G06K9/6262",
        "G06K9/6263",
        "G06N20/00",
        "G06N3/006",
        "G06N3/02",
        "G06N3/042",
        "G06N3/043",
        "G06N3/044",
        "G06N3/0445",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/047",
        "G06N3/0472",
        "G06N3/049",
        "G06N3/084",
        "G06N3/088",
        "G06N7/005",
        "G06N7/01",
        "G06T11/206",
        "G06V10/70",
        "G06V10/776",
        "H04B17/309",
        "H04B17/318",
        "H04L1/0002",
        "H04L1/004",
        "H04L1/0041",
        "H04L1/18",
        "H04L12/66",
        "H04L43/045",
        "H04L47/122",
        "H04L67/1097",
        "H04L67/12",
        "H04Q9/00",
        "G05B13/0265",
        "G05B2219/25428",
        "G05B2219/31282",
        "G05B2219/32287",
        "G05B2219/33331",
        "G05B2219/35001",
        "G05B2219/37337",
        "G05B2219/37351",
        "G05B2219/37434",
        "G05B2219/40115",
        "G05B2219/45004",
        "G05B2219/45129",
        "G06F2211/005",
        "G06N20/10",
        "G06N20/20",
        "G06N3/086",
        "G06N3/126",
        "G06N5/01",
        "G06N5/046",
        "H04L29/00",
        "H04L5/0064",
        "H04L69/00",
        "Y02P80/00",
        "Y02P80/10",
        "Y02P90/02",
        "Y04S40/18"
    ],
    "abstract": "Methods for data monitoring with changeable routing of input channels are disclosed. An example method includes a data collector communicatively coupled to a plurality of input channels and a data acquisition circuit to interpret the detection values, each corresponding to an input channel. Sensor data is acquired from a first route of input channels and stored together with specifications for the sensors that correspond to the input channels. The sensor data is evaluated with respect to an alarm threshold level and an alarm state set when the alarm threshold level is exceeded. A response circuit changes a routing of the input channels for data collection from a first routing to an alternate routing of input channels, wherein the alternate routing of input channels comprise the first input channel and a group of input channels related to the first input channel.",
    "claims": "\n1. A computer-implemented method for implementing a monitoring system for data collection in an industrial environment comprising:\nproviding a data collector communicatively coupled to a plurality of input channels;\nproviding a data acquisition circuit structured to interpret a plurality of detection values, each of the plurality of detection values corresponding to at least one of the plurality of input channels, wherein the data acquisition circuit acquires sensor data from a first routing of input channels for the plurality of input channels;\nproviding a data storage structured to store sensor specifications for sensors that correspond to the plurality of input channels;\nproviding a data analysis circuit structured to evaluate the sensor data with respect to stored anticipated state information, wherein the anticipated state information comprises an alarm threshold level, and wherein the data analysis circuit sets an alarm state when the alarm threshold level is exceeded for a first input channel in a first group of input channels; and\nproviding a response circuit structured to change, based on the alarm state, a routing of the input channels for data collection from the first routing of input channels to an alternate routing of input channels, wherein the alternate routing of input channels comprise the first input channel and a group of input channels related to the first input channel, wherein the group of input channels related to the first input channel includes input channels that are different from the input channels of the first group of input channels.\n2. The method of claim 1, wherein the method is one of deployed locally on the data collector or deployed in part locally on the data collector and in part on a remote information technology infrastructure component apart from the data collector, wherein each of the plurality of input channels correspond to a sensor located in the industrial environment.\n3. The method of claim 1, wherein the group of input channels related to the first input channel receives a signal from a three-axis sensor.\n4. The method of claim 1, wherein the first input channel receives a signal from a single axis sensor.\n5. The method of claim 4, wherein the group of input channels related to the first input channel receives a signal from a three-axis sensor.\n6. The method of claim 1, wherein each of the plurality of input channels corresponds to a sensor located in the industrial environment.\n7. The method of claim 1, wherein the method is deployed in part locally on the data collector and in part on a remote information technology infrastructure component apart from the data collector.\n8. The method of claim 1, further comprising placing one or more of the sensors that correspond to the plurality of input channels on an external portion of a machine in the industrial environment.\n9. The method of claim 8, wherein the first input channel receives a signal from a single-axis sensor, wherein the group of input channels related to the first input channel receives a signal from a three-axis sensor, and wherein the three-axis sensor and the single-axis sensor are located on the external portion of the machine in the industrial environment.\n10. The method of claim 1, wherein the first input channel receives a signal from a single-axis sensor, wherein the group of input channels related to the first input channel receives a signal from a three-axis sensor, and wherein the three-axis sensor and the single-axis sensor are located on an external portion of two different machines in the industrial environment.\n11. The method of claim 1, wherein the setting of the alarm state is based on an operational mode collection scheme for least one of a normal operational mode, a peak operational mode, an idle operational mode, a maintenance operational mode, or a power saving operational mode.\n12. The method of claim 1, wherein the alarm threshold level is associated with a sensed change to one of the plurality of input channels, and wherein the sensed change is at least one of a failure condition, a performance condition, a power condition, a temperature condition, or a vibration condition.\n13. One or more non-transitory computer-readable media comprising computer executable instructions that, when executed, causes at least one processor to perform actions comprising:\nproviding a data collector communicatively coupled to a plurality of input channels;\nproviding a data acquisition circuit structured to interpret a plurality of detection values, each of the plurality of detection values corresponding to at least one of the plurality of input channels, wherein the data acquisition circuit acquires sensor data from a first routing of input channels for the plurality of input channels;\nproviding a data storage structured to store sensor specifications for sensors that correspond to the input channels;\nproviding a data analysis circuit structured to evaluate the sensor data with respect to stored anticipated state information, wherein the anticipated state information comprises an alarm threshold level, and wherein the data analysis circuit sets an alarm state when the alarm threshold level is exceeded for a first input channel in a first group of input channels; and\nproviding a response circuit structured to change, based on the alarm state, a routing of the input channels for data collection from the first routing of input channels to an alternate routing of input channels, wherein the alternate routing of input channels comprise the first input channel and a group of input channels related to the first input channel, wherein the group of input channels related to the first input channel includes input channels that are different from the input channels of the first group of input channels.\n14. The media of claim 13, wherein the instructions are deployed in one of: locally on the data collector; or deployed in part locally on the data collector and in part on a remote information technology infrastructure component apart from the data collector; and wherein each of the input channels corresponds to a sensor located in an industrial environment.\n15. The media of claim 13, wherein the group of input channels related to the first input channel receives a signal from a three-axis sensor.\n16. The media of claim 13, wherein the first input channel receives a signal from a single axis sensor.\n17. The media of claim 13, wherein each of the plurality of input channels corresponds to a sensor.\n18. The media of claim 13, wherein the media is deployed in part locally on the data collector and in part on a remote information technology infrastructure component apart from the data collector.\n19. The media of claim 13, further comprising placing one or more of the sensors that correspond to the plurality of input channels on an external portion of a machine.\n20. The media of claim 19, wherein the group of input channels related to the first input channel receives a signal from a three-axis sensor.\n21. The media of claim 20, wherein the three-axis sensor and a single-axis sensor are located on an external portion of a machine.\n22. The media of claim 20, wherein the three-axis sensor and a single-axis sensor are located on an external portion of two different machines.\n23. The media of claim 13, wherein the setting of the alarm state is based on an operational mode collection scheme for least one of a normal operational mode, a peak operational mode, an idle operational mode, a maintenance operational mode, or a power saving operational mode.\n24. The media of claim 13, wherein the alarm threshold level is associated with a sensed change to one of the plurality of input channels, and wherein the sensed change is at least one of a failure condition, a performance condition, a power condition, a temperature condition, or a vibration condition."
}