{
    "patent_id": "US-2023120977-A1",
    "title": "Technology change confidence rating ",
    "assignee": "Disney Enterprises, Inc.",
    "publication_date": "2023-04-20",
    "patent_link": "https://patents.google.com/patent/US20230120977A1/en",
    "inventors": [
        "Jeffrey A. RAU",
        "Blair K. MARTLARO",
        "Steven HARROP",
        "Christopher P. DURAN",
        "Jason J. ISLEY"
    ],
    "classifications": [
        "G06Q10/0635",
        "G06F11/008",
        "G06N5/04",
        "G06N3/044",
        "G06N3/0464",
        "G06N3/09"
    ],
    "abstract": "Techniques for identifying a risk of failure for a planned change to a technology item in a technology infrastructure are disclosed. Historical technology change data are retrieved, including data relating to at least one of: (i) prior technology changes by an implementer or coordinator of the planned change, (ii) a process relating to the planned change, or (iii) prior technology changes relating to the technology item or a related technology item. A change confidence rating for a risk of failure for the planned change is generated, based on the historical technology change data. The change confidence rating is applied, including at least one of: (i) generating a user interface illustrating a risk level for the technology change, (ii) flagging for or initiating a supplemental review of the technology change, or (iii) recommending implementer training relating to the technology change.",
    "claims": "\n1. A method, comprising:\nidentifying a planned change to a technology item in a technology infrastructure;\nretrieving historical technology change data relating to the technology item and the planned change, the historical technology change data comprising data relating to at least one of: (i) prior technology changes by an implementer or coordinator of the planned change, (ii) a process relating to the planned change, or (iii) prior technology changes relating to the technology item or a related technology item;\ngenerating a change confidence rating for a risk of failure for the planned change, based on the historical technology change data; and\napplying the change confidence rating, comprising at least one of: (i) generating a user interface illustrating a risk level for the technology change, (ii) flagging for or initiating a supplemental review of the technology change, or (iii) recommending implementer training relating to the technology change.\n2. The method of claim 1, wherein the technology item comprises a hardware item or software item in an information technology (IT) infrastructure.\n3. The method of claim 1, wherein generating the change confidence rating comprises:\nproviding the historical technology change data to a trained machine learning (ML) model, and in response, receiving from the ML model an inference of the change confidence rating.\n4. The method of claim 3, wherein the ML model is trained using data relating to past technology changes in the technology infrastructure.\n5. The method of claim 1, wherein generating the change confidence rating comprises:\ncalculating an implementer component of the change confidence rating based on results of the prior technology changes by the implementer or coordinator of the planned change, wherein the coordinator comprises at least one of a coordinator for the planned change or a coordinator group for the planned change, and the implementer comprises at least one of a task implementer for the planned change or an implementer group for the planned change;\ncalculating a process component of the change confidence rating based on prior process problems relating to the coordinator of the planned change or an approval group for the planned change;\ncalculating a technology component of the change confidence rating based on results of prior technology changes relating to the technology item or a related technology item; or\na combination thereof.\n6. The method of claim 5, wherein generating the change confidence rating comprises calculating the implementer component of the change confidence rating, and wherein the implementer component is based on results of prior technology changes for all of: (i) the coordinator for the planned change, (ii) the coordinator group for the planned change, (iii) the task implementer for the planned change, and (iv) the implementer group for the planned change.\n7. The method of claim 5, wherein generating the change confidence rating comprises calculating the process component of the change confidence rating, and wherein the process component is based on prior process problems relating to the coordinator of the planned change and the approval group for the planned change.\n8. The method of claim 5, wherein generating the change confidence rating comprises calculating the technology component of the change confidence rating, and wherein the technology component is based on the results of prior technology changes relating to the technology item and the related technology item, and wherein the related technology item is provided by a same entity as the technology item.\n9. The method of claim 5, wherein generating the change confidence rating comprises calculating the technology component of the change confidence rating, and wherein the technology component is based on the results of prior technology changes for the related technology item and not the technology item itself, and wherein the related technology item is provided by a same entity as the technology item.\n10. The method of claim 1, wherein the historical technology change data comprises data relating to all of: (i) prior technology changes by an implementer or coordinator of the planned change, (ii) a process relating to the planned change, and (iii) prior technology changes relating to the technology item or a related technology item.\n11. A non-transitory computer-readable medium containing computer program code that, when executed by operation of one or more computer processors, performs operations comprising:\nidentifying a planned change to a technology item in a technology infrastructure;\nretrieving historical technology change data relating to the technology item and the planned change, the historical technology change data comprising data relating to at least one of: (i) prior technology changes by an implementer or coordinator of the planned change, (ii) a process relating to the planned change, or (iii) prior technology changes relating to the technology item or a related technology item;\ngenerating a change confidence rating for a risk of failure for the planned change, based on the historical technology change data; and\napplying the change confidence rating, comprising at least one of: (i) generating a user interface illustrating a risk level for the technology change, (ii) flagging for or initiating a supplemental review of the technology change, or (iii) recommending implementer training relating to the technology change.\n12. The non-transitory computer-readable medium of claim 11, wherein the technology item comprises a hardware item or software item in an information technology (IT) infrastructure.\n13. The non-transitory computer-readable medium of claim 11, wherein generating the change confidence rating comprises:\nproviding the historical technology change data to a trained machine learning (ML) model, and in response, receiving from the ML model an inference of the change confidence rating.\n14. The non-transitory computer-readable medium of claim 13, wherein the ML model is trained using data relating to past technology changes in the technology infrastructure.\n15. The non-transitory computer-readable medium of claim 11, wherein generating the change confidence rating comprises:\ncalculating an implementer component of the change confidence rating based on results of the prior technology changes by the implementer or coordinator of the planned change, wherein the coordinator comprises at least one of a coordinator for the planned change or a coordinator group for the planned change, and the implementer comprises at least one of a task implementer for the planned change or an implementer group for the planned change;\ncalculating a process component of the change confidence rating based on prior process problems relating to the coordinator of the planned change or an approval group for the planned change;\ncalculating a technology component of the change confidence rating based on results of prior technology changes relating to the technology item or a related technology item; or\na combination thereof.\n16. The non-transitory computer-readable medium of claim 15,\nwherein the implementer component is based on results of prior technology changes for all of: (i) the coordinator for the planned change, (ii) the coordinator group for the planned change, (iii) the task implementer for the planned change, and (iv) the implementer group for the planned change,\nwherein the process component is based on prior process problems relating to the coordinator of the planned change and the approval group for the planned change,\nwherein the technology component is based on the results of prior technology changes relating to the technology item and the related technology item, and wherein the related technology item is provided by a same entity as the technology item, or\na combination thereof.\n17. A system, comprising:\na computer processor; and\na memory having instructions stored thereon which, when executed on the computer processor, performs operations comprising:\nidentifying a planned change to a technology item in a technology infrastructure;\nretrieving historical technology change data relating to the technology item and the planned change, the historical technology change data comprising data relating to at least one of: (i) prior technology changes by an implementer or coordinator of the planned change, (ii) a process relating to the planned change, or (iii) prior technology changes relating to the technology item or a related technology item;\ngenerating a change confidence rating for a risk of failure for the planned change, based on the historical technology change data, comprising:\nproviding the historical technology change data to a trained machine learning (ML) model, and in response receiving from the ML model an inference of the change confidence rating, wherein the ML model is trained using data relating to past technology changes in the technology infrastructure; and\napplying the change confidence rating, comprising at least one of: (i) generating a user interface illustrating a risk level for the technology change, (ii) flagging for or initiating a supplemental review of the technology change, or (iii) recommending implementer training relating to the technology change.\n18. The system of claim 17, wherein the technology item comprises a hardware item or software item in an information technology (IT) infrastructure.\n19. The system of claim 17, wherein applying the change confidence rating comprises generating the user interface illustrating the risk level for the technology change.\n20. The system of claim 19, wherein applying the change confidence rating further comprises initiating the supplemental review of the technology change."
}