{
    "patent_link": "https://patents.google.com/patent/US5201010A/en",
    "patent_id": "US5201010A",
    "title": "Method and system for building a database and performing marketing based upon prior shopping history",
    "abstract": "A method and system is disclosed for performing targeted marketing on infrequent shoppers. A check reader is provided for automatically reading the MICR code of a plurality of checks drawn on a plurality of different banking institutions. Circuitry detects the customer's checking account number in the MICR code of the checks. A terminal enters data relating to the customer's shopping habits. A database of the store's customers is created in response to the check reader, circuitry for detecting, and terminal. The selection is then made of a list of customers from the database who have not shopped at the store since a preselected date.",
    "inventors": [
        "David W. Deaton",
        "Rodney G. Gabriel"
    ],
    "assignee": "Catalina Marketing Corp",
    "classifications": [
        "G06Q30/02",
        "G06Q20/042",
        "G06Q20/387",
        "G06Q40/02",
        "G07D7/04",
        "G07F17/42",
        "G07G1/00",
        "G07G1/0036",
        "G07G1/12",
        "G07G1/145"
    ],
    "claims": "\n1. A method of building a customer database using checks from a variety of different banks comprising:\ndetecting a customer's checking account identification number for use as a unique customer identification code;\nentering the unique customer identification code into a processor containing a database that maintains customer records including the customer's name and address, the checking account identification number, and customer transactional data over a pre-selected time interval;\ncomparing said checking account identification code with said database;\ngenerating a response with said processor to signal the presence of the customer's identification code or the failure to locate the customer's identification code;\ncreating a new record in said database for that customer's identification code in response to a processor response indicating the failure to locate, so that the customer's name and address is entered into the record along with the customer's transactional data; and\nselecting customers in said database whose last transaction date is prior to a pre-selected interval of inactivity so that that grouping of infrequent customers is available for marketing efforts.\n2. The method of claim 1 and further comprising detecting the bank transit number for use with said checking account identification number as a unique customer identification code.\n3. The method of claim 1 wherein said step for detecting a customer's checking account identification number comprises scanning the MICR code of a check and omitting portions of said MICR code while retaining said checking account identification number.\n4. The method of claim 3 and further comprising omitting the check sequence number from the MICR code.\n5. The method of claim 3 and further comprising retaining the bank transit number of the MICR code for use with the customer's checking account number as the unique customer identification code.\n6. The method of claim 2 and further comprising:\nstoring data related to the location of a specified portion of MICR codes for a plurality of banking institutions; and\ncreating said unique customer identification code in response to said stored data.\n7. The method of claim 1 and further comprising performing targeted marketing efforts on said grouping of customers.\n8. The method of claim 7 wherein said marketing efforts include providing coupons to said grouping of customers.\n9. The method of claim 1 and further comprising generating a display at the point of sale to indicate check verification data regarding each customer's check.\n10. A system for performing targeted marketing on infrequent shoppers comprising:\na check reader for automatically reading the MICR code of a plurality of checks drawn on a plurality of different banking institutions;\ncircuitry for detecting the customer's checking account number in the MICR code of said checks;\na terminal for entering data relating to the customer's shopping habits;\nmeans for creating a database of the store's customers in response to said check reader, circuitry for detecting, and terminal; and\nmeans for enabling the selection of a list of customers from said database whose prior transactions at the store during a prescribed time internal do not meet predetermined criteria.\n11. The system of claim 10 and further comprising means for transmitting marketing documents to said list of customers.\n12. The system of claim 11 and further comprising means for generating a coupon at the point of sale for distribution to said list of customers.\n13. The system of claim 10 and further comprising means for comparing the customer's checking account number of each new check read by said check reader with said database.\n14. The system of claim 13 and further comprising a display for indicating when a customer's checking account number is not stored in said database, wherein customer information may then be input from said terminal into the database for that customer.\n15. The system of claim 14 wherein said display is located at the point of sale.\n16. The system of claim 14 wherein said display is located remote from the point of sale.\n17. The system of claim 14 wherein said display also generates information regarding the credit worthiness of the customer.\n18. A check transaction processing system comprising:\nmeans for entering a customer's checking account number as a unique customer identification code within a retail establishment;\na processor programmed to store a database which includes a plurality of unique customer identification codes and check cashing histories of prior customers of the retail establishment;\nmeans for causing said processor to compare each newly entered unique customer identification code against said database;\nmeans within said processor for generating a signal indicating the presence of a complete customer information record or of an incomplete customer information record as a result of said comparison;\nmeans for generating a second database of customers whose check cashing histories do not meet predetermined criteria; and\nmeans for selectively effecting promotion of the retail establishment to customers within said second database.\n19. The system of claim 18 wherein said means for entering comprises a check reader for scanning the MICR code on checks.\n20. The system of claim 18 wherein said means for entering also enters the bank transit number of a customer to be used in combination with said checking account number as a unique customer identification code.\n21. The system of claim 19 and further comprising means for eliminating portions of the MICR codes read by said check reader while retaining the customer's checking account number.\n22. The system of claim 19 and further comprising data storage means for storing data regarding the location of a customer's checking account number in the MICR code of a plurality of different banking institutions.\n23. The system of claim 19 and further comprising data storage means for storing data regarding the location of a customer's bank transit number in the MICR code of a plurality of different banking institutions.\n24. The system of claim 19 and further comprising a display coupled with said memory in order to generate indications of the credit worthiness of checks offered by customers.\n25. The system of claim 19 and further comprising a display at the point of sale for providing an indication of the credit worthiness of a customer.\n26. A method for building a customer database comprising:\nin response to the presentation of a customer's check at a point of sale, entering the customer's checking account identification code from the check, along with customer transaction data;\nstoring a first database of said customer's checking account identification codes and customer transaction data;\ngenerating a second database of customers whose last checking account identification code entry data falls prior to a pre-selected date, such that said second database constitutes a record of relatively infrequent customers; and\neffecting sales promotion to said customers within said second database, wherein said sales promotion is efficiently directed toward only said relatively infrequent customers.\n27. The method of claim 26 and further comprising:\ngenerating a third database of customers whose last unique customer identification code entry date falls within a second pre-selected date range; and\neffecting a different type of sales promotion to customers within said third database.\n28. The method of claim 26 wherein said customer's checking account identification code comprises the checking account number and the bank transit number.\n29. The method of claim 26 wherein said step of effecting sales promotion comprises providing an incentive coupon to the customer at the point-of-sale.\n30. The method of claim 26 wherein said step of effecting sales promotion comprises providing incentive coupons to the home address of the customer.\n31. The method of claim 30 wherein a signal is generated to the point-of-sale indicating when a unique customer identification code entry date falls with said pre-selected date range; and\nwherein the sales clerk at the point-of-sale takes an action to insure the effectation of said sales promotion.\n32. The method of claim 31 wherein said action of the sales clerk comprises dispensing an incentive coupon to the customer.\n33. The method of claim 31 wherein said action of the sales clerk comprises identifying the customer's check for subsequent marketing efforts.\n34. The system for performing marketing comprising:\nmeans for entering a checking account number in response to the presentation of customer's check of the point of sale, along with customer transaction date data;\nmeans for generating a signal upon entry of a checking account number of customers whose prior transaction at the store during a prescribed time interval fails to meet predetermined criteria; and\nmeans responsive to said signal for effecting sales promotion to said customers, wherein said sales promotion is efficiently directed toward only said class of customers who fail to meet said predetermined criteria.\n35. The system of claim 34 wherein said means for entering comprises a check MICR code reader.\n36. The system of claim 34 wherein said means for entering comprises a data terminal for being operated by the store clerk.\n37. The system of claim 34 wherein the sales clerk dispenses an incentive coupon to the customer at the point-of-sale in response to said signal.\n38. The system of claim 34 wherein the sales clerk identifies the customer's check in response to said signal so that subsequent marketing to the customer may be effected.\n39. The system of claim 34 wherein said signal is transmitted to and displayed at the point-of-sale.\n40. The system of claim 34 wherein said predetermined criteria comprises a last customer checking account number entry date which falls within a predetermined date, in order to identify infrequent shoppers.\n41. The system of claim 34 wherein said predetermined cirteria comprises a level of purchases above a preset level during a prescribed time interval.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US2995727A",
        "US3316536A",
        "US3465289A",
        "US3528058A",
        "US3535682A",
        "US3576539A",
        "US3605092A",
        "US3629829A",
        "US3786421A",
        "US3833885A",
        "US3876981A",
        "US3914789A",
        "US3941977A",
        "US3987411A",
        "US4015701A",
        "US4027142A",
        "US4053737A",
        "US4053735A",
        "US4063070A",
        "US4087789A",
        "US4088879A",
        "US4107653A",
        "US4109238A",
        "US4127770A",
        "US4143356A",
        "US4143355A",
        "US4148010A",
        "US4176783A",
        "US4208575A",
        "US4245211A",
        "US4260880A",
        "USRE30579E",
        "USRE30580E",
        "US4277689A",
        "US4356472A",
        "US4380734A",
        "US4381494A",
        "US4396902A",
        "US4399553A",
        "US4404649A",
        "US4439670A",
        "US4441204A",
        "US4453074A",
        "US4510615A",
        "US4523330A",
        "US4547899A",
        "US4547780A",
        "US4617457A",
        "US4628194A",
        "US4672377A",
        "US4673802A",
        "US4678895A",
        "US4723212A",
        "US4748673A",
        "US4776021A",
        "US4797938A",
        "US4809351A",
        "US4810866A",
        "US4812628A",
        "US4882675A",
        "US4891503A",
        "US4897880A",
        "US4910672A",
        "US4949256A",
        "US4975841A",
        "US5010485A",
        "US5014324A",
        "US5035607A",
        "US5054092A",
        "US5053955A",
        "US5056019A",
        "US5070452A",
        "US5091634A"
    ],
    "citations_ftf": [
        "US30580A",
        "US30579A",
        "US3949363A",
        "US4201978A",
        "US4674041A",
        "US4554446A",
        "US4672572A",
        "US4703423A",
        "US5173851A",
        "US4670853A",
        "US4727243A",
        "JPS61109169A",
        "US4748668A",
        "US4825045A",
        "US4833308A",
        "US4799156A",
        "US5053607A",
        "US4750119A",
        "US4791281A",
        "US5025372A",
        "US4885685A",
        "US4933536A",
        "US4887207A",
        "US5040226A",
        "US5253345A",
        "US5185695A",
        "US5095195A",
        "US4908761A",
        "US5237496A",
        "US4982346A",
        "US4941090A",
        "US5117355A",
        "US5202826A",
        "US5008518A",
        "US5201010A",
        "US5237620A",
        "US5128520A",
        "JPH03288297A",
        "US5077805A",
        "US5179375A",
        "US5245533A",
        "US5251152A",
        "US5249044A"
    ],
    "citedby_own": [
        "US5305196A",
        "US5327508A",
        "US5506691A",
        "US5535407A",
        "US5621812A",
        "US5642485A",
        "US5649114A",
        "US5679938A",
        "WO1998002835A1",
        "US5794210A",
        "US5832457A",
        "US5870724A",
        "US5924078A",
        "US5923016A",
        "US6055513A",
        "US6055573A",
        "US6061658A",
        "US6064987A",
        "US6075971A",
        "US6076068A",
        "WO2000039725A2",
        "US6119099A",
        "US6138105A",
        "US6223163B1",
        "US6246997B1",
        "US20010005849A1",
        "EP1116145A1",
        "US20010014893A1",
        "US6282516B1",
        "US6292786B1",
        "US6298331B1",
        "US6298329B1",
        "US6298348B1",
        "US20010028301A1",
        "US6321221B1",
        "US20010054003A1",
        "US6334108B1",
        "US6334127B1",
        "US20010056376A1",
        "US20020052776A1",
        "US6397193B1",
        "US6412012B1",
        "US20020083444A1",
        "US20020095333A1",
        "US20020095335A1",
        "US6427912B1",
        "US6430539B1",
        "US20020107728A1",
        "US20020116286A1",
        "US20020161653A1",
        "US20020161779A1",
        "US20020161643A1",
        "US20020169664A1",
        "US20020178445A1",
        "US20020184077A1",
        "US20020188509A1",
        "US20020194068A1",
        "US20020194058A1",
        "US20030018732A1",
        "US20030023898A1",
        "US6516302B1",
        "US20030033211A1",
        "US20030046230A1",
        "US20030055730A1",
        "US20030075596A1",
        "US20030112236A1",
        "US6582304B2",
        "US20030126006A1",
        "US20030130933A1",
        "US20030135414A1",
        "US20030135442A1",
        "US20030137583A1",
        "US20030144933A1",
        "US6611814B1",
        "US20030200144A1",
        "US20030204444A1",
        "US20030212599A1",
        "US20030216987A1",
        "US20030216988A1",
        "US20030217003A1",
        "US20030219122A1",
        "US20030225686A1",
        "US6694300B1",
        "US20040032083A1",
        "KR100403984B1",
        "US20040039645A1",
        "US20040054586A1",
        "US20040054593A1",
        "US20040088221A1",
        "US20040109596A1",
        "US20040138953A1",
        "US20040171378A1",
        "US20040177004A1",
        "US20040186802A1",
        "US6799190B1",
        "US20040200898A1",
        "US20040254835A1",
        "US20050043994A1",
        "US6862575B1",
        "US6876978B1",
        "US20050114207A1",
        "US20050109842A1",
        "US20050163462A1",
        "US6925477B1",
        "US20050177401A1",
        "US20050177503A1",
        "US20050177502A1",
        "US20050185018A1",
        "US6954732B1",
        "US20050225524A1",
        "US20050240462A1",
        "US20050240468A1",
        "US20050261973A1",
        "US20050283429A1",
        "US6980968B1",
        "US7007003B1",
        "US20060053056A1",
        "US7013315B1",
        "US20060123066A1",
        "US7062510B1",
        "US20060136629A1",
        "US20060161952A1",
        "US7103579B1",
        "US20060218089A1",
        "US20060218049A1",
        "US20060235755A1",
        "US20060237281A1",
        "US7136634B1",
        "US20060271441A1",
        "US20060271402A1",
        "US20070038540A1",
        "US20070124401A1",
        "US20070123241A1",
        "US7228285B2",
        "US20070132836A1",
        "US7236942B1",
        "US7240022B1",
        "US20070162303A1",
        "US20070192320A1",
        "US20070214079A1",
        "US7272569B1",
        "US20070233571A1",
        "US20070240181A1",
        "US7299240B1",
        "US7302446B1",
        "US7308254B1",
        "US7340419B2",
        "US20080059352A1",
        "US20080077488A1",
        "US7359920B1",
        "US20080091508A1",
        "US7364068B1",
        "US20080109445A1",
        "US20080109294A1",
        "US7386485B1",
        "US7392224B1",
        "US20080162258A1",
        "US20080162554A1",
        "US20080221982A1",
        "US20080249902A1",
        "US7437313B1",
        "US20080270579A1",
        "US20080294584A1",
        "US20080313293A1",
        "US20090013053A1",
        "US20090037431A1",
        "US7500258B1",
        "US20090070189A1",
        "US20090076883A1",
        "US20090089581A1",
        "US20090106112A1",
        "US20090129377A1",
        "US20090138365A1",
        "US7542919B1",
        "US20090144179A1",
        "US7548874B2",
        "US7552069B2",
        "US7593605B2",
        "US20090254971A1",
        "US20090271248A1",
        "US20090288012A1",
        "US20090294532A1",
        "US7650304B1",
        "US20100057532A1",
        "US7690013B1",
        "US20100106583A1",
        "US20100131369A1",
        "US7729945B1",
        "US7739162B1",
        "US7753259B1",
        "US7784682B2",
        "US7788358B2",
        "US7801816B2",
        "US7826923B2",
        "US7827057B1",
        "US7831467B1",
        "US20100293165A1",
        "US20100299246A1",
        "US20100299195A1",
        "US7860789B2",
        "US20110004514A1",
        "US20110019020A1",
        "US20110029390A1",
        "US20110026838A1",
        "US7885726B2",
        "US7894936B2",
        "US20110043652A1",
        "US7899710B1",
        "US20110060905A1",
        "US20110072395A1",
        "US20110085211A1",
        "US20110096174A1",
        "US7962404B1",
        "US20110142371A1",
        "US20110145102A1",
        "US20110161109A1",
        "US7991689B1",
        "US20110218924A1",
        "US20110225046A1",
        "US8020754B2",
        "US8032714B2",
        "US8036979B1",
        "US8059796B2",
        "US8145549B2",
        "US8175921B1",
        "US8175908B1",
        "US8179563B2",
        "US8190513B2",
        "US8225347B1",
        "US8229844B2",
        "US8225995B1",
        "USRE43571E1",
        "US8261094B2",
        "US20120226754A1",
        "US8285577B1",
        "US8306908B1",
        "US8306975B1",
        "US8315909B1",
        "US8315364B2",
        "US8313023B1",
        "US8321243B1",
        "US8346620B2",
        "US8364588B2",
        "US8376224B2",
        "US8386276B1",
        "US8392334B2",
        "US8392214B1",
        "US8392209B1",
        "US8407137B2",
        "CN102999618A",
        "US8412593B1",
        "US8408455B1",
        "US8418055B2",
        "US8443385B1",
        "US8442331B2",
        "US8447670B1",
        "US8447066B2",
        "US8458052B2",
        "US8473341B1",
        "US8489624B2",
        "US8489415B1",
        "US8505090B2",
        "US8505813B2",
        "US8511550B1",
        "US8533086B1",
        "US8531710B2",
        "US8533138B2",
        "US8538777B1",
        "US8540574B1",
        "US8560161B1",
        "US8566117B1",
        "US8606626B1",
        "US8606666B1",
        "US8620083B2",
        "US8626560B1",
        "US8626525B2",
        "US8630942B2",
        "US8635083B1",
        "US8668146B1",
        "US8684265B1",
        "US8700458B2",
        "US8713418B2",
        "US8712836B2",
        "US8712857B1",
        "US8732004B1",
        "US8751391B2",
        "US8751298B1",
        "US8769567B1",
        "US8781228B2",
        "US8788296B1",
        "US8789091B2",
        "US8793160B2",
        "US8874504B2",
        "US8892495B2",
        "US8923766B2",
        "US8930263B1",
        "US9058627B1",
        "US9081799B2",
        "US9116890B2",
        "US9143638B2",
        "US9147217B1",
        "US9152727B1",
        "US20150371481A1",
        "US9251486B2",
        "US9268852B2",
        "US9323784B2",
        "US9535563B2",
        "US9654541B1",
        "US9658901B2",
        "US9672560B2",
        "US9704174B1",
        "US9767309B1",
        "US9830646B1",
        "US9892419B1",
        "US9904898B2",
        "US9990642B2",
        "US10062062B1",
        "US10061464B2",
        "US10242019B1",
        "US10262362B1",
        "US10297344B1",
        "US10313480B2",
        "US10361802B1",
        "US10395205B2",
        "US10409867B1",
        "US10417704B2",
        "US10423759B1",
        "CN110428075A",
        "US10511692B2",
        "US10524165B2",
        "US10552769B2",
        "US10565181B1",
        "US10580025B2",
        "US10580054B2",
        "US10606984B1",
        "US10635783B2",
        "US10678894B2",
        "US10740404B1",
        "US10769431B2",
        "US10789562B2",
        "US10810605B2",
        "US10909617B2",
        "US10936629B2",
        "US10977727B1",
        "JP2021144647A",
        "US11157997B2",
        "US11157835B1",
        "US11210276B1",
        "US11257117B1",
        "US11301922B2",
        "US11323505B2",
        "US11507688B1",
        "US11682041B1"
    ],
    "citedby_ftf": [
        "CA2067987A1",
        "US6850252B1",
        "US5903454A",
        "US6400996B1",
        "US6418424B1",
        "JP3260813B2",
        "US7019770B1",
        "US5557513A",
        "US5767848A",
        "US5732200A",
        "US5459306A",
        "US5628004A",
        "JPH11511273A",
        "US6237145B1",
        "US7917386B2",
        "US20020178051A1",
        "US5773807A",
        "US7024374B1",
        "US5857175A",
        "IL114965A",
        "AU714296B2",
        "US5774870A",
        "US5983196A",
        "US6885994B1",
        "US5970469A",
        "US9519915B1",
        "US5995942A",
        "AU2068997A",
        "AU2552197A",
        "US6059185A",
        "US5987434A",
        "US5761432A",
        "US5956693A",
        "DE19641092A1",
        "WO1998021713A2",
        "US5813003A",
        "US5832482A",
        "US6193152B1",
        "US7251617B1",
        "US6415262B1",
        "US20020161670A1",
        "US6619549B2",
        "US6925441B1",
        "US6078891A",
        "US7035699B1",
        "US20020055906A1",
        "US7240021B1",
        "AU3205199A",
        "US7809642B1",
        "US6615189B1",
        "US6486768B1",
        "EP0991003A3",
        "US7742966B2",
        "US6594635B1",
        "US7660763B1",
        "US6032136A",
        "US7150030B1",
        "EP1188135A2",
        "US8538801B2",
        "US6847373B1",
        "US6542913B1",
        "US6330554B1",
        "US6882984B1",
        "US7058817B1",
        "CN1280344A",
        "CA2381387A1",
        "US7912761B2",
        "US7103565B1",
        "US7321864B1",
        "WO2001033477A2",
        "US6876991B1",
        "US6901373B1",
        "US7370004B1",
        "US10275780B1",
        "US8571975B1",
        "GB2376385B",
        "US6615190B1",
        "US6867789B1",
        "US6941279B1",
        "US20020165771A1",
        "US7627498B1",
        "US8612292B1",
        "US8473342B1",
        "US7113914B1",
        "US7426530B1",
        "US10185936B2",
        "US7831508B1",
        "US7069236B1",
        "US20020010629A1",
        "WO2002011019A1",
        "US7747866B1",
        "US8335855B2",
        "US7246263B2",
        "KR100397813B1",
        "FI113428B",
        "US7844489B2",
        "US20020053076A1",
        "US20030158776A1",
        "US20020052752A1",
        "US20020052780A1",
        "US7454373B2",
        "US8285641B2",
        "JP2002149874A",
        "US6631849B2",
        "US6985873B2",
        "US8805739B2",
        "US20020160761A1",
        "US20020161640A1",
        "US7272857B1",
        "US8849716B1",
        "US7139793B2",
        "US20020188511A1",
        "US20020172995A1",
        "AU2002305653A1",
        "US7689506B2",
        "US20030023492A1",
        "WO2003001363A1",
        "US7266839B2",
        "US7809641B2",
        "US6945453B1",
        "US8800857B1",
        "US7311244B1",
        "US7103576B2",
        "US7099850B1",
        "JP3860448B2",
        "US20070078719A1",
        "CA2466071C",
        "US7987501B2",
        "US20100030675A1",
        "US7941533B2",
        "US7392396B2",
        "US20030172017A1",
        "US7756896B1",
        "US7353383B2",
        "US20180165441A1",
        "US7899753B1",
        "US20040210498A1",
        "US7614550B1",
        "US6957770B1",
        "US7520422B1",
        "US7753268B1",
        "US7246324B2",
        "US9710852B1",
        "US7143174B2",
        "US7472171B2",
        "US8239304B1",
        "US20040044961A1",
        "US6837425B2",
        "US7234065B2",
        "US7809595B2",
        "US7058660B2",
        "US8301493B2",
        "US20040153418A1",
        "WO2004077278A2",
        "WO2004097690A1",
        "US20040225555A1",
        "US7376838B2",
        "US8458033B2",
        "US7953663B1",
        "US20050055555A1",
        "US8239323B2",
        "US7593876B2",
        "US8190893B2",
        "US20080302873A1",
        "US7421696B2",
        "US20100174826A1",
        "US7640205B2",
        "US7100820B2",
        "US20050149440A1",
        "US20060247975A1",
        "US20050144100A1",
        "US7392386B2",
        "US7562058B2",
        "US7725300B2",
        "US8170841B2",
        "US8165853B2",
        "US20050234761A1",
        "US7730003B2",
        "US7499897B2",
        "US7933762B2",
        "US7742997B1",
        "US7392222B1",
        "US20060053045A1",
        "US20060080593A1",
        "US20060095318A1",
        "US20060095307A1",
        "US7124937B2",
        "US20060190723A1",
        "US8630898B1",
        "US20070043615A1",
        "US7822682B2",
        "US8185877B1",
        "US20070027799A1",
        "US8583926B1",
        "US7860897B2",
        "US20070106593A1",
        "WO2007117674A2",
        "EP1843290A1",
        "US8342399B1",
        "US8793490B1",
        "US11062342B2",
        "US9940627B2",
        "US20080201226A1",
        "US7848980B2",
        "CN101647040A",
        "US8615426B2",
        "US20080154735A1",
        "WO2008086421A1",
        "US20080177659A1",
        "WO2008118974A1",
        "US20100106584A1",
        "US8473735B1",
        "US20080294514A1",
        "US8676642B1",
        "US8655719B1",
        "US8170527B2",
        "US20090089190A1",
        "US9690820B1",
        "US20090119170A1",
        "US9990674B1",
        "US8127986B1",
        "US8622308B1",
        "US8321682B1",
        "US9715709B2",
        "US8346662B2",
        "US8312033B1",
        "US9542687B2",
        "US8478692B2",
        "US20090326977A1",
        "US20100030644A1",
        "US9256904B1",
        "US20100217709A1",
        "US10706402B2",
        "US8977567B2",
        "US9824355B2",
        "US20100138338A1",
        "WO2010036677A2",
        "US20100094733A1",
        "US8060424B2",
        "US8204477B2",
        "CA2749637A1",
        "US9710802B2",
        "US9449327B2",
        "US20100274653A1",
        "US10387885B2",
        "US20100306029A1",
        "US9608826B2",
        "US8364518B1",
        "US10546332B2",
        "US9841282B2",
        "US9443253B2",
        "US20110029367A1",
        "US20110035280A1",
        "US20110035278A1",
        "US20110047072A1",
        "WO2011019759A2",
        "US20110060631A1",
        "US20110060636A1",
        "US9031860B2",
        "US20110087519A1",
        "US20110087547A1",
        "US20110087546A1",
        "US9342835B2",
        "US20110087530A1",
        "US8595058B2",
        "US20110093324A1",
        "US20110093335A1",
        "US8676639B2",
        "US8626705B2",
        "US20110125565A1",
        "US20110145051A1",
        "US8775245B2",
        "US20110231258A1",
        "US20110231224A1",
        "US20110231305A1",
        "US20110231225A1",
        "US8639567B2",
        "US8738418B2",
        "US9697520B2",
        "US9471926B2",
        "US8359274B2",
        "US8781896B2",
        "US9760905B2",
        "US9972021B2",
        "US9679299B2",
        "US10373175B2",
        "US20120072290A1",
        "US10055745B2",
        "US9477967B2",
        "US20120084135A1",
        "US9558502B2",
        "US10007915B2",
        "US10438299B2",
        "US9607336B1",
        "US9483606B1",
        "US10223707B2",
        "US9106691B1",
        "US9466075B2",
        "US10380617B2",
        "US8738516B1",
        "JP5971034B2",
        "US10290018B2",
        "US10497022B2",
        "US10672018B2",
        "US9853959B1",
        "WO2013188585A1",
        "WO2014055568A1",
        "US10255598B1",
        "US10360627B2",
        "US10102570B1",
        "US9870589B1",
        "US9406085B1",
        "US9419957B1",
        "US10685398B1",
        "US9443268B1",
        "US10496946B2",
        "US10489754B2",
        "US9058626B1",
        "US10325314B1",
        "US9477737B1",
        "US10148726B1",
        "USD759689S1",
        "USD760256S1",
        "USD759690S1",
        "US10419379B2",
        "US9892457B1",
        "US10354268B2",
        "US10650398B2",
        "US10438226B2",
        "US11210669B2",
        "US9691085B2",
        "US10713670B1",
        "WO2019074961A1",
        "US11157139B2",
        "US11265324B2",
        "US11315179B1",
        "US11113702B1",
        "US11238656B1",
        "US11205214B2"
    ]
}