{
    "patent_link": "https://patents.google.com/patent/US6157707A/en",
    "patent_id": "US6157707A",
    "title": "Automated and selective intervention in transaction-based networks",
    "abstract": "Fraud losses in a communication network are substantially reduced by automatically and selectively invoking one or more authentication measures based on a fraud score that indicates the likelihood of fraud for that particular call or previously scored calls. By selectively invoking authentication on only those calls that are suspected or confirmed to be fraudulent, fraud prevention can be achieved in a way that both reduces fraud losses and minimizes disruptions to legitimate subscribers. Using telecommunication fraud as an example, a subscriber is registered in a system by collecting data on that subscriber based on the particular authentication method being used, such as shared knowledge (e.g., passwords), biometric validation (e.g., voice verification), and the like. Once registered, the authentication function for the subscriber's account is activated and subsequent calls are then scored for the likelihood of fraud during the call setup request phase. Fraud scoring estimates the probability of fraud for each call based on the learned behavior of an individual subscriber and the learned behavior of fraud perpetrators. If fraud is not suspected based on the fraud score, then normal call processing can resume without the need for authentication. If fraud is suspected based on the fraud score, then the system automatically invokes authentication. If authentication indicates suspicion of fraud, e.g., voice prints do not match, then the call may be either be blocked or referred for other appropriate prevention measures, e.g., intercepted by an operator. If fraud is not indicated by authentication, then normal call processing may resume.",
    "inventors": [
        "Gerald Donald Baulier",
        "Michael H. Cahill",
        "Virginia Kay Ferrara",
        "Diane Lambert"
    ],
    "assignee": "Nokia of America Corp",
    "classifications": [
        "H04W12/12",
        "H04M15/00",
        "H04M15/47",
        "H04M15/58",
        "H04M3/36",
        "H04M3/382",
        "H04W12/065",
        "H04M2203/6027",
        "H04M2215/0148",
        "H04M2215/0188"
    ],
    "claims": "\n1. A method for reducing fraudulent activity in a telecommunication network, comprising the step of:\nautomatically and selectively invoking at least one authentication measure during a call processing state for a particular call as a function of scoring calls for the likelihood of fraud, wherein the at least one authentication measure is selectively invoked based on a fraud score, the fraud score being derived as a function of a legitimate subscriber signature and a fraud signature, such that fraudulent activity in the network is reduced on a targeted basis thereby reducing disruptions to legitimate activity in the network.\n2. The method according to claim 1, wherein the at least one authentication measure is selected from the group consisting of voice verification, biometric validation, and shared knowledge-based verification.\n3. The method according to claim 1, wherein scoring is done on a call-by-call basis using a real-time transaction processing platform.\n4. The method according to claim 1, wherein the fraud score is based on learned behavior of a subscriber comprising the subscriber signature and learned behavior of fraudulent calling activity comprising the fraud signature.\n5. The method according to claim 1, wherein the at least one authentication measure is selectively invoked on calls suspected of being fraudulent and calls confirmed to be fraudulent based on the fraud score.\n6. A method for controlling a network where transactions occur, comprising the step of:\nautomatically and selectively invoking at least one process during a particular transaction based on automated analysis of usage in the network wherein the at least one process is selectively invoked to reduce fraudulent activity in the network on a targeted basis thereby reducing disruptions to legitimate activity in the network.\n7. The method according to claim 6, wherein automated analysis of usage in the network includes identifying the likelihood of fraud for transactions occurring in the network.\n8. A method for reducing fraudulent activity in a telecommunication network, comprising the steps of:\nregistering a subscriber by collecting information on that subscriber, wherein the information corresponds to a prescribed authentication measure;\nactivating the prescribed authentication measure for that subscriber's account;\nscoring a call for the likelihood of fraud during a call setup request phase; and\nif fraud is suspected based on the scoring step, automatically and selectively invoking authentication for the call according to the prescribed authentication measure,\nwhereby fraudulent activity in the network is reduced on a targeted basis thereby reducing disruptions to legitimate activity in the network.\n9. The method according to claim 8, further comprising the step of, if authentication indicates suspicion of fraud, initiating one or more prescribed call processing measures.\n10. The method according to claim 9, wherein the step of initiating one or more prescribed call processing measures is a step selected from the group consisting of blocking the call, terminating the call, and routing the call to an operator.\n11. The method according to claim 8, wherein the prescribed authentication measure is voice verification, and wherein the step of registering includes the step of collecting a voice print for the subscriber.\n12. The method according to claim 8, wherein the step of activating includes the step of receiving input from an external fraud management system that recommends authentication based on analysis of a suspected fraud case.\n13. The method according to claim 8, wherein a fraud score of an individual call is representative of the likelihood of fraud based on the learned behavior of a subscriber comprising a subscriber signature and the learned behavior of fraudulent calling activity comprising a fraud profile.\n14. The method according to claim 8, wherein the prescribed authentication measure is biometric validation, and wherein the step of registering includes the step of collecting biometric information for the subscriber.\n15. The method according to claim 8, wherein the prescribed authentication measure is shared knowledge-based verification.\n16. The method according to claim 8, wherein the step of registering is triggered by an event selected from the group consisting of establishment of a new account and monitored changes to an existing account.\n17. The method according to claim 8, wherein the step of activating includes the step of receiving a provisioning request.\n18. A system for reducing fraudulent activity in a network, comprising:\nmeans for scoring calls in the network and for generating a fraud score indicative of the likelihood of fraud; and\nmeans, responsive to the fraud score for automatically and selectively invoking at least one authentication measure during a call processing state for a particular call,\nsuch that fraudulent activity in the network is reduced on a targeted basis thereby reducing disruptions to legitimate activity in the network.\n19. The system according to claim 18, wherein the network is an intelligent network (IN) including one or more service switching points (SSPs), one or more signal transfer points (STPs), and one or more service control points (SCPs).\n20. The system according to claim 18, wherein the network is an adjunct-based network.\n21. A method for reducing fraudulent activity in a telecommunication network, comprising the step of:\nresponsive to call scoring, automatically and selectively authenticating a call, wherein call scoring provides an indication of the likelihood of fraud as a function of a legitimate subscriber signature and a fraud signature, such that fraudulent activity in the network is reduced on a targeted basis thereby reducing disruptions to legitimate activity in the network.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4363102A",
        "US4799255A",
        "US5345595A",
        "US5357564A",
        "US5375244A",
        "US5448760A",
        "US5465387A",
        "US5495521A",
        "WO1996008907A2",
        "US5502759A",
        "US5504810A",
        "US5506893A",
        "US5566234A",
        "US5602906A",
        "GB2303275A",
        "US5623539A",
        "US5627886A",
        "US5675704A",
        "US5677989A",
        "US5706338A",
        "US5768354A",
        "US5819226A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "WO2001067201A2",
        "US20010025345A1",
        "US6356630B1",
        "US20020161711A1",
        "US20030050081A1",
        "US6570968B1",
        "US20030112942A1",
        "US20030208689A1",
        "US6763098B1",
        "US6804331B1",
        "US20040250085A1",
        "US20050043997A1",
        "GB2407681A",
        "US20050125280A1",
        "US20050185779A1",
        "US6937702B1",
        "US20050262563A1",
        "US20050278270A1",
        "US20060041464A1",
        "WO2005033830A3",
        "US20070294182A1",
        "US20080109392A1",
        "US7403967B1",
        "US20080256139A1",
        "US20080319896A1",
        "US7478422B2",
        "US7653742B1",
        "US20100080372A1",
        "US7740168B2",
        "US7783745B1",
        "US20100257576A1",
        "US20110022483A1",
        "US20110022518A1",
        "US7917647B2",
        "US20110106579A1",
        "US8082349B1",
        "US20120158541A1",
        "US8234494B1",
        "US8380629B2",
        "US8458090B1",
        "US8495231B1",
        "US8533118B2",
        "US8572398B1",
        "US8725613B1",
        "US8914645B2",
        "US9065643B2",
        "US9106691B1",
        "US9118669B2",
        "US9143506B2",
        "US9147042B1",
        "US9230283B1",
        "US9251541B2",
        "US9256904B1",
        "US9342783B1",
        "USD759690S1",
        "USD759689S1",
        "USD760256S1",
        "US9400589B1",
        "US9406085B1",
        "US9443268B1",
        "US9477737B1",
        "US9529851B1",
        "US9536263B1",
        "US9558519B1",
        "US9607336B1",
        "US9633322B1",
        "US9654541B1",
        "US9652802B1",
        "US9697263B1",
        "US9710852B1",
        "US9721147B1",
        "US9830646B1",
        "US9853959B1",
        "US9870589B1",
        "US9892457B1",
        "US9930173B2",
        "US9930088B1",
        "US20180089688A1",
        "US9996837B2",
        "US10057398B2",
        "US10075446B2",
        "US10102570B1",
        "US10102536B1",
        "US10176233B1",
        "US10255598B1",
        "US10262362B1",
        "US10262364B2",
        "US10325314B1",
        "US10339527B1",
        "US10373240B1",
        "US10397402B1",
        "US10417704B2",
        "US10592982B2",
        "US10593004B2",
        "US10616411B1",
        "US10621657B2",
        "US10664936B2",
        "US10671749B2",
        "US10685398B1",
        "US10699028B1",
        "US10735183B1",
        "US10757154B1",
        "US10896472B1",
        "US10901757B1",
        "US10911234B2",
        "US10951635B2",
        "US10963434B1",
        "US11030562B1",
        "US11151468B1",
        "US11227001B2",
        "US11238656B1",
        "US11315179B1",
        "US11463574B1",
        "US11620403B2"
    ],
    "citedby_ftf": [
        "DE69930237T2",
        "DE102005007802A1",
        "JP2006259836A",
        "CN100566251C",
        "JP2014027671A",
        "CN103685613B",
        "CN109003181B"
    ]
}