{
    "patent_link": "https://patents.google.com/patent/US20020073017A1/en",
    "patent_id": "US20020073017A1",
    "title": "Method and system of presenting data and analysis for use in stock market trading",
    "abstract": "The present invention is directed to a method and system of presenting data and analysis for use in stock market trading. The method includes the steps of receiving stock information from a stock data provider, and then analyzing the stock information to generate historical stock trading information. Graphical displays showing the historical stock trading information along with basic stock information are then generated in such a manner to facilitate rapid understanding of the information being displayed.",
    "inventors": [
        "John Robertson"
    ],
    "assignee": "Robert Bender Consulting Ltd",
    "classifications": [],
    "claims": "\n1. A method of presenting data and analysis for use in stock market trading comprising the steps of:\nreceiving stock information;\nanalyzing said stock information to generate historical stock trading information; and\ngenerating at least two graphical displays for displaying said historical stock trading information.\n2. The method of claim 1 wherein said graphical displays are colour coded to distinguish between values associated with said historical stock trading information within each of said graphical display.\n3. The method of claim 2 wherein said at least two graphical displays are selected from a group consisting of a basic stock information display, a market maker display, volume of sale display, a trade bar display, a bid/ask bar display and a histogram display.\n4. The method of claim 3 wherein if one of said graphical displays is said bid/ask bar display, said method further comprising a step of displaying bid/ask bars side-by-side.\n5. The method of claim 3 wherein if one of said graphical displays is said histogram display, said method further comprising displaying a three minute volume histogram and an overall volume histogram.\n6. The method of claim 5 further comprising a step of providing a three-minute volume bar to indicate a current three-minute minute volume of a maximum three minute volume over a predetermined time interval.\n7. The method of claim 3 wherein if one of said graphical displays is said basic stock information display, said method further comprising a step of providing bars to indicate percentage of stock transactions occurring at various price levels during a time interval.\n8. The method of claim 7 wherein said bars are colour coded to indicate said percentage.\n9. The method of claim 8 wherein a length of said bars also indicates said percentage.\n10. The method of claim 3 wherein if one of said graphical displays is said trade bar display, said method further comprising providing a position entry submission bar to indicate a stock market entry price for an individual.\n11. The method of claim 10 further comprising the step of providing a stop loss bar for indicating to said individual when a predetermined exit price has been reached.\n12. The method of claim 11 wherein said predetermined exit price may be an absolute amount of a percentage of said stock market entry price.\n13. The method of claim 1 wherein said stock information is Level II stock information.\n14. The method of claim 13 wherein said stock information is received from a stock data provider.\n15. A system of presenting data and analysis for use in stock market trading comprising:\na basic stock information display; and\nat least two graphical displays showing historical stock information.\n16. The system of claim 15 wherein said at least two graphical displays are colour coded to distinguish between values associated with said historical stock information within each of said graphical displays.\n17. The system of claim 16 wherein said at least two graphical displays are selected from a group consisting of a basic stock information display, a trade bar display, a market maker display, volume of sale display, a bid/ask bar display and a histogram display.\n18. The system of claim 17 wherein if said graphical display is said basic stock information display, said system further comprising bars to indicate a percentage of stock transactions occurring at various price levels during a time interval.\n19. The system of claim 18 wherein said bars are colour coded to indicate said percentage.\n20. The system of claim 19 wherein a length of said bars also indicates said percentage.\n21. The system of claim 17 wherein if said graphical display is said trade bar display, said system further comprising a position entry submission bar to indicate a stock market entry price for an individual.\n22. The system of claim 21 further comprising a stop loss bar for indicating to said individual when a predetermined exit price has been reached.\n23. The system of claim 22 wherein said predetermined exit price is an absolute amount of a percentage of said stock market entry price.\n24. A system of presenting data and analysis for use in stock market trading comprising:\na basic stock information display;\na graphical display showing historical stock information;\nwherein said graphical display is a bid/ask bar display including bid/ask bars placed side by side.\n25. A system of presenting data and analysis for use in stock market trading comprising:\na basic stock information display;\na graphical display showing historical stock information;\nwherein said basic stock information display includes colour coded bars to indicate a percentage of stock transactions occurring at various price levels during a time interval.\n26. The system of claim 25 wherein a length of said bars also indicates said percentage.\n27. A system of presenting data and analysis for use in stock market trading comprising:\na basic stock information display;\na graphical display showing historical stock information;\nwherein said graphical display is a trade bar display including a position entry submission bar to indicate a stock market entry price for an individual.\n28. The system of claim 27 further comprising a stop loss bar for indicating to said individual when a predetermined exit price has been reached.\n29. The system of claim 28 wherein said predetermined exit price is an absolute amount of a percentage of said stock market entry price.",
    "status": "Abandoned",
    "citations_own": [
        "US5270922A",
        "US5347452A",
        "US5880726A",
        "US5946666A",
        "US6012042A",
        "US6195647B1",
        "US6211880B1",
        "US6272474B1",
        "US6876981B1",
        "US6907404B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20020073021A1",
        "US20040093300A1",
        "US20040117292A1",
        "US20040148247A1",
        "US20040254870A1",
        "US20050021443A1",
        "US20050097029A1",
        "US20050262003A1",
        "US20060015436A1",
        "US20060195383A1",
        "US20060259384A1",
        "US20060265316A1",
        "US20060277132A1",
        "US20070027788A1",
        "US20070174174A1",
        "US20070298871A1",
        "US20080081684A1",
        "US7366691B1",
        "US20080183639A1",
        "US7426491B1",
        "US7542941B1",
        "US7571134B1",
        "US7574388B1",
        "US7587357B1",
        "US7620576B1",
        "US20100049666A1",
        "US20100169209A1",
        "US20100174637A1",
        "US20100174665A1",
        "US7756775B1",
        "US7801784B2",
        "US7809628B1",
        "US20100262901A1",
        "US20100299280A1",
        "US7890396B2",
        "US7966241B2",
        "US20110173133A1",
        "WO2011126456A1",
        "US20120109845A1",
        "US20120271748A1",
        "US8321334B1",
        "US20120310704A1",
        "US8463679B2",
        "US8510206B2",
        "US20150012405A1",
        "US20150026095A1",
        "US20150356675A1",
        "US9569797B1",
        "US9858619B2",
        "US10025842B1",
        "US10043214B1",
        "US10102570B1",
        "US10121198B2",
        "US10147138B2",
        "US10176233B1",
        "US10210572B2",
        "US10262364B2",
        "US10277659B1",
        "US10325314B1",
        "US10346917B2",
        "US10354324B2",
        "US10366450B1",
        "US10482532B1",
        "US10621657B2",
        "US10642999B2",
        "US10671749B2",
        "US10685398B1",
        "US11157872B2",
        "US11200620B2",
        "US11238656B1",
        "US11315179B1",
        "US11356430B1"
    ],
    "citedby_ftf": [
        "US7020629B1"
    ]
}