{
    "patent_link": "https://patents.google.com/patent/US3950733A/en",
    "patent_id": "US3950733A",
    "title": "Information processing system",
    "abstract": "An adaptive information processing system includes a module, called a Nestor module, having a plurality (N) of input terminals 1, 2 . . . , j . . . , N, adapted to receive N input signals s1, s2 . . . , sj . . . , SN, respectively, and a plurality (n) of output terminals 1, 2 . . . , i . . . , n, adapted to present n output responses r1, r2 . . . , ri . . . , rn, respectively. A plurality of junction elements, called mnemonders, couple various ones (or a multiplicity) of the input terminals with various ones (or a multiplicity) of the output terminals. These mnemonders provide a transfer of information from an input terminal j to an output terminal i in dependence upon the signal sj appearing at the input terminal j and upon the mnemonder transfer function Aij. Means are provided for modifying the transfer function Aij of the mnemonders in dependence upon the product of at least one of the input signals and one of the output responses of the Nestor module. In a preferred embodiment of the invention, the modification to the transfer function of each mnemonder takes the form: ##EQU1## WHERE η IS A CONSTANT OF PROPORTIONALITY.",
    "inventors": [
        "Leon N. Cooper",
        "Charles Elbaum"
    ],
    "assignee": "Nestor Inc",
    "classifications": [
        "G06F7/023",
        "G06F18/213",
        "G06N3/065"
    ],
    "claims": "\n1. An information processing module comprising, in combination:\na. a plurality (N) of input terminals 1, 2 . . . , j . . . , N adapted to receive N input signals s1, s2 . . . , sj . . . , sN, respectively;\nb. a plurality (n) of output terminals 1, 2 . . . , i . . . , n adapted to present n output responses r1, r2 . . . , ri . . . , rn, respectively;\nc. a plurality of junction elements, called mnemonders, each mnemonder coupling one of said input terminals (input j) with one of said output terminals (output i) and providing a transfer of information from input j to output i in dependence upon the signal sj appearing at the input j and upon the mnemonder transfer function Aij ; and\nd. means for modifying the transfer function Aij of at least one of said mnemonders, when in a learning mode, in dependence upon the product of at least one of said input signals and one of said output responses;\nwhereby modifications to the transfer functions of the mnemonders, when in a learning mode, take the form:\nεA.sub.ij = f (s.sub.1, s.sub.2 . . . , s.sub.j . . . , s.sub.N ; r.sub.1, r.sub.2 . . . , r.sub.i . . . , r.sub.n).\n2. The information processing module defined in claim 1, wherein the number of output terminals equals the number of input terminals (n = N).\n3. The information processing module defined in claim 1, wherein the number of output terminals is less than the number of input terminals (n < N).\n4. The information processing module defined in claim 1, wherein the number of output terminals is greater than the number of input terminals (n > N).\n5. The information processing module defined in claim 1, wherein at least one mnemonder is coupled to each one of said input terminals.\n6. The information processing module defined in claim 1, wherein each one of said output terminals is coupled to at least one mnemonder.\n7. The information processing module defined in claim 1, wherein at least one mnemonder is coupled to each input terminal and wherein each output terminal is coupled to at least one mnemonder.\n8. The information processing module defined in claim 1, wherein each one of said input terminals is coupled to at least one of said output terminals through a mnemonder.\n9. The information processing module defined in claim 1, wherein each one of said input terminals is coupled to each one of said output terminals through a mnemonder.\n10. The information processing module defined in claim 1, wherein the output sj ' of each mnemonder equals the product of its transfer function Aij and the signal sj applied at its input (sj ' = Aij sj).\n11. The information processing module defined in claim 1, wherein said transfer function modifying means includes means for modifying the transfer function Aij of each of said mnemonders.\n12. The information processing module defined in claim 1, wherein said transfer function modifying means includes means for modifying the transfer function Aij of at least one of said mnemonders in dependence upon the input signal sj applied thereto and the output response ri at the output terminal to which the mnemonder is coupled;\nwhereby the modifications to the transfer function of at least one of the mnemonders take the form:\nεA.sub.ij = f (s.sub.j, r.sub.i).\n13. The information processing module defined in claim 12, wherein said transfer function modifying means includes means for modifying the transfer function Aij of each one of said mnemonders in dependence upon the input signal sj applied thereto and the output response ri at the output terminal to which the mnemonder is coupled;\nwhereby the modifications to the transfer function of each of the mnemonders take the form:\nεA.sub.ij = f (s.sub.j, r.sub.i).\n14. The information processing module defined in claim 12, wherein said transfer function modifying means includes means for modifying the transfer function Aij of at least one of said mnemonders in proportion to the product of the input signal sj applied thereto and the output response ri at the output terminal to which the mnemonder is coupled;\nwhereby the modifications to the transfer function of at least one of the mnemonders take the form:\nεA.sub.ij = η s.sub.j r.sub.i,\nwhere η is the constant of proportionality.\n15. The information processing module defined in claim 14, wherein said transfer function modifying means includes means for modifying the transfer function Aij of each one of said mnemonders in proportion to the product of the input signal sj applied thereto and the output response ri at the output terminal to which the mnemonder is coupled;\nwhereby the modifications to the transfer function of each of the mnemonders take the form:\nεA.sub.ij = η s.sub.j r.sub.i ,\nwhere η is the constant of proportionality.\n16. The information processing module defined in claim 1, further comprising logic element means, connected between each output terminal and the mnemonders coupled thereto, for receiving mnemonder outputs sj ' and producing an output response ri in dependence upon said mnemonder outputs.\n17. The information processing module defined in claim 16, wherein each of said logic element means produces said output response ri in proportion to the sum of the mnemonder outputs sj ' applied thereto:\nwhereby said output response ri takes the form: ##EQU34##\n18. The information processing module defined in claim 1, further comprising:\na plurality (n) of threshold means T1, T2 . . . , Ti . . . , Tn, each connected to one of said output terminals, for producing an output signal if the output response ri applied thereto is greater than a threshold level θi (ri > θi or |ri | > θi).\n19. The information processing module defined in claim 18, further comprising:\nsignal suppression means, connected to the outputs of each of said threshold means, for suppressing all of the output responses r1, r2 . . . , rn except that response ri applied as an input to the threshold means Ti which is producing an output signal.\n20. The information processing module defined in claim 1, further comprising:\nsource means for selectively applying a specific desired output response riA to at least one of said output terminals;\nwhereby said information processing module may be caused to provide a \"correct\" output response r.sup.ω during its operation.\n21. An information processing system comprising, in combination:\na. at least one information processing module as defined in claim 1; and\nb. means for adjusting the transfer function Aij of each mnemonder of said module to a predetermined desired value,\nwhereby the system may be trained in a single operation.\n22. An information processing system comprising, in combination:\na. at least one information processing module as defined in claim 1; and\nb. means for selectively interrupting the operation of said modifying means of said module so that no modifications are made to the transfer function Aij of the mnemonders (εAij = 0),\nwhereby the system may be operated as a pure memory.\n23. An information processing system comprising, in combination:\na. at least one information processing module as defined in claim 1;\nb. buffer storage means for storing the transfer function Aij of each mnemonder of said module; and\nc. means for selectively transferring the transfer function Aij of each mnemonder to said buffer storage means,\nwhereby the transfer functions may be preserved for later use after a period of training of said module.\n24. An information processing system comprising, in combination:\na. at least one information processing module as defined in claim 1;\nb. buffer storage means for storing a plurality of transfer functions Aij ; and\nc. means for selectively transferring a transfer function Aij to at least one of said mnemonders of said module,\nwhereby said module can be trained in a single operation.\n25. An information processing system as defined in claim 24, wherein said transferring means includes means for selectively transferring the transfer function Aij of each mnemonder to said buffer storage means.\n26. An information processing system comprising in combination:\na. a plurality of information processing modules as defined in claim 1;\nb. means connecting the output terminals of at least one of said modules to the input terminals of at least one other of said modules,\nwhereby at least two modules are connected in series.\n27. The information processing system defined in claim 26, wherein the connecting means (b) includes means for connecting the output terminals of at least two of said modules to the input terminals of one other module,\nwhereby at least two modules are connected in series to a third.\n28. The information processing system defined in claim 26, wherein the connecting means (b) includes means for connecting the output terminals of one of said modules to the input terminals of at least two other modules,\nwhereby one module is connected in series to at least two other modules.\n29. The information processing system defined in claim 26, wherein the total number of output terminals of said at least one module is greater than the total number of input terminals of said at least one other module.\n30. The information processing system defined in claim 26, wherein the total number of output terminals of said at least one module is equal to the total number of input terminals of said at least one other module.\n31. The information processing system defined in claim 26, wherein the total number of output terminals of said at least one module is less than the total number of input terminals of said at least one other module.\n32. An information processing system comprising, in combination:\na. a plurality of information processing modules as defined in claim 1;\nb. means for connecting the output terminals of one of said modules to the input terminals of another,\nwhereby at least two modules are connected in series.\n33. The information processing system defined in claim 32, wherein said output terminals of one of said modules are connected to the input terminals of another in a random fashion.\n34. The information processing system defined in claim 32, wherein the output terminals of one of said modules are connected to the input terminals of another in an ordered fashion,\nwhereby each one of the output terminals of said one module is connected to one of the input terminals of said other module.\n35. An information processing system comprising, in combination:\na. a plurality of information processing modules as defined in claim 1;\nb. means for connecting the output terminals of one of said modules to the output terminals of another,\nwhereby at least two modules are connected in parallel.\n36. An information processing system comprising, in combination:\na. a plurality of information processing modules as defined in claim 1;\nb. means for connecting the input terminals of one of said modules to the input terminals of another,\nwhereby at least two modules are connected in parallel.\n37. The information processing module defined in claim 1, further comprising:\nsource means for selectively applying a specific desired output response riA to each one of said output terminals;\nwhereby said information processing module may be caused to provide a \"correct\" output response r.sup.ω during its operation.\n38. The information processing module defined in claim 1, wherein said modifying means includes means for reducing the value of the transfer function Aij of at least one of said mnemonders with a decay at a predetermined rate.\n39. The information processing module defined in claim 38, wherein said rate is constant, thereby to provide a uniform decay.\n40. The information processing module defined in claim 1, wherein said modifying means includes means for reducing the value of the transfer function Aij of each one of said mnemonders with a decay at a predetermined rate.\n41. The information processing module defined in claim 40, wherein said rate is constant, thereby to provide a uniform decay.\n42. The information processing module defined in claim 1, wherein the input signals s1, s2 . . . , sj . . . , sN and the output responses r1, r2 . . . , ri . . . , rn are represented by voltage levels.\n43. The information processing module defined in claim 42, wherein each of said mnemonders includes a gain controlled amplifier, the transfer function Aij of a mnemonder being represented by the gain of the mnemonder amplifier.\n44. The information processing module defined in claim 1, wherein each mnemonder includes means for storing its transfer function Aij.\n45. The information processing module defined in claim 44, wherein said storage means comprises a device for storing an electrical charge.\n46. The information processing module defined in claim 45, wherein said device is a capacitor.\n47. The information processing module defined in claim 44, wherein said modifying means includes means for adding said increments εAij to the stored transfer function Aij of a mnemonder.\n48. The information processing module defined in claim 47, wherein electrical charge stored in said storage means of the ij'th mnemonder is Qij ;\nwherein in each of said increments εAij is proportional to a respective increment εQij ;\nand wherein said means for adding increments εAij to the stored transfer function comprises, in combination:\na. means for producing a first pulse having an amplitude proportional to the input signal sj and having a width ti proportional to the absolute value of the output response ri ; and\nb. means, connected to said pulse producing means, for applying a second pulse to said device for storing an electrical charge, the pulse height and pulse width of said second pulse being proportional to the pulse height and pulse width of said first pulse and the polarity of said second pulse being equal to ri /|ri |.\n49. An information processing element comprising, in combination:\na. a plurality (N) of input terminals 1, 2 . . . , j . . . , N adapted to receive N input signals s1, s2 . . . , sj . . . , sN, respectively;\nb. an output terminal i adapted to present an output response ri ;\nc. a plurality (N) of junction elements, called mnemonders, each mnemonder coupling one of said input terminals (input j) to said output terminal (output i) and providing a transfer of information from input j to output i in dependence upon the signal sj appearing at the input j and upon the mnemonder transfer function Aij ; and\nd. means for modifying the transfer function Aij of at least one of said mnemonders, when in a learning mode, in dependence upon the product of at least one of said input signals and said output response;\nwhereby the modifications to the transfer function of the mnemonders, when in a learning mode, take the form:\nεA.sub.ij = f (s.sub.1, s.sub.2 . . . , s.sub.j . . . , s.sub.N ; r.sub.i).\n50. The information processing element defined in claim 49, wherein said modifying means includes means for reducing the value of the transfer function Aij of each one of said mnemonders with a decay at a predetermined rate.\n51. The information processing element defined in claim 50, wherein said rate is constant, thereby to provide a uniform decay.\n52. The information processing element defined in claim 49, wherein the output sj ' of each mnemonder equals the product of its transfer function Aij and the signal sj applied at its input (sj ' = Aij sj).\n53. The information processing element defined in claim 49, wherein said transfer function modifying means includes means for modifying the transfer function Aij of each of said mnemonders.\n54. The information processing element defined in claim 49, wherein said transfer function modifying means includes means for modifying the transfer function Aij of at least one of said mnemonders in dependence upon the input signal sj applied thereto and the output response ri at the output terminal;\nwhereby the modifications to the transfer function of at least one of the mnemonders take the form:\nεA.sub.ij = f (s.sub.j, r.sub.i).\n55. The information processing element defined in claim 54, wherein said transfer function modifying means includes means for modifying the transfer function Aij of each one of said mnemonders in dependence upon the input signal sj applied thereto and the output response ri at the output terminal;\nwhereby the modifications to the transfer function of each of the mnemonders take the form:\nεA.sub.ij = f (s.sub.j, r.sub.i).\n56. The information processing element defined in claim 54, wherein said transfer function modifying means includes means for modifying the transfer function Aij of at least one of said mnemonders in proportion to the product of the input signal sj applied thereto and the output response ri at the output terminal;\nwhereby the modifications to the transfer function of at least one of the mnemonders take the form:\nεA.sub.ij = η s.sub.j r.sub.i ,\nwhere η is the constant of proportionality.\n57. The information processing element defined in claim 56, wherein said transfer function modifying means includes means for modifying the transfer function Aij of each one of said mnemonders in proportion to the product of the input signal sj applied thereto and the output response ri at the output terminal;\nwhereby the modifications to the transfer function of each of the mnemonders take the form:\nεA.sub.ij = η s.sub.j r.sub.i ,\nwhere η is the constant of proportionality.\n58. The information processing element defined in claim 49, further comprising logic element means, connected between said output terminal and the mnemonders coupled thereto, for receiving mnemonder outputs sj ' and producing an output response ri in dependence upon said mnemonder outputs.\n59. The information processing element defined in claim 58, wherein said logic element means produces said output response ri in proportion to the sum of the mnemonder outputs sj ' applied thereto;\nwhereby said output response ri takes the form: ##EQU35##\n60. The information processing element defined in claim 49, further comprising:\na threshold means Ti, connected to said output terminal, for producing an output signal if the output response ri applied thereto is greater than a threshold level θi (ri > θi or |ri | > θi).\n61. The information processing element defined in claim 49, further comprising:\nsource means for selectively applying a specific desired output response riA to said output terminal;\nwhereby said information processing module may be caused to provide a \"correct\" output response r.sup.ω during its operation.\n62. The information processing element defined in claim 49, wherein said modifying means includes means for reducing the value of the transfer function Aij of at least one of said mnemonders with a decay at a predetermined rate.\n63. The information processing element defined in claim 62, wherein said rate is constant, thereby to provide a uniform decay.\n64. The information processing element defined in claim 49, wherein the signals s1, s2 . . . , sj . . . , sN and ri are represented by voltage levels.\n65. The information processing element defined in claim 64, wherein each of said mnemonders includes a gain controlled amplifier, the transfer function Aij of a mnemonder being represented by the gain of the mnemonder amplifier.\n66. The information processing element defined in claim 49, wherein each mnemonder includes means for storing its transfer function Aij.\n67. The information processing element defined in claim 66, wherein said storage means comprises a device for storing an electrical charge.\n68. The information processing element defined in claim 67, wherein said device is a capacitor.\n69. The information processing element defined in claim 66, wherein said modifying means includes means for adding said increments εAij to the stored transfer function Aij of a mnemonder.\n70. The information processing element defined in claim 69, wherein electrical charge stored in said storage means of the ij'th mnemonder is Qij ;\nwherein in each of said increments εAij is proportional to a respective increment εQij ;\nand wherein said means for adding increments εAij to the stored transfer function comprises, in combination:\na. means for producing a first pulse having an amplitude proportional to the input signal sj and having a width ti proportional to the absolute value of the output response ri ; and\nb. means, connected to said pulse producing means, for applying a second pulse to said device for storing an electrical charge, the pulse height and pulse width of said second pulse being proportional to the pulse height and pulse width of said first pulse and the polarity of said second pulse being equal to ri /|ri |.\n71. A process of using an information processing module which comprises, in combination:\na. a plurality (N) of input terminals 1, 2 . . . , j . . . , N adapted to receive N input signals s1, s2 . . . , sj . . . , sN, respectively;\nb. a plurality (n) of output terminals 1, 2 . . . , i . . . , n adapted to present n output responses r1, r2 . . . , ri . . . , rn, respectively;\nc. a plurality of junction elements, each coupling one of said input terminals with one of said output terminals and providing a transfer of information from input j to output i in dependence upon the signal sj appearing at the input j and upon the junction element transfer function Aij, said junction elements coupling said input and output terminals in such a way that each output response ri is a function of a plurality of transfer functions Aij and a plurality of input signals sj ;\nsaid process comprising the steps of:\n1. setting the transfer function Aij of each junction element to a particular desired value representing stored information;\n2. applying at least one of said input signals s1, s2 . . . , sj . . . , sN to the respective input terminal; and\n3. receiving at least one of said output responses r1, r2 . . . , ri . . . , rn at the respective output terminal, whereby said module is utilized as a distributed memory.\n2. applying at least one of said input signals s1, s2 . . . , sj . . . , sN to the respective input terminal; and\n3. receiving at least one of said output responses r1, r2 . . . , ri . . . , rn at the respective output terminal, whereby said module is utilized as a distributed memory.\n72. The process defined in claim 71, wherein the number of output terminals of the information processing module equals the number of input terminals thereof (n = N).\n73. The process defined in claim 71, wherein the number of output terminals of the information processing module is less than the number of input terminals thereof (n < N).\n74. The process defined in claim 71, wherein the number of output terminals of the information processing module is greater than the number of input terminals thereof (n > N).\n75. The process defined in claim 71, wherein at least one junction element of the information processing module is coupled to each one of said input terminals thereof.\n76. The process defined in claim 71, wherein each one of said output terminals of the information processing module is coupled to at least one junction element thereof.\n77. The process defined in claim 71, wherein at least one junction element of the information processing module is coupled to each input terminal thereof and wherein each output terminal of the information processing module is coupled to at least one junction element thereof.\n78. The process defined in claim 71, wherein each one of said input terminals of the information processing module is coupled to at least one of said output terminals thereof through a junction element.\n79. The process defined in claim 71, wherein each one of said input terminals of the information processing module is coupled to each one of said output terminals thereof through a junction element.\n80. The process defined in claim 71, wherein the output sj ' of each junction element of the information processing module equals the product of its transfer function Aij and the signal sj applied at its input (sj ' = Aij sj).\n81. The process defined in claim 71, wherein the information processing module further comprises logic element means, connected between each output terminal and the junction elements coupled thereto, for receiving junction element outputs sj ' and producing an output response ri in dependence upon said junction element outputs.\n82. The process defined in claim 81, wherein each of said logic element means produces said output response ri in proportion to the sum of the junction element outputs sj ' applied thereto;\nwhereby said output response ri takes the form: ##EQU36##\n83. A method of processing information comprising the steps of:\na. receiving a plurality of input signals s1, s2 . . . , sj . . . , sN ;\nb. producing a plurality of intermediate signals s'i1, s'i2, . . . s'ij . . . , s'iN, each s'ij of which is dependent upon a respective one of said input signals sj and an associated transfer function Aij ;\nc. producing an output response ri which is dependent upon at least one of said intermediate signals s'ij ; and\nd. modifying at least one of said transfer functions Aij, when in a learning mode, in dependence upon the product of at least one of said input signals sj and said output response ri.\n84. The method defined in claim 83, wherein each intermediate signal s'ij equals the product of the respective input signal sj and the associated transfer function Aij (s'ij = Aij sj).\n85. The method defined in claim 83, wherein said output response ri is dependent upon all of said intermediate signals s'ij.\n86. The method defined in claim 83, wherein said output response ri is proportional to the sum of a plurality of said intermediate signals s'ij.\n87. The method defined in claim 86, wherein said output response ri is proportional to the sum of all of said intermediate signals s'ij.\n88. The method defined in claim 83, wherein step (d) includes the step of modifying each of said transfer functions Aij in dependence upon the product of at least one of said input signals sj and said output response ri.\n89. The method defined in claim 83, wherein step (d) includes the step of modifying at least one of said transfer functions Aij in dependence upon the product of the input signal sj, associated therewith, and said output response ri.\n90. The method defined in claim 89, wherein step (d) includes the step of modifying each of said transfer functions Aij in dependence upon the product of the input signal sj, associated therewith, and said output response ri.\n91. The method defined in claim 83, wherein step (d) includes the step of modifying at least one of said transfer functions Aij in proportion to the product of the input signal sj, associated therewith, and said output response ri.\n92. The method defined in claim 83, wherein step (d) includes the step of modifying each one of said transfer functions Aij in proportion to the product of the input signal sj, associated therewith, and the output response ri.\n93. The method defined in claim 83, wherein step (c) includes the step of producing a plurality of output responses r1, r2 . . . , ri . . . , rn, each response ri of which is dependent upon at least one of said intermediate signals s'ij, where j varies from 1 to N.\n94. The method defined in claim 93, further comprising the step of setting at least one of said output responses ri equal to a specific desired output response riA.\n95. The method defined in claim 93, further comprising the step of setting each of said output responses r1, r2 . . . , ri . . . , rn equal, respectively, to a specific desired output response r1A, r2A . . . , riA . . . , rnA.\n96. The method defined in claim 93, further comprising the step of suppressing all the output responses r1, r2 . . . , rn accept that response ri which exceeds a prescribed threshold.\n97. The method defined in claim 93, wherein step (c) includes the step of producing plurality of output responses r1, r2 . . . , ri . . . , rn, each response ri of which is dependent upon all of said intermediate signals s'ij, where j varies from 1 to N.\n98. The method defined in claim 93, wherein step (c) includes the step of producing a plurality of output responses r1, r2 . . . , ri . . . rn, each response ri of which is proportional to the sum of a plurality of said intermediate signals s'ij, where j varies from 1 to N.\n99. The method defined in claim 98, wherein step (c) includes the step of producing a plurality of output responses r1, r2 . . . , ri . . . rn, each response ri of which is proportional to the sum of all of said intermediate signals s'ij, where j varies from 1 to N.\n100. The method defined in claim 83, further comprising the steps of:\n1. receiving a second plurality of input signals s2 1, s2 2 . . . , s2 j . . . , s2 N ;\n2. producing a second plurality of intermediate signals s'2 il, s'2 i2 . . . , s'2 ij . . . , s'2 iN, each s'2 ij of which is dependent upon a respective one of said second input signals s2 j and upon said transfer function Aij that is associated with a respective one of the first intermediate signals s'ij produced in step (b); and\n3. producing a second output response r2 i which is dependent upon at least one of said second intermediate signals s'2 ij.\n1. receiving a second plurality of input signals s2 1, s2 2 . . . , s2 j . . . , s2 N ;\n2. producing a second plurality of intermediate signals s'2 il, s'2 i2 . . . , s'2 ij . . . , s'2 iN, each s'2 ij of which is dependent upon a respective one of said second input signals s2 j and upon said transfer function Aij that is associated with a respective one of the first intermediate signals s'ij produced in step (b); and\n3. producing a second output response r2 i which is dependent upon at least one of said second intermediate signals s'2 ij.\n101. The method defined in claim 83, further comprising the step of storing each of said transfer functions Aij in a storage device.\n102. The method defined in claim 101, further comprising the step of transferring at least one of the stored transfer functions Aij to another storage device.\n103. The method defined in claim 101, further comprising the step of transferring each of the stored transfer functions Aij to another storage device.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3275986A",
        "US3408627A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4044243A",
        "US4100370A",
        "US4218733A",
        "US4254474A",
        "EP0037164A2",
        "US4308522A",
        "US4450530A",
        "US4479241A",
        "US4518866A",
        "WO1985005711A1",
        "US4593367A",
        "US4599692A",
        "US4599693A",
        "US4620286A",
        "US4660166A",
        "US4670848A",
        "WO1987003399A1",
        "US4697242A",
        "US4704695A",
        "US4752890A",
        "US4760604A",
        "US4773024A",
        "WO1988010474A1",
        "US4807168A",
        "US4809223A",
        "US4852018A",
        "US4858147A",
        "US4874963A",
        "US4881178A",
        "US4893255A",
        "US4906865A",
        "US4912654A",
        "US4912652A",
        "US4912653A",
        "US4912651A",
        "US4912655A",
        "US4912649A",
        "US4912647A",
        "US4914603A",
        "US4914604A",
        "US4914708A",
        "US4920506A",
        "US4926064A",
        "US4930099A",
        "US4931868A",
        "US4939683A",
        "US4941122A",
        "US4951239A",
        "US4958375A",
        "US4967340A",
        "US4974169A",
        "US4979124A",
        "US4990838A",
        "US5001631A",
        "US5003490A",
        "US5033020A",
        "US5040214A",
        "US5041976A",
        "US5050095A",
        "US5053974A",
        "US5058184A",
        "US5060277A",
        "US5063601A",
        "US5072452A",
        "US5072130A",
        "US5077807A",
        "US5093781A",
        "US5119469A",
        "US5133021A",
        "US5146542A",
        "US5151970A",
        "US5170071A",
        "AU633812B2",
        "US5204872A",
        "US5222195A",
        "US5224066A",
        "US5226092A",
        "US5239594A",
        "US5247605A",
        "US5251269A",
        "US5251626A",
        "US5263122A",
        "US5274745A",
        "US5285522A",
        "US5297222A",
        "US5299285A",
        "US5299284A",
        "US5319587A",
        "US5337371A",
        "US5355438A",
        "US5361328A",
        "US5396565A",
        "US5438645A",
        "US5438629A",
        "US5452399A",
        "US5479574A",
        "US5479578A",
        "US5479575A",
        "US5506915A",
        "US5526298A",
        "US5592589A",
        "US5615305A",
        "US5671335A",
        "US5689581A",
        "US5742740A",
        "US5963930A",
        "US6041322A",
        "US6052679A",
        "US6134305A",
        "US6167390A",
        "US20020016782A1",
        "US20030140849A1",
        "US6728310B1",
        "US20050157938A1",
        "US7031513B1",
        "US20060112056A1",
        "US7096192B1",
        "US20060259894A1",
        "US20060277533A1",
        "US20070079108A1",
        "US20070288668A1",
        "US20080140576A1",
        "US7865427B2",
        "US7904398B1",
        "US20110156896A1",
        "US8364136B2",
        "US8892495B2",
        "US9152779B2",
        "US10268843B2",
        "US10361802B1"
    ],
    "citedby_ftf": [
        "JPH0658665B2"
    ]
}