{
    "patent_id": "US-11563699-B2",
    "title": "Machine natural language processing for summarization and sentiment analysis ",
    "assignee": "Royal Bank Of Canada",
    "publication_date": "2023-01-24",
    "patent_link": "https://patents.google.com/patent/US11563699B2/en",
    "inventors": [
        "Yixian CAI",
        "Amir GHADERI",
        "Ankit KHIRWADKAR",
        "Chetana CHAVDA",
        "Pei Hu"
    ],
    "classifications": [
        "H04L51/02",
        "G06F16/9038",
        "G06F40/237",
        "G06F40/284",
        "G06F40/40",
        "G06N20/00",
        "G06N3/006",
        "G06N3/04",
        "G06N5/02",
        "G06N5/04"
    ],
    "abstract": "A virtual agent can implement a “chatbot” to provide output based on predictive/prescriptive models for incidents. The virtual agent can integrate with natural language processor for text analysis and summary report generation. The virtual agent can integrate with cognitive search to enable processing of search requests and retrieval of search results. The virtual agent uses computing processes with self-learning systems that use data mining, pattern recognition and natural language processing to mimic the way the human brain works. The virtual agent provides an automated IT system that is capable of resolving incidents without requiring human assistance. The virtual agent can display condensed summaries of a large amount of data and can link the summaries to predictive models and operational risk models to identify risk events and provide summaries of those events.",
    "claims": "\n1. A system for natural language processing, the system comprising:\nat least one memory and at least one processor configured for:\nreceiving, via a virtual agent interface, natural language data including a data representation of user-inputted text;\ngenerating, with a frontend data processing layer, a communication tuple including at least one data field containing the data representation of the user-inputted text, and a sequence identifier identifying positioning of the user-inputted text in a series of communications, and communicating the communication tuple to a cognitive data processing layer;\nparsing, with the cognitive data processing layer, the data representation of the user-inputted text, and upon determining the user-inputted text is indicative of an information technology (IT) incident based on the parsing, identifying an incident identifier and communicating the incident identifier to a database processing layer;\ngenerating, with the database processing layer, an incident data set associated with the incident identifier, the incident data set including a title, description and list of computer symptoms associated with the incident identifier;\nperforming, with the cognitive data processing layer, a text similarity algorithm with the incident data set to generate an ordered list of closest matching historical IT incidents;\ngenerating and communicating a solution tuple including a response sequence identifier identifying a position of a response message in the series of communications, and a plurality of closest solution data sets corresponding to highest ranked historical IT incidents in the ordered list of closest matching historical IT incidents; and\ngenerating, with the frontend data processing layer, signals for outputting, via the virtual agent interface, the response message including data from the plurality of closest solution data sets at the identified position in the series of communications.\n2. The system of claim 1, wherein upon communicating the communication tuple to the backend data processing layer, the frontend data processing layer is configured to generate signals to provide an output, via the virtual agent interface, indicating that a virtual agent is composing a response.\n3. The system of claim 1, wherein upon identification of the incident identifier, the frontend data processing layer is configured to generate signals to output an intermediate message, via the virtual agent interface, indicating that the virtual agent is searching for a solution for the incident.\n4. The system of claim 1, wherein the frontend data processing layer, the cognitive data processing layer, and the database processing layer are defined by software instructions written in different programming languages, and wherein each layer is configured to communicate with a single communication tuple data structure enabling each layer to communicate with each of the other layers without data transformation.\n5. The system of claim 1, wherein the virtual agent interface is an electronic messaging interface provided by an electronic messaging platform.\n6. The system of claim 5, wherein when the electronic messaging platform is facilitating a group chat involving a plurality of users and the virtual agent, the frontend data processing layer is configured to communication the tuple including the at least one data field containing the data representation of the user-inputted text corresponding to a group chat message upon determining that the group chat message is intended to be directed at the virtual agent.\n7. The system of claim 1, wherein the virtual agent interface is a voice interface, and wherein the at least one memory and the at least one processor are configured for: receiving audio input data representing the natural language data; and generating the data representation of user-inputted text with a speech-to-text decoder.\n8. The system of claim 5, wherein the at least one memory and the at least one processor are configured for: generating a close line instruction to close an audio stream on an audio interface upon determining the user-inputted text is indicative of an information technology (IT) incident to enable the virtual agent interface to output an audio response on the audio interface.\n9. The system of claim 1, wherein the virtual agent interface is an automated ticketing tool configured to identify newly submitted IT incident data structures.",
    "status": "Active",
    "citations_own": [
        "US6751619B1",
        "US20100100412A1",
        "US20130103749A1",
        "US20140120864A1",
        "US20140289356A1",
        "US20180007205A1",
        "US20180218374A1"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "WO2018170876A1",
        "US10313413B2",
        "US10581945B2",
        "US11025693B2",
        "US10896297B1",
        "US10585724B2",
        "US10594635B2",
        "US11055489B2",
        "GB201818237D0",
        "GB201818234D0",
        "US10839167B2",
        "US11501073B2",
        "US10931739B2",
        "US11314817B1",
        "US20200335089A1",
        "US20200372492A1",
        "US20210043211A1",
        "US10909317B2",
        "US10902191B1",
        "US11281854B2",
        "US11205047B2",
        "US11455339B1",
        "US11763230B2",
        "EP4100864A1",
        "US11321104B2",
        "US11348415B2",
        "US11042700B1",
        "US11694025B2",
        "US11277359B2",
        "US11301503B2",
        "US11201966B1",
        "US11645472B2",
        "US20220083731A1",
        "US11336507B2",
        "CN112364627B",
        "CN112486461A",
        "US11373131B1",
        "US20220398599A1",
        "US11762668B2",
        "US11715108B2",
        "US11430446B1",
        "US20230063713A1",
        "US20230082002A1",
        "US20230082021A1",
        "US11580309B1",
        "US11450124B1",
        "CN114861112B"
    ]
}