{
    "patent_id": "US-11670304-B2",
    "title": "Speaker recognition in the call center ",
    "assignee": "Pindrop Security, Inc.",
    "publication_date": "2023-06-06",
    "patent_link": "https://patents.google.com/patent/US11670304B2/en",
    "inventors": [
        "Elie Khoury",
        "Matthew Garland"
    ],
    "classifications": [
        "G10L17/00",
        "H04M1/271",
        "G06N7/01",
        "G10L15/07",
        "G10L15/19",
        "G10L15/26",
        "G10L17/04",
        "G10L17/08",
        "G10L17/24",
        "H04M2203/40"
    ],
    "abstract": "Utterances of at least two speakers in a speech signal may be distinguished and the associated speaker identified by use of diarization together with automatic speech recognition of identifying words and phrases commonly in the speech signal. The diarization process clusters turns of the conversation while recognized special form phrases and entity names identify the speakers. A trained probabilistic model deduces which entity name(s) correspond to the clusters.",
    "claims": "\n1. A computer-implemented method comprising:\nextracting, by a computer, from one or more audio signals, a first set of audio features associated with a first speaker and a second set of audio features associated with a second speaker;\ngenerating, by the computer, a first cluster associated with the first speaker based upon the first set of features;\ngenerating, by the computer, a second cluster associated with the second speaker based upon the second set of features;\nextracting, by the computer, from each respective set of audio features an entity name and a phrase; and\ngenerating, by the computer, a trained probabilistic model for each respective speaker based upon the respective cluster, the respective entity name, and the respective phrase.\n2. The method according to claim 1, further comprising executing, by the computer, a speech activity detector on an audio signal, the speech activity detector generating one or more speech portions and removing non-speech portions.\n3. The method according to claim 1, further comprising performing, by the computer, speaker diarization on an audio signal, the speaker diarization generating the first cluster and the second cluster.\n4. The method according to claim 1, wherein the computer extracts the one or more features from the one or more audio signals at a given interval, and wherein the computer partitionally clusters the one or more features into the respective clusters for the first speaker and the second speaker at the given interval.\n5. The method according to claim 1, wherein extracting the entity name and the phrase comprises:\nidentifying, by the computer, text content in each of the clusters extracted from an audio signal by executing an automatic speech recognition process configured to recognize the text content of speech in each of the clusters,\nwherein the computer extracts each entity name and each phrase from the text content identified in the first cluster and in the second cluster.\n6. The method according to claim 5, wherein at least one phrase is associated with a respective prior probability that an adjacent utterance is the entity name.\n7. The method according to claim 1, further comprising:\nreceiving, by the computer, a second audio signal involving at least one of the first speaker and the second speaker; and\ngenerating, by the computer, a next cluster using the probabilistic model associated with the first speaker or the probabilistic model associated with the second speaker.\n8. The method according to claim 1, further comprising identifying, by the computer, at least one of the first speaker and the second speaker as a caller based upon at least one of the trained probabilistic models generated by the computer.\n9. The method according to claim 1, further comprising identifying, by the computer, at least one of the first speaker and the second speaker as an agent based upon at least one of the trained probabilistic models generated by the computer.\n10. The method according to claim 1, wherein the first set of audio features and the second set of audio features each comprise at least one of: mel-frequency cepstral coefficients (MFCCs), linear predictive cepstral coefficients (LPCCs), and perceptual linear prediction (PLP).\n11. A system comprising:\na non-transitory storage medium storing a plurality of computer program instructions; and\na processor electrically coupled to the non-transitory storage medium and configured to execute the computer program instructions to:\nextract from one or more audio signals, a first set of audio features associated with a first speaker and a second set of audio features associated with a second speaker;\ngenerate a first cluster associated with the first speaker based upon the first set of features;\ngenerate a second cluster associated with the second speaker based upon the second set of features;\nextract from each respective set of audio features, an entity name and a phrase; and\ngenerate a trained probabilistic model for each respective speaker based upon the respective cluster, the respective entity name, and the respective phrase.\n12. The system according to claim 11, wherein the processor is further configured to:\nexecute a speech activity detector an audio signal, the speech activity detector configured to generate one or more speech portions and removing non-speech portions.\n13. The system according to claim 11, wherein the processor is further configured to:\nperform speaker diarization on an audio signal, the speaker diarization configured to generate the first cluster and the second cluster.\n14. The system according to claim 11, wherein the processor is configured to extract the one or more features from the one or more audio signals at a given interval, and wherein the processor is configured to partitionally cluster the one or more features into the respective clusters for the first speaker and the second speaker at the given interval.\n15. The system according to claim 11, wherein to extract the entity name and the phrase the processor is configured to:\nidentify text content in each of the clusters extracted from an audio signal by executing an automatic speech recognition process configured to recognize the text content of speech in each of the clusters,\nwherein the processor extracts each entity name and each phrase from the text content identified in the first cluster and in the second cluster.\n16. The system according to claim 15, wherein at least one phrase is associated with a respective prior probability that an adjacent utterance is the entity name.\n17. The system according to claim 11, wherein the processor is further configured to:\nreceive a second audio signal involving at least one of the first speaker and the second speaker; and\ngenerate a next cluster using the probabilistic model associated with the first speaker or the probabilistic model associated with the second speaker.\n18. The system according to claim 11, wherein the processor is further configured to:\nidentify at least one of the first speaker and the second speaker as a caller based upon at least one of the trained probabilistic models generated by the computer.\n19. The system according to claim 11, wherein the processor is further configured to:\nidentify at least one of the first speaker and the second speaker as an agent based upon at least one of the trained probabilistic models generated by the computer.\n20. The system according to claim 11, wherein the first set of audio features and the second set of audio features each comprise at least one of: mel-frequency cepstral coefficients (MFCCs), linear predictive cepstral coefficients (LPCCs), and perceptual linear prediction (PLP).",
    "status": "Active",
    "citations_own": [
        "US4817156A",
        "US4829577A",
        "US4972485A",
        "US5072452A",
        "US5461697A",
        "US5475792A",
        "US5598507A",
        "US5659662A",
        "US5835890A",
        "US5949874A",
        "US5995927A",
        "US6009392A",
        "US6021119A",
        "US6055498A",
        "US6094632A",
        "US6141644A",
        "US6411930B1",
        "US20020095287A1",
        "US20020143539A1",
        "US6463413B1",
        "US6519561B1",
        "US20030231775A1",
        "US20030236663A1",
        "US6760701B2",
        "US20040218751A1",
        "US20040230420A1",
        "US20050039056A1",
        "US20050038655A1",
        "US6882972B2",
        "US6922668B1",
        "US6975708B1",
        "US7003460B1",
        "US20060058998A1",
        "US20060111905A1",
        "US20060293771A1",
        "US7209881B2",
        "US20070189479A1",
        "US20070198257A1",
        "US7295970B1",
        "US20070294083A1",
        "US7318032B1",
        "US7324941B2",
        "US20080195389A1",
        "US20080312926A1",
        "US20090138712A1",
        "US20090265328A1",
        "US20100131273A1",
        "US7739114B1",
        "US20100217589A1",
        "US20110010173A1",
        "US8046230B1",
        "US8112160B2",
        "US8160877B1",
        "US8160811B2",
        "US20120185418A1",
        "US20130041660A1",
        "US20130080165A1",
        "US8484023B2",
        "US8484024B2",
        "US8554563B2",
        "US20130300939A1",
        "US20140046878A1",
        "US20140053247A1",
        "US8712760B2",
        "US8738442B1",
        "US20140195236A1",
        "US20140214676A1",
        "US20140214417A1",
        "US20140241513A1",
        "US20140250512A1",
        "US20140278412A1",
        "US20140288928A1",
        "US8856895B2",
        "US8886663B2",
        "US20140337017A1",
        "US8903859B2",
        "US20150036813A1",
        "US20150127336A1",
        "US9042867B2",
        "WO2015079885A1",
        "US20150161522A1",
        "US9064491B2",
        "US20150189086A1",
        "US20150199960A1",
        "US20150269941A1",
        "US20150269931A1",
        "US20150310008A1",
        "US20150334231A1",
        "US20150348571A1",
        "US20150356630A1",
        "US20150365530A1",
        "US20160019458A1",
        "US20160019883A1",
        "US20160028434A1",
        "US9277049B1",
        "US20160078863A1",
        "US20160104480A1",
        "US20160125877A1",
        "US9338619B2",
        "US9336781B2",
        "US9343067B2",
        "US9344892B1",
        "US9355646B2",
        "US9373330B2",
        "US20160180214A1",
        "US9406298B2",
        "US20160240190A1",
        "US9431016B2",
        "US9444839B1",
        "US20160275953A1",
        "US9454958B2",
        "US20160284346A1",
        "US9460722B2",
        "US20160293167A1",
        "US9466292B1",
        "US20160343373A1",
        "WO2016195261A1",
        "US9558755B1",
        "US9584946B1",
        "US20170060779A1",
        "US20170069327A1",
        "US20170069313A1",
        "US20170098444A1",
        "US9620145B2",
        "US9626971B2",
        "US20170111515A1",
        "US9633652B2",
        "US9641954B1",
        "US20170126884A1",
        "US20170142150A1",
        "US20170169816A1",
        "US9685174B2",
        "US20170262837A1",
        "WO2017167900A1",
        "US9818431B2",
        "US9824692B1",
        "US9860367B1",
        "US9875743B2",
        "US20180082691A1",
        "US9930088B1",
        "US9984706B2",
        "US20180152558A1",
        "US20180249006A1",
        "US20180295235A1",
        "US20180337962A1",
        "US20190037081A1",
        "US10277628B1",
        "US20190172476A1",
        "US10325601B2",
        "US10347256B2",
        "US20190238956A1",
        "US10397398B2",
        "US10404847B1",
        "US20190297503A1",
        "US10462292B1",
        "US10506088B1",
        "US10554821B1",
        "US10638214B1",
        "US20200137221A1",
        "US10659605B1",
        "US20200195779A1",
        "US20200252510A1",
        "US20200312313A1",
        "US20200396332A1",
        "US20210084147A1",
        "US11069352B1"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "US9824692B1",
        "AU2017327003B2",
        "US10325601B2",
        "US10397398B2",
        "WO2018148298A1",
        "US10637898B2",
        "US11417343B2",
        "US10091349B1",
        "US10623581B2",
        "KR102413282B1",
        "US10482878B2",
        "US10726829B2",
        "CN108922541B",
        "WO2019246219A1",
        "US11417344B2",
        "JP7218547B2",
        "US11031017B2",
        "US11355103B2",
        "WO2020163624A1",
        "US10720171B1",
        "GB201906367D0",
        "US10659588B1",
        "US11646018B2",
        "CN110223676A",
        "IL303147A",
        "US11039012B2",
        "US10911600B1",
        "AU2020340368A1",
        "US11227601B2",
        "KR20230011307A",
        "CN111524527B",
        "US11508377B2",
        "WO2022072655A1",
        "CN112614478B",
        "US11606461B2",
        "CN112710061B",
        "CN112927694B",
        "US11756555B2",
        "US11451658B1",
        "US20220377171A1",
        "US11582336B1",
        "US11558506B1"
    ]
}