{
    "patent_link": "https://patents.google.com/patent/US5864827A/en",
    "patent_id": "US5864827A",
    "title": "System and method for providing an information gateway",
    "abstract": "In a device and method to provide a gateway for the transfer of information between financial markets and customers, a processor is coupled to a customer system and to a financial market system. The processor receives transaction information from the customer system in a first format, converts it to a second format and transmits the transaction information to the financial market system. The processor receives an acknowledgment and a transaction confirmation from the financial market system in the second format, converts these to the first format and transmits the acknowledgment and the transaction confirmation to the customer system. The processor may also be coupled to a memory, where it stores tracking information relating to the transaction information, the acknowledgment and/or the transaction confirmation.",
    "inventors": [
        "Donald W. Wilson"
    ],
    "assignee": "Belzberg Financial Markets and News International Inc",
    "classifications": [
        "G06Q40/00",
        "G06Q40/04"
    ],
    "claims": "\n1. A device for providing an information gateway between a customer and a financial market comprising:\na processor coupled to a customer system, and coupled to a financial market system, the processor programmed to:\nreceive a first group of data from the customer system,\nreceive a second group of data from the financial market system,\nconvert the first group of data into a third group of data,\nconvert the second group of data into a fourth group of data,\ntransmit the third group of data to the financial market system, and\ntransmit the fourth group of data to the customer system; and\na memory coupled to the processor, the processor programmed to transmit a fifth group of data to the memory.\n2. The device according to claim 1, wherein the fifth group of data relates to the first group of data and to the fourth group of data.\n3. The device according to claim 1, further comprising a storage device coupled to the processor, the processor programmed to transmit the fifth group of data to the storage device.\n4. The device according to claim 1, wherein the first and fourth group of data are in a first format.\n5. The device according to claim 1, wherein the second and third group of data are in a second format.\n6. The device according to claim 4, wherein the first format is FIX protocol.\n7. The device according to claim 1, wherein the first group of data, the second group of data, the third group of data and the fourth group of data are received and transmitted electronically.\n8. The device according to claim 1, wherein the first group of data, the second group of data, the third group of data and the fourth group of data are received and transmitted optically.\n9. The device according to claim 1, wherein the first group of data and the fourth group of data include transaction information.\n10. The device according to claim 9, wherein the transaction information includes information relating to a plurality of transactions.\n11. The device according to claim 1, wherein the second group of data and the third group of data include at least one of acknowledgment information and confirmation information.\n12. The device according to claim 1, wherein the processor is coupled to a plurality of customer systems and the processor programmed to receive at least one first group of data from each of the plurality of customer systems, and wherein each of the at least one first groups of data are in the first format.\n13. The device according to claim 1, wherein the fifth group of data is stored in memory in a data base.\n14. The device according to claim 1, wherein the fifth group of data includes tracking information.\n15. A device for providing an information gateway between at least one customer and a plurality of financial markets comprising:\na processor coupled to at least one customer system, and coupled to a plurality of financial market systems, the processor programmed to:\nreceive at least one first group of data from the at least one customer system,\nreceive at least one second group of data from at least one of the plurality of financial market systems,\nconvert the at least one first group of data into at least one third group of data,\nconvert the at least one second group of data into at least one fourth group of data,\ntransmit the at least one third group of data to at least one of the plurality of financial market systems, and\ntransmit the at least one fourth group of data to the at least one customer system; and\na memory coupled to the processor, the processor programmed to transmit at least one fifth group of data to the memory.\n16. The device according to claim 15, further comprising a storage device coupled to the processor, the processor programmed to transmit the at least one fifth group of data to the storage device.\n17. The device according to claim 15, wherein the processor is coupled to a plurality of customer systems and the processor programmed to receive at least one first group of data from each of the plurality of customer systems, and wherein each of the at least one first groups of data are in the first format.\n18. A device for providing an information gateway comprising:\na processor coupled to at least one first system, and coupled to at least one second system, the processor programmed to:\nreceive at least one first group of data from the at least one first system in a first format,\nreceive at least one second group of data from the at least one second system in a second format,\nconvert the at least one first group of data from the first format into the second format,\nconvert the at least one second group of data from the second format into the first format,\ntransmit the at least one first group of data to the at least one second system in the second format,\ntransmit the at least one second group of data to the at least one first system in the first format.\n19. The device according to claim 18, further comprising a memory coupled to the processor, the processor programmed to transmit at least one third group of data to the memory.\n20. The device according to claim 19, wherein the third group of data relates to the first group of data and to the second group of data.\n21. The device according to claim 19, wherein the third group of data is stored in memory in a data base.\n22. The device according to claim 19, wherein the third group of data includes tracking information.\n23. The device according to claim 18, further comprising a storage device coupled to the processor, the processor programmed to transmit the third group of data to the storage device.\n24. The device according to claim 23, wherein the storage device is a tape drive.\n25. The device according to claim 18, wherein the first protocol is FIX protocol.\n26. The device according to claim 18, wherein the at least one first group of data and the at least one second group of data are received and transmitted electronically.\n27. The device according to claim 18, wherein the at least one first group of data and the at least one second group of data are received and transmitted optically.\n28. The device according to claim 18, wherein the at least one first group of data includes transaction information.\n29. The device according to claim 26, wherein the first group of data includes information relating to a plurality of transactions.\n30. The device according to claim 18, wherein the at least one second group of data includes at least one of acknowledgment information and confirmation information.\n31. The device according to claim 18, wherein the processor is coupled to a plurality of first systems and a plurality of second systems, and the processor programmed to receive at least one first group of data from each of the plurality of first systems, and wherein each of the at least one first groups of data are in the first format (protocol).\n32. The device according to claim 18, wherein the at least one first system is a customer system and the at least one second system is a financial market system.\n33. A method for providing an information gateway between a customer and a financial market comprising the steps of:\nreceiving a first group of data from a customer system;\nreceiving a second group of data from a financial market system;\nconverting the first group of data into a third group of data;\nconverting the second group of data into a fourth group of data;\ntransmitting the third group of data to the financial market system;\ntransmitting the fourth group of data to the customer system;\ntransmitting a fifth group of data to a memory.\n34. The method according to claim 33, wherein the fifth group of data relates to the first group of data and to the fourth group of data.\n35. The method according to claim 33, further comprising a storage device coupled to the processor, the processor programmed to transmit the fifth group of data to the storage device.\n36. The method according to claim 33, wherein the first and fourth group of data are in a first format.\n37. The method according to claim 33, wherein the second and third group of data are in a second format.\n38. The method according to claim 36, wherein the first format is FIX protocol.\n39. The method according to claim 33, wherein the first group of data, the second group of data, the third group of data and the fourth group of data are received and transmitted electronically.\n40. The method according to claim 33, wherein the first group of data, the second group of data, the third group of data and the fourth group of data are received and transmitted optically.\n41. The method according to claim 33, wherein the first group of data and the fourth group of data include transaction information.\n42. The method according to claim 41, wherein the transaction information includes information relating to a plurality of transactions.\n43. The method according to claim 33, wherein the second group of data and the third group of data include at least one of acknowledgment information and confirmation information.\n44. The method according to claim 33, wherein a first group of data is received from each of a plurality of customer systems, and a second group of data is received from each of a plurality of financial market system.\n45. The method according to claim 33, wherein the fifth group of data is stored in memory in a data base.\n46. The method according to claim 33, wherein the fifth group of data includes tracking information.\n47. A method for providing an information gateway between at least one customer and a plurality of financial markets comprising the steps of:\nreceiving at least one first group of data from at least one customer system in a first format;\nreceiving at least one second group of data from at least one of a plurality of financial market systems in a second format;\nconverting the at least one first group of data from the first format into the second format;\nconverting the at least one second group of data from the second format into the first format;\ntransmitting the at least one first group of data to at least one of the plurality of financial market systems in the second format;\ntransmitting the at least one second group of data to the at least one customer system in the first format; and\ntransmitting at least one third group of data to a memory.\n48. The method according to claim 47, further comprising a storage device coupled to the processor, the processor programmed to transmit the at least one fifth group of data to the storage device.\n49. The method according to claim 47, wherein a first group of data is received from each of a plurality of customer systems in the first format.\n50. A method for providing an information gateway comprising the steps of:\nreceiving at least one first group of data from at least one first system in a first format;\nreceiving at least one second group of data from at least one second system in a second format;\nconverting the at least one first group of data from the first format into the second format;\nconverting the at least one second group of data from the second format into the first format;\ntransmitting the at least one first group of data to the at least one second system in the second format; and\ntransmitting the at least one second group of data to the at least one first system in the first format.\n51. The method according to claim 50, further comprising the step of transmitting at least one third group of data to a memory.\n52. The method according to claim 51, wherein the third group of data relates to the first group of data and to the second group of data.\n53. The method according to claim 51, wherein the third group of data is stored in memory in a data base.\n54. The method according to claim 51, wherein the third group of data includes tracking information.\n55. The method according to claim 50, further comprising a storage device coupled to the processor, the processor programmed to transmit a third group of data to the storage device.\n56. The method according to claim 55, wherein the storage device is a tape drive.\n57. The method according to claim 50, wherein the first protocol is FIX protocol.\n58. The method according to claim 50, wherein the at least one first group of data and the at least one second group of data are received and transmitted electronically.\n59. The method according to claim 50, wherein the at least one first group of data and the at least one second group of data are received and transmitted optically.\n60. The method according to claim 50, wherein the at least one first group of data includes transaction information.\n61. The method according to claim 60, wherein the first group of data includes information relating to a plurality of transactions.\n62. The method according to claim 50, wherein the at least one second group of data includes at least one of acknowledgment information and confirmation information.\n63. The method according to claim 50, wherein a first group of data is received from each of a plurality of first systems, and a second group of data is received from each of a plurality of second systems.\n64. The method according to claim 50, wherein the at least one first system is a customer system and the at least one second system is a financial market system.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US5684799A"
    ],
    "citations_ftf": [
        "US5278955A",
        "JPH0660000A",
        "EP0669771B1"
    ],
    "citedby_own": [
        "US5987432A",
        "US6012044A",
        "US6021397A",
        "US6061057A",
        "WO2000058890A1",
        "US6141006A",
        "WO2000070524A1",
        "WO2001002974A1",
        "US6229534B1",
        "US6260050B1",
        "US6272492B1",
        "US6278982B1",
        "US20010020241A1",
        "US6292787B1",
        "WO2001084431A1",
        "US20010042040A1",
        "US20010044770A1",
        "US20010051909A1",
        "US20020002521A1",
        "WO2002006921A2",
        "US20020023045A1",
        "WO2002017559A2",
        "US20020035482A1",
        "US20020073143A1",
        "US20020073006A1",
        "US6412011B1",
        "US20020091617A1",
        "US20020099647A1",
        "US20020099633A1",
        "US20020107784A1",
        "US20020138386A1",
        "US20020154628A1",
        "US20020188536A1",
        "US20020188553A1",
        "US20020198798A1",
        "US20020198829A1",
        "US6505175B1",
        "US20030018557A1",
        "US20030028537A1",
        "EP1282877A1",
        "US20030055768A1",
        "US20030061149A1",
        "US6567796B1",
        "US20030105674A1",
        "US20030105692A1",
        "US20030110106A1",
        "US6587547B1",
        "US20030125992A1",
        "US6611875B1",
        "US20030163392A1",
        "US20030167223A1",
        "US6625570B2",
        "US6647410B1",
        "US20030225729A1",
        "US6662195B1",
        "US20030233313A1",
        "US6694316B1",
        "US20040039612A1",
        "US20040078243A1",
        "US20040083148A1",
        "US6741980B1",
        "US20040143538A1",
        "US20040148247A1",
        "US20040230507A1",
        "US20040236662A1",
        "US6829334B1",
        "US6836537B1",
        "WO2005000004A2",
        "US20050015324A1",
        "US20050015321A1",
        "US20050021378A1",
        "US20050027658A1",
        "US20050044033A1",
        "US20050060256A1",
        "US20050071252A1",
        "US20050086170A1",
        "US20050091087A1",
        "US20050096948A1",
        "US20050144048A1",
        "US20050188378A1",
        "US6938087B1",
        "US20050210376A1",
        "US20050222938A1",
        "US20050223408A1",
        "US20050222937A1",
        "US20050251478A1",
        "US20050267868A1",
        "US6983259B1",
        "US20060026091A1",
        "US7003486B1",
        "US7016865B1",
        "US7024386B1",
        "US7058903B1",
        "US7082410B1",
        "US7107240B1",
        "US7110973B1",
        "US7110969B1",
        "US7130823B1",
        "US7174363B1",
        "US7184982B1",
        "US20070058886A1",
        "US7216092B1",
        "US7231366B1",
        "US20070179909A1",
        "US20070192216A1",
        "US7262778B1",
        "US20070208648A1",
        "US7287089B1",
        "US20070260496A1",
        "US7305360B1",
        "US7305353B1",
        "US7313541B2",
        "US20080015970A1",
        "US7330830B1",
        "US7333952B1",
        "US7356499B1",
        "US7366690B1",
        "US20080105737A1",
        "US20080126575A1",
        "US20080127230A1",
        "US7383220B1",
        "US7383218B1",
        "US7392210B1",
        "US7398244B1",
        "US7454372B1",
        "US7496533B1",
        "US7529704B1",
        "US20090132428A1",
        "US20090132335A1",
        "US7539638B1",
        "US20090164384A1",
        "US20090187512A1",
        "US7567928B1",
        "US7620578B1",
        "US7636682B1",
        "US7647268B1",
        "US20100057608A1",
        "US7680731B1",
        "US7685036B1",
        "US7716107B1",
        "US20100138332A1",
        "US7752110B1",
        "US7774246B1",
        "US7783561B1",
        "US7813991B1",
        "US7818238B1",
        "US7827085B1",
        "US7827096B1",
        "US7860774B1",
        "US20110016221A1",
        "US20110035306A1",
        "US7890410B1",
        "US20110055113A1",
        "US7908198B1",
        "US20110079613A1",
        "US7962398B1",
        "US7966234B1",
        "US7970686B1",
        "US7970722B1",
        "US20110202452A1",
        "US20110208670A1",
        "US20110208634A1",
        "US8130918B1",
        "US8200561B1",
        "US8244621B1",
        "US8249975B1",
        "US8271309B2",
        "US8321411B2",
        "WO2013082461A1",
        "US8468078B2",
        "US20130198037A1",
        "US8527587B1",
        "US8548886B1",
        "US8571968B2",
        "US8688569B1",
        "US20140149275A1",
        "US8745147B2",
        "US8775294B1",
        "US8930719B2",
        "US9081653B2",
        "US9191206B2",
        "US9208213B2",
        "US9258116B2",
        "US9270859B2",
        "US9710669B2",
        "US9811868B1",
        "US10636089B2",
        "US10735437B2",
        "US11526859B1",
        "US11532040B2",
        "US11704671B2"
    ],
    "citedby_ftf": [
        "JP2004355313A",
        "US8296778B2",
        "US8676876B2",
        "US8122144B2",
        "US8695015B2",
        "US8850451B2",
        "US8327381B2",
        "US7917912B2",
        "US7685044B1",
        "EP2936420A4"
    ]
}