{
    "patent_link": "https://patents.google.com/patent/US6182125B1/en",
    "patent_id": "US6182125B1",
    "title": "Methods for determining sendable information content based on a determined network latency",
    "abstract": "A method for improving perception of electronic content from a computer network such as the Internet or an intranet. Network latencies and the type of electronic content such as text, graphical images, animation, voice, video and other electronic content interact to influence user perception of the quality of information provided. As network latency increases and becomes more variable, users typically become less satisfied. The method dynamically adjusts the amount of electronic content presented to user based on a determined network latency. The amount of electronic content is also adjusted progressively and underlying transport protocol such as Transmission Control Protocol (“TCP”) and User Datagram Protocol (“UDP”) are adaptively adjusted based on the type of electronic content requested (e.g., TCP for text, UDP for graphical images, etc.). The method may improve user perception of requested original electronic content by dynamically sending an amount of original electronic content based on a determined network latency. Improved user perception of original electronic content may help attract and retain, students, customers, contributors, etc. to an organization's electronic content site on a computer network (e.g., a home page on the Internet or an intranet).",
    "inventors": [
        "Michael S. Borella",
        "Guido M. Schuster",
        "Ikhlaq S. Sidhu",
        "Jacek A. Grabiec"
    ],
    "assignee": "Hewlett Packard Enterprise Development LP",
    "classifications": [],
    "claims": "\n1. A method for dynamically providing electronic content over a computer network, comprising the following steps:\n2. A computer readable medium having stored therein instructions for causing a central processing unit to execute the method of claim 1.\n3. The method of claim 1 wherein the first network is any of the Internet or an intranet.\n4. The method of claim 1 wherein the Step of determining a network latency includes sending one or more data packets of a first type with a timestamp from the second network device to the first network device, wherein the one or more data packets with the first type are returned to the second network device from the first network device.\n5. The method of claim 4 wherein the one or more data packets of a first type are Internet Control Message Protocol data packets.\n6. The method of claim 1 wherein the Step of determining an amount of original electronic content includes determining a number of graphical images in the original electronic content.\n7. The method of claim 1 wherein the Step of determining an amount of original electronic content includes determining an amount of textual electronic content and an amount of non-textual electronic content in the original electronic content.\n8. The method of claim 1 wherein the Step of sending the determined amount of electronic content type includes sending less than all of the requested original electronic content.\n9. The method of claim 1 wherein the Step of sending the determined amount of electronic content type includes sending all of the requested original electronic content.\n10. The method of claim 1 wherein the Step of determining an amount of original electronic content includes using a set of pre-determined cutoff latencies with the determined network latency.\n11. The method of claim 1 wherein the Step of sending the determined amount of electronic content type includes sending the determined amount of electronic content progressively by sending selected components of the determined amount of electronic content.\n12. The method of claim 1 wherein the Step of sending the determined amount of electronic content type includes sending the determined amount of electronic content using a compression scheme.\n13. The method of claim 12, wherein the compression scheme is Joint Pictures Expert Group expression.\n14. A method for providing electronic content over a computer network with adaptive transport, comprising the following steps:\n15. A computer readable medium having stored therein instructions for causing a central processing unit to execute the method of claim 14.\n16. The method of claim 14 wherein the first content type from the original electronic content is any of text or hypertext.\n17. The method of claim 14 wherein the second content type of electronic content from the original electronic content is any of graphical images, animation, audio or video electronic content.\n18. The method of claim 14 wherein the first protocol is Transmission Control Protocol and the second protocol is User Datagram Protocol.\n19. The method of claim 14 wherein the Step of sending the determined amount of the second content type of electronic content from the original electronic content with a second protocol includes sending the determined amount of second content type of the original electronic content progressively by sending selected components of the determined amount of the second content type.\n20. The method of claim 14 wherein the Step of sending the determined amount of the second content type of electronic content from the original electronic content with a second protocol includes sending the determined amount of second content type of the original electronic content using a compression scheme.\n21. A method for dynamically providing electronic content over a computer network to improve user perception, comprising the following steps:\n22. A computer readable medium having stored therein instructions for causing a central processing unit to execute the method of claim 21.\n23. The method of claim 21 wherein the first network is any of the Internet or an intranet.\n24. The method of claim 21 wherein the first content type is text and the second content type is any of graphical images or video.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4058113A",
        "US4843568A",
        "US5838685A",
        "US5860936A",
        "US5933413A",
        "US5983176A",
        "US6012096A",
        "US6018748A",
        "US6021426A",
        "US6038598A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "WO2001058131A2",
        "US6273821B1",
        "US20010029537A1",
        "US20010044835A1",
        "US6339787B1",
        "WO2002023478A2",
        "US20020069354A1",
        "US6412006B2",
        "US20020080871A1",
        "US20020095332A1",
        "US20020093917A1",
        "WO2002063488A1",
        "US6442603B1",
        "US20020138511A1",
        "US20020165973A1",
        "WO2002101552A1",
        "US20020191692A1",
        "US20030018912A1",
        "US6538667B1",
        "US6601098B1",
        "US20030145080A1",
        "US20030191876A1",
        "US20030233445A1",
        "US20040001224A1",
        "US20040042506A1",
        "US20040056783A1",
        "US6731600B1",
        "US20040205100A1",
        "US20050083970A1",
        "US20050102413A1",
        "US20050192871A1",
        "US20050193079A1",
        "US20050193070A1",
        "US20050193069A1",
        "US20050198189A1",
        "US20060015650A1",
        "US6993591B1",
        "US6996626B1",
        "US20060031469A1",
        "US20060184687A1",
        "US20060206796A1",
        "US7139976B2",
        "US7209892B1",
        "US7254605B1",
        "US20080031136A1",
        "US20080043643A1",
        "US20080052141A1",
        "US7349955B1",
        "US20080086516A1",
        "US20080216095A1",
        "US20080267069A1",
        "US7650376B1",
        "US7668968B1",
        "US7680050B1",
        "US7733858B1",
        "US20100229037A1",
        "US20100274848A1",
        "US7925770B1",
        "US20110199243A1",
        "US8200837B1",
        "US20140047118A1",
        "US8671213B2",
        "US8706802B1",
        "US8924581B1",
        "US9130756B2",
        "US9154551B1",
        "US9160641B2",
        "US9160703B2",
        "US20150304415A1",
        "US9185012B2",
        "US9191458B2",
        "US9191338B2",
        "US9208097B2",
        "US9210235B2",
        "US9237114B2",
        "US9246776B2",
        "US9253065B2",
        "US9282032B2",
        "US9294391B1",
        "US9323577B2",
        "US9332078B2",
        "US9367929B2",
        "US9391949B1",
        "US9407699B2",
        "US9407681B1",
        "US9444759B2",
        "US9451046B2",
        "US9479476B2",
        "US9497259B1",
        "US9495338B1",
        "US9503389B2",
        "US9515949B2",
        "US9525659B1",
        "US9544394B2",
        "US9571389B2",
        "US9590946B2",
        "US9608957B2",
        "US9628403B2",
        "US9628554B2",
        "US9660890B2",
        "US9712484B1",
        "EP3200081A1",
        "FR3047325A1",
        "US9734472B2",
        "US9742795B1",
        "US9769248B1",
        "US9774619B1",
        "US9787775B1",
        "US9794281B1",
        "US9800539B2",
        "US9819567B1",
        "US9832141B1",
        "US9887932B1",
        "US9887931B1",
        "US9912740B2",
        "US9930131B2",
        "US9954934B2",
        "US9985927B2",
        "US9992303B2",
        "US9992086B1",
        "US10007591B2",
        "US10015237B2",
        "US10021179B1",
        "US10027582B2",
        "US10027739B1",
        "US10033691B1",
        "US10033627B1",
        "US10049051B1",
        "US10075551B1",
        "US10091096B1",
        "US10097448B1",
        "US10097566B1",
        "US10110694B1",
        "US10205698B1",
        "US10225326B1",
        "US10225365B1",
        "US10230819B2",
        "US10257307B1",
        "US10270878B1",
        "US10284446B2",
        "US10311372B1",
        "US10311371B1",
        "US10348639B2",
        "US10372499B1",
        "US10447648B2",
        "US10462025B2",
        "US10461886B2",
        "US10469513B2",
        "US10503613B1",
        "US10521348B2",
        "US10592578B1",
        "US10601767B2",
        "US10616179B1",
        "US10616086B2",
        "US10623408B1",
        "US10831549B1",
        "US10862852B1",
        "US10938884B1",
        "US10958501B1",
        "US11025747B1",
        "US11075987B1",
        "US11181905B2",
        "US11290418B2",
        "US11548531B2",
        "US11604667B2",
        "US11711274B2"
    ],
    "citedby_ftf": []
}