{
    "patent_id": "US-11517310-B2",
    "title": "Tool assembly for a surgical stapling device ",
    "assignee": "Covidien Lp",
    "publication_date": "2022-12-06",
    "patent_link": "https://patents.google.com/patent/US11517310B2/en",
    "inventors": [
        "David C. Racenet",
        "Philip Roy",
        "John Beardsley",
        "Lee Olson",
        "Ralph Stearns",
        "Clifford L. Emmons"
    ],
    "classifications": [
        "A61B17/07207",
        "A61B17/068",
        "A61B17/105",
        "A61B17/0686",
        "A61B2017/003",
        "A61B2017/07214",
        "A61B2017/07257",
        "A61B2017/07271",
        "A61B2017/07278",
        "A61B2017/07285",
        "A61B2017/2926",
        "A61B2017/2927",
        "A61B2017/2929",
        "A61B2017/2939",
        "A61B2017/320052"
    ],
    "abstract": "A surgical device comprising a first jaw member, a second jaw member, a clamping member and a clamp apparatus is disclosed. The clamping member is slidably positioned to translate at least partially through the first jaw member. The clamping member engages the first jaw member and the second jaw member, and has a knife blade for cutting tissue. A flange of the clamping member is configured to engage a cam surface to pivot the second jaw member with respect to the first jaw member from an open position toward an approximated position. The clamp apparatus is movable from a retracted position to an advanced position for preventing a gap between proximal portions of the first jaw member and the second jaw member from exceeding a predetermined distance. The clamping member and the clamp apparatus are separately movable.",
    "claims": "\n1. A surgical tool for performing robotic surgery, the surgical tool comprising:\nan endoscopic body portion having a distal portion and defining a longitudinal axis;\na tool assembly pivotally supported on the distal portion of the endoscopic body portion, the tool assembly having an anvil and a cartridge assembly, the cartridge assembly including a channel portion and a cartridge, the channel portion defining a recess for receiving the cartridge, the cartridge assembly being pivotally coupled to the anvil for movement from an open position to a clamped position to clamp tissue;\na clamping member including upper and lower flanges, the upper and lower flanges positioned to engage surfaces of the anvil and the cartridge assembly to pivot the cartridge assembly in relation to the anvil from the open position to the clamped position, the cartridge including first and second groups of retention slots for receiving staples, each of the first and second groups of retention slots including three rows of retention slots, one of the three rows of retention slots of each of the first and second groups of retention slots being longitudinally offset from the other two rows of retention slots;\na sled positioned to translate through the cartridge; and\na drive member including a cable for moving the clamping member and the sled distally through the cartridge to eject staples from the cartridge, the drive member being longitudinally movable through the cartridge, wherein the cable includes a coaxial cable having an outer sheath that extends between the endoscopic body portion and the tool assembly.\n2. The surgical tool of claim 1, further including a knife blade movable with the sled through the cartridge.\n3. The surgical tool of claim 2, wherein the knife blade is formed as part of one of the clamping member or the sled.\n4. The surgical tool of claim 3, wherein the clamping member includes a central body portion.\n5. The surgical tool of claim 4, wherein the knife blade is positioned on the central body portion of the clamping member.\n6. The surgical tool of claim 1, wherein the tool assembly is pivotally connected to the endoscopic body portion by a pivot member.\n7. The surgical tool of claim 1, wherein the clamping member is integrally formed of a material to minimize deflection of the anvil during clamping and firing of the surgical tool.\n8. The surgical tool of claim 1, wherein the tool assembly is rotatable about the longitudinal axis.\n9. The surgical tool of claim 1, wherein the coaxial cable is longitudinally movable to move the clamping member through the cartridge.\n10. The surgical tool of claim 1, wherein the coaxial cable is attached to the clamping member.\n11. The surgical tool of claim 1, further including an articulation mechanism to articulate the tool assembly in relation to the endoscopic body portion.\n12. The surgical tool of claim 11, wherein the articulation mechanism includes at least one articulation link.\n13. The surgical tool of claim 12, wherein the at least one articulation link includes a proximal articulation link and a distal articulation link.\n14. A surgical tool for performing robotic surgery, the surgical tool comprising:\nan endoscopic body portion having a distal portion and defining a longitudinal axis;\na tool assembly pivotally supported on the distal portion of the endoscopic body portion, the tool assembly having an anvil and a cartridge assembly, the cartridge assembly including a channel portion and a cartridge, the channel portion defining a recess for receiving the cartridge, the cartridge assembly being pivotally coupled to the anvil for movement from an open position to a clamped position to clamp tissue;\na clamping member including upper and lower flanges, the upper and lower flanges positioned to engage surfaces of the anvil and the cartridge assembly to pivot the cartridge assembly in relation to the anvil from the open position to the clamped position;\na sled positioned to translate through the cartridge;\na knife blade movable with the sled through the cartridge; and\na drive member including a cable for moving the clamping member and the sled distally through the cartridge to eject staples from the cartridge, the drive member being longitudinally movable through the cartridge, wherein the cable includes a coaxial cable having an outer sheath that extends between the endoscopic body portion and the tool assembly.\n15. The surgical tool of claim 14, wherein the knife blade is formed as part of one of the clamping member or the sled.\n16. The surgical tool of claim 14, wherein the clamping member includes a central body portion.\n17. The surgical tool of claim 16, wherein the knife blade is positioned on the central body portion of the clamping member."
}