{
    "patent_link": "https://patents.google.com/patent/US5054094A/en",
    "patent_id": "US5054094A",
    "title": "Rotationally impervious feature extraction for optical character recognition",
    "abstract": "A feature-based optical character recognition system, employing a feature-based recognition device such as a neural network or an absolute distance measure device, extracts a set of features from segmented character images in a document, at least some of the extracted features being at least nearly impervious to rotation or skew of the document image, so as to enhance the reliability of the system. One rotationally invariant feature extracted by the system is the number of intercepts between boundary transitions in the image with at least a selected one of a plurality of radii centered at the centroid of the character in the image.",
    "inventors": [
        "Lori L. Barski"
    ],
    "assignee": "Eastman Kodak Co",
    "classifications": [
        "G06V30/18",
        "G06V30/10"
    ],
    "claims": "\n1. A feature-based optical character recognition system for extracting features from an individual character image segmented from a document image, comprising:\nradial intercept feature extraction means for counting a number of intercepts between at least one of a plurality of circles of predetermined radii and boundary transitions in said character image;\ntransition point location feature extraction means for determining for each transition point in said image an identity of a pair of regions in a grid superimposed on said character image nearest the transition point, whereby said number of intercepts and said identity of said pair of regions comprise an input data string; and\nfeature-based recognition means for comparing said input data string with a set of reference data strings corresponding to a set of known symbols.\n2. The system of claim 1 wherein said radial intercept feature extraction means comprise:\nmeans for locating a centroid and boundary of an object in said character image;\nmeans for selecting one radius of said circle and centering said circle at said centroid.\n3. The system of claim 2 wherein said means for selecting said radius comprise:\nmeans for locating with respect to said centroid a reference radius between a minimum radial peak and a maximum radial valley in said boundary; and\nmeans for computing said one radius as a weighted average of said reference radius and a mean radius of said boundary.\n4. The system of claim 2 wherein said radial intercept feature extraction means further comprises:\nmeans for determining for each one of said intercepts an identity of a pair of polar sections nearest said intercept in a grid of polar sections superimposed on said character image and centered at said centroid, wherein said input data string further comprises said identity of said pair of polar sections.\n5. The system of claim 1 wherein said radial intercept means comprises means for generating a histogram of the intercept count at each one of said plurality of radii, wherein said input data string comprises said histogram.\n6. The system of claim 1 wherein said transition points comprise end points and branch points in said image.\n7. The system of claim 1 further comprising curve feature extraction means for making an identification of which predetermined regions of said character image match one of a set of arc templates, wherein said input data string further comprises said identification of said predetermined regions.\n8. The system of claim 7 wherein said curve feature extraction means comprises means for making said identification for each one of a set of four quarter-arc templates.\n9. The system of claim 8 wherein said predetermined regions comprise quadrants of said character image.\n10. The system of claim 1 further comprising line feature extraction means for making an identification of at least one of a plurality of selected lines having predetermined orientations correlated with said character image, wherein said input data string further comprises said identification of said selected line.\n11. The system of claim 10 wherein said plurality of selected lines comprise vertical, horizontal, minor diagonal and major diagonal lines, whereby said line feature extraction means comprises means for making said identification for each one of said selected lines.\n12. The system of claim 10 wherein said line feature extraction means comprises means for determining whether the number of \"ON\" pixels in each one of a plurality of parallel linear regions of said character image characterized by one of said predetermined orientations exceeds a predetermined threshold number.\n13. A feature-based optical character recognition method for extracting features from an individual character image segmented from a document image, comprising:\ncounting a number of intercepts between at least one of a plurality of circles of predetermined radii in said character image and boundary transitions in said character image;\ndetermining for each transition point in said image an identity of a pair of regions in a grid superimposed on said character image nearest the transition point, whereby said number of intercepts and said identity of said pair of regions comprise an input data string; and\ncomparing said input data string with a set of reference data strings corresponding to a set of known symbols.\n14. The method of claim 13 wherein said counting step comprises:\nlocating a centroid and boundary of an object in said character image;\ncentering said one circle at said centroid; and\nselecting the radius of said one circle.\n15. The method of claim 14 wherein said selecting step comprises:\nlocating with respect to said centroid a reference radius between a minimum radial peak and a maximum radial valley in said boundary; and\ncomputing said radius as a weighted average of said reference radius an a mean radius of said boundary.\n16. The method of claim 14 wherein said counting step further comprises:\ndetermining for each one of said intercepts an identity of a pair of polar sections nearest said intercept in a grid of polar sections superimposed on said character image and centered at said centroid, wherein said input data string further comprises said identity of said pair of polar sections.\n17. The method of claim 13 wherein said counting step comprises generating a histogram of the intercept count at each one of said plurality of radii, wherein said input data string comprises said histogram.\n18. The method of claim 13 wherein said transition points comprise end points and branch points in said image.\n19. The method of claim 13 further comprising making an identification of which predetermined regions of said character image match one of a set of arc templates, wherein said input data string further comprises said identification of said predetermined regions.\n20. The method of claim 19 wherein said step of making said identification of said predetermined regions comprises making said identification for each one of a set of four quarter-arc templates.\n21. The method of claim 20 wherein said predetermined regions comprise quadrants of said character image.\n22. The method of claim 13 further comprising making an identification of at least one of a plurality of selected lines having predetermined orientations correlated with said character image, wherein said input data string further comprises said identification of said selected line.\n23. The method of claim 22 wherein said plurality of selected lines comprise vertical, horizontal, minor diagonal and major diagonal lines.\n24. The method of claim 22 wherein said step of making said identification of said selected line comprises determining whether the number of \"ON\" pixels in each one of a plurality of parallel linear regions of said character image characterized by one of said predetermined orientations exceeds a predetermined threshold number.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "DE226379C",
        "US2838602A",
        "US3050711A",
        "US3407386A",
        "US3506837A",
        "US3715724A",
        "US3766520A",
        "US3805239A",
        "US3909785A",
        "US3968475A",
        "US4000399A",
        "US4048615A",
        "US4109237A",
        "US4132976A",
        "US4163214A",
        "US4185270A",
        "US4208652A",
        "US4242734A",
        "JPS5647876A",
        "US4275381A",
        "JPS57113183A",
        "US4361830A",
        "US4607384A",
        "US4628533A",
        "US4641355A",
        "US4644583A",
        "US4651341A",
        "US4672678A",
        "US4704694A",
        "US4712248A",
        "US4742556A",
        "US4754493A",
        "US4783830A",
        "US4783829A",
        "US4817187A",
        "US4922543A"
    ],
    "citations_ftf": [
        "JPS5723302B2",
        "JPS646512B2",
        "CA1210870A",
        "DE3716787C2",
        "US4891750A",
        "US4802230A",
        "US4959870A"
    ],
    "citedby_own": [
        "US5245674A",
        "US5253307A",
        "US5305395A",
        "US5319722A",
        "US5371809A",
        "US5513277A",
        "US5588072A",
        "US5604822A",
        "US5629990A",
        "US5638466A",
        "US5696838A",
        "US5712922A",
        "US5742702A",
        "US5771308A",
        "US6101270A",
        "US6112195A",
        "US6130959A",
        "US6141464A",
        "US20010028732A1",
        "US6373997B1",
        "US6571013B1",
        "US20040247171A1",
        "US20050152586A1",
        "US20050163347A1",
        "US20100054629A1",
        "US20100246982A1",
        "US20100329569A1",
        "US8345979B2",
        "US8422793B2",
        "CN103093185A",
        "US20130148902A1",
        "US20160110599A1",
        "US9378435B1",
        "US9476705B2"
    ],
    "citedby_ftf": [
        "JP4683395B2",
        "DE102009048066A1",
        "DE102010020330A1",
        "DE102011109387A1",
        "DE102013219909A1"
    ]
}