{
    "patent_link": "https://patents.google.com/patent/US6493702B1/en",
    "patent_id": "US6493702B1",
    "title": "System and method for searching and recommending documents in a collection using share bookmarks",
    "abstract": "A search and recommendation system employs the preferences and profiles of individual users and groups within a community of users, as well as information derived from shared document bookmarks, to augment Internet searches, re-rank search results, and provide recommendations for documents based on a subject-matter query. The search and recommendation system operates in the context of a shared bookmark manager, which stores individual users' bookmarks (some of which may be published or shared for group use) on a centralized bookmark database connected to the Internet. The shared bookmark manager is implemented as a distributed program, portions of which operate on users' terminals and other portions of which operate on the centralized bookmark database.",
    "inventors": [
        "Eytan Adar",
        "Thomas M. Breuel",
        "Todd A. Cass",
        "James E. Pitkow",
        "Hinrich Schuetze"
    ],
    "assignee": "Google LLC",
    "classifications": [
        "G06F16/9562",
        "Y10S707/99933",
        "Y10S707/99934"
    ],
    "claims": "\n1. A method of adding a content pointer to a collection of shared content pointers contributed by a plurality of users, wherein each shared content pointer is associated with a content source, the content pointers organized into a plurality of categories, comprising the steps of:\n2. A system for maintaining a collection of shared document content pointers contributed by a plurality of users, wherein each shared document content pointer represents a document in a document repository, comprising:\n3. The system of claim 2, wherein each user terminal includes a browser.\n4. The system of claim 2, wherein a first portion of the software is executed by the database, and a second portion of the software is executed by each user terminal.\n5. The system of claim 4, wherein the second portion of the software is downloaded on demand from the database to a user terminal.\n6. The system of claim 5, wherein at least a portion of the collection of shared document content pointers is downloaded on demand from the database to a user terminal.\n7. The system of claim 6, wherein the portion of the collection of shared document content pointers is uploaded to the database from the user terminal upon completion of a session of use.\n8. The system of claim 6, wherein the portion of the collection of shared document content pointers is uploaded to the database from the user terminal on demand.\n9. The system of claim 6, wherein a user command received by the second portion is transmitted from the user terminal to the database for processing.\n10. The system of claim 9, wherein the portion of the collection of shared document content pointers is uploaded to the database from the user terminal together with the user command.\n11. The system of claim 2, wherein the software adapted to maintain the collection of shared document content pointers is also adapted to maintain a plurality of user-specific document content pointer sets corresponding to the plurality of users.\n12. The system of claim 11, wherein the software is adapted to publish a content pointer from a user-specific document content pointer set to the collection of shared document content pointers upon request by a user.\n13. The system of claim 2, wherein the collection of shared document content pointers comprises a plurality of shared content pointers arranged in a global hierarchy of categories.\n14. The system of claim 4, wherein the first portion is adapted to monitor the availability of each shared document content pointer in the collection of shared document content pointers.\n15. The system of claim 14, wherein if a shared document content pointer is unavailable, the first portion is adapted to generate a recommendation for a similar document chosen from the collection of shared document content pointers.\n16. A method for generating a recommendation from a collection of shared document content pointers contributed by a plurality of users, wherein each shared document content pointer represents a document, comprising the steps of:\n17. A method for searching an information repository comprising the steps of:\n18. The method of claim 17, wherein the context comprises a profile for a single user chosen from the plurality of users.\n19. The method of claim 18, wherein the profile comprises a content vector derived from at least one document represented by at least one content pointer in at least one selected topical category of content pointers contributed by the single user.\n20. The method of claim 17, wherein the profile comprises a content vector derived from at least one document represented by at least one shared content pointer contributed by the group.\n21. The method of claim 17, wherein the profile comprises a content vector derived from at least one document represented by at least one content pointer in at least one selected topical category of content pointers contributed by the group.\n22. The method of claim 17, wherein the context comprises a profile for the plurality of users, said profile comprising a content vector derived from at least one document represented by at least one content pointer in at least one selected topical category of content pointers contributed by the plurality of users.\n23. The method of claim 17, further comprising the step of ordering the group of retrieved content pointers in a ranking order, the order determined by a weighted set of user metrics.\n24. The method of claim 23, wherein the set of user metrics are chosen from the group consisting of a popularity metric, a frequency of access metric, a recency of access metric, and a link structure metric.\n25. The method of claim 24, wherein the step of identifying the popularity of each content pointer in the group of content pointers comprises determining what fraction of users in the plurality of users contributed the content pointer.\n26. The method of claim 17, further comprising the steps of:\n27. The method of claim 26, further comprising the steps of:\n28. A method for searching an information repository comprising the steps of:\n29. The method of claim 28, wherein the augmenting step comprises the steps of:\n30. The method of claim 29, wherein the context comprises a profile, the profile selected from a group consisting of a user profile for a single user chosen from the plurality of users, a group profile for a group of users chosen from the plurality of users, and a profile for the plurality of users.\n31. The method of claim 30, wherein the profile is derived from at least one document represented by at least one content pointer in at least one selected topical category of content pointers contributed by at least one user.\n32. The method of claim 28, further comprising the step of ordering the retrieved documents in a ranking order, the order determined by a weighted set of user metrics.\n33. The method of claim 32, wherein the set of user metrics are chosen from the group consisting of a popularity metric, a frequency of access metric, a recency of access metric, and a link structure metric.\n34. The method of claim 33, wherein the step of identifying the popularity of each document in the group of documents comprises determining what fraction of users in the plurality of users contributed a content pointer representative of the document.\n35. The method of claim 33, wherein the link structure comprises a computed inlink weight combined with a computed outlink weight.\n36. The method of claim 29, further comprising the step of re-ranking the group of content pointers based on a spreading activation analysis of the group of content pointers.\n37. The method of claim 28, further comprising the steps of:\n38. The method of claim 37, further comprising the steps of:\n39. A method for searching an information repository comprising the steps of:\n40. The method of claim 39, wherein the profile is derived from at least one document represented by at least one content pointer in at least one selected topical category of content pointers contributed by at least one user.\n41. The method of claim 39, further comprising:\n42. The method of claim 41, wherein the augmented query keyword is derived from the collection context.\n43. The method of claim 39, further comprising the step of ordering the retrieved documents in a ranking order, the order determined by a weighted set of user metrics.\n44. The method of claim 43, wherein the set of user metrics are chosen from the group consisting of a popularity metric, a frequency of access metric, a recency of access metric, and a link structure metric.\n45. The method of claim 44, wherein the step of identifying the popularity of each document in the group of documents comprises determining what fraction of users in the plurality of users contributed a content pointer representative of the document.\n46. A method for searching an information repository comprising the steps of:\n47. The method of claim 46, wherein the set of user metrics are chosen from the group consisting of a popularity metric, a frequency of access metric, a recency of access metric, and a link structure metric.\n48. The method of claim 47, wherein the step of identifying the popularity of each document in the group of documents comprises determining what fraction of users in the plurality of users contributed a content pointer representative of the document.\n49. A method for generating ordered recommendations of content sources from an information repository comprising the steps of:\n50. The method of claim 49, wherein the retrieved group of content sources is ranked in accordance with a computed match with the context.\n51. The method of claim 50, wherein the context comprises a profile, the profile selected from a group consisting of a user profile for a single user chosen from the plurality of users, a group profile for a group of users chosen from the plurality of users, and a profile for the plurality of users.\n52. The method of claim 51, wherein the profile is derived from at least one document represented by at least one content pointer in at least one selected topical category of content pointers contributed by at least one user.\n53. The method of claim 49, wherein the ranking step further comprises the step of ordering the group of retrieved content sources in accordance with a set of user recommendation priority metrics.\n54. The method of claim 53, wherein the user recommendation priority metrics are chosen from the group consisting of a popularity metric, a frequency of access metric, a recency of access metric, and a link structure metric.\n55. The method of claim 49, further comprising the steps of:\n56. The method of claim 55, wherein the augmented query keyword is derived from the collection context.\n57. A method for generating ordered recommendations of content sources from an information repository comprising the steps of:\n58. The method according to claim 57 further comprising the steps of:\n59. An information repository search engine comprising:\n60. The information repository search engine of claim 59, wherein the query augmentation engine combines the identified associate keyword with the keyword query input to define an enhanced keyword vector.\n61. The information repository search engine of claim 60, further comprising a retrieval engine, the retrieval engine configured to retrieve at least one of a group of content sources, each identified by a content pointer and each including content indicia, at least one content index matching the enhanced keyword vector.\n62. The information repository search engine of claim 59, further comprising a contextualization engine, the contextualization engine identifying a context within the collection, wherein the associate keyword is derived from the context.\n63. The information repository search engine of claim 61, further comprising a recommendation engine, the recommendation engine ordering a set of retrieved content sources in accordance with a set of user recommendation metrics, the user recommendation metrics chosen from the group consisting of a popularity metric, a frequency of access metric, a recency of access metric, and a link structure metric.\n64. In a search engine of the type configured to search an information repository on the basis of at least a query keyword input by a user, the search engine retrieving at least one of a group of content sources, each content source including content indicia, a recommendation engine comprising:\n65. The recommendation engine of claim 64, wherein the user recommendation metrics are chosen from the group consisting of a popularity metric, a frequency of access metric, a recency of access metric, and a link structure metric.\n66. The recommendation engine of claim 64, further comprising:\n67. The recommendation engine of claim 66, further comprising:",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4839853A",
        "US5113340A",
        "US5265065A",
        "US5301109A",
        "US5317507A",
        "US5442778A",
        "US5446891A",
        "US5526443A",
        "US5592375A",
        "US5630125A",
        "US5638543A",
        "US5659766A",
        "US5687364A",
        "US5748954A",
        "US5749081A",
        "US5796393A",
        "US5802516A",
        "US5802515A",
        "US5813007A",
        "US5835905A",
        "US5847708A",
        "US5875446A",
        "US5907845A",
        "US5909207A",
        "US5918010A",
        "US5918014A",
        "US5924105A",
        "US6005568A",
        "US6029175A",
        "US6029172A",
        "US6032162A",
        "US6037934A",
        "US6041311A",
        "US6049812A",
        "US6052714A",
        "US6055508A",
        "US6085226A",
        "US6092049A",
        "US6098065A",
        "US6100890A",
        "EP1030247A2",
        "US6138128A",
        "US6185598B1"
    ],
    "citations_ftf": [
        "US5666526A",
        "US5729495A",
        "US5909845A",
        "US6460034B1",
        "US6256633B1",
        "US6363377B1",
        "US6253202B1",
        "US6327590B1"
    ],
    "citedby_own": [
        "US20020007354A1",
        "US20020010652A1",
        "US20020046257A1",
        "US20020049814A1",
        "US20020059399A1",
        "US20020069190A1",
        "US20020087535A1",
        "US20020095466A1",
        "US20020099784A1",
        "US20020107884A1",
        "US20020120604A1",
        "US20020145589A1",
        "US20020147813A1",
        "US20020152461A1",
        "US20020156832A1",
        "US20020184351A1",
        "US20020188671A1",
        "US20030005134A1",
        "US20030005041A1",
        "US20030034956A1",
        "US20030036967A1",
        "US20030046290A1",
        "US20030055819A1",
        "US20030098878A1",
        "US20030101216A1",
        "US20030110133A1",
        "US6584471B1",
        "US20030131000A1",
        "US6598047B1",
        "US6606654B1",
        "US20030182295A1",
        "US20030182277A1",
        "US6643658B1",
        "US6665710B1",
        "US20040000995A1",
        "US20040002938A1",
        "US6687696B2",
        "US20040030690A1",
        "US20040034631A1",
        "US20040039814A1",
        "US20040044677A1",
        "US6718365B1",
        "US20040088313A1",
        "US20040135817A1",
        "US20040143570A1",
        "US6778975B1",
        "US20040210560A1",
        "GB2401215A",
        "US20040230564A1",
        "US6832350B1",
        "US20040267748A1",
        "US20040267815A1",
        "US20050010582A1",
        "US20050050103A1",
        "US20050055335A1",
        "US20050071479A1",
        "US20050086212A1",
        "WO2005048059A2",
        "US20050131762A1",
        "US20050131721A1",
        "US20050131866A1",
        "US6915294B1",
        "US20050154711A1",
        "US6948135B1",
        "US6950861B1",
        "US20050216460A1",
        "US20050216526A1",
        "US20050223326A1",
        "US20050228781A1",
        "US20050229252A1",
        "US6961751B1",
        "WO2005114469A1",
        "US20050283468A1",
        "US20060026173A1",
        "US20060041549A1",
        "US20060064406A1",
        "US7028268B1",
        "US7047482B1",
        "US20060112076A1",
        "US7080073B1",
        "US7082573B2",
        "US20060167942A1",
        "US7092936B1",
        "US20060190548A1",
        "US7100114B1",
        "US20060195325A1",
        "US7103838B1",
        "US20060206480A1",
        "US20060218487A1",
        "US20060224942A1",
        "US20060235886A1",
        "US7127454B2",
        "US20060242586A1",
        "US20060246932A1",
        "US20060265381A1",
        "US20060282504A1",
        "WO2006130985A1",
        "US7158986B1",
        "US20070022111A1",
        "US20070022125A1",
        "US20070033224A1",
        "US20070043745A1",
        "US20070043710A1",
        "US7213249B2",
        "US20070100798A1",
        "US7216163B2",
        "US20070124301A1",
        "US20070130331A1",
        "US20070130126A1",
        "US7231419B1",
        "US7237191B1",
        "US20070162422A1",
        "US7251647B2",
        "US20070179924A1",
        "US20070185827A1",
        "US20070192313A1",
        "US20070198340A1",
        "US20070203991A1",
        "US20070203906A1",
        "US7266762B1",
        "US20070214118A1",
        "US20070214122A1",
        "US20070214097A1",
        "US20070233672A1",
        "US7281018B1",
        "US20070239672A1",
        "US20070239734A1",
        "US20070244868A1",
        "US7287214B1",
        "US20070250501A1",
        "US7295995B1",
        "US20070276831A1",
        "US20070282847A1",
        "US20080010286A1",
        "US20080010252A1",
        "US20080018670A1",
        "US7330845B2",
        "US20080059454A1",
        "US20080059584A1",
        "US7346604B1",
        "US7349912B2",
        "US20080086496A1",
        "US7363339B2",
        "US20080098312A1",
        "US20080104042A1",
        "US20080120142A1",
        "US20080140722A1",
        "US20080147632A1",
        "US20080162400A1",
        "US20080189253A1",
        "US20080195607A1",
        "US7415607B2",
        "US20080201326A1",
        "US7421432B1",
        "US20080222105A1",
        "US20080243817A1",
        "US20080243637A1",
        "US20080243837A1",
        "US20080256049A1",
        "US20080270484A1",
        "US20080270390A1",
        "US20080276177A1",
        "US20080275834A1",
        "US20080281769A1",
        "US20080301091A1",
        "US20080306932A1",
        "US20080319944A1",
        "US20080319973A1",
        "US20080319955A1",
        "US20090006324A1",
        "US20090006358A1",
        "US7475151B2",
        "EP2011065A2",
        "WO2009014058A1",
        "US7487145B1",
        "US7496856B2",
        "US20090055242A1",
        "US7499940B1",
        "US20090063439A1",
        "US20090063386A1",
        "US20090059082A1",
        "US20090070360A1",
        "US7519902B1",
        "US20090100047A1",
        "US7523103B2",
        "US20090112827A1",
        "US20090119173A1",
        "US20090132285A1",
        "US20090132316A1",
        "US20090132516A1",
        "US20090157714A1",
        "US7581011B2",
        "US20090222716A1",
        "US20090232134A1",
        "US20090274384A1",
        "US20100010977A1",
        "US20100010981A1",
        "US20100042608A1",
        "US20100042460A1",
        "US7668821B1",
        "US7673227B2",
        "US7673047B2",
        "US7676843B1",
        "US7689457B2",
        "US7692636B2",
        "US7702997B2",
        "US7712048B2",
        "US7711818B2",
        "US7712022B2",
        "US20100114950A1",
        "US7716332B1",
        "US7721190B2",
        "US7725834B2",
        "US20100131333A1",
        "US20100153427A1",
        "US20100153364A1",
        "US20100153416A1",
        "US20100153428A1",
        "US7743063B2",
        "US7747749B1",
        "US7765298B2",
        "US7779343B2",
        "US7797635B1",
        "US7802174B2",
        "US7818677B2",
        "US7827170B1",
        "US20100281025A1",
        "US7831582B1",
        "US20100287183A1",
        "US7840658B2",
        "US20100306658A1",
        "US7865477B2",
        "US20110010372A1",
        "US7877266B2",
        "US7882132B2",
        "JP2011023045A",
        "US20110040622A1",
        "US20110047213A1",
        "US7900134B2",
        "US7904487B2",
        "US7904801B2",
        "US7913159B2",
        "US7925621B2",
        "US7925246B2",
        "US20110093476A1",
        "US7937655B2",
        "US7937651B2",
        "US7949659B2",
        "US7966225B2",
        "US20110153644A1",
        "US7971139B2",
        "US7974885B1",
        "US7979856B2",
        "US7979501B1",
        "US20110184951A1",
        "US7996208B2",
        "US8001459B2",
        "US8010515B2",
        "US8015600B2",
        "US8019766B2",
        "US20110221367A1",
        "US8046683B2",
        "US8051096B1",
        "US8065275B2",
        "US8073866B2",
        "US8078545B1",
        "US8078960B2",
        "US8078602B2",
        "US8086697B2",
        "US20110320430A1",
        "US20120005227A1",
        "US8103659B1",
        "US8170912B2",
        "US20120117048A1",
        "US8181116B1",
        "US8195714B2",
        "US8200975B2",
        "US8219447B1",
        "US8224964B1",
        "US20120197855A1",
        "US8255413B2",
        "US8260787B2",
        "US8266127B2",
        "US8275790B2",
        "US8290986B2",
        "US8301623B2",
        "US8316003B2",
        "US8316020B1",
        "US20130080422A1",
        "US8423541B1",
        "US8468157B2",
        "US8478732B1",
        "US8487879B2",
        "US8521735B1",
        "US8543577B1",
        "US8554852B2",
        "US8554794B2",
        "US20130290339A1",
        "US8577868B1",
        "US8583654B2",
        "US8601004B1",
        "US20130335758A1",
        "US8621022B2",
        "US8620952B2",
        "US8627197B2",
        "US8626851B2",
        "US8645941B2",
        "CN103559288A",
        "US8661361B2",
        "US8676922B1",
        "US8688691B2",
        "US8689238B2",
        "US20140108408A1",
        "US8719255B1",
        "US8725716B1",
        "US8738733B1",
        "WO2014081741A1",
        "US8751507B2",
        "US8805840B1",
        "US8812651B1",
        "US8819072B1",
        "US8843536B1",
        "US8868590B1",
        "US8874570B1",
        "US8892993B2",
        "US8898141B1",
        "US8918520B2",
        "US8918729B2",
        "US8965998B1",
        "US8977613B1",
        "US8996550B2",
        "US9002725B1",
        "US9043352B1",
        "US9047386B2",
        "US9118553B2",
        "US9135226B2",
        "US9141590B1",
        "US9195756B1",
        "US9262388B2",
        "US9275149B2",
        "US9361640B1",
        "US9367637B2",
        "US9424240B2",
        "US9423954B2",
        "US9436781B2",
        "US20160283471A1",
        "US9465889B2",
        "US9495446B2",
        "US9582095B1",
        "US20170155726A1",
        "US9672292B2",
        "US9785883B2",
        "RU2633096C2",
        "US9836545B2",
        "US9841878B1",
        "US9972317B2",
        "US9977831B1",
        "US9984048B2",
        "US10261938B1",
        "US10331743B2",
        "US10397639B1",
        "US10657161B2",
        "US10796076B2",
        "US10826862B1",
        "CN112632398A",
        "USRE48904E1",
        "US11367295B1",
        "US11397745B1"
    ],
    "citedby_ftf": [
        "JP4282030B2",
        "US7181438B1",
        "US6963867B2",
        "US9736209B2",
        "US7624172B1",
        "US7567958B1",
        "US7630959B2",
        "US7287071B2",
        "US20050144114A1",
        "US7669051B2",
        "US8176563B2",
        "US7546334B2",
        "US7191252B2",
        "US7103915B2",
        "US8677505B2",
        "US20020075302A1",
        "JP3938872B2",
        "JP4630480B2",
        "JP2002297185A",
        "US7260643B2",
        "US7058643B2",
        "WO2002097670A1",
        "US7272594B1",
        "US20030009496A1",
        "US7028024B1",
        "EP1412874A4",
        "US6820075B2",
        "US6778979B2",
        "US6928425B2",
        "US7133862B2",
        "US7284191B2",
        "US6732090B2",
        "US7117432B1",
        "US7809710B2",
        "DE10143940B4",
        "US7313617B2",
        "US20030080986A1",
        "US6944616B2",
        "US7568150B2",
        "JP2003242176A",
        "US7133879B1",
        "US7386439B1",
        "US8135711B2",
        "AU2003207856A1",
        "US7519589B2",
        "US7421660B2",
        "US7949648B2",
        "US7567953B2",
        "US20070038614A1",
        "US8078615B2",
        "US20030220913A1",
        "US6892198B2",
        "WO2004010331A1",
        "US7570943B2",
        "US8856093B2",
        "US7496559B2",
        "US7082428B1",
        "US7831476B2",
        "US20050125240A9",
        "US7428580B2",
        "US7899862B2",
        "US7590696B1",
        "WO2004046867A2",
        "US7640306B2",
        "US8965964B1",
        "US8005919B2",
        "US8122137B2",
        "US8701014B1",
        "US20040100494A1",
        "US7280957B2",
        "US8533840B2",
        "US8117265B2",
        "US7653693B2",
        "US7756750B2",
        "US8086619B2",
        "US7383269B2",
        "JP4457614B2",
        "US7516086B2",
        "US7693827B2",
        "US7617205B2",
        "US20050096997A1",
        "US20090018918A1",
        "US8566263B2",
        "US8600920B2",
        "US7493294B2",
        "US7606772B2",
        "US7526459B2",
        "US7539652B2",
        "USRE45770E1",
        "US7526458B2",
        "US7860804B2",
        "US20050138067A1",
        "US20050149619A1",
        "US8156444B1",
        "US7761569B2",
        "GB2411014A",
        "US8055553B1",
        "US8788492B2",
        "US7707142B1",
        "US7664734B2",
        "US7693825B2",
        "US9009153B2",
        "US20070276801A1",
        "US8041713B2",
        "US8595214B1",
        "US8631001B2",
        "US20080040315A1",
        "US20080059419A1",
        "US7272601B1",
        "US7539674B2",
        "US20110099053A1",
        "US7788260B2",
        "CN1993697A",
        "US9223868B2",
        "US7788274B1",
        "US8131754B1",
        "CN101390042B",
        "US8078607B2",
        "WO2006011819A1",
        "US8341143B1",
        "US7873622B1",
        "CN101014954B",
        "US7853606B1",
        "US20060059225A1",
        "US20060074864A1",
        "US7574433B2",
        "US7499928B2",
        "US7904337B2",
        "WO2006050278A2",
        "US7698270B2",
        "US20060149800A1",
        "US8538970B1",
        "US20060195361A1",
        "US20060161621A1",
        "US20070189544A1",
        "US7489979B2",
        "US7562117B2",
        "US7542816B2",
        "US20060229058A1",
        "US20110208732A1",
        "US20060179056A1",
        "US20060173556A1",
        "US20070276870A1",
        "US20060173828A1",
        "US7624102B2",
        "US8660977B2",
        "US7904411B2",
        "US20060179026A1",
        "US20060179044A1",
        "US10515374B2",
        "US20060253210A1",
        "US7870147B2",
        "US7565345B2",
        "US20060230005A1",
        "US20060223637A1",
        "US20060224608A1",
        "US7873765B1",
        "US7613664B2",
        "US20060224583A1",
        "US9256685B2",
        "US7636714B1",
        "US20060223635A1",
        "US20060256008A1",
        "US10210159B2",
        "US8732175B2",
        "US20060241864A1",
        "US20060259574A1",
        "US20060256007A1",
        "US7962504B1",
        "US20070150188A1",
        "US20060271286A1",
        "US20070150483A1",
        "US20070150721A1",
        "US20070150457A1",
        "US7877386B2",
        "US20060186197A1",
        "US20080032719A1",
        "US8200687B2",
        "WO2007002820A2",
        "US20070011616A1",
        "WO2007014398A2",
        "US7702675B1",
        "US8739020B2",
        "US9268867B2",
        "US7565358B2",
        "US9471925B2",
        "US8503995B2",
        "US20110313853A1",
        "US8688671B2",
        "US10038756B2",
        "US8989718B2",
        "US8433297B2",
        "US8832100B2",
        "US9058406B2",
        "US9076175B2",
        "US7769764B2",
        "US10911894B2",
        "US7577665B2",
        "US7702318B2",
        "US7752209B2",
        "US7912458B2",
        "US8103545B2",
        "US9703892B2",
        "US7676394B2",
        "US10592930B2",
        "US8805339B2",
        "US9201979B2",
        "US8176101B2",
        "US7577522B2",
        "US20070083323A1",
        "US7586032B2",
        "US8161044B2",
        "US7890502B2",
        "US7457801B2",
        "US8156097B2",
        "US20060227047A1",
        "US8533199B2",
        "US7899829B1",
        "US20070145680A1",
        "US8327297B2",
        "US20070143300A1",
        "US20070075127A1",
        "JP2007172490A",
        "US7856446B2",
        "US20090196570A1",
        "WO2007082169A2",
        "US20070182760A1",
        "US7859550B2",
        "US20090300476A1",
        "US7958051B2",
        "US8200579B2",
        "US20070208730A1",
        "US7634474B2",
        "US8842660B2",
        "US8228824B2",
        "US8065135B2",
        "US7477165B2",
        "US9497314B2",
        "US20070253407A1",
        "US7603350B1",
        "US20070271228A1",
        "US20070270126A1",
        "US20070271245A1",
        "GB0610119D0",
        "US20070274293A1",
        "US20070280225A1",
        "JP4179341B2",
        "US7814112B2",
        "GB2439349A",
        "US20080005095A1",
        "US20080005067A1",
        "US8788517B2",
        "WO2008008072A1",
        "EP2074600A1",
        "US8135725B2",
        "US8943039B1",
        "US8037093B2",
        "US9798789B2",
        "US7587392B2",
        "US7552112B2",
        "US8548991B1",
        "US9171040B2",
        "US20080097979A1",
        "US20080104021A1",
        "US20080288588A1",
        "US9519715B2",
        "BRPI0718582A8",
        "CN100507915C",
        "US7765176B2",
        "US20080137668A1",
        "US7685119B2",
        "US8423565B2",
        "US8166026B1",
        "US8468244B2",
        "US7647325B2",
        "US8073850B1",
        "US8819021B1",
        "US10007895B2",
        "US8484083B2",
        "US9214001B2",
        "US20080222132A1",
        "US8626930B2",
        "US8484214B2",
        "US8005823B1",
        "US20080262998A1",
        "US8433995B1",
        "US20080270151A1",
        "US8051040B2",
        "BRPI0813820A2",
        "US7774345B2",
        "US9235848B1",
        "US7958228B2",
        "US7979321B2",
        "WO2009018001A1",
        "JP2010536102A",
        "KR100954624B1",
        "US8103967B2",
        "US20090070346A1",
        "US8201081B2",
        "US20090112847A1",
        "JP5294612B2",
        "US8583633B2",
        "JP4433326B2",
        "US8271357B2",
        "US20090157612A1",
        "US8117060B2",
        "US8984044B2",
        "US8046675B2",
        "US20090216724A1",
        "EP2083364A1",
        "US20090198488A1",
        "KR20090087269A",
        "US20090216859A1",
        "EP2096558A1",
        "US8412702B2",
        "US20090234837A1",
        "US10242104B2",
        "US9081853B2",
        "US20090259620A1",
        "US7949643B2",
        "US9135328B2",
        "US20090276425A1",
        "US20090281994A1",
        "US20090282045A1",
        "US8250054B2",
        "US8273182B2",
        "CN101661474B",
        "US20110264537A1",
        "US20100095219A1",
        "GB2464498A",
        "US8140463B2",
        "US8166016B2",
        "US20100185616A1",
        "US8078617B1",
        "US9607324B1",
        "US10191982B1",
        "US9245033B2",
        "US8661030B2",
        "US20100268704A1",
        "US20100287129A1",
        "US20100293206A1",
        "EP2280354A1",
        "US20110040753A1",
        "US20110060745A1",
        "US20110184813A1",
        "US9015148B2",
        "US20110154209A1",
        "JP5171854B2",
        "US20110238670A1",
        "US8930351B1",
        "US20110246439A1",
        "US8880520B2",
        "US20110270828A1",
        "WO2012003779A1",
        "US10817555B2",
        "US20120084669A1",
        "US9152726B2",
        "US10068266B2",
        "US8484191B2",
        "US8725743B2",
        "US20120278318A1",
        "US8793312B2",
        "US9436726B2",
        "US9218605B2",
        "EP2639714A4",
        "US9342612B2",
        "US8930339B2",
        "CN103377201B",
        "EP2856328A4",
        "US9111319B2",
        "US20140019546A1",
        "US9245428B2",
        "SG2012059135A",
        "US10198776B2",
        "US9323767B2",
        "US20140109137A1",
        "US9020962B2",
        "US9569440B2",
        "US9529928B2",
        "US9659058B2",
        "US9602607B2",
        "US9880983B2",
        "US10079737B2",
        "US11238056B2",
        "US9542440B2",
        "US10324987B2",
        "US11645289B2",
        "US9870432B2",
        "US11657060B2",
        "US10757201B2",
        "US10394827B2",
        "US10255563B2",
        "US10169457B2",
        "US9836765B2",
        "US9319442B2",
        "CN105224547A",
        "US10346550B1",
        "US10061826B2",
        "US10127318B2",
        "US20180004845A1",
        "US10331679B2",
        "US10534783B1",
        "US20170351674A1",
        "KR102010418B1",
        "US10643178B1",
        "CN107491552A",
        "CN110020153B",
        "US10282359B1",
        "CN109033228A",
        "US11328086B2",
        "US11526567B2",
        "US20200125680A1",
        "CN111222076B",
        "CN113590958B"
    ]
}