{
    "patent_id": "US-11113475-B2",
    "title": "Chatbot generator platform ",
    "assignee": "Accenture Global Solutions Limited",
    "publication_date": "2021-09-07",
    "patent_link": "https://patents.google.com/patent/US11113475B2/en",
    "inventors": [
        "Nirav Jagdish SAMPAT",
        "Saran Prasad",
        "Manish Jain",
        "Sriram Lakshminarasimhan",
        "Dharmesh DHIRAJLAL BAROCHIA",
        "Purnanga Prema BORAH",
        "Deepali Jain",
        "Suhas Vinod SANE"
    ],
    "classifications": [
        "G06F40/35",
        "G06F16/00",
        "G06F16/3329",
        "G06F40/186",
        "G06F40/30",
        "G06N20/00",
        "G06N3/006",
        "G06N5/022",
        "G06N5/041",
        "H04L51/02"
    ],
    "abstract": "An example chatbot generation platform may receive a request to generate a chatbot; determine a chatbot template for the chatbot based on the request; obtain custom chatbot information according to the chatbot template; generate a chatbot corpus for the chatbot using the custom chatbot information and the chatbot template; generate a set of question and answer (QnA) pairs based on the chatbot corpus; configure a language analysis model for the chatbot; build the chatbot according to the set of QnA pairs and the language analysis model; and deploy the chatbot to a chatbot host platform for operation. The chatbot may be built to engage in an interaction with a user via the chatbot host platform, use the language analysis model to select one or more QnA pairs from the set of QnA pairs during the interaction, and train the language analysis model based on the interaction.",
    "claims": "\n1. A method, comprising:\nreceiving, by a device, a request to generate a chatbot,\nwherein the request identifies a type of the chatbot;\ndetermining, by the device, a chatbot template for the chatbot based on the type of the chatbot;\nobtaining, by the device, chatbot information according to the chatbot template;\ngenerating, by the device and based on the chatbot template and the chatbot information, a chatbot corpus for the chatbot;\ngenerating, by the device, a set of question and answer (QnA) pairs;\nconfiguring, by the device and based on the chatbot corpus, a language analysis model for the chatbot,\nwherein the language analysis model is configured to select one or more QnA pairs of the set of QnA pairs during an interaction between the chatbot and a user;\nbuilding, by the device, the chatbot according to the set of QnA pairs and the language analysis model; and\ndeploying, by the device, the chatbot to a chatbot host platform to enable operation of the chatbot,\nwherein, during the operation of the chatbot, the language analysis model is trained based on the interaction with the user.\n2. The method of claim 1, wherein the set of QnA pairs are generated based on the chatbot information,\nwherein the chatbot information identifies at least one of:\na format of the chatbot,\na topic associated with the chatbot, or\na context associated with the chatbot.\n3. The method of claim 1, wherein the set of QnA pairs are generated based on the chatbot information and a training chatbot corpus.\n4. The method of claim 1, wherein the request is received from a user device, and wherein the chatbot information is obtained according to the chatbot template by:\nproviding the chatbot template to the user device,\nwherein the chatbot template includes prompts for the chatbot information, and\nreceiving the chatbot information according to the prompts.\n5. The method of claim 1, wherein the language analysis model is configured to select the set of QnA pairs during the interaction based on the chatbot corpus,\nwherein the chatbot corpus includes a set of simulated user inputs and a set of simulated chatbot responses.\n6. The method of claim 1, wherein the language analysis model comprises a machine learning model that is trained according to the interaction during the operation of the chatbot and at least one of:\none or more other interactions associated with the chatbot, or\none or more other interactions associated with one or more other chatbots.\n7. The method of claim 1, wherein the type of the chatbot includes at least one of:\na frequently asked questions (FAQ) chatbot,\na survey chatbot,\na user support chatbot,\na project management chatbot,\nan information technologies support chatbot, or\na sales assistant chatbot.\n8. The method of claim 1, wherein the chatbot host platform is communicatively coupled with an application platform,\nwherein the chatbot is built to be accessed via an application of the application platform, and\nwherein the interaction involves a communication facilitated by the application hosted by the application platform.\n9. A device, comprising:\none or more memories; and\none or more processors communicatively coupled to the one or more memories, configured to:\nreceive, from a user device, a request to generate a chatbot,\nwherein the request identifies a characteristic of the chatbot;\ndetermine a chatbot template for the chatbot based on the characteristic of the chatbot;\nprovide, to the user device, the chatbot template to permit the user device to provide custom chatbot information according to the chatbot template;\nreceive the custom chatbot information after providing the chatbot template;\ngenerate, based on the chatbot template and the custom chatbot information, a chatbot corpus for the chatbot;\ngenerate, based on the chatbot corpus, a set of question and answer (QnA) pairs for the chatbot;\nconfigure, based on the chatbot corpus and using the set of QnA pairs, a language analysis model for the chatbot;\nbuild the chatbot according to the set of QnA pairs and the language analysis model; and\ndeploy the chatbot to a chatbot host platform for operation,\nwherein, the chatbot, during operation, is configured to:\nengage in an interaction with a user via the chatbot host platform,\nuse the language analysis model to select one or more QnA pairs from the set of QnA pairs during the interaction, and\ntrain the language analysis model based on the interaction.\n10. The device of claim 9, wherein the one or more processors, when generating the chatbot corpus, are to:\ngenerate, using a machine learning model, the chatbot corpus to include a set of simulated user inputs and a set of simulated responses,\nwherein the machine learning model is trained based on a plurality of chatbot corpuses stored in a data structure that is communicatively coupled with the one or more processors,\nwherein the machine learning model is configured to generate the set of simulated user inputs and the set of simulated responses according to sets of simulated user inputs and sets of simulated responses in the plurality of chatbot corpuses.\n11. The device of claim 9, wherein the chatbot comprises a first chatbot, and\nwherein the request is received by a second chatbot associated with the device,\nwherein the chatbot template is provided by the second chatbot, and\nwherein the custom chatbot information is received by the second chatbot.\n12. The device of claim 9, wherein the language analysis model comprises a machine learning model,\nwherein the machine learning model is trained based on:\none or more other interactions associated with the chatbot, or\none or more other interactions associated with one or more other chatbots.\n13. The device of claim 9, wherein the characteristic of the chatbot includes at least one of:\na type of the chatbot,\na format of the chatbot, or\na source of the chatbot.\n14. The device of claim 9, wherein the chatbot host platform is communicatively coupled with an application platform,\nwherein the interaction involves a communication facilitated by an application hosted by the application platform.\n15. A non-transitory computer-readable medium storing instructions, the instructions comprising:\none or more instructions that, when executed by one or more processors, cause the one or more processors to:\nreceive a request to generate a chatbot;\ndetermine a chatbot template for the chatbot based on the request;\nobtain custom chatbot information according to the chatbot template;\ngenerate, using a first machine learning model, a chatbot corpus for the chatbot,\nwherein the first machine learning model generates the chatbot corpus using the custom chatbot information and the chatbot template;\ngenerate, using a second machine learning model, a set of question and answer (QnA) pairs based on the chatbot corpus;\nconfigure, using a third machine learning model, a language analysis model for the chatbot;\nbuild the chatbot according to the set of QnA pairs and the language analysis model; and\ndeploy the chatbot to a chatbot host platform for operation,\nwherein, the chatbot is built to, while under operation:\nengage in an interaction with a user via the chatbot host platform,\nuse the language analysis model to select one or more QnA pairs from the set of QnA pairs during the interaction, and\ntrain the language analysis model based on the interaction.\n16. The non-transitory computer-readable medium of claim 15, wherein the first machine learning model is trained based on a set of simulated user inputs and a set of simulated chatbot responses associated with one or more other chatbot corpuses.\n17. The non-transitory computer-readable medium of claim 15, wherein the second machine learning model is trained based on sets of QnA pairs associated with one or more other chatbots,\nwherein the one or more other chatbots are associated with the chatbot based on being at least one of:\na same type of chatbot,\na same format of chatbot,\na same source of chatbot,\nbeing associated with a same topic, or\nbeing associated with a same context.\n18. The non-transitory computer-readable medium of claim 15, wherein the third machine learning model is trained based on at least one of learning analysis models associated with one or more other chatbots,\nwherein the one or more other chatbots are associated with the chatbot based on being at least one of:\na same type of chatbot,\na same format of chatbot,\na same source of chatbot,\nbeing associated with a same topic, or\nbeing associated with a same context.\n19. The non-transitory computer-readable medium of claim 15, wherein the first machine learning model, the second machine learning model, and the third machine learning model are associated with a same chatbot generation model.\n20. The non-transitory computer-readable medium of claim 15, wherein the chatbot host platform is communicatively coupled with an application platform,\nwherein the chatbot is built to be accessible via an application hosted by the application platform.",
    "status": "Active",
    "citations_own": [
        "US20120041903A1",
        "US20150161521A1",
        "US20170180284A1",
        "US20170344532A1",
        "US20180054464A1",
        "US20180054523A1",
        "US20180053119A1",
        "US20180083898A1",
        "US20180131645A1",
        "US20180212904A1",
        "US20180367484A1",
        "US20190179608A1",
        "US20200081939A1",
        "US20200327196A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20220180857A1",
        "US20220353304A1",
        "US11689486B1"
    ],
    "citedby_ftf": [
        "US11113475B2",
        "US11461311B2",
        "US11106874B2",
        "US11689484B2",
        "US11599813B1",
        "US20210209499A1",
        "US11397857B2",
        "JP2021157222A",
        "US11720752B2",
        "US20220075960A1",
        "CN116301847A"
    ]
}