{
    "patent_link": "https://patents.google.com/patent/US6678268B1/en",
    "patent_id": "US6678268B1",
    "title": "Multi-interface point-to-point switching system (MIPPSS) with rapid fault recovery capability",
    "abstract": "A combination delivering signals between a plurality of devices includes a mixed-layer switching fabric, and a controller which controls the mixed-layer switching fabric. According to the present invention, the controller includes a first device for automatically performing fault recognition and fault isolation routines when the multi-interface switching system is initialized and periodically thereafter, and a second device for performing the fault recognition and fault isolation routines on demand. Moreover, the mixed-layer switching fabric further includes a computer controlled switch which establishes one of point-to-point connections and point-to-multipoint connections under the control of the controller, the computer controlled switch comprising a non-volatile memory which stores switch configuration data indicative of a current configuration of the switching fabric to thereby facilitate fail-safe operation of the switching system without requiring re-initialization or re-configuration of the switching system upon power-up of the switching system following an occurrence of a power-down condition of the switching system.",
    "inventors": [
        "Harry F. Francis",
        "Thomas F. Cocke, IV",
        "II Gary S. Calvert",
        "Roland H. Mattoon",
        "Timothy Y. Gorder",
        "Neal E. Moody",
        "Gair D. Brown"
    ],
    "assignee": "US Department of Navy",
    "classifications": [],
    "claims": "\n1. A multi-interface switching system, including:\n2. The multi-interface switching system as set forth in claim 1, wherein at least one of the different signals is a parallel interface format signal and at least one of the different signals is a serial interface format signal.\n3. The multi-interface switching system as set forth in claim 1, wherein the controller determines the duration of each connection independent of the data content of the signal delivered via that connection.\n4. The multi-interface switching system as set forth in claim 3, wherein the switch configuration data includes switch setting data that defines the determined signal path for each current connection, and connection duration data that defines the determined duration for each current connection.\n5. The multi-interface switching system as set forth in claim 1, wherein the switch configuration data include switch setting data that defines the determined signal path for each current connection.\n6. The multi-interface switching system as set forth in claim 1, wherein said storing means automatically saves the switch configuration data upon detection of a power-down condition of the switching system.\n7. The multi-interface switching system as set forth in claim 1, wherein the switching fabric includes:\n8. The multi-interface switching system as set forth in claim 7, wherein the controller provides unified control over the switching operation of all of the different switching layers.\n9. The multi-interface switching system as set forth in claim 7, further including means for verifying the viability of each determined connection before it is established.\n10. The multi-interface switching system as set forth in claim 9, wherein the controller does not establish any connections that have not been verified.\n11. The multi-interface switching system as set forth in claim 9, wherein at least one of the different signals is a parallel interface format signal and at least one of the different signals is a serial interface format signal.\n12. The multi-interface switching system as set forth in claim 1, wherein the controller comprises:\n13. The multi-interface switching system as set forth in claim 1, wherein the switching fabric includes a plurality of different switching layers, and the controller provides unified control over the switching operation of all of the different switching layers.\n14. The multi-interface switching system as set forth in claim 1, wherein the different signals include electrical and optical signals.\n15. The multi-interface switching system as set forth in claim 1, wherein the signal fidelity of the switching fabric is substantially perfect, so that the different signals exhibit substantially the same signal characteristics after passing through the switching fabric that they exhibit prior to passing through the switching fabric.\n16. A multi-interface switching system, including:\n17. The multi-interface switching system as set forth in claim 16, wherein at least one of the different signals is a parallel interface format signal and at least one of the different signals is a serial interface format signal.\n18. The multi-interface switching system as set forth in claim 16, further comprising a controller that determines the fixed, low latency signal path for each connection and generates switch configure data by which the switching fabric establishes the determined signal path for each connection.\n19. The multi-interface switching system as set forth in claim 18, wherein the controller determines the duration of each connection independent of the data content of the signal delivered via that connection.\n20. The multi-interface switching system as set forth in claim 19, wherein the switch configuration data includes switch setting data that defines the determined signal path for each current connection, and connection duration data that defines the determined duration for each current connection.\n21. The multi-interface switching system as set forth in claim 18, wherein said storing means automatically saves the switch configuration data upon detection of a power-down condition of the switching system.\n22. The multi-interface switching system as set forth in claim 16, wherein the switch configuration data includes switch setting data that defines the determined signal path for each current connection.\n23. The multi-interface switching system as set forth in claim 16, wherein the switching fabric includes:\n24. The multi-interface switching system as set forth in claim 23, wherein the switch configuration data includes data indicative of a current configuration of each of the switching layers.\n25. The multi-interface switching system as set forth in claim 24, wherein the controller provides unified control over the switching operation of all of the different switching layers.\n26. The multi-interface switching system as set forth in claim 16, wherein the switching fabric includes a plurality of different levels of switching components, and the switch configuration data includes data indicative of a current configuration of each of the different levels of switching components.\n27. The multi-interface switching system as set forth in claim 26, wherein the controller provides unified control over the switching operation of all of the different switching layers.\n28. The multi-interface switching system as set forth in claim 27, wherein the controller is a programmable controller.\n29. The multi-interface switching system as set forth in claim 16, wherein the switching fabric includes a plurality of different switching layers, and the switch configuration data includes data indicative of a current configuration of each of the different switching layers.\n30. The multi-interface switching system as set forth in claim 29, wherein the controller provides unified control over the switching operation of all of the different switching layers.\n31. The multi-interface switching system as set forth in claim 30, wherein the controller is a programmable controller.\n32. The multi-interface switching system as set forth in claim 16, wherein the controller comprises:\n33. A multi-interface switching system, including:\n34. The multi-interface switching system as set forth in claim 33, wherein at least one of the different signals is a parallel interface format signal and at least one of the different signals is a serial interface format signal.\n35. The multi-interface switching system as set forth in claim 33, wherein the controller determines the duration of each connection independent of the data content of the signal delivered via that connection.\n36. The multi-interface switching system as set forth in claim 35, wherein the switch configuration data includes switch setting data that defines the determined signal path for each current connection, and connection duration data that defines the determined duration for each current connection.\n37. The multi-interface switching system as set forth in claim 33, wherein the switch configuration data includes switch setting data that defines the determined signal path for each current connection.\n38. The multi-interface switching system as set forth in claim 33, wherein said memory automatically saves the switch configuration data responsive to detection of a power-down condition of the switching system by the controller.\n39. The multi-interface switching system as set forth in claim 33, wherein the switching fabric includes:\n40. The multi-interface switching system as set forth in claim 39, wherein the controller provides unified control over the switching operation of all of the different switching layers.\n41. The multi-interface switching system as set forth in claim 39, further including means for verifying the viability of each determined connection before it is established.\n42. The multi-interface switching system as set forth in claim 41, wherein the controller does not establish any connections that have not been verified.\n43. The multi-interface switching system as set forth in claim 41, wherein at least one of the different signals is a parallel interface format signal and at least one of the different signals is a serial interface format signal.\n44. The multi-interface switching system as set forth in claim 33, wherein the controller is a programmable controller.\n45. The multi-interface switching system as set forth in claim 33, wherein the switching fabric includes a plurality of different switching layers, and the controller provides unified control over the switching operation of all of the different switching layers.\n46. The multi-interface switching system as set forth in claim 33, wherein the different signals include electrical and optical signals.\n47. The multi-interface switching system as set forth in claim 33, wherein the signal fidelity of the switching fabric is substantially perfect, so that the different signals exhibit substantially the same signal characteristics after passing through the switching fabric that they exhibit prior to passing through the switching fabric.\n48. A multi-interface switching system, including:\n49. The multi-interface switching system as set forth in claim 48, wherein at least one of the different signals is a parallel interface format signal and at least one of the different signals is a serial interface format signal.\n50. The multi-interface switching system as set forth in claim 48, wherein the controller means determines the duration of each connection independent of the data content of the signal delivered via that connection.\n51. The multi-interface switching system as set forth in claim 50, wherein the switch configuration data includes switch setting data that defines the determined signal path for each current connection, and connection duration data that defines the determined duration for each current connection.\n52. The multi-interface switching system as set forth in claim 48, wherein the switch configuration data includes switch setting data that defines the determined signal path for each current connection.\n53. The multi-interface switching system as set forth in claim 48, wherein the controller means automatically saves the switch configuration data upon detection of a power-down condition of the switching system.\n54. The multi-interface switching system as set forth in claim 48, wherein the switching means includes:\n55. The multi-interface switching system as set forth in claim 54, wherein the controller means provides unified control over the switching operation of all of the different switching layers.\n56. The multi-interface switching system as set forth in claim 54, further including means for verifying the viability of each determined connection before it is established.\n57. The multi-interface switching system as set forth in claim 56, wherein the controller means does not establish any connections that have not been verified.\n58. The multi-interface switching system as set forth in claim 56, wherein at least one of the different signals is a parallel interface format signal and at least one of the different signals is a serial interface format signal.\n59. The multi-interface switching system as set forth in claim 48, wherein the controller means comprises:\n60. The multi-interface switching system as set forth in claim 48, wherein the switching means includes a plurality of different switching layers, and the controller means provides unified control over the switching operation of all of the different switching layers.\n61. The multi-interface switching system as set forth in claim 48, wherein the different signals include electrical and optical signals.\n62. The multi-interface switching system as set forth in claim 48, wherein the signal fidelity of the switching means is substantially perfect, so that the different signals exhibit substantially the same signal characteristics after passing through the switching means that they exhibit prior to passing through the switching means.\n63. A multi-interface switching system, including:\n64. The multi-interface switching system as set forth in claim 63, wherein at least one of the different signals is a parallel interface format signal and at least one of the different signals is a serial interface format signal.\n65. The multi-interface switching system as set forth in claim 63, further comprising a controller means for determining the fixed, low latency signal path for each connection and for generating switch configuration data by which said switching means establishes the determined signal path for each connection.\n66. The multi-interface switching system as set forth in claim 65, wherein the controller means determines the duration of each connection independent of the data content of the signal delivered via that connection.\n67. The multi-interface switching system as set forth in claim 66, wherein the switch configuration data includes switch setting data that defines the determined signal path for each current connection, and connection duration data that defines the determined duration for each current connection.\n68. The multi-interface switching system as set forth in claim 65, wherein the memory means automatically saves the switch configuration data upon detection of a power-down condition of the switching system by said controller means.\n69. The multi-interface switching system as set forth in claim 63, wherein the switch configuration data includes switch setting data that defines the determined signal path for each current connection.\n70. The multi-interface switching system as set forth in claim 63, wherein the switching means includes:\n71. The multi-interface switching system as set forth in claim 70, wherein the switch configuration data includes data indicative of a current configuration of each of the switching layers.\n72. The multi-interface switching system as set forth in claim 71, wherein the controller means provides unified control over the switching operation of all of the different switching layers.\n73. The multi-interface switching system as set forth in claim 72, wherein the controller means comprises:\n74. The multi-interface switching system as set forth in claim 73, wherein the controller is a programmable controller.\n75. The multi-interface switching system as set forth in claim 63, wherein the switching means includes a plurality of different levels of switching components, and the switch configuration data includes data indicative of a current configuration of each of the different levels of switching components.\n76. The multi-interface switching system as set forth in claim 75, wherein the controller means provides unified control over the switching operation of all of the different switching layers.\n77. The multi-interface switching system as set forth in claim 63, wherein the switching means includes a plurality of different switching layers, and the switch configuration data includes data indicative of a current configuration of each of the different switching layers.\n78. The multi-interface switching system as set forth in claim 77, wherein the controller means provides unified control over the switching operation of all of the different switching layers.\n79. The multi-interface switching system as set forth in claim 78, wherein the controller means comprises a programmable controller.\n80. A multi-interface switching system, including:\n81. The multi-interface switching system as set forth in claim 80, wherein at least one of the different signals is a parallel interface format signal and at least one of the different signals is a serial interface format signal.\n82. The multi-interface switching system as set forth in claim 80, wherein the controller means determines the duration of each connection independent of the data content of the signal delivered via that connection.\n83. The multi-interface switching system as set forth in claim 82, wherein the switch configuration data includes switch setting data that defines the determined signal path for each current connection, and connection duration data that defines the determined duration for each current connection.\n84. The multi-interface switching system as set forth in claim 80, wherein the switch configuration data includes switch setting data that defines the determined signal path for each current connection.\n85. The multi-interface switching system as set forth in claim 80, wherein the memory means automatically saves the switch configuration data upon detection of a power-down condition of the switching system by said controller means.\n86. The multi-interface switching system as set forth in claim 80, wherein the switching means includes:\n87. The multi-interface switching system as set forth in claim 86, wherein the controller means provides unified control over the switching operation of all of the different switching layers.\n88. The multi-interface switching system as set forth in claim 86, further including means for verifying the viability of each determined connection before it is established.\n89. The multi-interface switching system as set forth in claim 88, wherein the controller means does not establish any connections that have not been verified.\n90. The multi-interface switching system as set forth in claim 80, wherein the controller means comprises:\n91. The multi-interface switching system as set forth in claim 80, wherein the switching means includes a plurality of different switching layers, and the controller means provides unified control over the switching operation of all of the different switching layers.\n92. The multi-interface switching system as set forth in claim 91, wherein at least one of the different signals is a parallel interface format signal and at least one of the different signals is a serial interface format signal.\n93. The multi-interface switching system as set forth in claim 80, wherein the different signals include electrical and optical signals.\n94. The multi-interface switching system as set forth in claim 80, wherein the signal fidelity of the switching means is substantially perfect, so that the different signals exhibit substantially the same signal characteristics after passing through the switching means that they exhibit prior to passing through the switching means.\n95. A combination delivering signals between a plurality of devices, comprising:\n96. The combination as set forth in claim 95, wherein said controller determines an associated low latency for each of a plurality of signal paths within said switching fabric and selects the one of said signals commands having the lowest latency value.\n97. The combination as set forth in claim 95, wherein the mixed-layer switching fabric includes a plurality of different switching components, including local area switching means for interconnecting devices within a local area, intermediate area switching means for interconnecting devices within an intermediate area, and wide area switching means for interconnecting devices within a wide area.\n98. The combination as set forth in claim 95, wherein:\n99. The combination as set forth in claim 95, wherein said controller determines the duration of each connection within said mixed-layer switching fabric.\n100. The combination as set forth in claim 95, wherein said mixed-layer switching fabric establishes at least one of a point-to-point and a point-to-multipoint connection responsive to control signals generated by said controller.\n101. The combination as set forth in claim 95, wherein the controller comprises:",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4009345A",
        "US4181886A",
        "US4491944A",
        "US4653047A",
        "US4677611A",
        "US4696000A",
        "US4706081A",
        "US4720850A",
        "US4731825A",
        "US4736462A",
        "US4769833A",
        "US4807282A",
        "US4817083A",
        "US4965798A",
        "US4972463A",
        "US5077735A",
        "US5182751A",
        "US5204949A",
        "US5239542A",
        "US5291480A",
        "US5367522A",
        "US5384773A",
        "US5406557A",
        "US5420916A",
        "US5497373A",
        "US5535373A",
        "US5581558A",
        "US5612953A",
        "US5654695A",
        "US5659542A",
        "US5691984A",
        "US5706111A",
        "US5706290A",
        "US5812754A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20020016856A1",
        "US20030227573A1",
        "US20040007917A1",
        "US20040095025A1",
        "US20040192439A1",
        "US20050120277A1",
        "US20050189817A1",
        "US20050228943A1",
        "US20050271071A1",
        "WO2006105092A2",
        "US20070041338A1",
        "US20100150151A1",
        "US20100165984A1",
        "US20100165983A1",
        "US8195758B1",
        "US8705500B1",
        "RU2526100C2",
        "US20190107816A1",
        "US20190122169A1",
        "US10678233B2",
        "US10706456B2",
        "US10732621B2",
        "US10983507B2",
        "US11199837B2",
        "US11199835B2",
        "US11237546B2",
        "US11271871B2",
        "US11315174B2",
        "US11451491B2",
        "US11455269B1",
        "US11774944B2"
    ],
    "citedby_ftf": []
}