{
    "patent_link": "https://patents.google.com/patent/US5586550A/en",
    "patent_id": "US5586550A",
    "title": "Apparatus and methods for the delivery of therapeutic liquids to the respiratory system",
    "abstract": "The invention provides methods and apparatus for the delivery of therapeutic liquids to the respiratory system of a patient. In an exemplary embodiment, the apparatus includes a vibratable non-planar member having tapered apertures which produce droplets wherein about 70% of more of the droplets by weight have a size in the range from about 1 μm to 6 μm. The apparatus may further optionally include a breath sensor which detects the inspiratory flow rate and transmits a signal to vibrate the non-planar member at a frequency corresponding to the inspiratory flow rate. Optionally, the non-planar member may be included in a disposable mouthpiece assembly that is separate from the oscillator assembly. In this manner, the mouthpiece assembly may be discarded after use, while the oscillator assembly may be reused.",
    "inventors": [
        "Yehuda Ivri",
        "Cheng H. Wu"
    ],
    "assignee": "Novartis Pharma AG",
    "classifications": [
        "A61M11/005",
        "B05B17/0615",
        "A61M15/0085",
        "A61M15/009",
        "A61M2016/0021",
        "A61M2016/0039"
    ],
    "claims": "\n1. An apparatus for nebulizing a liquid, the apparatus comprising:\na non-planar member comprising a front surface, a rear surface, and a plurality of apertures extending therebetween, said apertures being tapered to narrow from the rear surface to the front surface;\na liquid supplier which delivers liquid to the rear surface such that substantially all of the delivered liquid adheres to the non-planar member by surface tension; and\na vibrator which vibrates the non-planar member to eject liquid droplets from the front surface of the member.\n2. An apparatus as in claim 1, wherein the apertures have a preferred geometry to eject liquid droplets such that about 70% of more of the droplets by weight have a size in the range from about 1 to 6 μm.\n3. An apparatus as in claim 1, wherein the size of the apertures at the front surface is in the range from about 1 μm to 6 μm, and wherein the apertures have a slope at the front surface in the range from about 10° to 20° relative to a central axis extending through the apertures.\n4. An apparatus as in claim 3, wherein the slope of the apertures at the front surface is in the range from about 10° to 15° relative to the central axis.\n5. An apparatus as in claim 1, wherein the slope of the apertures at the front surface is about 12° relative to the central axis.\n6. An apparatus as in claim 1, wherein the non-planar member is sufficiently rigid to vibrate homogeneously.\n7. An apparatus as in claim 1, wherein the non-planar member is a thin shell member having a shape selected from the group of shapes consisting of an arc shape, a parabolic shape, or a hemispherical shape.\n8. An apparatus as in claim 1, further comprising a housing having a proximal end and a distal end, wherein the non-planar member is held within the housing, and wherein the vibrator is removably attached about the housing.\n9. An apparatus for nebulizing a liquid, the device comprising:\na housing having a proximal end and a distal end;\na vibratable non-planar member mounted within the housing, said non-planar member having a plurality of apertures for nebulizing the liquid upon vibration of the non-planar member; and\na vibrator removably attached about the housing which vibrates the non-planar member.\n10. An apparatus as in claim 9, wherein each of the apertures is tapered in geometry.\n11. An apparatus as in claim 10, wherein the tapers have a size in the range from about 1 μm to 6 μm at their narrowest dimension.\n12. An apparatus as in claim 9, wherein the non-planar member is mounted within a portion of the housing which is isolated by an elastomeric material.\n13. An apparatus as in claim 9, wherein the non-planar member is sufficiently rigid to vibrate homogeneously.\n14. An apparatus as in claim 9, wherein the non-planar member is a thin shell member having a shape which is selected from the group of shapes consisting of an arc shape, a parabolic shape, or a hemispherical shape.\n15. An apparatus as in claim 9, further comprising a mouthpiece at the proximal end of the housing.\n16. An apparatus as in claim 15, further comprising an acoustical chamber within the housing which produces an audible signal during inhalation from the mouthpiece and which may be detected to control the operation of the vibrator.\n17. An apparatus for nebulizing a liquid, the apparatus comprising:\na housing having a distal end and a mouthpiece at a proximal end;\nan non-planar member mounted within the housing, said non-planar member having a plurality of apertures;\na vibrator which vibrates the non-planar member to eject liquid from the apertures;\nan acoustic chamber within the housing which produces an audible signal during inhalation from the mouthpiece; and\na controller for controlling the rate of non-planar member vibration upon detection of the audible signal.\n18. An apparatus as in claim 17, wherein the controller includes a microphone which detects the audible signal.\n19. An apparatus as in claim 17, wherein the non-planar member includes a front surface and a rear surface, with the plurality of apertures extending between the front surface and rear surface, said apertures being tapered to narrow from the rear surface to the front surface.\n20. An apparatus as in claim 19, further comprising a liquid supplier which delivers liquid to the rear surface such that substantially all of the delivered liquid adheres to the non-planar member by surface tension.\n21. An apparatus as in claim 17, wherein the apertures in the non-planar member are tapered and are constructed to eject liquid droplets from the front surface of the non-planar member such that about 70% of more of the droplets by weight have a size in the range from about 1 μm to 6 μm.\n22. An apparatus as in claim 21, wherein the apertures are tapered toward the front surface and are sized to eject liquid droplets such that about 70% of more of the droplets by weight have a size in the range from about 1 μm to 6 μm.\n23. An apparatus as in claim 17, wherein the size of the apertures at the front surface is in the range from about 1 μm to 6 μm, and wherein the apertures have a slope at the front surface in the range from about 10° to 20° relative to a central axis extending through the apertures.\n24. An apparatus as in claim 23, wherein the slope of the apertures at the front surface is in the range from about 10° to 15° relative to the central axis.\n25. A method for nebulizing a liquid, said method comprising:\nproviding a non-planar member having a plurality of tapered apertures extending therethrough; and\nvibrating the non-planar member to produce liquid droplets where about 70% of more of the droplets by weight have a size in the range from about 1 μm to 6 μm.\n26. A method as in claim 25, further comprising supplying liquid to the non-planar member such that substantially all of the delivered liquid adheres to the non-planar member by surface tension, and wherein substantially all of the delivered liquid is ejected upon vibration of the non-planar member.\n27. A method as in claim 26, wherein the supplying step further comprises squeezing a liquid reservoir to supply liquid to the non-planar member.\n28. A method as in claim 25, further comprising vibrating the non-planar member at a frequency sufficient to produce the liquid droplets at a rate greater than about 5 μliters per second.\n29. A method as in claim 25, wherein the vibrating step further comprises vibrating substantially all of the apertures in the non-planar member in unison.\n30. A method as in claim 25, wherein the vibrating step further comprises vibrating the non-planar member at a frequency in the range from about 45 kHz to 200 kHz.\n31. A method as in claim 25, wherein the non-planar member is held within a housing having a mouthpiece, and further comprising vibrating the non-planar member at a rate corresponding to an inspiratory flow rate through the mouthpiece.\n32. A method as in claim 31, further comprising producing an audible signal during inhalation and detecting the produced signal to control rate of vibration of the non-planar member.\n33. A method as in claim 25, further comprising vibrating the non-planar member only during inhalation from the mouthpiece.\n34. A method as in claim 25, wherein the liquid is a medicament, and further comprising vibrating the non-planar member to produce liquid droplets such that about 90% of more of the produced droplets by weight have a size in the range from about 1 μm to 6 μm.\n35. A method as in claim 25, wherein vibrating step further comprises removably attaching a vibrating source about a housing enclosing the non-planar member and actuating the vibrating source.\n36. A method as in claim 35, further comprising removing the vibrating source and discarding the housing.\n37. A method for delivering a liquid medicament to the respiratory system of a patient, the method comprising:\nproviding a housing having a proximal end and a distal end\nproviding a non-planar member which is disposed within the housing, the non-planar member having a plurality of tapered apertures extending therethrough;\nsupplying liquid to the non-planar member;\ninhaling from the proximal end of the housing; and\nvibrating the non-planar member in response to the inhalation to eject the liquid.\n38. A method as in claim 37, further comprising varying the inspiratory flow rate.\n39. A method as in claim 37, wherein the vibrating step further comprises ejecting the liquid only during inhalation.\n40. A method as in claim 37, further comprising producing an audible signal during inhalation and detecting the produced signal to control the vibration of the non-planar member.\n41. A method as in claim 37, wherein the vibrating step further comprises vibrating the non-planar member at a frequency sufficient to produce liquid droplets such that about 70% of more of the droplets by weight have a size in the range from about 1 μm to 6 μm.\n42. A method as in claim 37, wherein the supplying step further comprises supplying liquid to the non-planar member such that substantially all of the delivered liquid adheres to the non-planar member by surface tension.\n43. A method as in claim 42, wherein the supplying step further comprises dispensing the liquid from a liquid reservoir to supply liquid to the non-planar member.\n44. A method as in claim 37, wherein the vibrating step further comprises vibrating substantially all of the apertures in the non-planar member in unison.\n45. A method as in claim 37, wherein the liquid is a medicament, and further comprising supplying liquid to the non-planar member such that substantially all of the delivered liquid adheres to the non-planar member by surface tension.\n46. A method as in claim 37, wherein vibrating step further comprises removably attaching a vibrating source about the housing and actuating the vibrating source.\n47. A method as in claim 46, further comprising removing the vibrating source and discarding the housing.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "CH477885A",
        "US3812854A",
        "US4119096A",
        "US4159803A",
        "US4268460A",
        "US4301093A",
        "US4300546A",
        "US4334531A",
        "US4338576A",
        "GB2101500A",
        "US4465234A",
        "US4533082A",
        "EP0178925A2",
        "US4632311A",
        "US4790479A",
        "US4793339A",
        "US4850543A",
        "US4887989A",
        "US4976259A",
        "US5063922A",
        "US5076266A",
        "US5139016A",
        "US5152456A",
        "US5164740A",
        "US5170782A",
        "US5487378A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5758637A",
        "US5906202A",
        "WO1999063946A2",
        "US6014970A",
        "US6062212A",
        "US6085740A",
        "WO2000053337A1",
        "WO2000053336A1",
        "USD433125S",
        "US6152130A",
        "US6158431A",
        "US6161536A",
        "US6196219B1",
        "WO2001019437A1",
        "US6223744B1",
        "US6235177B1",
        "WO2001051110A1",
        "WO2001085244A1",
        "WO2002009889A1",
        "EP1201258A2",
        "WO2002036269A1",
        "US6443366B1",
        "WO2002074374A1",
        "US20020134372A1",
        "US20030006184A1",
        "US6540154B1",
        "US6543443B1",
        "US6546927B2",
        "US6550472B2",
        "US6554201B2",
        "US20030089368A1",
        "WO2003041774A1",
        "WO2003059424A1",
        "US6606992B1",
        "WO2003082477A1",
        "WO2003097126A2",
        "US6655379B2",
        "US6732944B2",
        "US6782886B2",
        "EP1474198A1",
        "WO2005009323A2",
        "WO2005065756A2",
        "WO2005102431A2",
        "US6962151B1",
        "US20050263149A1",
        "US20060097068A1",
        "US20060198941A1",
        "US20060198942A1",
        "US20060198940A1",
        "WO2006102345A2",
        "US20060238757A1",
        "WO2006127181A2",
        "US20060289002A1",
        "US7185651B2",
        "US20070062526A1",
        "US20070075161A1",
        "US20070096788A1",
        "US20070219481A1",
        "US20080212517A1",
        "US20080236577A1",
        "US20090241948A1",
        "US7600511B2",
        "US7645442B2",
        "US7677467B2",
        "US20100126502A1",
        "US7766013B2",
        "US20100282247A1",
        "WO2011009131A1",
        "WO2011014800A2",
        "US7883031B2",
        "WO2011018777A1",
        "US7913688B2",
        "US20110108025A1",
        "US7946291B2",
        "US20110168172A1",
        "US7981401B2",
        "US7987846B2",
        "WO2011098552A2",
        "US8012136B2",
        "US20110232312A1",
        "EP2371409A1",
        "WO2012092163A1",
        "US8235037B2",
        "US8332020B2",
        "US8333197B2",
        "US8336545B2",
        "US8348177B2",
        "US8357696B2",
        "US8387612B2",
        "US8408200B2",
        "US8419638B2",
        "EP2594272A2",
        "EP2607524A1",
        "WO2013092701A1",
        "US8539944B2",
        "US8551036B2",
        "WO2013158353A1",
        "US8629139B2",
        "WO2014018668A2",
        "US8684980B2",
        "US8733935B2",
        "US8815838B2",
        "WO2014159917A2",
        "US8967493B2",
        "US20150101596A1",
        "US9014779B2",
        "US9068566B2",
        "US9087145B2",
        "US9084566B2",
        "US9125979B2",
        "EP2947181A1",
        "WO2015177311A1",
        "US9272101B2",
        "DE202009019112U1",
        "US9452271B2",
        "US9522409B2",
        "US9545488B2",
        "US9572950B2",
        "US9572596B2",
        "US9642980B2",
        "US9700564B2",
        "WO2017127420A1",
        "EP3228345A1",
        "US20170319797A1",
        "WO2017191108A1",
        "US20170333644A1",
        "WO2018007245A1",
        "US9975136B2",
        "WO2018099968A1",
        "EP3075271B1",
        "US10154923B2",
        "US10307550B2",
        "WO2019110099A1",
        "US10471222B2",
        "US10569033B2",
        "WO2020040818A1",
        "WO2020041641A1",
        "US10639194B2",
        "WO2020120085A1",
        "WO2020123336A1",
        "US10842951B2",
        "US10857313B2",
        "WO2020245573A1",
        "WO2020245574A1",
        "US10888117B2",
        "US10905837B2",
        "WO2021023522A1",
        "WO2021023596A1",
        "EP3782604A1",
        "US11096990B2",
        "WO2021214440A1",
        "WO2021214439A1",
        "WO2021247542A2",
        "US11273271B2",
        "EP4059499A1",
        "US11458267B2",
        "US11497867B2",
        "WO2022240897A1",
        "US11517685B2",
        "US11529476B2",
        "WO2023028364A1",
        "US11642473B2",
        "US11666801B2",
        "US11690963B2",
        "US11712175B2",
        "US11738158B2",
        "US11771852B2",
        "US11793945B2"
    ],
    "citedby_ftf": []
}