{
    "patent_link": "https://patents.google.com/patent/US4760604A/en",
    "patent_id": "US4760604A",
    "title": "Parallel, multi-unit, adaptive, nonlinear pattern class separator and identifier",
    "abstract": "A system is disclosed for separating and identifying classes of patterns or events which are not necessarily linearly separable. The patterns are represented by an input signal S. The system comprises (1) a plurality of classification units, connected in parallel to receive the input signal S, and (2) a class selection device, responsive to the output signals produced by the classification units, for producing a single output response R representing the class of each respective pattern. In a preferred embodiment each classification unit includes a pattern feature encoding device, responsive to the input signal S, for producing an intermediate signal Fi representative of the features contained in the pattern, and a pattern classifier, responsive to the signal Fi, for producing an output signal Ri representative of the respective class of the pattern, as identified by the features encoded by the feature encoding device.",
    "inventors": [
        "Leon N. Cooper",
        "Charles Elbaum",
        "Douglas L. Reilly",
        "Christopher L. Scofield"
    ],
    "assignee": "Nestor Inc",
    "classifications": [
        "G06F18/24143",
        "G06F18/254"
    ],
    "claims": "\n1. A system for classification and identification of patterns, each pattern being represented by an input signal S, said system comprising:\n(a) a plurality of classification units U1, U2 . . . Ui . . . Uk, each unit Ui including:\n(1) pattern feature encoding means, responsive to said signal S, for producing an intermediate signal Fi (F1, F2 . . . Fi . . . Fk) representative of features contained in the pattern represented by said signal S, each intermediate signal Fi comprising a plurality of signal components (f1i, f2i, . . . fii . . . fMi); and\n(2) pattern classification means, responsive to said intermediate signal Fi, for producing an output signal Ri (R1, R2 . . . Ri . . . Rk), representative of a proposed respective class of said pattern represented by said signal S as identified by the features represented by said intermediate signal Fi ; and\n(b) class selection means, responsive to all of said output signals Ri produced by said classification units Ui, for producing a single output response R representing the class of said pattern.\n2. The system defined in claim 1, wherein each pattern feature encoding means encodes a different set of features in said pattern, whereby all of said intermediate signals Fi produced by said encoding means are unique and different from each other.\n3. The system defined in claim 1, wherein each pattern classification means classifies said pattern with respect to a different set of classes, whereby all of said output signals Ri produced by said classification means are unique and different from each other.\n4. The system defined in claim 1, wherein said class selection means includes means for selecting the output signal Ri which best represents an identifiable pattern class.\n5. The system defined in claim 1, wherein said pattern classification means is a Nestor adaptive module.\n6. The system defined in claim 5, wherein said Nestor adaptive module comprises:\n(1) a plurality M of input terminals each coupled to receive one scalar component fi (f1, f2 . . . fi . . . fM) of an intermediate signal F;\n(2) a plurality N of summing means, each summing means having M inputs and an output and being operative to produce a scalar component signal rj (r1, r2 . . . rj . . . rN) at its output representing the sum of the signal representations applied to its inputs;\n(3) a plurality N of threshold devices, each coupled to one of said summing means, for producing a scalar output response pi (p1, p2 . . . pi . . . pN) when the scalar component signal applied thereto exceeds a prescribed threshold level θi ; and\n(4) a plurality MXN of junction elements, each junction element coupling one of said input terminals with one of said summing means and providing a transfer of information from the respective input terminal to the respective summing means in dependence upon the signal appearing at the respective input terminal and upon the junction element transfer function,\nwhereby the respective scalar output responses p1, p2 . . . pN are components of the output response R of said module.\n7. The system defined in claim 6, wherein said Nestor adaptive module further comprises a plurality N of scalar multipliers, each coupled between one of said summing means and its associated threshold device, for producing a scalar component signal λri, where λ is a multiplier factor.\n8. The system defined in claim 7, further comprising means for modifying said multiplier factor λ of at least one of said scalar multipliers, when in a training mode, so as to avoid ambiguous class separation and identification.\n9. The system defined in claim 6, further comprising means for modifying the transfer function of at least one of said junction elements, when in a training mode, in dependence upon the incoming signal applied thereto and the output signal of the summing means with which said respective junction element is associated.\n10. The system defined in claim 6, further comprising means for modifying said threshold level θ, when in a training mode, so as to avoid ambiguous class separation and identification.\n11. The system defined in claim 1, wherein said class selection means is a Nestor adaptive module.\n12. The system defined in claim 11, wherein said Nestor adaptive module comprises:\n(1) a plurality M of input terminals each coupled to receive one scalar component fi (f1, f2 . . . fi . . . fM) of an intermediate signal Fi ;\n(2) a plurality N of summing means, each summing means having M inputs and an output and being operative to produce a first scalar component signal rj (r1, r2 . . . rj . . . rN) at its output representing the sum of the signal representations applied to its inputs;\n(3) a plurality N of threshold devices, each coupled to one of said summing means, for producing a scalar output response pi (p1, p2 . . . pi . . . pN) when the scalar component signal applied thereto exceeds a prescribed threshold level θi ; and\n(4) a plurality MXN of junction elements, each junction element coupling one of said input terminals with one of said summing means and providing a transfer of information from the respective input terminal to the respective summing means in dependence upon the signal appearing at the respective input terminal and upon the junction element transfer function,\nwhereby the respective scalar output responses p1, p2 . . . pN are components of the output response R of said module.\n13. The system defined in claim 12, wherein said Nestor adaptive module further comprises a plurality N of scalar multipliers, each coupled between one of said summing means and its associated threshold device, for producing a scalar component signal λri, where λ is a multiplier factor.\n14. The system defined in claim 13, further comprising means for modifying said multiplier factor λ of at least one of said scalar multipliers, when in a training mode, so as to avoid ambiguous class separation and identification.\n15. The system defined in claim 12, further comprising means for modifying the transfer function of at least one of said junction elements, when in a training mode, in dependence upon the incoming signal applied thereto and the output signal of the summing means with which said respective junction element is associated.\n16. The system defined in claim 12, further comprising means for modifying said threshold level θ, when in a training mode, so as to avoid ambiguous class separation and identification.\n17. The system defined in claim 1, wherein said pattern classification means includes memory means for storing a plurality of prototypes within a multi-dimensional pattern space, and means for comparing an input pattern, represented by said intermediate signal F, with each of said prototypes stored in said memory means, to determine whether said input pattern falls within a region of influence of at least one of said prototypes.\n18. The system defined in claim 17, wherein each prototype includes, as prototype information stored in said memory means, a vector location in said multi-dimensional pattern space; a scalar distance defining the size of a region of influence about said vector location in said pattern space; and a particular class with which said prototype is associated; and wherein said comparing means includes means for determining whether the location of said input pattern in said pattern space falls within the region of influence of one or more of said prototypes, and for producing a response indicative of the class associated with such prototype if said input pattern falls within the region of influence thereof.\n19. The system defined in claim 18, wherein each prototype is designated by one of at least two types, said designated type being stored in said memory means for its associated prototype as a part of said prototype information, wherein a first type of prototype produces a first output signal 1Ri indicative of the certain recognition of the class of an input pattern that falls within the region of influence thereof, and wherein a second type of prototype produces a second output signal 2Ri indicative of a possible, but not certain recognition of the class of an input pattern that falls within the region of influence thereof.\n20. The system defined in claim 19, wherein said class selection means includes means for selecting, as said output response R, one of a plurality of output signals produced by said pattern classification means.\n21. The system defined in claim 20, wherein each pattern classification means is assigned a prescribed priority indicative of a hierarchy level, and wherein said selecting means selects, as said output response R, the first output signal 1Ri produced by said classification means which has the highest priority, said first output signal being indicative of certain recognition of a particular class by said classification means.\n22. The system defined in claim 21, wherein said selecting means includes means for (1) counting the numbers of each class indicated by the second output signal 2Ri, produced by each successive classification means in order of priority, until one class has a majority count, whenever no classification means produces a first output signal 1Ri, and (2) producing said output response R indicative of said majority class.\n23. The system defined in claim 18, wherein said pattern classification means further includes means for modifying said prototype information in said memory means, when in the training mode, in response to the receipt of an input pattern.\n24. The system defined in claim 23, wherein said means for modifying said prototype information reduces said scalar distance of a prototype if an input pattern falls within the region of influence of such prototype, thereby producing a response Ri indicative of the class associated with such prototype, when the class is incorrect, said scalar distance being reduced sufficiently so that said input pattern falls outside of said region of influence of such prototype.\n25. The system defined in claim 24, wherein said scalar distance is reduced to a value substantially equal to, but less than the distance between the vector locations in said pattern space of such prototype and said input pattern.\n26. The system defined in claim 24, wherein each prototype is designated by one of at least two types, said designated type being stored in said memory means for its associated prototype as a part of said prototype information, wherein a first type of prototype produces a first output signal 1Ri indicative of the certain recognition of the class of an input pattern that falls within the region of influence thereof, and wherein a second type of prototype produces a second output signal 2Ri indicative of a possible, but not certain recognition of the class of an input pattern that falls within the region of influence thereof; and wherein said means for modifying said prototype information changes the designated type of a prototype from a first type to a second type when said scalar distance of such prototype is reduced below a prescribed threshold value.\n27. The system defined in claim 26, wherein said means for modifying said prototype information expands said scalar distance of a given prototype out to the nearest region of influence of a prototype of said first type, whenever the designated type of such given prototype has been changed from a first type to a second type.\n28. The system defined in claim 24, wherein said means for modifying said prototype information includes means for storing a new prototype in said memory means when an input pattern fails to fall within the region of influence of any previously stored prototype.\n29. The system defined in claim 1, wherein said class selection means includes means for selecting, as said output response R, one of a plurality of output signals produced by said pattern classification means.\n30. The system defined in claim 29, wherein each pattern classification means is assigned a prescribed priority indicative of a hierarchy level, and wherein said selecting means selects, as said output response R, the output signal produced by said classification means which has the highest priority.\n31. The system defined in claim 1, wherein each output signal Ri comprises a plurality of signal components (r1i, r2i . . . rii . . . rNi).\n32. The system defined in claim 1, wherein said output response R comprises a plurality of signal components (p1, p2, . . . pN).",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3601811A",
        "US3950733A",
        "US4030068A",
        "US4044243A",
        "US4177448A",
        "US4180800A",
        "US4254474A",
        "US4307376A",
        "US4319331A",
        "US4326259A",
        "US4451929A",
        "US4611347A"
    ],
    "citations_ftf": [
        "JPS5160122A"
    ],
    "citedby_own": [
        "US4933871A",
        "US4958375A",
        "US4975961A",
        "US5040230A",
        "US5041976A",
        "US5048100A",
        "US5060278A",
        "US5060277A",
        "US5063521A",
        "US5065431A",
        "US5067164A",
        "US5077807A",
        "US5095443A",
        "US5119438A",
        "US5133021A",
        "US5138695A",
        "US5151951A",
        "US5155801A",
        "US5163133A",
        "US5168352A",
        "US5175793A",
        "US5185816A",
        "US5239594A",
        "US5247584A",
        "US5263107A",
        "US5274714A",
        "US5276772A",
        "US5276771A",
        "US5285522A",
        "US5299284A",
        "US5321795A",
        "US5337371A",
        "US5355438A",
        "US5355437A",
        "US5357597A",
        "US5359673A",
        "US5359700A",
        "US5361328A",
        "US5371809A",
        "US5396565A",
        "US5434951A",
        "US5442716A",
        "US5479574A",
        "US5479575A",
        "US5519786A",
        "US5559899A",
        "US5563982A",
        "US5592589A",
        "US5613039A",
        "US5638281A",
        "US5680476A",
        "US5822741A",
        "US5875264A",
        "US5909681A",
        "US5918196A",
        "US5966464A",
        "US6052679A",
        "US6092059A",
        "US6097834A",
        "US6167390A",
        "US6175652B1",
        "US6175644B1",
        "US20010029477A1",
        "US20010054022A1",
        "US6366897B1",
        "US20020052776A1",
        "US6400996B1",
        "US6418424B1",
        "US20020147669A1",
        "US6598030B1",
        "US6606402B2",
        "US6671403B1",
        "US20040024671A1",
        "US20040032981A1",
        "US20040042651A1",
        "US20040148241A1",
        "US20040236647A1",
        "US6865547B1",
        "US20050094861A1",
        "US20050182713A1",
        "US6999943B1",
        "US7096192B1",
        "US20060222221A1",
        "US20060222204A1",
        "US7212996B1",
        "US7242988B1",
        "US20070280536A1",
        "US20080140576A1",
        "US7467109B1",
        "US20090003706A1",
        "US7480631B1",
        "US7509279B2",
        "US7542921B1",
        "US7624068B1",
        "US7668777B2",
        "US7685064B1",
        "US7707192B1",
        "US7756896B1",
        "US20100199279A1",
        "US7831467B1",
        "US7831509B2",
        "US7865427B2",
        "US7890343B1",
        "US7895098B2",
        "US7925578B1",
        "US7953663B1",
        "US7962396B1",
        "US7974895B1",
        "US7974714B2",
        "US8046313B2",
        "CN101593270B",
        "US8175908B1",
        "US8369967B2",
        "US8429006B1",
        "US8478637B1",
        "US8489497B1",
        "US8533030B1",
        "US8751391B2",
        "US8892495B2",
        "US10361802B1"
    ],
    "citedby_ftf": [
        "JP2553608B2",
        "US6128409A",
        "RU2037203C1",
        "EP0694854B1",
        "JPH10306744A",
        "GB2492248B",
        "US8287055B2",
        "US11494644B2"
    ]
}