{
    "patent_link": "https://patents.google.com/patent/US20030158705A1/en",
    "patent_id": "US20030158705A1",
    "title": "Method for avoiding irregular shutoff of production equipment and system for avoiding irregular shutoff",
    "abstract": "A method for avoiding irregular shutoff of production equipment, includes: measuring regularly time-series data of characteristics of a rotary machine used in the production equipment running for the production; obtaining first failure diagnosis data subjecting the time-series data to a first real-time analysis; obtaining second failure diagnosis data subjecting the first failure diagnosis data to a second real-time analysis; predicting a status of the production equipment several minutes later using the second failure diagnosis data; and shutting off during a production process if the result of the prediction determines that the production equipment will shut off irregularly, and switching to a purge sequence for conducting a gas purge of the production equipment.",
    "inventors": [
        "Ken Ishii",
        "Takashi Nakao",
        "Yukihiro Ushiku",
        "Shuichi Samata"
    ],
    "assignee": "Kioxia Corp",
    "classifications": [
        "H01L21/02",
        "G05B9/02",
        "F04D19/04",
        "F04D27/001",
        "G05B23/024",
        "G05B23/0291"
    ],
    "claims": "\n1. A method for avoiding irregular shutoff of a production equipment, comprising:\nmeasuring regularly time-series data of characteristics of a rotary machine used in the production equipment during a production process;\nobtaining first failure diagnosis data subjecting the time-series data to a first real-time analysis;\nobtaining second failure diagnosis data subjecting the first failure diagnosis data to a second real-time analysis;\npredicting a status of the production equipment using the second failure diagnosis data; and\nshutting off the production process if the result of the prediction determines that the production equipment will shut off irregularly, and switching to a purge sequence for conducting a gas purge of the production equipment.\n2. The method of claim 1, wherein the rotary machine is a vacuum pump.\n3. The method of claim 1, wherein the production equipment is a semiconductor production equipment.\n4. The method of claim 2, wherein the characteristics include vibration, temperature, motor current, and exhaust pressure of the vacuum pump.\n5. The method of claim 3, wherein the semiconductor production equipment is an LPCVD equipment.\n6. The method of claim 3, wherein an integrated amount and inflow time of inflow gas for each gas species are added to analysis parameters in the first real-time analysis.\n7. The method of claim 3, wherein accumulated film thickness information of a thin film to be deposited by the production equipment is added to analysis parameters in the first real-time analysis.\n8. The method of claim 3, wherein consumed amount of each gas species under each respective condition in the production process is added to analysis parameters in the first real-time analysis.\n9. The method of claim 3, wherein a structural parameter of the production equipment and information on the status of a sample to be processed are added to analysis parameters in the first real-time analysis.\n10. The method of claim 3, wherein differences among the production equipment are added to analysis parameters in the first real-time analysis.\n11. A system for avoiding irregular shutoff of a production equipment, comprising:\na production chamber performing a production process of the production equipment;\na rotary machine processing a load of the production process;\nsensors measuring time-series data of characteristics of the rotary machine and outputting the time-series data in real time;\na real-time failure diagnosis module configured to perform a first real-time analysis on the time-series data so as to obtain first failure diagnosis data, to perform a second real-time analysis on the first failure diagnosis data so as to obtain second failure diagnosis data, and to predict future status of production equipment based upon the second failure diagnosis data; and\na real-time controller configured to perform and control the production process, and to direct the production equipment to introduce a purge gas if the real-time failure diagnosis module determines that during the production process the production equipment may have an irregular shutoff.\n12. The system of claim 11, wherein the production equipment includes a gas supply control system configured to introduce gas to the production chamber, and a vacuum pump configured to evacuate the gas.\n13. The system of claim 11, wherein the production equipment is semiconductor production equipment.\n14. The system of claim 12, wherein the characteristics include the vibration, temperature, motor current, and exhaust pressure of the vacuum pump.\n15. The system of claim 13, wherein the semiconductor production equipment is an LPCVD equipment.\n16. The system of claim 11, wherein the real-time failure diagnosis module adds an integrated amount and inflow time of an inflow gas for each gas species to analysis parameters for the first real-time analysis.\n17. The system of claim 11, wherein the real-time failure diagnosis module adds the accumulated film thickness information of the thin film deposited by the production equipment to analysis parameters for the first real-time analysis.\n18. The system of claim 11, wherein the real-time failure diagnosis module adds the consumed amount of each gas species used under each condition of the production process to analysis parameters for the first real-time analysis.\n19. The system of claim 11, wherein the real-time failure diagnosis module adds a structural parameter of the production equipment and information on the status of a sample to be processed to analysis parameters for the first real-time analysis.\n20. The system of claim 11, wherein the real-time failure diagnosis module adds differences among the production equipment to analysis parameters for the first real-time analysis.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5979225A",
        "US6185472B1"
    ],
    "citations_ftf": [
        "GB2229536B",
        "US5210704A",
        "US5815396A",
        "US5501105A",
        "US5406502A",
        "US5586066A",
        "US5610339A",
        "US5633811A",
        "US5710723A",
        "GB9616457D0",
        "US6297742B1",
        "EP1010114A1",
        "ATE315815T1",
        "US6260004B1",
        "US6199018B1",
        "US6434512B1",
        "JP3349455B2",
        "JP2000283056A",
        "US6321602B1",
        "US6392584B1",
        "JP4138267B2",
        "JP4184638B2",
        "JP4592235B2",
        "US7063981B2"
    ],
    "citedby_own": [
        "US20030154052A1",
        "US6748341B2",
        "US20040199307A1",
        "US20050102119A1",
        "US20050107984A1",
        "FR2887938A1",
        "US20080109185A1",
        "US20080294382A1",
        "US20090035151A1",
        "CN102418691A",
        "US20170067153A1",
        "US11236743B2",
        "CN114419837A",
        "CN115600130A"
    ],
    "citedby_ftf": [
        "US7051197B2",
        "US20050106982A1",
        "JP4237610B2",
        "GB0412623D0",
        "JP4721234B2",
        "JP4620524B2",
        "JP2007165721A",
        "WO2007091555A1",
        "US8180594B2",
        "GB0809976D0",
        "JP2011007053A",
        "US9625168B2",
        "JP5504107B2",
        "JP2012114157A",
        "DE102011050018A1",
        "CN102605351B",
        "CN102734147B",
        "CN105204486B",
        "CN104078395A",
        "US10810068B2",
        "EP3271798A4",
        "CN105221403A",
        "JP6685204B2",
        "US11348813B2",
        "CN110925068B",
        "US11269003B2",
        "CN114576152A",
        "CN113204212A"
    ]
}