{
    "patent_id": "US-11423320-B2",
    "title": "Method of and system for efficient fact checking utilizing a scoring and classification system ",
    "assignee": "Bin 2022, Series 822 Of Allied Security Trust I",
    "publication_date": "2022-08-23",
    "patent_link": "https://patents.google.com/patent/US11423320B2/en",
    "inventors": [
        "Lucas J. Myslinski"
    ],
    "classifications": [
        "G06F16/9535",
        "G06N5/047",
        "G06F16/2365",
        "G06F16/243",
        "G06F16/2457",
        "G06F16/2468",
        "G06F16/248",
        "G06F16/3344",
        "G06F16/35",
        "G06F16/951",
        "G06F16/9538",
        "G06F3/0412",
        "G06F40/205",
        "G06F40/226",
        "G06F40/289",
        "G06N20/00",
        "G06N5/048",
        "G06N7/005",
        "G06N7/01"
    ],
    "abstract": "An efficient fact checking system analyzes and determines the factual accuracy of information and/or characterizes the information by comparing the information with source information. The efficient fact checking system automatically monitors information, processes the information, fact checks the information efficiently and/or provides a status of the information.",
    "claims": "\n1. A method comprising:\na. monitoring target information with a device;\nb. fact checking the target information by comparing the target information with source information to generate a result; and\nc. presenting a status of the target information in real-time based on the result of the comparison of the target information with the source information, wherein the comparison of the target information with the source information includes utilizing a scoring system based on classifying the target information or the source information, wherein comparing includes at least one of:\ni. searching for an exact match of the target information in the source information and returning the result of the exact match search if the exact match is found;\nii. utilizing pattern matching for fact checking and returning the result of the pattern matching fact check if a pattern matching result confidence score is above a pattern matching result confidence threshold; and\niii. utilizing a natural language search for fact checking and returning the result of the natural language fact check if a natural language result confidence score is above a natural language result confidence threshold; and,\nwherein searching for the exact match begins searching the source information located on a fastest access time hardware device and continues to slower access time hardware devices;\nwherein utilizing pattern matching begins utilizing the source information located on the fastest access time hardware device and continues to the slower access time hardware devices; and\nwherein the natural language search begins searching the source information located on the fastest access time hardware device and continues to the slower access time hardware devices,\nwherein searching for the exact match begins searching the source information classified by a plurality of keywords found in the target information, then using the source information classified by a single keyword found in the target information, and then using the source information classified by keywords related to the keywords found in the target information;\nwherein utilizing pattern matching begins utilizing the source information classified by the plurality of keywords found in the target information, then using the source information classified by the single keyword found in the target information, and then using the source information classified by the keywords related to the keywords found in the target information; and\nwherein the natural language search begins searching the source information classified by the plurality of keywords found in the target information, then using the source information classified by the single keyword found in the target information, and then using the source information classified by the keywords related to the keywords found in the target information.\n2. The method of claim 1 wherein most popular, most recent and most common information is stored in the fastest access time hardware device, and less popular, less recent and less common information is stored in the slower access hardware devices.\n3. The method of claim 1 wherein searching for the exact match begins searching the source information located in a designated fact checking database and then goes to a broader set of source information;\nwherein utilizing pattern matching begins utilizing the source information located in the designated fact checking database, then goes to the broader set of source information; and\nwherein the natural language search begins searching the source information located in the designated fact checking database, then goes to the broader set of source information.\n4. The method of claim 1 further comprising parsing the target information into segments and prioritizing the segments, so that a highest priority segment is fact checked first, wherein priority is based on the relatedness of the segment to a current topic being discussed and when the segment was presented, wherein if the segment is not fact checked before a timeout threshold, then the segment is removed from a fact check queue.\n5. The method of claim 1 wherein a plurality of fact check queues are implemented, wherein a first fact check queue contains the segments to be fact checked in real-time, and the second fact check queue contains the segments to be fact checked in non-real-time.\n6. The method of claim 1 further comprising parsing the target information into segments and prioritizing the segments, so that a highest priority segment is fact checked first, wherein priority is based on a presenter of the target information.\n7. The method of claim 1 further comprising parsing the target information into phrases, parsing the phrases into words, counting the number of words in each phrase, and comparing each phrase with source information containing the same number of words as the number of words in the phrase being compared.\n8. The method of claim 7 wherein the source information includes only source information in a classification matching a keyword detected in the target information.\n9. The method of claim 1 wherein searching for the exact match begins searching the source information controlled by a media company, then using crowdsourced data as the source information, and then using world wide web data for fact checking;\nwherein utilizing pattern matching begins utilizing the source information controlled by the media company, then using the crowdsourced data as the source information, and then using the world wide web data for fact checking; and\nwherein the natural language search begins searching the source information controlled by the media company, then using the crowdsourced data as the source information, and then using the world wide web data for fact checking.\n10. The method of claim 1 further comprising analyzing a validity rating of an entity providing the target information, wherein if the validity rating of the entity is below a threshold, then source information is limited to sources with a rating above a reliability threshold.\n11. The method of claim 1 wherein the target information comprises an image or a video.\n12. The method of claim 1 wherein the target information comprises social media content.\n13. The method of claim 1 wherein presenting the status of the target information includes indicating a bias.\n14. The method of claim 1 wherein fact checking the target information comprises utilizing crowdsourced information.\n15. The method of claim 1 wherein fact checking the target information comprises utilizing manual analysis.\n16. The method of claim 1 wherein the status of the target information comprises a validity rating of a provider of the target information.",
    "status": "Active",
    "citations_own": [
        "US5960411A",
        "US6161090A",
        "US6256734B1",
        "US6266664B1",
        "WO2001077907A2",
        "WO2001077906A2",
        "US20020083468A1",
        "US20020099730A1",
        "WO2003014949A1",
        "US20030088689A1",
        "US20030158872A1",
        "US20030210249A1",
        "WO2004034755A2",
        "US20040103032A1",
        "US20040122846A1",
        "US20040139077A1",
        "US6782510B1",
        "US20040210824A1",
        "US20050022252A1",
        "US20050060312A1",
        "US20050120391A1",
        "US20050132420A1",
        "US20060015904A1",
        "WO2006036853A2",
        "US20060148446A1",
        "US20060206912A1",
        "US20060248076A1",
        "US20060253580A1",
        "US20070011710A1",
        "GB2428529A",
        "US20070043766A1",
        "US20070100730A1",
        "US20070136782A1",
        "US20070136781A1",
        "US7249058B2",
        "US7249380B2",
        "US7266116B2",
        "WO2007115224A2",
        "US20070288978A1",
        "US7337462B2",
        "US20080077570A1",
        "US20080109285A1",
        "US20080109780A1",
        "US20080183726A1",
        "US20080319744A1",
        "WO2009006542A2",
        "US7478078B2",
        "US7487334B2",
        "US20090063294A1",
        "US20090125382A1",
        "WO2009089116A2",
        "US20090210448A1",
        "US20090210395A1",
        "US20090265304A1",
        "US20090311659A1",
        "US7644088B2",
        "US20100023525A1",
        "US7657424B2",
        "US20100049590A1",
        "US20100121638A1",
        "US20100121973A1",
        "US20100185637A1",
        "US7765574B1",
        "WO2010093510A1",
        "WO2010105245A2",
        "US20100235313A1",
        "US7809721B2",
        "US20100306166A1",
        "US20100332583A1",
        "US20110066587A1",
        "US20110067065A1",
        "US20110087639A1",
        "US20110093258A1",
        "US20110106615A1",
        "US20110136542A1",
        "US20110166860A1",
        "WO2011088264A1",
        "US20110313757A1",
        "US20120005221A1",
        "US20120102405A1",
        "US8185448B1",
        "US20120131015A1",
        "US20120191757A1",
        "US20120198319A1",
        "US8290924B2",
        "US8290960B2",
        "US20120317046A1",
        "US20130091436A1",
        "US20130099925A1",
        "US20130110748A1",
        "US20130151240A1",
        "US20130158984A1",
        "US20130159127A1",
        "US20130198196A1",
        "US20140074751A1",
        "US20140075557A1",
        "WO2015044179A1",
        "US20150379197A1",
        "US9300755B2",
        "US9361382B2",
        "US9880234B2"
    ],
    "citations_ftf": [
        "US6950866B1",
        "US9460346B2",
        "US7769579B2",
        "JP2006252382A",
        "US20060294095A1",
        "KR100755678B1",
        "US8122026B1",
        "US20080104506A1",
        "CN101398835B",
        "US8620872B1",
        "US20110213655A1",
        "US20100257438A1",
        "US20110276507A1",
        "US9110882B2",
        "US20120158759A1",
        "US8381120B2",
        "US20120272143A1",
        "WO2013123518A1",
        "US9104785B2",
        "CN103514181B",
        "US20130346160A1",
        "MX348203B",
        "CN103684981B",
        "WO2014051315A1",
        "US10838926B2",
        "US10387416B2",
        "JP2015153108A"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US8990234B1",
        "US9595048B2",
        "US10867003B2",
        "US10187346B2",
        "US10303768B2",
        "US9973464B2",
        "CN105354017B",
        "US10586161B2",
        "US10248738B2",
        "US10013450B2",
        "US10013404B2",
        "US10714079B2",
        "CN105930359A",
        "US10776587B2",
        "US10826866B2",
        "US10587565B2",
        "US11087087B1",
        "IT201700031414U1",
        "US10181333B2",
        "US11120339B2",
        "WO2018209254A1",
        "US10417484B2",
        "US10467813B2",
        "US11113275B2",
        "US10387576B2",
        "US11431748B2",
        "US11132648B2",
        "CN108804501B",
        "US11200581B2",
        "US20200004882A1",
        "US10825450B2",
        "US11200336B2",
        "CN110072007A",
        "CN110602285B",
        "US20210089956A1",
        "US11775494B2",
        "US20230104661A1"
    ]
}