{
    "patent_link": "https://patents.google.com/patent/US4499568A/en",
    "patent_id": "US4499568A",
    "title": "Process for the teledistribution of recorded information and a system for performing this process",
    "abstract": "A process and system for vending recorded information, wherein a recording of information is carried out at a faster speed than normal. Calls from subscribers are received and a message is formed consisting of a preamble constituted by an addressing code to the requesting subscriber, a message body constituted by the information corresponding to requested information and an end of message. Said message is transmitted to the requesting subscriber by means of a picture transmission channel. In an equipment housed with the requesting subscriber the addressing code is recognized and the transmitted message body is received. The read message is then decelerated in order to give it its normal speed again and restoring the corresponding information on the basis of the decelerated message.",
    "inventors": [
        "Jacques Gremillet"
    ],
    "assignee": "Individual",
    "classifications": [
        "H04N7/17318",
        "H04H20/38",
        "H04H20/40",
        "H04H60/17",
        "H04H60/94",
        "H04H2201/70",
        "H04N2007/1739"
    ],
    "claims": "\n1. A process for the remote distribution of recorded information corresponding to sound, said recorded information having a normal speed, wherein it comprises the steps of:\nforming an information recording bank, recording being carried out at a speed at least 100 times faster than said normal speed, receiving and identifying calls from subscribers requesting a particular work, forming a message consisting of a preamble constituted by an addressing code to the requesting subscriber, a message body constituted by the information corresponding to requested information and an end of message, transmitting to the requesting subscriber the said message by means of a picture transmission channel having an information flow rate of at least 50 Mbits/s,\nrecognizing, in equipment housed with the requesting subscriber, the addressing code of said equipment and, in the case of the reception of this code, recording the transmitted message body, after reception of the end of message, reading the recorded message and decelerating the read message in order to give it its normal speed again and restoring the corresponding information on the basis of the decelerated message.\n2. A process according to claim 1, wherein the transmission of the message takes place in analog manner.\n3. A process according to claim 1, wherein the transmission of the message takes place in digital manner.\n4. A process according to claims 1, 2 or 3, wherein the information consists of musical works.\n5. A system for the teledistribution of recorded information, comprising:\na distribution centre comprising an information recording bank, having information corresponding to sound, said recorded information being recorded at a speed at least 100 times faster than normal,\nmeans for forming a message comprising a preamble constituted by an addressing code to the requesting subscriber, a message body corresponding to the selected information and an end of message;\neach subscriber equipment comprises an indicating circuit able to recognize the arrival of its own addressing code and an end of message, a video recorder controlled by the indicating circuit, a connected to said video recorder and able to restore the normal speed to the information and a sound restoration chain connected to said rate converter, a picture transmission channel having an information flow rate of at least 50 Mbits/s able to transmit information from the distribution centre to each subscriber equipment; and\na means for connecting subscribers to the distribution centre via a telephone network.\n6. A system according to claim 5, wherein the transmission channel is a colour television broadcasting network.\n7. A system according to claim 5, wherein the transmission channel is a cabled network.\n8. A system according to claim 5, wherein the rate converter comprises a memory subdivided into two stacks alternately operating on a reading basis is one case and on a writing basis in the other and two clocks each controlling the two stacks, one in writing with a first frequency and the other in reading with a second frequency which is lower than the first, an input switching means having an input connected to the video recorder and two outputs connected to the two memory stacks, an output switching means with two inputs connected to the two memory stacks and one output.\n9. A system according to claim 5, wherein the recordings are of musical works.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US2595510A",
        "US3199226A",
        "US3718906A",
        "US3729581A",
        "FR2172142A1",
        "FR2410863A1",
        "GB2038147A"
    ],
    "citations_ftf": [
        "JPS5211532A",
        "US4030366A",
        "JPS5630378A"
    ],
    "citedby_own": [
        "US4734764A",
        "US4761684A",
        "US4852154A",
        "US5089885A",
        "US5327554A",
        "US5404567A",
        "US5418559A",
        "US5442389A",
        "EP0675655A2",
        "US5539449A",
        "WO1996033562A1",
        "US5570296A",
        "US5570126A",
        "US5572442A",
        "US5654747A",
        "US5691964A",
        "WO1998026416A1",
        "US5790423A",
        "US5818911A",
        "US5872712A",
        "US5926624A",
        "US6133940A",
        "US6163644A",
        "US6301513B1",
        "US6397275B1",
        "US20020147979A1",
        "US20030031249A1",
        "US20030123858A1",
        "US20050099984A1",
        "US20060074985A1",
        "US20060271646A1",
        "US20090063034A1",
        "US20090083513A1",
        "US20090210915A1",
        "US20100106847A1",
        "US20100293072A1",
        "US20110016504A1",
        "US8175977B2",
        "US8433759B2"
    ],
    "citedby_ftf": [
        "US4528643A",
        "JPH0574078B2",
        "JPS6035867A",
        "CA1227865A",
        "GB8401318D0",
        "GB8518350D0",
        "US4763191A",
        "FR2611942B1",
        "JP2689130B2",
        "US4890320A",
        "US4995078A",
        "DE3851538T2",
        "US5057932A",
        "JPH02233053A",
        "JPH03262372A",
        "JP2853375B2",
        "FR2692740B1",
        "DE4244198A1",
        "DE4337726B4",
        "US5563714A",
        "CA2201909C",
        "US7188352B2",
        "US7424731B1",
        "US6516466B1",
        "FR2753868A1",
        "FR2769165B1",
        "FR2781591B1",
        "FR2781580B1",
        "US8028318B2",
        "US8726330B2",
        "FR2796482B1",
        "FR2805377B1",
        "FR2805072B1",
        "FR2805060B1",
        "FR2808906B1",
        "FR2811175B1",
        "FR2811114B1",
        "FR2814085B1",
        "US8332895B2",
        "US8584175B2",
        "US7822687B2",
        "US9646339B2",
        "US10373420B2",
        "US9330529B2",
        "US9171419B2",
        "US9953481B2",
        "US8332887B2",
        "US10290006B2",
        "WO2010005569A1",
        "US9292166B2",
        "US10564804B2",
        "US10719149B2",
        "CN102449658A",
        "CN105374380A",
        "CA2970057C",
        "US11151224B2",
        "US9921717B2",
        "CN106489125B"
    ]
}