{
    "patent_link": "https://patents.google.com/patent/US20050022106A1/en",
    "patent_id": "US20050022106A1",
    "title": "System and method for performing efficient document scoring and clustering",
    "abstract": "A system and method for providing efficient document scoring of concepts within a document set is described. A frequency of occurrence of at least one concept within a document retrieved from the document set is determined. A concept weight is analyzed reflecting a specificity of meaning for the at least one concept within the document. A structural weight is analyzed reflecting a degree of significance based on structural location within the document for the at least one concept. A corpus weight is analyzed inversely weighing a reference count of occurrences for the at least one concept within the document. A score associated with the at least one concept is evaluated as a function of the frequency, concept weight, structural weight, and corpus weight.",
    "inventors": [
        "Kenji Kawai",
        "Lynne Evans"
    ],
    "assignee": "Nuix North America Inc",
    "classifications": [
        "G06F16/35",
        "G06F16/353",
        "G06F16/355",
        "G06F16/36",
        "Y10S707/99934",
        "Y10S707/99937"
    ],
    "claims": "\n1. A system for grouping clusters of semantically scored documents, comprising:\na scoring module determining a score assigned to at least one concept extracted from a plurality of documents based on at least one of a frequency of occurrence of the at least one concept within at least one such document, a concept weight, a structural weight, and a corpus weight; and\na clustering module forming clusters of the documents by applying the score for the at least one concept to a best fit criterion for each such document.\n2. A system according to claim 1, further comprising:\nthe scoring module calculating the score as a function of a summation of at least one of the frequency of occurrence, the concept weight, the structural weight, and the corpus weight of the at least one concept.\n3. A system according to claim 2, further comprising:\na compression module compressing the score through logarithmic compression.\n4. A system according to claim 1, further comprising:\nthe scoring module calculating the concept weight as a function of a number of terms comprising the at least one concept.\n5. A system according to claim 1, further comprising:\nthe scoring module calculating the structural weight as a function of a location of the at least one concept within the at least one such document.\n6. A system according to claim 1, further comprising:\nthe scoring module calculating the corpus weight as a function of a reference count of the at least one concept over the plurality of documents.\n7. A system according to claim 1, further comprising:\nthe scoring module forming the score assigned to the at least one concept to a normalized score vector for each such document, determining a similarity between the normalized score vector for each such document as an inner product of each normalized score vector, and applying the similarity to the best fit criterion.\n8. A system according to claim 1, further comprising:\nthe clustering module evaluating a set of candidate seed documents selected from the plurality of documents, identifying a set of seed documents by applying the score for the at least one concept to a best fit criterion for each such candidate seed document, and basing the best fit criterion on the score of each such seed document.\n9. A method for grouping clusters of semantically scored documents, comprising:\ndetermining a score assigned to at least one concept extracted from a plurality of documents based on at least one of a frequency of occurrence of the at least one concept within at least one such document, a concept weight, a structural weight, and a corpus weight; and\nforming clusters of the documents by applying the score for the at least one concept to a best fit criterion for each such document.\n10. A method according to claim 9, further comprising:\ncalculating the score as a function of a summation of at least one of the frequency of occurrence, the concept weight, the structural weight, and the corpus weight of the at least one concept.\n11. A method according to claim 10, further comprising:\ncompressing the score through logarithmic compression.\n12. A method according to claim 9, further comprising:\ncalculating the concept weight as a function of a number of terms comprising the at least one concept.\n13. A method according to claim 9, further comprising:\ncalculating the structural weight as a function of a location of the at least one concept within the at least one such document.\n14. A method according to claim 9, further comprising:\ncalculating the corpus weight as a function of a reference count of the at least one concept over the plurality of documents.\n15. A method according to claim 9, further comprising:\nforming the score assigned to the at least one concept to a normalized score vector for each such document;\ndetermining a similarity between the normalized score vector for each such document as an inner product of each normalized score vector; and\napplying the similarity to the best fit criterion.\n16. A method according to claim 9, further comprising:\nevaluating a set of candidate seed documents selected from the plurality of documents;\nidentifying a set of seed documents by applying the score for the at least one concept to a best fit criterion for each such candidate seed document; and\nbasing the best fit criterion on the score of each such seed document.\n17. A computer-readable storage medium holding code for performing the method of claim 9.\n18. A system for providing efficient document scoring of concepts within a document set, comprising:\na frequency module determining a frequency of occurrence of at least one concept within a document retrieved from the document set; and\na concept weight module analyzing a concept weight reflecting a specificity of meaning for the at least one concept within the document;\na structural weight module analyzing a structural weight reflecting a degree of significance based on structural location within the document for the at least one concept;\na corpus weight module analyzing a corpus weight inversely weighing a reference count of occurrences for the at least one concept within the document; and\na scoring module evaluating a score associated with the at least one concept as a function of the frequency, concept weight, structural weight, and corpus weight.\n19. A system according to claim 18, further comprising:\nthe scoring module evaluating the score substantially in accordance with the formula:\nS\ni\n=\n∑\n1\n->\nn\nj\n⁢\nf\nij\n×\ncw\nij\n×\nsw\nij\n×\nrw\nij\nwhere Si comprises the score, fij comprises the frequency, 0<cwij≦1 comprises the concept weight, 0<swij≦1 comprises the structural weight, and 0<rwij≦1 comprises the corpus weight for occurrence j of concept i.\n20. A system according to claim 19, further comprising:\nthe concept weight module evaluating the concept weight substantially in accordance with the formula:\ncw\nij\n=\n{\n0.25\n+\n(\n0.25\n×\nt\nij\n)\n,\n1\n≤\nt\nij\n≤\n3\n0.25\n+\n(\n0.25\n×\n[\n7\n-\nt\nij\n]\n)\n,\n4\n≤\nt\nij\n≤\n6\n0.25\n,\nt\nij\n≥\n7\nwhere cwij comprises the concept weight and tij comprises a number of terms for occurrence j of each such concept i.\n21. A system according to claim 19, further comprising:\nthe structural weight module evaluating the structural weight substantially in accordance with the formula:\nsw\nij\n=\n{\n1.0\n,\nif\n⁢\n⁢\n(\nj\n≈\nSUBJECT\n)\n0.8\n,\nif\n⁢\n⁢\n(\nj\n≈\nHEADING\n)\n0.7\n,\nif\n⁢\n⁢\n(\nj\n≈\nSUMMARY\n)\n0.5\nif\n⁢\n⁢\n(\nj\n≈\nBODY\n)\n0.1\nif\n⁢\n⁢\n(\nj\n≈\nSIGNATURE\n)\nwhere swij comprises the structural weight for occurrence j of each such concept i.\n22. A system according to claim 19, further comprising:\nthe corpus weight module evaluating the corpus weight substantially in accordance with the formula:\nrw\nij\n=\n{\n(\nT\n-\nr\nij\nT\n)\n2\n,\nr\nij\n>\nM\n1.0\n,\nr\nij\n≤\nM\nwhere rwij comprises the corpus weight, rij comprises a reference count for occurrence j of each such concept i, T comprises a total number of reference counts of documents in the document set, and M comprises a maximum reference count of documents in the document set.\n23. A system according to claim 19, further comprising:\na compression module compressing the score substantially in accordance with the formula:\n\nS′ i=log(S i+1)\nwhere S′i comprises the compressed score for each such concept i.\n24. A system according to claim 18, further comprising:\na global stop concept vector cache maintaining concepts and terms; and\na filtering module filtering selection of the at least one concept based on the concepts and terms maintained in the global stop concept vector cache.\n25. A system according to claim 18, further comprising:\na parsing module identifying terms within at least one document in the document set, and combining the identified terms into one or more of the concepts.\n26. A system according to claim 25, further comprising:\nthe parsing module structuring each such identified term in the one or more concepts into canonical concepts comprising at least one of word root, character case, and word ordering.\n27. A system according to claim 25, wherein at least one of nouns, proper nouns and adjectives are included as terms.\n28. A system according to claim 18, further comprising:\na plurality of candidate seed documents;\na similarity module determining a similarity between each pair of a candidate seed document and a cluster center;\na clustering module designating each such candidate seed document separated from substantially all cluster centers with such similarity being sufficiently distinct as a seed document, and grouping each such candidate seed document not being sufficiently distinct into a cluster with a nearest cluster center.\n29. A system according to claim 28, further comprising:\na plurality of non-seed documents;\nthe similarity module determining the similarity between each non-seed document and each cluster center; and\nthe clustering module grouping each such non-seed document into a cluster having a best fit, subject to a minimum fit criterion.\n30. A system according to claim 29, further comprising:\na normalized score vector for each document comprising the score associated with the at least one concept for each such concept occurring within the document; and\nthe similarity module determining the similarity as a function of the normalized score vector associated with the at least one concept for each such document.\n31. A system according to claim 30, further comprising:\nthe similarity module calculating the similarity substantially in accordance with the formula:\ncos\n⁢\n⁢\nσ\nAB\n=\n〈\nS\n->\nA\n·\nS\n->\nB\n〉\n\nS\n->\nA\n\n⁢\n\nS\n->\nB\n\nwhere cos σAB comprises a similarity between a document A and a document B, {right arrow over (S)}A comprises a score vector for document A, and {right arrow over (S)}B comprises a score vector for document B.\n32. A system according to claim 29, further comprising:\na dynamic threshold module determining a dynamic threshold for each cluster based on the similarities between each document in the cluster and a center of the cluster; and\nthe similarity module identifying each outlier document having such a similarity outside the dynamic threshold.\n33. A system according to claim 32, further comprising:\nthe clustering module grouping each such outlier document into a cluster having a best fit, subject to a minimum fit criterion and the dynamic threshold of the cluster.\n34. A system according to claim 32, wherein the dynamic threshold is determined based on the similarities of the documents in the cluster to the cluster center.\n35. A method for providing efficient document scoring of concepts within a document set, comprising:\ndetermining a frequency of occurrence of at least one concept within a document retrieved from the document set; and\nanalyzing a concept weight reflecting a specificity of meaning for the at least one concept within the document;\nanalyzing a structural weight reflecting a degree of significance based on structural location within the document for the at least one concept;\nanalyzing a corpus weight inversely weighing a reference count of occurrences for the at least one concept within the document; and\nevaluating a score associated with the at least one concept as a function of the frequency, concept weight, structural weight, and corpus weight.\n36. A method according to claim 35, further comprising:\nevaluating the score substantially in accordance with the formula:\nS\ni\n=\n∑\n1\n->\nn\nj\n⁢\nf\nij\n×\ncw\nij\n×\nsw\nij\n×\nrw\nij\nwhere Si comprises the score, fij comprises the frequency, 0<cwij≦1 comprises the concept weight, 0<swij≦1 comprises the structural weight, and 0<rwij≦1 comprises the corpus weight for occurrence j of concept i.\n37. A method according to claim 36, further comprising:\nevaluating the concept weight substantially in accordance with the formula:\ncw\nij\n=\n{\n0.25\n+\n(\n0.25\n×\nt\nij\n)\n,\n1\n≤\nt\nij\n≤\n3\n0.25\n+\n(\n0.25\n×\n[\n7\n-\nt\nij\n]\n)\n,\n4\n≤\nt\nij\n≤\n6\n0.25\n,\nt\nij\n≥\n7\nwhere cwij comprises the concept weight and tij comprises a number of terms for occurrence j of each such concept i.\n38. A method according to claim 36, further comprising:\nevaluating the structural weight substantially in accordance with the formula:\nsw\nij\n=\n{\n1.0\n,\nif\n⁡\n(\nj\n≈\nSUBJECT\n)\n0.8\n,\nif\n⁡\n(\nj\n≈\nHEADING\n)\n0.7\n,\nif\n⁡\n(\nj\n≈\nSUMMARY\n)\n0.5\nif\n⁡\n(\nj\n≈\nBODY\n)\n0.1\nif\n⁡\n(\nj\n≈\nSIGNATURE\n)\nwhere swij comprises the structural weight for occurrence j of each such concept i.\n39. A method according to claim 36, further comprising:\nevaluating the corpus weight substantially in accordance with the formula:\nrw\nij\n=\n{\n(\nT\n-\nr\nij\nT\n)\n2\n,\nr\nij\n>\nM\n1.0\n,\nr\nij\n≤\nM\nwhere rwij comprises the corpus weight, rij comprises a reference count for occurrence j of each such concept i, T comprises a total number of reference counts of documents in the document set, and M comprises a maximum reference count of documents in the document set.\n40. A method according to claim 36, further comprising:\ncompressing the score substantially in accordance with the formula:\n\nS′ i=log(S i+1)\nwhere S′i comprises the compressed score for each such concept i.\n41. A method according to claim 35, further comprising:\nmaintaining concepts and terms in a global stop concept vector cache; and\nfiltering selection of the at least one concept based on the concepts and terms maintained in the global stop concept vector cache.\n42. A method according to claim 35, further comprising:\nidentifying terms within at least one document in the document set; and\ncombining the identified terms into one or more of the concepts.\n43. A method according to claim 42, further comprising:\nstructuring each such identified term in the one or more concepts into canonical concepts comprising at least one of word root, character case, and word ordering.\n44. A method according to claim 42, further comprising:\nincluding as terms at least one of nouns, proper nouns and adjectives.\n45. A method according to claim 35, further comprising:\nidentifying a plurality of candidate seed documents;\ndetermining a similarity between each pair of a candidate seed document and a cluster center;\ndesignating each such candidate seed document separated from substantially all cluster centers with such similarity being sufficiently distinct as a seed document; and\ngrouping each such candidate seed document not being sufficiently distinct into a cluster with a nearest cluster center.\n46. A method according to claim 45, further comprising:\nidentifying a plurality of non-seed documents;\ndetermining the similarity between each non-seed document and each cluster center; and\ngrouping each such non-seed document into a cluster with a best fit, subject to a minimum fit criterion.\n47. A method according to claim 46, further comprising:\nforming a normalized score vector for each document comprising the score associated with the at least one concept for each such concept occurring within the document; and\ndetermining the similarity as a function of the normalized score vector associated with the at least one concept for each such document.\n48. A method according to claim 47, further comprising:\ncalculating the similarity substantially in accordance with the formula:\ncos\n⁢\n⁢\nσ\nAB\n=\n〈\nS\n->\nA\n·\nS\n->\nB\n〉\n\nS\n->\nA\n\n⁢\n\nS\n->\nB\n\nwhere cos σAB comprises a similarity between a document A and a document B, {right arrow over (S)}A comprises a score vector for document A, and {right arrow over (S)}B comprises a score vector for document B.\n49. A method according to claim 46, further comprising:\ndetermining a dynamic threshold for each cluster based on the similarities between each document in the cluster and a center of the cluster; and\nidentifying each outlier document having such a similarity outside the dynamic threshold.\n50. A method according to claim 49, further comprising:\ngrouping each such outlier document into a cluster with a best fit, subject to a minimum fit criterion and the dynamic threshold of the cluster.\n51. A method according to claim 49, wherein the dynamic threshold is determined based on the similarities of the documents in the cluster to the cluster center.\n52. A computer-readable storage medium holding code for performing the method of claim 35.\n53. An apparatus for providing efficient document scoring of concepts within a document set, comprising:\nmeans for determining a frequency of occurrence of at least one concept within a document retrieved from the document set; and\nmeans for analyzing a concept weight reflecting a specificity of meaning for the at least one concept within the document;\nmeans for analyzing a structural weight reflecting a degree of significance based on structural location within the document for the at least one concept;\nmeans for analyzing a corpus weight inversely weighing a reference count of occurrences for the at least one concept within the document; and\nmeans for evaluating a score associated with the at least one concept as a function of the frequency, concept weight, structural weight, and corpus weight.",
    "status": "Active",
    "citations_own": [
        "US5477451A",
        "US5794236A",
        "US5799276A",
        "US5867799A",
        "US6026397A",
        "US6137911A",
        "US6148102A",
        "US20010047351A1",
        "US20020078090A1",
        "US20020082953A1",
        "US6470307B1",
        "US20020184193A1",
        "US6502081B1",
        "US6519580B1",
        "US20030074368A1",
        "US6560597B1",
        "US6571225B1",
        "US6598054B2",
        "US6606625B1",
        "US6651057B1",
        "US20030225750A1",
        "US20040024755A1",
        "US20040034633A1",
        "US6697998B1",
        "US20040059736A1",
        "US6747646B2",
        "US20040205578A1",
        "US20040215606A1",
        "US20050004949A1",
        "US6841321B2",
        "US20050216443A1",
        "US6970881B1",
        "US6990238B1",
        "US7155668B2",
        "US7194483B1",
        "US7233940B2",
        "US7251637B1",
        "US7277919B1",
        "US7379913B2",
        "US7383282B2"
    ],
    "citations_ftf": [
        "US3416150A",
        "US3426210A",
        "BE757866A",
        "JPS6283787A",
        "US4930077A",
        "US4893253A",
        "US5121338A",
        "US5056021A",
        "US5860136A",
        "US6089742A",
        "US5278980A",
        "US5488725A",
        "US5442778A",
        "EP0955591A3",
        "JP3364242B2",
        "DE69426541T2",
        "US5528735A",
        "JPH0756933A",
        "US6173275B1",
        "US5619709A",
        "US5675819A",
        "US5959699A",
        "US5619632A",
        "US5758257A",
        "US5635929A",
        "US5724571A",
        "US5844991A",
        "US6006221A",
        "US5737734A",
        "US5842203A",
        "US5862325A",
        "US5864871A",
        "US6453327B1",
        "US5909677A",
        "JP3540511B2",
        "US5864846A",
        "US5920854A",
        "US5857179A",
        "US6484168B1",
        "US5870740A",
        "US5950146A",
        "US5987446A",
        "JP3598742B2",
        "US5966126A",
        "US5950189A",
        "JP3550929B2",
        "US6137499A",
        "US5819258A",
        "US5835905A",
        "US5895470A",
        "US6460034B1",
        "US5940821A",
        "JPH1115759A",
        "GB9713019D0",
        "US6012053A",
        "US6070133A",
        "US6122628A",
        "US6154219A",
        "US6389436B1",
        "WO1999032985A1",
        "US6094649A",
        "US6449612B1",
        "US6038574A",
        "US6484196B1",
        "US6119124A",
        "US6418431B1",
        "JPH11316779A",
        "US6345243B1",
        "US7266365B2",
        "US7209949B2",
        "US6438564B1",
        "US6100901A",
        "US6216123B1",
        "JP2000019556A",
        "US6446061B1",
        "US6167368A",
        "US6243713B1",
        "JP4032649B2",
        "US6414677B1",
        "WO2000016209A1",
        "JP3903610B2",
        "US6415283B1",
        "US6480843B2",
        "US6678705B1",
        "US6628304B2",
        "US6442592B1",
        "US6816175B1",
        "JP2000187668A",
        "US6549957B1",
        "JP2000285140A",
        "US6349307B1",
        "US6363374B1",
        "EP1024437B1",
        "US6360227B1",
        "US6941325B1",
        "WO2000046701A1",
        "US6510406B1",
        "US6862710B1",
        "US6408294B1",
        "US6496822B2",
        "US6377287B1",
        "US6629097B1",
        "EP1049030A1",
        "US6493703B1",
        "US6701305B1",
        "US6611825B1",
        "US6711585B1",
        "US6438537B1",
        "US6389433B1",
        "US7240199B2",
        "US6523063B1",
        "US6260038B1",
        "US6544123B1",
        "US7130807B1",
        "US6507847B1",
        "US6751621B1",
        "US6542889B1",
        "US6654739B1",
        "US7412462B2",
        "US7117246B2",
        "US6757646B2",
        "US6785679B1",
        "US6915308B1",
        "US7325127B2",
        "US6584564B2",
        "US6879332B2",
        "US6738759B1",
        "JP2002041544A",
        "US6675159B1",
        "US20020032735A1",
        "AUPR033800A0",
        "US7457948B1",
        "US7197470B1",
        "US6684205B1",
        "US6978419B1",
        "US6961731B2",
        "US7003551B2",
        "AU2002235147A1",
        "US7607083B2",
        "TW561358B",
        "US6751628B2",
        "US6658423B1",
        "JP3768105B2",
        "US7571177B2",
        "US20020122543A1",
        "US7366759B2",
        "US6823333B2",
        "US6819344B2",
        "US20030130991A1",
        "US7353204B2",
        "US6714929B1",
        "US6804665B2",
        "US7020645B2",
        "US6735578B2",
        "US7308451B1",
        "US6675164B2",
        "US7266545B2",
        "JP4701564B2",
        "US6978274B1",
        "AUPR958901A0",
        "EP1466273B1",
        "US7188107B2",
        "US20030172048A1",
        "US6847966B1",
        "US6996575B2",
        "JP3870862B2",
        "US6886010B2",
        "US7246113B2",
        "US7158957B2",
        "US7472110B2",
        "US20040215608A1",
        "US7146361B2",
        "US20040243556A1",
        "US20070020642A1",
        "US7523349B2"
    ],
    "citedby_own": [
        "US20040093557A1",
        "US20040230577A1",
        "US20050097435A1",
        "US20050149546A1",
        "US6978274B1",
        "US20060026152A1",
        "US20060112065A1",
        "US20060117002A1",
        "US20070016581A1",
        "US20070203865A1",
        "US20080077583A1",
        "US20080082531A1",
        "US20080086468A1",
        "US20080104054A1",
        "US20080177725A1",
        "US20080243889A1",
        "US20090006386A1",
        "US20090083256A1",
        "US20090083257A1",
        "US20090094021A1",
        "US20090112840A1",
        "US20090144272A1",
        "US20090157491A1",
        "US20090157714A1",
        "US20090177656A1",
        "US20090276724A1",
        "US20100153388A1",
        "US20100157354A1",
        "US20100205128A1",
        "US20100235314A1",
        "US20100241650A1",
        "US7836050B2",
        "US20110029536A1",
        "WO2011028553A1",
        "US20110125751A1",
        "US20110218993A1",
        "US20110238645A1",
        "US20110238659A1",
        "US20110235902A1",
        "US20110270606A1",
        "US20120226974A1",
        "US8311997B1",
        "US8321293B2",
        "US8396878B2",
        "US20130197925A1",
        "US20130326346A1",
        "US20140075282A1",
        "US8738627B1",
        "US8775436B1",
        "US20140214825A1",
        "US20140214862A1",
        "US8935249B2",
        "US8949252B2",
        "US9015172B2",
        "US20150112877A1",
        "US20150142829A1",
        "US20160012125A1",
        "US20160012054A1",
        "US9396214B2",
        "US9401145B1",
        "US20170169032A1",
        "US9807073B1",
        "US9852215B1",
        "US9898523B2",
        "US10037385B2",
        "CN108665148A",
        "US10257196B2",
        "US20190182382A1",
        "US10496684B2",
        "US10503761B2",
        "US10540404B1",
        "US10572521B2",
        "US10599753B1",
        "US10614366B1",
        "US10691877B1",
        "US10691737B2",
        "US10877953B2",
        "US11049156B2",
        "US11244011B2",
        "US11295374B2",
        "US20220261544A1",
        "US11605116B2"
    ],
    "citedby_ftf": [
        "US7099671B2",
        "US8554601B1",
        "EP1721266A1",
        "US7805446B2",
        "US7356777B2",
        "JP2007041733A",
        "WO2008126184A1",
        "US20080243482A1",
        "EP2065816A1",
        "US8316022B2",
        "US7877404B2",
        "US8463783B1",
        "US9323426B2",
        "US9046991B2",
        "CN103384883B",
        "WO2012006509A1",
        "US8364672B2",
        "US8332426B2",
        "US8484228B2",
        "US20120254166A1",
        "US8983963B2",
        "US20140173397A1",
        "US20130166563A1",
        "US20140025687A1",
        "US20140035924A1",
        "US9141882B1",
        "US20140207870A1",
        "US9122681B2",
        "JP2015036892A",
        "US20150142679A1",
        "US10210156B2",
        "US10474700B2",
        "JP6165657B2",
        "US9910899B1",
        "WO2016048283A1",
        "US9996603B2",
        "US10331782B2",
        "US10025783B2",
        "US10671675B2",
        "CN107015961B",
        "US10552465B2",
        "US10521436B2",
        "US11194860B2",
        "US10650318B2",
        "JP6930180B2",
        "US20180300323A1",
        "CN107329999B",
        "US11240184B2",
        "US11138249B1",
        "US10872125B2",
        "US10997259B2",
        "US10809892B2",
        "US11048876B2",
        "US20220044200A1"
    ]
}