{
    "patent_id": "US-8788446-B2",
    "title": "Fuzzy inference methods, and apparatuses, systems and apparatus using such inference apparatus ",
    "assignee": "University of Liecester, Bae Plc",
    "publication_date": "2014-07-22",
    "patent_link": "https://patents.google.com/patent/US8788446B2/en",
    "inventors": [
        "Liqun Yao",
        "Da-Wei Gu",
        "Ian Postlethwaite"
    ],
    "classifications": [
        "G06N5/048",
        "G06N7/023",
        "G06N3/043"
    ],
    "abstract": "A health monitoring system for complex networked apparatus includes a number of neuro-fuzzy inference apparatuses feeding inference results into a data fusion hierarchy. At each level in the hierarchy, fuzzy inference is applied to generate a desired output signal by processing selected input signals in accordance with a knowledge base defining fuzzy membership functions and fuzzy inference rules defined in advance. The knowledge base includes alternative definitions of membership functions and/or inference rules. The apparatus selects which definition to use according to environmental or other conditions, and predetermined selection criteria.",
    "claims": "\n1. A method of performing a fuzzy inference implemented in a programmable data processor or computer, the method comprising:\n(a) receiving one or more input values and generating an array of values each representing a membership degree of a respective input value in a pre-defined fuzzy set;\n(b) forming a vector sum of said array of membership degree values and a rule array representing a fuzzy rule of a fuzzy rule base, said rule array comprising a set of binary values, whereby forming said vector sum places each of said membership degree values, which initially all lie in a predetermined numerical range, into one of two distinct numerical ranges, according to a corresponding binary value in said rule array; and\n(c) processing elements of said vector sum to determine a firing strength for said fuzzy rule represented by said rule array.\n2. The method as claimed in claim 1, comprising:\na preliminary converting of a rule base into a binary array representation, prior to repeated performance of said method in a real-time processing application.\n3. The method as claimed in claim 1, wherein said step (c) comprises:\nselecting a minimum element in said vector sum as said firing strength for said fuzzy rule represented by said rule array.\n4. The method as claimed in claim 1, comprising:\n(d) repeating steps (b) and (c) for a plurality of rule arrays, each representing a different fuzzy rule; and (e) calculating an output value by reference to said firing strengths of said plurality of fuzzy rules.\n5. The method as claimed in claim 4, wherein said step (e) includes:\nidentifying a dominant rule among a group of rules, by identifying a maximum firing strength among said firing strengths calculated in said step (c).\n6. The method as claimed in claim 5, wherein said group of rules is a group of rules associated with a particular linguistic value of said output, said maximum firing strength indicating a dominant rule, all other rules in said group being eliminated from calculation of said output value.\n7. The method as claimed in claim 6, wherein said method is performed simultaneously for said group of rules and for other groups of rules associated with other linguistic values of a same output.\n8. The method as claimed in claim 7, wherein said method is performed simultaneously for yet further groups associated with linguistic values of a further output value.\n9. A processor adapted to perform fuzzy inference by a method claimed in claim 1.\n10. An automated system for monitoring or control of a target apparatus, said system comprising an inference apparatus arranged to receive a plurality of input signals from sensors coupled to a target apparatus, to determine a set of membership degrees for each input and to perform fuzzy inference by a method comprising:\n(a) receiving one or more input values and generating an array of values each representing a membership degree of a respective input value in a pre-defined fuzzy set;\n(b) forming a vector sum of said array of membership degree values and a rule array representing a fuzzy rule of a fuzzy rule base, said rule array comprising a set of binary values, whereby forming said vector sum places each of said membership degree values, which initially all lie in a predetermined numerical range, into one of two distinct numerical ranges, according to a corresponding binary value in said rule array; and\n(c) processing elements of said vector sum to determine a firing strength for said fuzzy rule represented by said rule array.\n11. The system as claimed in claim 10, comprising:\na feedback path for applying said output value of said fuzzy inference to influence a state of said target apparatus.\n12. The monitoring system as claimed in claim 10, comprising:\nan output for providing said output value of said fuzzy inference is provided as an output signal representing a condition or status of said apparatus or its environment.\n13. A computer program product containing instructions which, when loaded into a programmable processing apparatus, implements a fuzzy inference processing apparatus or method, said instructions comprising:\none or more instructions for (a) receiving one or more input values and generating an array of values each representing a membership degree of a respective input value in a pre-defined fuzzy set;\none or more instructions for (b) forming a vector sum of said array of membership degree values and a rule array representing a fuzzy rule of a fuzzy rule base, said rule array comprising a set of binary values, whereby forming said vector sum places each of said membership degree values, which initially all lie in a predetermined numerical range, into one of two distinct numerical ranges, according to a corresponding binary value in said rule array; and\none or more instructions for (c) processing elements of said vector sum to determine a firing strength for said fuzzy rule represented by said rule array.\n14. The computer program product as claimed in claim 13 comprising:\none or more instructions for a preliminary converting of a rule base into a binary array representation, prior to repeated performance of said method in a real-time processing application.\n15. The computer program product as claimed in claim 13 comprising:\none or more instructions for selecting, in said step (c), a minimum element in said vector sum as said firing strength for said fuzzy rule represented by said rule array.\n16. The computer program product as claimed in claim 13 comprising:\none or more instructions for a step (d), said step (d) repeating steps (b) and (c) for a plurality of rule arrays, each representing a different fuzzy rule; and\n(e) calculating an output value by reference to said firing strengths of said plurality of fuzzy rules.\n17. The computer program product as claimed in claim 16 comprising:\none or more instructions for said step (e) including identifying a dominant rule among a group of rules by identifying a maximum firing strength among said firing strengths calculated in said step (c).\n18. The computer program product as claimed in claim 17 wherein said group of rules is a group of rules associated with a particular linguistic value of said output, said maximum firing strength indicating a dominant rule, all other rules in said group being eliminated from calculation of said output value.\n19. The computer program product as claimed in claim 18 comprising:\none or more instructions for performing said method simultaneously for said group of rules and for other groups of rules associated with other linguistic values of a same output.\n20. The computer program product as claimed in claim 19 comprising:\none or more instructions for performing said method simultaneously for yet further groups associated with linguistic values of a further output value."
}