{
    "patent_id": "US-2020042515-A1",
    "title": "Methods and apparatus for performing machine learning to improve capabilities of an artificial intelligence (ai) entity used for online communications ",
    "assignee": "Salesforce.Com, Inc.",
    "publication_date": "2020-02-06",
    "patent_link": "https://patents.google.com/patent/US20200042515A1/en",
    "inventors": [
        "Darshil Vipul Vora",
        "Youngjun KWAK"
    ],
    "classifications": [
        "G06F16/245",
        "G06F16/22",
        "G06N3/006",
        "G06N5/041",
        "H04L51/02",
        "H04L51/046",
        "H04L51/32",
        "H04L51/52",
        "G06N20/00"
    ],
    "abstract": "A method for providing query responses to a user via online chat establishes a first communication connection for online chat between a user interface and an artificial intelligence (AI) entity comprising a processor and a memory element configured to store a database of query answers; receives a user input query transmitted via the first communication connection; performs a lookup in the database of query answers, to locate a query answer corresponding to the user input query; when unable to locate a query answer, establishes a second communication connection for online chat between the user interface and a live agent interface that transmits responses dynamically provided by a human operator; evaluates a chat between the user interface and the live agent interface; identifies an answer to the user input query, based on evaluating the chat; and stores the answer to be provided by the AI entity in the future.",
    "claims": "\n1. A method for providing query responses to a user, the method comprising:\nreceiving, by an artificial intelligence (AI) entity comprising at least one processor and a memory element configured to store a database of query answers, a user input query transmitted over a network via a first communication connection between a user interface and the AI entity;\nperforming a lookup, by the AI entity, to locate a query answer corresponding to the user input query in a plurality of query answers;\nwhen the AI entity is unable to locate a query answer corresponding to the user input query, establishing a second communication connection between the user interface and a live agent interface over the network;\nevaluating a chat session between the user interface and the live agent interface using the second communication connection to identify an answer to the user input query; and\nstoring, by the AI entity, the answer associated with the user input query.\n2. The method of claim 1, wherein the first communication connection is established by connecting to an instant messaging platform using a computer network;\nwherein the user interface comprises a graphical user interface (GUI) presented by the instant messaging platform; and\nwherein the user input query is received via the GUI and transmitted by the instant messaging platform.\n3. The method of claim 1, wherein the first communication connection is established by connecting to a social media instant messaging platform using a computer network;\nwherein the user interface comprises a social media chat interface presented by the social media instant messaging platform; and\nwherein the user input query is received via the social media chat interface and transmitted by the social media instant messaging platform.\n4. The method of claim 1, wherein locating a query answer, by the AI entity, further comprises:\nperforming the lookup to locate a match for the user input query in the plurality of query answers; and\nwhen there is no match for the user input query in the plurality of query answers, determining that the AI entity is unable to locate a query answer corresponding to the user input query.\n5. The method of claim 1, wherein evaluating the chat session further comprises:\nidentifying contents of the chat session, wherein the contents comprise the user input query and a response provided by the live agent interface, wherein the answer comprises the response; and\nwherein storing the answer further comprises:\nassociating the response to the user input query, to generate an associated response; and\nstoring the user input query and the associated response.\n6. The method of claim 5, wherein the response comprises a text-based message, a voice-based message, or a video-based message from a live agent computer system.\n7. The method of claim 1, further comprising the AI entity using an application programming interface (API) to establish the second communication connection between a live agent computer system and a user computer system over the network.\n8. The method of claim 7, wherein the second communication connection is separate and distinct from the first communication connection between the user computer system and the AI entity over the network.\n9. The method of claim 7, wherein the API comprises at least one of a text API, an audio call API, a video call API, and a live agent text chat API.\n10. A system comprising:\na system memory element configured to store a plurality of query answers;\na communication device, configured to establish communication connections using a computer network; and\nat least one processor communicatively coupled to the system memory element and the communication device, the at least one processor configured to:\nestablish a first communication connection, via the communication device, between a user interface and an artificial intelligence (AI) entity;\nreceive a user input query transmitted via the first communication connection and from the user interface;\nperform a lookup in the plurality of query answers to locate a query answer corresponding to the user input query;\nwhen the plurality of query answers does not include a query answer corresponding to the user input query, establish a second communication connection between the user interface and a live agent interface;\nevaluate a chat session between the user interface and the live agent interface using the second communication connection to identify an answer to the user input query; and\nstore the answer in association with the user input query in the system memory element.\n11. The system of claim 10, wherein the communication device is further configured to establish the first communication connection by connecting to an instant messaging platform using the computer network;\nwherein the user interface comprises a graphical user interface (GUI) presented by the instant messaging platform; and\nwherein the user input query is received via the GUI and transmitted by the instant messaging platform.\n12. The system of claim 10, wherein the communication device is further configured to establish the first communication connection by connecting to a social media instant messaging platform using the computer network;\nwherein the user interface comprises a social media chat interface presented by the social media instant messaging platform; and\nwherein the user input query is received via the social media chat interface and transmitted by the social media instant messaging platform.\n13. The system of claim 10, wherein the at least one processor is further configured to locate a query answer, by:\nperforming the lookup to locate a match for the user input query in the plurality of query answers; and\nwhen there is no match for the user input query in the plurality of query answers, determining that the at least one processor is unable to locate a query answer corresponding to the user input query.\n14. The system of claim 10, wherein the at least one processor is further configured to evaluate the chat session, by:\nidentifying contents of the chat session, wherein the contents comprise the user input query and a response provided by the live agent interface, wherein the answer comprises the response; and\nwherein storing the answer further comprises:\nassociating the response to the user input query, to generate an associated response; and\nstoring the user input query and the associated response in the plurality of query answers.\n15. The system of claim 10, wherein the at least one processor is further configured to use an application programming interface (API) to establish the second communication connection between a live agent computer system and a user computer system over a network that is separate and distinct from the first communication connection between the user computer system and the AI entity over the network.\n16. A non-transitory, computer-readable medium containing instructions thereon, which, when executed by a processor, are capable of performing a method comprising:\nwhen the processor is unable to locate a query answer corresponding to a user input query submitted to an artificial intelligence (AI) entity via a user interface of an instant messaging platform,\nestablishing a second communication connection between the user interface and a live agent interface;\nevaluating a chat session between the user interface and the live agent interface using the second communication connection to identify an answer to the user input query; and\nstoring the answer in association with the user input query.\n17. The non-transitory, computer-readable medium of claim 16, wherein the method further comprises:\nestablishing a first communication connection between the user interface and the AI entity comprising the processor and a memory element configured to store a plurality of query answers;\nreceiving, by the processor, the user input query transmitted via the first communication connection and from the user interface; and\nperforming a lookup, by the processor, in the plurality of query answers, to locate a query answer corresponding to the user input query;\nwherein the second communication connection is established when the plurality of query answers does not include the query answer corresponding to the user input query.\n18. The non-transitory, computer-readable medium of claim 17, wherein the first communication connection is established by connecting to the instant messaging platform using a computer network;\nwherein the user interface comprises a graphical user interface (GUI) presented by the instant messaging platform; and\nwherein the user input query is received via the GUI and transmitted by the instant messaging platform.\n19. The non-transitory, computer-readable medium of claim 18, wherein evaluating the chat session further comprises:\nidentifying contents of the chat session, wherein the contents comprise the user input query and a response provided by the live agent interface, wherein the answer comprises the response; and\nwherein storing the answer further comprises:\nassociating the response to the user input query, to generate an associated response; and storing the user input query and the associated response in the plurality of query answers, for future use.\n20. The non-transitory, computer-readable medium of claim 16, wherein the AI entity comprises a chat-bot.",
    "status": "Active",
    "citations_own": [],
    "citations_ftf": [
        "US5649104A",
        "US5608872A",
        "US7991347B1",
        "US5577188A",
        "US7181758B1",
        "GB2300991B",
        "US5715450A",
        "US5821937A",
        "US5831610A",
        "US6604117B2",
        "US5873096A",
        "AU6440398A",
        "WO1998038583A1",
        "WO1998038762A2",
        "WO1998040804A2",
        "WO1998038586A1",
        "AU6183798A",
        "AU6336798A",
        "EP1015997A4",
        "US6169534B1",
        "US5918159A",
        "US6560461B1",
        "US20020059095A1",
        "US6732111B2",
        "US6161149A",
        "US6772229B1",
        "US5963953A",
        "AU5791899A",
        "US6728960B1",
        "US6549908B1",
        "US6601087B1",
        "EP1135723A4",
        "JP2002531900A",
        "JP2002531899A",
        "WO2000033226A1",
        "US7356482B2",
        "US20020072951A1",
        "US6574635B2",
        "US8095413B1",
        "US7698160B2",
        "US6621834B1",
        "US6535909B1",
        "US6324568B1",
        "US6654032B1",
        "US7266502B2",
        "US6577726B1",
        "US6732100B1",
        "US6336137B1",
        "US6842748B1",
        "US6434550B1",
        "US6665655B1",
        "US7730072B2",
        "US6763501B1",
        "US7069231B1",
        "KR100365357B1",
        "US7581230B2",
        "USD454139S1",
        "US7174514B2",
        "US7363388B2",
        "US6829655B1",
        "US20030018705A1",
        "US20030206192A1",
        "US6732095B1",
        "US7761288B2",
        "US6711565B1",
        "US6782383B2",
        "US6728702B1",
        "US6763351B1",
        "US20030004971A1",
        "US7761535B2",
        "US6993712B2",
        "US6724399B1",
        "US6978445B2",
        "US6826582B1",
        "US6901595B2",
        "US7962565B2",
        "US8359335B2",
        "US7146617B2",
        "US7289949B2",
        "US7062502B1",
        "US6804330B1",
        "US7058890B2",
        "US7672853B2",
        "US7131071B2",
        "US6850949B2",
        "US7594181B2",
        "US7437720B2",
        "US8639542B2",
        "US20040010489A1",
        "US7251787B2",
        "US9448860B2",
        "US7287041B2",
        "US7904340B2",
        "EP1606740A4",
        "US8762415B2",
        "US7685515B2",
        "US7412455B2",
        "US7620655B2",
        "US7409336B2",
        "US20040260659A1",
        "US7237227B2",
        "US7694314B2",
        "US7529728B2",
        "US7412708B1",
        "US8607322B2",
        "US7289976B2",
        "US8566301B2",
        "US8209308B2",
        "US9135228B2",
        "US7779475B2",
        "US7730478B2",
        "US8082301B2",
        "US8954500B2",
        "US8583615B2",
        "US20090100342A1",
        "US8490025B2",
        "US8504945B2",
        "US20090245500A1",
        "US8032297B2",
        "US8014943B2",
        "CA2665669A1",
        "US20090292680A1",
        "US8881020B2",
        "US8646103B2",
        "US8510664B2",
        "US8661056B1",
        "US8346622B2",
        "US8510045B2",
        "US8925041B2",
        "US8392411B2",
        "US8566654B2",
        "US8943002B2",
        "US8769004B2",
        "US8756275B2",
        "US8769017B2",
        "US9042540B2",
        "US9177318B2",
        "US9955869B2",
        "EP2821943A1",
        "IN2013MU03014A",
        "US9626966B2",
        "US10394966B2",
        "US9645703B2",
        "US9363539B2",
        "US9647968B2",
        "US10091140B2",
        "US20170098162A1",
        "US10685029B2",
        "US11477139B2",
        "US10645034B2",
        "US10038787B2",
        "US10104025B2",
        "US11373100B2",
        "US11205103B2",
        "US20180174055A1",
        "US10673786B2",
        "US20180197104A1",
        "US10366168B2",
        "US20180233057A1",
        "US10891627B2",
        "US10783188B2",
        "US20180278552A1",
        "US10474673B2",
        "US10581765B2"
    ],
    "citedby_own": [
        "US20220138593A1",
        "US11409736B2",
        "USD991268S1",
        "USD992560S1"
    ],
    "citedby_ftf": [
        "US11347751B2",
        "US11151992B2",
        "US10917483B2",
        "US11283738B2",
        "CN113965807B",
        "JPWO2019220518A1",
        "JP6787973B2",
        "US20200153965A1",
        "US10972609B2",
        "US10839167B2",
        "WO2021006861A1",
        "US11677703B2",
        "US11258741B2",
        "US11050841B2",
        "JP2021051385A",
        "US11416682B2",
        "CN113766067A"
    ]
}