{
    "patent_id": "US-2020175015-A1",
    "title": "Crf-based span prediction for fine machine learning comprehension ",
    "assignee": "Koninklijke Philips N.V.",
    "publication_date": "2020-06-04",
    "patent_link": "https://patents.google.com/patent/US20200175015A1/en",
    "inventors": [
        "Sheikh Sadid Al Hasan",
        "Tao Li",
        "Vivek Varma Datla"
    ],
    "classifications": [
        "G06F40/284",
        "G06F16/24534",
        "G06F16/248",
        "G06F16/355",
        "G06F17/2705",
        "G06F17/2785",
        "G06F40/205",
        "G06F40/30",
        "G06N20/00",
        "G06N3/044",
        "G06N3/0445",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/08",
        "G06N5/041",
        "G06N7/01",
        "G06F40/35"
    ],
    "abstract": "A method for determining, from a document, an answer to a query using a query answering system, comprising: (i) encoding, using an encoder, one or more documents; (ii) encoding a received query; (iii) generating, using an attention mechanism, a query-aware document representation comprising alignment between one or more words in one of the plurality of documents and one or more words in the query; (iv) generating, using a hierarchical self-attention mechanism, a word-to-sentence alignment of the query-aware document representation; (v) labeling, using a conditional random field classifier, each of a plurality of words in the word-to-sentence alignment with one of a one of a plurality of different sequence identifiers, resulting in possible labeled answering spans; and (vi) generating, from the one or more possible labeled answering spans, a response to the query.",
    "claims": "\n1. A method for determining, from a document, an answer to a query using a query answering system, comprising:\nencoding, using an encoder of the query answering system, one or more documents;\nencoding, using the encoder, a received query;\ngenerating, using an attention mechanism of the query answering system, a query-aware document representation comprising alignment between one or more words in one of the plurality of documents and one or more words in the query;\ngenerating, using a hierarchical self-attention mechanism of the query answering system, a word-to-sentence alignment of the query-aware document representation;\nlabeling, using a conditional random field (CRF) classifier of the query answering system, each of a plurality of words in the generated word-to-sentence alignment with one of a one of a plurality of different sequence identifiers, resulting in one or more possible labeled answering spans; and\ngenerating, from the one or more possible labeled answering spans, a response to the query.\n2. The method of claim 1, further comprising the step of providing the generated response.\n3. The method of claim 1, wherein the plurality of different sequence identifiers comprises three different sequence identifiers, comprising B (beginning word), I (inside word), and O (outside word), or a representation thereof.\n4. The method of claim 1, wherein the attention module is a bidirectional attention module.\n5. The method of claim 1, wherein the steps of encoding further comprise:\nencoding the query and the document into a word embedding using a context independent word vector library; and\napplying a BiRNN on the word embeddings for the query and document.\n6. The method of claim 1, wherein the step of labeling each of a plurality of words in the generated word-to-sentence alignment using a (CRF) classifier comprises:\napplying a linear layer on vectors representing the plurality of words to generate one or more possible labeled answering spans (S);\napplying a Viterbi algorithm analysis to the one or more possible labeled answering spans (S), wherein the Viterbi algorithm analysis is configured to predict one or more of the labeled answering spans (S) with a highest likelihood of a high score, to generate a list of one or more labeled answering spans with a high likelihood of a high score (S′); and\napplying an argmax function to select, from the list of one or more labeled answering spans with a high likelihood of a high score (S′), a labeled answering span with the maximal score.\n7. The method of claim 6, wherein the labeled answering span with the maximal score is the answer to the query.\n8. The method of claim 1, wherein the step of labeling each of a plurality of words in the generated word-to-sentence alignment using a (CRF) classifier comprises a transition table, the transition table configured to direct the system to only generate labeled answering spans (S) with approved transitions.\n9. The method of claim 8, wherein the transition table ensures that the generated labeled answering spans (S) comprise a beginning word sequence identifier at the beginning of the span.\n10. The method of claim 8, wherein the transition table ensures that the generated labeled answering spans (S) does not comprise a transition from an inside-the-span sequence identifier to a beginning-word sequence identifier.\n11. A system configured to determine an answer to a received query, comprising:\na plurality of documents;\na received query; and\na processor configured to: (i) encode, using an encoder, one or more of the plurality of the documents; (ii) encode, using the encoder, the received query; (iii) generate, using an attention mechanism, a query-aware document representation comprising alignment between one or more words in one of the plurality of documents and one or more words in the query; (iv) generate, using a hierarchical self-attention mechanism, a word-to-sentence alignment of the query-aware document representation; (v) label, using a conditional random field (CRF) classifier, each of a plurality of words in the generated word-to-sentence alignment with one of a one of a plurality of different sequence identifiers, resulting in one or more possible labeled answering spans; and (vi) generate, from the one or more possible labeled answering spans, a response to the query.\n12. The system of claim 11, wherein the plurality of different sequence identifiers comprises three different sequence identifiers, comprising B (beginning word), I (inside word), and O (outside word), or a representation thereof\n13. The system of claim 11, wherein labeling each of a plurality of words in the generated word-to-sentence alignment using a (CRF) classifier comprises:\napplying a linear layer on vectors representing the plurality of words to generate one or more possible labeled answering spans (S);\napplying a Viterbi algorithm analysis to the one or more possible labeled answering spans (S), wherein the Viterbi algorithm analysis is configured to predict one or more of the labeled answering spans (S) with a highest likelihood of a high score, to generate a list of one or more labeled answering spans with a high likelihood of a high score (S′); and\napplying an argmax function to select, from the list of one or more labeled answering spans with a high likelihood of a high score (S′), a labeled answering span with the maximal score.\n14. The system of claim 13, wherein the labeled answering span with the maximal score is the answer to the query.\n15. A system configured to improve the ability of a computer system to provide an answer to a received query, comprising:\na plurality of documents;\na received query; and\na processor configured to: (i) encode, using an encoder, one or more of the plurality of the documents; (ii) encode, using the encoder, the received query; (iii) generate, using an attention mechanism, a query-aware document representation comprising alignment between one or more words in one of the plurality of documents and one or more words in the query; (iv) generate, using a hierarchical self-attention mechanism, a word-to-sentence alignment of the query-aware document representation; (v) label, using a conditional random field (CRF) classifier, each of a plurality of words in the generated word-to-sentence alignment with one of a one of a plurality of different sequence identifiers, resulting in one or more possible labeled answering spans; and (vi) generate, from the one or more possible labeled answering spans, a response to the query;\nwherein a memory of the processor is configured to store or comprise at least: (i) a transition data structure utilized to direct the system to only generate labeled answering spans with a plurality of approved transitions from one sequence identifier to another; and (ii) a data structure comprising generated authorized labeled answering spans with a high likelihood of a high score, from which the response to the query is generated.",
    "status": "Active",
    "citations_own": [],
    "citations_ftf": [
        "US9275341B2",
        "US20190079739A1",
        "WO2015006206A1",
        "US11093556B2",
        "CN108780445B",
        "WO2017201195A1",
        "US20180357562A1",
        "US20190156220A1",
        "CN108415977B",
        "US10997221B2",
        "CN108959246B",
        "CN109033068B",
        "CN110928982A",
        "CN109460553B",
        "CN109492227A",
        "US20220138432A1"
    ],
    "citedby_own": [
        "CN111898379A",
        "CN112287978A",
        "CN112347229A",
        "CN112487796A",
        "CN112579739A",
        "CN112836056A",
        "US20210256069A1",
        "CN113362598A",
        "WO2021174871A1",
        "CN113761197A",
        "EP3933699A1",
        "WO2022003762A1",
        "US11232267B2",
        "WO2022079845A1",
        "US20220229843A1",
        "CN114881038A",
        "US20220253447A1",
        "US11443102B1",
        "US11645462B2"
    ],
    "citedby_ftf": []
}