{
    "patent_link": "https://patents.google.com/patent/US6094632A/en",
    "patent_id": "US6094632A",
    "title": "Speaker recognition device",
    "abstract": "A speaker recognition device for judging whether or not an unknown speaker is an authentic registered speaker himself/herself executes `text verification using speaker independent speech recognition` and `speaker verification by comparison with a reference pattern of a password of a registered speaker`. A presentation section instructs the unknown speaker to input an ID and utter a specified text designated by a text generation section and a password. The `text verification` of the specified text is executed by a text verification section, and the `speaker verification` of the password is executed by a similarity calculation section. The judgment section judges that the unknown speaker is the authentic registered speaker himself/herself if both the results of the `text verification` and the `speaker verification` are affirmative. According to the device, the `text verification` is executed using a set of speaker independent reference patterns, and the `speaker verification` is executed using speaker reference patterns of passwords of registered speakers, thereby storage capacity for storing reference patterns for verification can be considerably reduced. Preferably, `speaker identity verification` between the specified text and the password is executed.",
    "inventors": [
        "Hiroaki Hattori"
    ],
    "assignee": "NEC Corp",
    "classifications": [
        "G10L17/14",
        "G10L17/24"
    ],
    "claims": "\n1. A speaker recognition device for judging whether or not an unknown speaker is an authentic registered speaker, wherein the speaker recognition device includes a digital processor programmed to:\n1) instruct the unknown speaker to input an ID of the unknown speaker and utter a specified text designated by the speaker recognition device and a password of the unknown speaker,\n2) input the ID and the utterance of the specified text and the password from the unknown speaker, and\n3) determine that the unknown speaker is the authentic registered, speaker if each of the following conditions are satisfied:\na. the specified text uttered by the unknown speaker is the same as the specified text designated by the speaker recognition device: and\nb. the degree of similarity between acoustic features of the password uttered by the unknown speaker and acoustic features of the password uttered by the authentic registered speaker who corresponds to the inputted ID is larger than a predetermined threshold value; and\nwherein the specified text is independent of stored acoustic features of the authentic registered speaker.\n1) instruct the unknown speaker to input an ID of the unknown speaker and utter a specified text designated by the speaker recognition device and a password of the unknown speaker,\n2) input the ID and the utterance of the specified text and the password from the unknown speaker, and\n3) determine that the unknown speaker is the authentic registered, speaker if each of the following conditions are satisfied:\na. the specified text uttered by the unknown speaker is the same as the specified text designated by the speaker recognition device: and\nb. the degree of similarity between acoustic features of the password uttered by the unknown speaker and acoustic features of the password uttered by the authentic registered speaker who corresponds to the inputted ID is larger than a predetermined threshold value; and\nwherein the specified text is independent of stored acoustic features of the authentic registered speaker.\n2. A speaker recognition device for judging whether or not an unknown speaker is an authentic registered speaker, wherein the speaker recognition device includes a digital processor programmed to:\n1) instruct the unknown speaker to input an ID of the unknown speaker and utter a specified text designated by the speaker recognition device and a password of the unknown speaker,\n2) input the ID and the utterance of the specified text and the password from the unknown speaker, and\n3) determine that the unknown speaker is the authentic registered speaker if each of the following conditions are satisfied:\na. the specified text uttered by the unknown speaker is the same as the specified text designated by the speaker recognition device;\nb. the degree of similarity between acoustic features of the password uttered by the unknown speaker and acoustic features of the password uttered by the authentic registered speaker who corresponds to the inputted ID is larger than a predetermined threshold value;\nc. the specified text and the password are judged to have been uttered by the same speaker; and\nwherein the specified text is independent of stored acoustic features of the authentic registered speaker.\n1) instruct the unknown speaker to input an ID of the unknown speaker and utter a specified text designated by the speaker recognition device and a password of the unknown speaker,\n2) input the ID and the utterance of the specified text and the password from the unknown speaker, and\n3) determine that the unknown speaker is the authentic registered speaker if each of the following conditions are satisfied:\na. the specified text uttered by the unknown speaker is the same as the specified text designated by the speaker recognition device;\nb. the degree of similarity between acoustic features of the password uttered by the unknown speaker and acoustic features of the password uttered by the authentic registered speaker who corresponds to the inputted ID is larger than a predetermined threshold value;\nc. the specified text and the password are judged to have been uttered by the same speaker; and\nwherein the specified text is independent of stored acoustic features of the authentic registered speaker.\n3) determine that the unknown speaker is the authentic registered speaker if each of the following conditions are satisfied:\n3. A speaker recognition device for judging whether or not an unknown speaker is an authentic registered speaker comprising:\n1) a text generation section for generating a specified text to be uttered by an unknown speaker;\n2) a presentation section for instructing the unknown speaker to utter the specified text together with a password of the unknown speaker;\n3) a voice input section for receiving the utterance of the specified text and the password of the unknown speaker;\n4) a speaker information input section for receiving an ID of a registered speaker which is inputted by the unknown speaker;\n5) a speaker independent reference pattern storing section for storing speaker independent reference patterns which represent acoustic features of speaker independent phonemes/syllables which are independent of stored acoustic features of the authentic registered speaker by which an arbitrary text is generated;\n6) a speaker reference pattern storing section for storing a plurality of speaker reference patterns each of which representing acoustic features of a password which has been uttered by each registered speaker;\n7) a voice analysis section for executing sound analysis of a voice waveform of the utterance of the unknown speaker and generating an input pattern by extracting feature values from the voice waveform;\n8) a time correspondence section for linking together\na. the speaker independent phoneme/syllable reference patterns stored in the speaker independent reference pattern storing section and generating a first reference pattern of the specified text and\nb. a second reference pattern of a password of one registered speaker who corresponds to an ID which has been inputted to the speaker information input section by the unknown speaker, said time correspondence section establishing time-correspondence between the first and second generated reference patterns and the input pattern generated by the voice analysis section, and segmenting the input pattern into a first input pattern corresponding to the specified text and a second input pattern corresponding to the password using the time-correspondence;\n9) a text verification section for judging whether or not text contents of the first input pattern corresponding to the specified text are the same as text contents of the specified text generated by the text generation section independently of any stored acoustic features of the authentic registered speaker;\n10) a similarity calculation section for obtaining the degree of similarity between a speaker reference pattern stored in the speaker reference pattern storing section which corresponds to the ID inputted by the unknown speaker and the second input pattern corresponding to the password; and\n11) a judgment section for judging that the unknown speaker is the authentic registered speaker if the following conditions are satisfied:\na. the result of the judgment by the text verification section is affirmative; and\nb. the degree of similarity calculated by the similarity calculation section is larger than a predetermined threshold value.\n1) a text generation section for generating a specified text to be uttered by an unknown speaker;\n2) a presentation section for instructing the unknown speaker to utter the specified text together with a password of the unknown speaker;\n3) a voice input section for receiving the utterance of the specified text and the password of the unknown speaker;\n4) a speaker information input section for receiving an ID of a registered speaker which is inputted by the unknown speaker;\n5) a speaker independent reference pattern storing section for storing speaker independent reference patterns which represent acoustic features of speaker independent phonemes/syllables which are independent of stored acoustic features of the authentic registered speaker by which an arbitrary text is generated;\n6) a speaker reference pattern storing section for storing a plurality of speaker reference patterns each of which representing acoustic features of a password which has been uttered by each registered speaker;\n7) a voice analysis section for executing sound analysis of a voice waveform of the utterance of the unknown speaker and generating an input pattern by extracting feature values from the voice waveform;\n8) a time correspondence section for linking together\na. the speaker independent phoneme/syllable reference patterns stored in the speaker independent reference pattern storing section and generating a first reference pattern of the specified text and\nb. a second reference pattern of a password of one registered speaker who corresponds to an ID which has been inputted to the speaker information input section by the unknown speaker, said time correspondence section establishing time-correspondence between the first and second generated reference patterns and the input pattern generated by the voice analysis section, and segmenting the input pattern into a first input pattern corresponding to the specified text and a second input pattern corresponding to the password using the time-correspondence;\n9) a text verification section for judging whether or not text contents of the first input pattern corresponding to the specified text are the same as text contents of the specified text generated by the text generation section independently of any stored acoustic features of the authentic registered speaker;\n10) a similarity calculation section for obtaining the degree of similarity between a speaker reference pattern stored in the speaker reference pattern storing section which corresponds to the ID inputted by the unknown speaker and the second input pattern corresponding to the password; and\n11) a judgment section for judging that the unknown speaker is the authentic registered speaker if the following conditions are satisfied:\na. the result of the judgment by the text verification section is affirmative; and\nb. the degree of similarity calculated by the similarity calculation section is larger than a predetermined threshold value.\n4. A speaker recognition device as claimed in claim 3, further comprising a speaker identity verification section for verifying speaker identity between the first input pattern corresponding to the specified text and the second input pattern corresponding to the password, wherein the judgment section judges that the unknown speaker is the authentic registered speaker if the following additional condition is satisfied by the judgment section:\na. the result of the speaker identity verification by the speaker identity verification section is affirmative.\n5. A speaker recognition device as claimed in claim 3, wherein the text verification section obtains a first likelihood between the first input pattern and the reference pattern of the specified text and a second likelihood between the first input pattern and a reference pattern which can accept all possible phoneme sequence, and judges that the text contents of the first input pattern are the same as the text contents of the specified text generated by the text generation section if the difference between the first likelihood and the second likelihood is smaller than a threshold value.\n6. A speaker recognition device as claimed in claim 4, wherein the text verification section obtains a first likelihood between the first input pattern and the reference pattern of the specified text and a second likelihood between the first input pattern and a reference pattern which can accept all possible phoneme sequence, and judges that the text contents of the first input pattern are the same as the text contents of the specified text generated by the text generation section if the difference between the first likelihood and the second likelihood is smaller than a threshold value.\n7. A speaker recognition device as claimed in claim 4 wherein the speaker identity verification section calculates a text independent similarity between the first input pattern corresponding to the specified text and the second input pattern corresponding to the password, and judges that both the first input pattern and the second input pattern have been uttered by the same speaker if the calculated text independent similarity is larger than a predetermined threshold value.\n8. A speaker recognition device as claimed in claim 4, wherein the speaker identity verification section obtains a first text independent similarity and a second text independent similarity with regard to each of a plurality of predetermined speakers, in which the first text independent similarity being the degree of text independent similarity between the first input pattern and a speaker dependent reference pattern of one of the predetermined speakers which can accept all possible phoneme sequence, and the second similarity being the degree of text independent similarity between the second input pattern and the speaker dependent reference pattern of the one of the predetermined speakers which can accept all possible phoneme sequence, and the speaker identity verification section judges that both the first input pattern and the second input pattern have been uttered by the same speaker if a first group of speakers whose first text independent similarities are large and a second group of speakers whose second text independent similarities are large have similar composition of members.\n9. A speaker recognition device as claimed in claim 4, wherein the speaker identity verification section executes speaker adaptation to speaker independent phoneme/syllable reference patterns using one of the first input pattern and the second input pattern, obtains a first similarity and a second similarity with regard to the other one of the first input pattern and the second input pattern, in which the first similarity being the degree of similarity between the other one and the speaker independent phoneme/syllable reference patterns before the speaker adaptation, and the second similarity being the degree of similarity between the other one and the speaker independent phoneme/syllable reference patterns after the speaker adaptation, and judges that both the first input pattern and the second input pattern have been uttered by the same speaker if the second similarity is larger than the first similarity by more than a predetermined threshold value.\n10. A speaker recognition device as claimed in claim 3, wherein the speaker reference pattern storing section further stores text contents of each password which has been uttered by each registered speaker, and the time correspondence section utilizes the text contents for generating the reference pattern of the password which corresponds to the inputted ID.\n11. A speaker recognition device as claimed in claim 3 wherein the time correspondence section utilizes a speaker independent phoneme/syllable reference pattern which can accept all possible phoneme sequence for generating the reference pattern of the password which corresponds to the inputted ID.\n12. A speaker recognition device for judging whether or not an unknown speaker is an authentic registered speaker comprising:\n1) a text generation section for generating a specified text to be uttered by an unknown speaker;\n2) a presentation section for instructing the unknown speaker to utter the specified text together with a password of the unknown speaker;\n3) a voice input section for receiving the utterance of the specified text and the password of the unknown speaker;\n4) a speaker information input section for receiving an ID of a registered speaker which is inputted by the unknown speaker;\n5) a speaker independent reference pattern storing section for storing speaker independent reference patterns which represent acoustic features of speaker independent phonemes/syllables which are independent of stored acoustic features of the authentic registered speaker by which an arbitrary text is generated;\n6) a speaker reference pattern storing section for storing a plurality of speaker reference patterns each of which representing acoustic features of a password which has been uttered by each registered speaker;\n7) a voice analysis section for executing sound analysis of a voice waveform of the utterance of the unknown speaker and generating an input pattern by extracting feature values from the voice waveform;\n8) a time correspondence section for linking together\na. the speaker independent phoneme/syllable reference patterns stored in the speaker independent reference pattern storing section and generating a first reference pattern of the specified text and\nb. a second reference pattern of a password of one registered speaker who corresponds to an ID which has been inputted to the speaker information input section by the unknown speaker, said time correspondence section establishing time-correspondence between the first and second generated reference patterns and the input pattern generated by the voice analysis section, and segmenting the input pattern into a first input pattern corresponding to the specified text and a second input pattern corresponding to the password using the time-correspondence;\n9) a text verification section for judging whether or not text contents of the first input pattern corresponding to the specified text are the same as text contents of the specified text generated by the text generation section independently of any stored acoustic features of the authentic registered speaker;\n10) a speaker adaptation section for executing speaker adaptation to a speaker reference pattern which corresponds to the inputted ID using the first input pattern corresponding to the specified text:\n11) a similarity calculation section for obtaining a first similarity before the speaker adaptation and a second similarity after the speaker adaptation, in which the first similarity before the speaker adaptation being the degree of similarity between the speaker reference pattern before the speaker adaptation and the second input pattern corresponding to the password, and the second similarity after the speaker adaptation being the degree of similarity between the speaker reference pattern after the speaker adaptation and the second input pattern corresponding to the password; and\na judgment section for judging that the unknown speaker is the authentic registered speaker if the following conditions are satisfied:\na. the result of the judgment by the text verification section is affirmative;\nb. the first similarity before the speaker adaptation obtained by the similarity calculation section is larger than a predetermined threshold value; and\nc. the second similarity after the speaker adaptation obtained by the similarity calculation section is larger than the first similarity before the speaker adaptation by more than another predetermined threshold value.\n1) a text generation section for generating a specified text to be uttered by an unknown speaker;\n2) a presentation section for instructing the unknown speaker to utter the specified text together with a password of the unknown speaker;\n3) a voice input section for receiving the utterance of the specified text and the password of the unknown speaker;\n4) a speaker information input section for receiving an ID of a registered speaker which is inputted by the unknown speaker;\n5) a speaker independent reference pattern storing section for storing speaker independent reference patterns which represent acoustic features of speaker independent phonemes/syllables which are independent of stored acoustic features of the authentic registered speaker by which an arbitrary text is generated;\n6) a speaker reference pattern storing section for storing a plurality of speaker reference patterns each of which representing acoustic features of a password which has been uttered by each registered speaker;\n7) a voice analysis section for executing sound analysis of a voice waveform of the utterance of the unknown speaker and generating an input pattern by extracting feature values from the voice waveform;\n8) a time correspondence section for linking together\na. the speaker independent phoneme/syllable reference patterns stored in the speaker independent reference pattern storing section and generating a first reference pattern of the specified text and\nb. a second reference pattern of a password of one registered speaker who corresponds to an ID which has been inputted to the speaker information input section by the unknown speaker, said time correspondence section establishing time-correspondence between the first and second generated reference patterns and the input pattern generated by the voice analysis section, and segmenting the input pattern into a first input pattern corresponding to the specified text and a second input pattern corresponding to the password using the time-correspondence;\n9) a text verification section for judging whether or not text contents of the first input pattern corresponding to the specified text are the same as text contents of the specified text generated by the text generation section independently of any stored acoustic features of the authentic registered speaker;\n10) a speaker adaptation section for executing speaker adaptation to a speaker reference pattern which corresponds to the inputted ID using the first input pattern corresponding to the specified text:\n11) a similarity calculation section for obtaining a first similarity before the speaker adaptation and a second similarity after the speaker adaptation, in which the first similarity before the speaker adaptation being the degree of similarity between the speaker reference pattern before the speaker adaptation and the second input pattern corresponding to the password, and the second similarity after the speaker adaptation being the degree of similarity between the speaker reference pattern after the speaker adaptation and the second input pattern corresponding to the password; and\n13. A speaker recognition device as claimed in claim 12, further comprising a speaker identity verification section for verifying speaker identity between the first input pattern corresponding to the specified text and the second input pattern corresponding to the password, wherein the judgment section judges that the unknown speaker is the authentic registered speaker if the following additional condition is satisfied by the judgment section:\na. the result of the speaker identity verification by the speaker identity verification section is affirmative.\n14. A speaker recognition device as claimed in claim 12, wherein the text verification section obtains a first likelihood between the first input pattern and the reference pattern of the specified text and a second likelihood between the first input pattern and a reference pattern which can accept all possible phoneme sequence, and judges that the text contents of the first input pattern are the same as the text contents of the specified text generated by the text generation section if the difference between the first likelihood and the second likelihood is smaller than a threshold value.\n15. A speaker recognition device as claimed in claim 13, wherein the text verification section obtains a first likelihood between the first input pattern and the reference pattern of the specified text and a second likelihood between the first input pattern and a reference pattern which can accept all possible phoneme sequence, and judges that the text contents of the first input pattern are the same as the text contents of the specified text generated by the text generation section if the difference between the first likelihood and the second likelihood is smaller than a threshold value.\n16. A speaker recognition device as claimed in claim 13, wherein the speaker identity verification section calculates a text independent similarity between the first input pattern corresponding to the specified text and the second input pattern corresponding to the password, and judges that both the first input pattern and the second input pattern have been uttered by the same speaker if the calculated text independent similarity is larger than a predetermined threshold value.\n17. A speaker recognition device as claimed in claim 13, wherein the speaker identity verification section obtains a first text independent similarity and a second text independent similarity with regard to each of a plurality of predetermined speakers, in which the first text independent similarity being the degree of text independent similarity between the first input pattern and a speaker dependent reference pattern of one of the predetermined speakers which can accept all possible phoneme sequence, and the second similarity being the degree of text independent similarity between the second input pattern and the speaker dependent reference pattern of the one of the predetermined speakers which can accept all possible phoneme sequence, and the speaker identity verification section judges that both the first input pattern and the second input pattern have been uttered by the same speaker if a first group of speakers whose first text independent similarities are large and a second group of speakers whose second text independent similarities are large have similar composition of members.\n18. A speaker recognition device as claimed in claim 13, wherein the speaker identity verification section executes speaker adaptation to speaker independent phoneme/syllable reference patterns using one of the first input pattern and the second input pattern, obtains a first similarity and a second similarity with regard to the other one of the first input pattern and the second input pattern, in which the first similarity being the degree of similarity between the other one and the speaker independent phoneme/syllable reference patterns before the speaker adaptation, and the second similarity being the degree of similarity between the other one and the speaker independent phoneme/syllable reference patterns after the speaker adaptation, and judges that both the first input pattern and the second input pattern have been uttered by the same speaker if the second similarity is larger than the first similarity by more than a predetermined threshold value.\n19. A speaker recognition device as claimed in claim 12, wherein the speaker reference pattern storing section further stores text contents of each password which has been uttered by each registered speaker, and the time correspondence section utilizes the text contents for generating the reference pattern of the password which corresponds to the inputted ID.\n20. A speaker recognition device as claimed in claim 12, wherein the time correspondence section utilizes a speaker independent phoneme/syllable reference pattern which can accept all possible phoneme sequence for generating the reference pattern of the password which corresponds to the inputted ID.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4987480A",
        "JPH05323990A",
        "US5414755A",
        "US5548647A",
        "EP0810737A2",
        "US5774525A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6253180B1",
        "US6332122B1",
        "US6341263B1",
        "US20020051522A1",
        "US20020059072A1",
        "US20020104027A1",
        "US6529871B1",
        "US6690772B1",
        "US20040107099A1",
        "US20050154926A1",
        "US20050228675A1",
        "US6973426B1",
        "US20060155549A1",
        "US7082415B1",
        "US20060178882A1",
        "US20060178886A1",
        "US20070098146A1",
        "US20070192101A1",
        "US20070198269A1",
        "US20070219792A1",
        "US7283964B1",
        "US7289957B1",
        "US20080195389A1",
        "US20080243517A1",
        "US7437330B1",
        "US7464059B1",
        "US20080312926A1",
        "US20090006093A1",
        "US7533809B1",
        "US20090157714A1",
        "US7624073B1",
        "US7765164B1",
        "US7827032B2",
        "US20110246198A1",
        "US8200980B1",
        "US20130080166A1",
        "US20130325473A1",
        "US20130340041A1",
        "EP2713367A1",
        "US20140095161A1",
        "US8898064B1",
        "US8914290B2",
        "US9043210B1",
        "US9189788B1",
        "US20160014137A1",
        "US9426150B2",
        "US9965663B2",
        "US9978395B2",
        "US20190050545A1",
        "US10276191B2",
        "US10497364B2",
        "US10553218B2",
        "US10679630B2",
        "US10854205B2",
        "US11019201B2",
        "US11289072B2",
        "US11355103B2",
        "US11437046B2",
        "US11468901B2",
        "US11646018B2",
        "US11659082B2"
    ],
    "citedby_ftf": [
        "EP1158492A1",
        "US7852993B2",
        "JP4463526B2",
        "DE102007021772B4",
        "US8190437B2",
        "US8332223B2",
        "US8442824B2",
        "WO2013190169A1",
        "US10008208B2",
        "US20170323644A1",
        "CN109741749B"
    ]
}