{
    "patent_link": "https://patents.google.com/patent/US5097428A/en",
    "patent_id": "US5097428A",
    "title": "Data occurrence frequency analyzer",
    "abstract": "An apparatus for counting the number of times that each of a large number of digital data patterns are present on a set of signal lines comprises a plurality of random access memories (RAMs) and a feedback means, arranged to form an array of linear feedback shift registers. The data to be analyzed is applied to the address inputs of the RAMs where it selects one of the linear feedback shift registers in the array. A data-valid signal associated with this data causes the selected linear feedback shift register to increment (or decrement) in its pseudo-random count. After the analysis period is over, the value at each address is read out and translated using a lookup table or other translating means from the pseudo-random code of the linear feedback shift register into a meaningful number. This result may then be displayed; for example, in a histogram. An improved feedback path for the linear feedback shift register avoids hang-up states and the need for initialization. A mux can be used to switch between two alternative feedback paths, allowing the apparatus to operate in a count-up mode or a count-down mode.",
    "inventors": [
        "Philip S. Crosby"
    ],
    "assignee": "Tektronix Inc",
    "classifications": [
        "G06F7/60",
        "G06F17/18"
    ],
    "claims": "\n1. An apparatus for counting the number of times that different digital data patterns occur on a set of signal lines, comprising:\nan array of linear feedback shift registers implemented in random access memories (RAMs) with the set of signal lines connected to the address inputs of each RAM to select one of the linear feedback shift registers from the array according to the digital data pattern occurring on the set of signal lines; and\nmeans for causing the selected linear feedback shift register to shift upon the occurrence of a signal indicating that one of the digital signal patterns to be counted is present such that on each occurrence of the signal the content of the selected linear feedback shift register is incremented in a pseudo-random sequence.\n2. An apparatus as recited in claim 1 further comprising means for translating coupled to a data output of the RAMs for translating pseudo-random codes generated by the linear feedback shift registers into meaningful numbers.\n3. An apparatus as recited in claim 2 wherein the means for translating comprises a lookup table.\n4. An apparatus as recited in claim 1 wherein the signal is a data valid signal and the means for causing comprises means for delaying the data valid signal to produce a code valid signal, with the data valid signal being applied to a chip select input of the RAMs and the code valid signal being applied to a write enable input of the RAMs.\n5. An apparatus as recited in claim 1 wherein the array of linear feedback shift registers implemented in RAMs comprises:\na plurality of single bit RAMS arranged in a chain with the input of all except the first connected in series to the output of the preceding RAM in the clain; and\nmeans for providing feedback from a combination of the RAM outputs to the input of the first RAM in the chain.\n6. An apparatus as recited in claim 5 wherein the feedback means comprises an exclusive-OR gate.\n7. An apparatus as recited in claim 6 further comprising a NOR gate with all of the plurality of RAM data outputs except the last one as inputs, and with the output of the NOR gate coupled to be one of the inputs to the exclusive-OR gate.\n8. An apparatus as recited in claim 5 wherein the feedback means comprises a multiplexer disposed to select for feedback one of two combinations of the data outputs, one of which causes counting up behavior of the apparatus and the other of which causes counting down behavior of the apparatus.\n9. An apparatus for counting the number of times that different digital data patterns occur on a set of signal lines, the apparatus comprising:\nmeans for delaying a data valid signal to produce a code valid signal;\na plurality of random access memories (RAMs), each having address inputs, a data input, a data output, a chip select control input, and a write enable control input, with the address inputs of each RAM coupled to the set of signal lines, with the chip select control inputs of each RAM coupled to the data valid signal, with the write enable control inputs of each RAM coupled to the code valid signal, and with the data inputs of each RAM, except the first RAM, coupled to the data output of the preceding RAM in the series; and\nfeedback means for coupling a combination of the data outputs of the plurality of RAM to the data input of the first RAM;\nwhereby, on each occurrence of the data valid signal followed by the code valid signal, the contents of the RAMs at the address location specified by the address inputs is incremented in a pseudo-random count.\n10. An apparatus as recited in claim 9 further comprising means for translating the pseudo-random count held by the plurality of RAMs into a meaningful non-random number.\n11. An apparatus as recited in claim 10 wherein the means for translating comprises a lookup table.\n12. An apparatus as recited in claim 9 wherein the feedback means comprises an exclusive-OR gate.\n13. An apparatus as recited in claim 12 further comprising a NOR gate with all of the plurality of RAM data outputs except the last one as inputs, and with the output of the NOR gate coupled to be one of the inputs to the exclusive-OR gate.\n14. An apparatus as recited in claim 9 wherein the feedback means comprises a multiplexer disposed to select for feedback one of two combinations of the data outputs, one of which causes counting up behavior of the apparatus and the other of which causes counting down behavior of the apparatus.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3978413A",
        "US4429300A",
        "US4475237A",
        "US4692897A",
        "US4774681A",
        "US4860236A"
    ],
    "citations_ftf": [
        "JPS5531501B2"
    ],
    "citedby_own": [
        "US5530942A",
        "US5946473A",
        "US6026397A",
        "US20050120257A1"
    ],
    "citedby_ftf": [
        "CN104865346B"
    ]
}