{
    "patent_id": "US-11063769-B2",
    "title": "Blockchain data protection based on generic account model and homomorphic encryption ",
    "assignee": "Advanced New Technologies Co., Ltd.",
    "publication_date": "2021-07-13",
    "patent_link": "https://patents.google.com/patent/US11063769B2/en",
    "inventors": [
        "Wenbin Zhang",
        "Baoli Ma",
        "Huanyu Ma"
    ],
    "classifications": [
        "G06F7/58",
        "G06N7/005",
        "G06N7/01",
        "H04L9/008",
        "H04L9/088",
        "H04L9/30",
        "H04L9/3218",
        "H04L9/3239",
        "H04L9/3247",
        "H04L9/50",
        "H04L2209/38"
    ],
    "abstract": "Implementations of the specification include receiving transaction data associated with the transaction, the transaction data comprising: data representative of a plurality of assets, a first commitment hiding a first random number and a transaction amount of the transaction, a second commitment that hides a second random number and a change, the transaction amount and a third random number both encrypted by a public key of the second node, the change and a fourth random number both encrypted by a public key of the first node, and a zero-knowledge proof (ZKP); determining, based on the ZKP, whether the transaction is valid based on determining if the first random number is equal to the third random number, the second random number is equal to the fourth random number, and the transaction amount hidden in the first commitment is equal to the transaction amount encrypted by the public key of the second node.",
    "claims": "\n1. A computer-implemented method performed by a consensus node using at least one or more hardware processors for validating a transaction between a first node and a second node within a blockchain network, the method comprising:\nreceiving transaction data associated with the transaction, the transaction data comprising:\ndata representative of a plurality of assets;\na first commitment comprising a first random number and a transaction amount of the transaction;\na second commitment comprising a second random number and a change calculated based on deducting the transaction amount from a total value of the plurality of assets, the transaction amount being encrypted by a public key of the second node;\na third random number encrypted with the transaction amount by the public key of the second node; and\nthe change and a fourth random number encrypted by the public key of the first node;\ndetermining that the transaction amount and the change are each greater than, or equal to, zero;\ndetermining that the total value of the plurality of assets equals a sum of the transaction amount and the change; and\ndetermining that the transaction is valid by determining that the transaction amount is equal to the transaction amount encrypted by the public key of the second node, determining that the first random number is equal to the third random number, and determining that the second random number is equal to the fourth random number.\n2. The computer-implemented method of claim 1, wherein:\nthe third random number is encrypted with the transaction amount by the public key of the second node based upon on a linear deterministic homomorphic encryption (HE) scheme; and\nthe change and a fourth random number are encrypted by the public key of the first node based upon the linear deterministic HE scheme.\n3. The computer-implemented method of claim 1, wherein the transaction data includes one or more range proofs, a zero-knowledge proof (ZKP), and a digital signature generated based on a private key corresponding to the public key of the first node.\n4. The computer-implemented method of claim 3, wherein determining that the transaction amount and the change are each greater than, or equal to, zero is based upon the one or more range proofs.\n5. The computer-implemented method of claim 4, wherein determining that the transaction is valid is based upon the ZKP.\n6. The computer-implemented method of claim 3, further comprising verifying the digital signature based on the public key of the first node.\n7. A non-transitory, computer-readable medium storing one or more instructions executable by a computer system to perform operations comprising:\nreceiving transaction data associated with a transaction between a first node and a second node within a blockchain network, the transaction data comprising:\ndata representative of a plurality of assets;\na first commitment comprising a first random number and a transaction amount of the transaction;\na second commitment comprising a second random number and a change calculated based on deducting the transaction amount from a total value of the plurality of assets, the transaction amount being encrypted by a public key of the second node;\na third random number encrypted with the transaction amount by the public key of the second node; and\nthe change and a fourth random number encrypted by the public key of the first node:\ndetermining that the transaction amount and the change are each greater than, or equal to, zero;\ndetermining that the total value of the plurality of assets equals a sum of the transaction amount and the change; and\ndetermining that the transaction is valid by determining that the transaction amount is equal to the transaction amount encrypted by the public key of the second node, determining that the first random number is equal to the third random number, and determining that the second random number is equal to the fourth random number.\n8. The non-transitory, computer-readable medium of claim 7, wherein:\nthe third random number is encrypted with the transaction amount by the public key of the second node based upon on a linear deterministic homomorphic encryption (HE) scheme; and\nthe change and a fourth random number are encrypted by the public key of the first node based upon the linear deterministic HE scheme.\n9. The non-transitory, computer-readable medium of claim 7, wherein the transaction data includes one or more range proofs, a zero-knowledge proof (ZKP), and a digital signature generated based on a private key corresponding to the public key of the first node.\n10. The non-transitory, computer-readable medium of claim 9, wherein determining that the transaction amount and the change are each greater than, or equal to, zero is based upon the one or more range proofs.\n11. The non-transitory, computer-readable medium of claim 10, wherein determining that the transaction is valid is based upon the ZKP.\n12. The non-transitory, computer-readable medium of claim 9, further comprising verifying the digital signature based on the public key of the first node.\n13. A computer-implemented system, comprising:\none or more computers; and\none or more computer memory devices interoperably coupled with the one or more computers and having tangible, non-transitory, machine-readable media storing one or more instructions that, when executed by the one or more computers, perform one or more operations comprising:\nreceiving transaction data associated a transaction between a first node and a second node within a blockchain network, the transaction data comprising:\ndata representative of a plurality of assets;\na first commitment comprising a first random number and a transaction amount of the transaction;\na second commitment comprising a second random number and a change calculated based on deducting the transaction amount from a total value of the plurality of assets, the transaction amount being encrypted by a public key of the second node;\na third random number encrypted with the transaction amount by the public key of the second node; and\nthe change and a fourth random number encrypted by the public key of the first node;\ndetermining that the transaction amount and the change are each greater than, or equal to, zero;\ndetermining that the total value of the plurality of assets equals a sum of the transaction amount and the change; and\ndetermining that the transaction is valid by determining that the transaction amount is equal to the transaction amount encrypted by the public key of the second node, determining that the first random number is equal to the third random number, and determining that the second random number is equal to the fourth random number.\n14. The computer-implemented system of claim 13, wherein:\nthe third random number is encrypted with the transaction amount by the public key of the second node based upon on a linear deterministic homomorphic encryption (HE) scheme; and\nthe change and a fourth random number are encrypted by the public key of the first node based upon the linear deterministic HE scheme.\n15. The computer-implemented system of claim 13, wherein the transaction data includes one or more range proofs, a zero-knowledge proof (ZKP), and a digital signature generated based on a private key corresponding to the public key of the first node.\n16. The computer-implemented system of claim 15, wherein determining that the transaction amount and the change are each greater than, or equal to, zero is based upon the one or more range proofs.\n17. The computer-implemented system of claim 16, further comprising:\nverifying the digital signature based on the public key of the first node,\nwherein determining that the transaction is valid is based upon the ZKP.",
    "status": "Active",
    "citations_own": [
        "US5394116A",
        "EP0822683A2",
        "US7240034B1",
        "US20090177591A1",
        "US20090327141A1",
        "US8667292B2",
        "US8731199B2",
        "US20140258027A1",
        "US20150242825A1",
        "US20160055322A1",
        "WO2016049406A1",
        "US20160358165A1",
        "US20170041132A1",
        "US9635000B1",
        "RU2015145232A",
        "US20170346833A1",
        "JP2018007168A",
        "CN107656812A",
        "US20180117446A1",
        "CN108021821A",
        "WO2018087836A1",
        "US20180137512A1",
        "KR101879353B1",
        "US20180219671A1",
        "CN108418689A",
        "CN108418783A",
        "US20180285838A1",
        "CN108764874A",
        "US20180337775A1",
        "RU2674329C2",
        "CN109035029A",
        "CN109039648A",
        "US20190026146A1",
        "US20190165943A1",
        "US20190164153A1",
        "US20190180558A1",
        "US20190229919A1",
        "US20190229921A1",
        "US20190244290A1",
        "US20190251527A1",
        "US20190327078A1",
        "JP2019537348A"
    ],
    "citations_ftf": [
        "CN106549749B",
        "CN107274159A",
        "CN108985933A"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US20180212753A1",
        "US10972251B2",
        "US10728018B2",
        "US11507683B2",
        "US11777729B2",
        "US11196541B2",
        "SG11201913426RA",
        "US11139956B2",
        "US11184437B2",
        "CN111783114A",
        "CN112651740A",
        "US10902133B2",
        "US10817262B2",
        "CN109614820A",
        "AU2018347201B2",
        "AU2018349940B2",
        "US10795644B2",
        "CN110223063B",
        "CN112488703A",
        "US10790990B2",
        "FR3099017B1",
        "CN110505084B",
        "CN110827028B",
        "CN110839028B",
        "CN110958110B",
        "CN110991655B",
        "CN111444541B",
        "CN111401875B",
        "WO2022076352A1",
        "US11601258B2",
        "JPWO2022153377A1",
        "CN112910933B",
        "WO2022236406A1",
        "CN113268777B",
        "CN113592650B",
        "KR102401485B1",
        "US20230245112A1"
    ]
}