{
    "patent_link": "https://patents.google.com/patent/US20090157714A1/en",
    "patent_id": "US20090157714A1",
    "title": "System and method for analyzing and categorizing text",
    "abstract": "A system and method are provided for analyzing elements of text for comparative purposes. Text is provided to the system in an electronic format readable by the system. The system divides the text data into scenes, which may then be compared against a range of various values across a database of scenes from different texts. Data from one text can be used to identify other texts with similar styles, or identify texts with different styles, and to rank those differences on a spectrum. The system may use data from one text to identify other texts that a user may like, and present information about the text to the user in various forms.",
    "inventors": [
        "Aaron Stanton",
        "Brandon Zehm",
        "Paul Kreiner"
    ],
    "assignee": "Apple Inc",
    "classifications": [
        "G06F16/335",
        "G06F16/31",
        "G06F16/334",
        "G06F16/9562",
        "G06F18/22",
        "G06F40/10",
        "G06F40/279",
        "G06V30/224"
    ],
    "claims": "\n1. A method of analyzing text, the method comprising:\nproviding a system capable of electronically receiving and manipulating text data associated with the text;\nproviding a database that is comprised of data relative to one or more reference texts; said system being enabled to electronically access said database;\nusing said system to recognize the text data as one or more scenes and a plurality of boundaries;\nusing said system to analyze said one or more scenes and identify one or more elements of the text within said one or more scenes; and\ncompiling the identified one or more elements of text within said one or more scenes to provide a bookmark that is a measured representation of the text.\n2. The method of claim 1 further comprising:\nproviding a database that is comprised of data relative to one or more reference texts; said system being enabled to electronically access said database;\ncomparing said measured representation of the text with said data relative to one or more reference texts to identify similarities between the text and said one or more reference texts.\n3. The method of claim 2 further comprising:\nranking differences between the text and said one or more reference texts on a spectrum.\n4. The method of claim 1 wherein the text is a printed text, the method further comprising:\nscanning the text into a text data format that is readable by a computer device.\n5. The method of claim 1 wherein said boundaries are comprised of natural boundaries.\n6. The method of claim 1 wherein said boundaries are comprised of predetermined length boundaries.\n7. The method of claim 1 wherein said one or more elements of text include at least one of: the subtypes of verbs; total number of verbs; total number of adjectives; total number of adverbs; total number of nouns; types of punctuation; total number of prepositions; total number of conjunctions; total number of interjections; total number of modifiers; total number of predeterminers; total number of pronouns; total number of particles; or total number of symbols; paragraph length; number of paragraphs; amount of content within dialog; amount of content outside of dialog; word length; total text length; sentence length: ratio of commas to sentence length; total number of unique words; type of vocabulary; total number of non-English words; and total number of words containing unusual characters.\n8. The method of claim 1 wherein said bookmark is a perspective bookmark complied by counting a number of first person indicators within dialog containing sentences within said one or more scenes.\n9. The method of claim 1 wherein said bookmark is a pacing bookmark compiled by the detection and analysis of pacing factors within said one or more scenes\n10. The method of claim 8 wherein said pacing factors comprise analysis of paragraph length and amount of dialog exchange between multiple characters.\n11. The method of claim 9 wherein said pacing factors further comprise analysis of sentence length, scene length and punctuation.\n12. The method of claim 1 wherein said bookmark is a density bookmark compiled by an analysis of said one or more scenes for at least one of: word length; vocabulary, sentence length, and amount of punctuation.\n13. The method of claim 1 wherein said bookmark is a dialog bookmark compiled by quantifying an amount of dialog within said one or more scenes spoken by a character.\n14. The method of claim 1 wherein said bookmark is a description bookmark compiled by a quantification and analysis of adjectives and adverbs within said one or more scenes.\n15. The method of claim 1 wherein said bookmark is an action bookmark compiled by analyzing a ratio of verbs to total word count within said one or more scenes.\n16. The method of claim 1 wherein said bookmark is a rating bookmark compiled by an analysis of user feedback, relative to user opinion of one or more reference texts, received by said system.\n17. The method of claim 16 wherein said user feedback is comprised of data received directly from a user, by the user providing responsive feedback.\n18. The method of claim 16 wherein said user feedback is comprised of data generated by said system though said system analyzing data generated by a user during user interaction with said system.\n19. The method of claim 1 wherein said bookmark is a cumulative bookmark that is representative of a plurality of scenes within the text.\n20. The method of claim 1 wherein said system compiles the identified one or more elements of text within said one or more scenes to provide a plurality of bookmarks that are different from one another as measured representations of the text.\n21. The method of claim 20 further comprising:\nproviding a database that is comprised of data relative to one or more reference texts; said system being enabled to electronically access said database;\nproviding the system with a user-defined hierarchal ranking of said plurality of bookmarks; and\ncomparing said plurality of bookmarks, according to said user-defined hierarchal ranking, with said data relative to one or more reference texts to identify similarities or differences between the text and said one or more reference texts.\n22. The method of claim 20 further comprising:\nproviding a database that is comprised of data relative to one or more reference texts; said system being enabled to electronically access said database;\nproviding the system with bookmark data from a user-created or user-selected source; and\ncomparing said bookmark data from the user-created or user-selected source with said data relative to one or more reference texts to identify one or more of said reference texts with an intersection of bookmark data, irrespective of a hierarchal order of said bookmark data.\n23. The method of claim 1 further comprising:\nproviding a database that is comprised of data relative to one or more reference texts; said system being enabled to electronically access said database;\ncreating a user account on said system; said user account comprising information relative to one or more user preferences; and\ncomparing said user preferences with said data relative to one or more reference texts to identify one or more reference texts that embody one or more of said user preferences.\n24. The method of claim 23 further comprising;\ncollecting information relative to one or more user preferences during a plurality of separate periods, spaced apart from one another over time,\n25. The method of claim 7 wherein said bookmark is a comparison of two or more of the elements identified within claim 7.\n26. The method of claim 1 wherein said bookmark is personalized to a user's preferences by:\nproviding the text data as data relative to a plurality of user selected reference texts;\nusing said system to identify one or more elements within each of the user selected reference texts; and\nusing the system to compare said plurality of user selected reference texts by identifying variations in said one or more elements among said plurality of user selected reference texts; and\nproviding cumulative scores for said one or more elements of text to provide a personalized bookmark.\n27. The method of claim 26 further comprising:\ncalculating a standard deviation for the cumulative scores for said one or more elements of text within said personalized bookmark; and\nordering the cumulative scores for said one or more elements of text within said personalized bookmark according to a size of the calculated standard deviations.",
    "status": "Active",
    "citations_own": [
        "US6014663A",
        "US6094632A",
        "US20020099730A1",
        "US6493702B1",
        "US20030028566A1",
        "US20040006457A1",
        "US20040107102A1",
        "US20040205461A1",
        "US20040218838A1",
        "US20050022106A1",
        "US20050028098A1",
        "US20050149965A1",
        "US20060120627A1",
        "US20060184566A1",
        "US7142318B2",
        "US20070067289A1",
        "US7272594B1",
        "US20070218450A1",
        "US20080059452A1",
        "US7360151B1",
        "US20080208857A1",
        "US20080208864A1",
        "US20090024963A1",
        "US7490287B2",
        "US7506246B2",
        "US20090083032A1",
        "US20090110268A1",
        "US7809724B2",
        "US20100268526A1",
        "US7873657B2"
    ],
    "citations_ftf": [
        "US5132900A",
        "JPH0594537A",
        "US5696965A",
        "US5758257A",
        "US6480852B1",
        "US6560640B2",
        "US7603268B2",
        "US7672022B1",
        "GB0209563D0",
        "GB2390704A",
        "US20080177994A1",
        "EP2270465B2",
        "CA2443447A1",
        "US7523096B2",
        "US20070300142A1",
        "US7984372B2",
        "US7809548B2",
        "US8346620B2",
        "US20060080315A1",
        "WO2006047654A2",
        "US7328214B2",
        "US7386569B2",
        "US7433866B2",
        "US9880995B2",
        "US7533088B2",
        "CA2550532A1",
        "US9715542B2",
        "DE102005040251A1",
        "US20070147654A1",
        "KR20080096761A",
        "US7852499B2",
        "US8321197B2",
        "US8090222B1",
        "WO2008073053A1",
        "US7877343B2",
        "US7779079B2",
        "US20090024385A1",
        "US20090037271A1",
        "WO2009026193A2",
        "US8868562B2",
        "US8280885B2",
        "US8154778B2",
        "US7921071B2",
        "FI124000B",
        "US20090313540A1",
        "US8024324B2",
        "US8352857B2",
        "JP2010154397A",
        "US8447760B1",
        "US8880537B2",
        "US20130166303A1",
        "US20130041876A1",
        "US10380629B2",
        "US9129296B2",
        "US9098532B2",
        "US9535899B2",
        "US9996504B2",
        "US9336306B2",
        "US20150339616A1",
        "US10248639B2"
    ],
    "citedby_own": [
        "US20080318563A1",
        "US20100179930A1",
        "US20110258560A1",
        "US8515972B1",
        "US8572073B1",
        "EP2658212A1",
        "US8589434B2",
        "US20130332441A1",
        "US20140075299A1",
        "US8745056B1",
        "US8752184B1",
        "US20140236573A1",
        "US20140324587A1",
        "US8892171B2",
        "US20140344174A1",
        "US20150105146A1",
        "US20150242815A1",
        "US20150309965A1",
        "US9256343B1",
        "US9311294B2",
        "US20160364998A1",
        "US9628573B1",
        "US20170148337A1",
        "CN106789227A",
        "US20170220692A1",
        "US20170221084A1",
        "US9747275B1",
        "US9754288B2",
        "US20170287355A1",
        "US9786268B1",
        "US20180247228A1",
        "US20190205460A1",
        "US10678771B1",
        "US10996827B2",
        "US11093507B2",
        "US20210256543A1",
        "US11100557B2",
        "US11128720B1",
        "US20210319461A1",
        "US11176959B2",
        "US20210374329A1",
        "US11263240B2",
        "US20220417192A1",
        "US11645317B2",
        "US11709875B2"
    ],
    "citedby_ftf": [
        "US8423349B1",
        "US8706644B1",
        "US8706643B1",
        "US8768852B2",
        "US9569770B1",
        "US9298700B1",
        "US10007712B1",
        "US8799658B1",
        "US8332415B1",
        "US8725495B2",
        "US9098312B2",
        "US8909641B2",
        "US9576046B2",
        "US9734132B1",
        "US8818788B1",
        "US9015089B2",
        "US9208509B1",
        "US9870713B1",
        "US9569535B2",
        "US9483452B2",
        "US8621244B1",
        "US10373194B2",
        "JP6285010B2",
        "US11061973B2",
        "US9424597B2",
        "US10453079B2",
        "US9762637B2",
        "US10313410B2",
        "WO2015143416A1",
        "US9467533B2",
        "US9961058B2",
        "US9462085B2",
        "US9560170B2",
        "US10025942B2",
        "US9350812B2",
        "US9350791B2",
        "CN106294489B",
        "US10671618B2",
        "CN107968703B",
        "CN110377708B",
        "JP7354750B2",
        "CN111061838B",
        "US11269969B1",
        "US11521409B2"
    ]
}