{
    "patent_link": "https://patents.google.com/patent/US4517468A/en",
    "patent_id": "US4517468A",
    "title": "Diagnostic system and method",
    "abstract": "A diagnostic system wherein a central diagnostic center receives sensor data relative to the operating condition of a plurality of remote plants. Each plant records just certain sensor signals and transmits them at respective prescheduled transmisssion times. If certain activation limits are exceeded, a data link with the diagnostic center is immediately established so that the data may be transmitted ahead of its normally scheduled transmission time in order that an immediate diagnostic analysis be made on the plant. A communication link between the plant and diagnostic center is kept open for a predetermined period of time in which more data may be sent from the plant to the diagnostic center, and results and instructions, sent from the diagnostic center back to the plant. Such instructions may include the changing of certain parameters in the examination of the sensor signals.",
    "inventors": [
        "Christian T. Kemper",
        "Robert L. Osborne",
        "James C. Bellows"
    ],
    "assignee": "CBS Corp",
    "classifications": [
        "G06F17/00",
        "G06F11/2294",
        "G05B23/027"
    ],
    "claims": "\n1. A diagnostic system for monitoring a process at a first location, said process including a plurality of sensors generating output signals related to operating conditions of the process, comprising:\n(A) first data storage means at said first location;\n(B) first computer means at said first location operable to periodically scan said sensor output signals and place into said first data storage means those signals which exhibit a predetermined difference from its value from a previous scan and those signals which exceed respective predetermined threshold values;\n(C) a diagnostic center at a second location remote from said first location and including second data storage and second computer means operable to perform diagnostic analysis;\n(D) first transmitter/receiver means, under control of said first computer means, for transmitting the contents of said first data storage means, via a data link, to said diagnostic center at predetermined scheduled periods of time and for transmitting said contents at an unscheduled period of time whenever a signal exceeds its predetermined threshold;\n(E) said diagnostic center including second transmitter/receiver means, under control of said second computer means to receive data sent from said first location whereby said second computer means may perform said diagnostic analysis;\n(F) said second transmitter/receiver means being additionally operable to transmit, via said data link, information resulting from said analysis back to said first transmitter/receiver means;\n(G) said first transmitter/receiver means being additionally operable to receive said transmitted information.\n2. A system according to claim 1 which includes:\n(A) display means at said first location for displaying said received transmitted information.\n3. A system according to claim 1 wherein:\n(A) said contents of said first data storage means are transmitted upon the occurrence of a sensor signal exceeding a predetermined level threshold value.\n4. A system according to claim 3 wherein:\n(A) said first computer means is operable to assign a new level threshold value when an old level threshold value is exceeded.\n5. A system according to claim 1 wherein:\n(A) said contents of said first data storage means are transmitted upon the occurrence of a sensor signal exceeding a predetermined rate threshold.\n6. A system according to claim 5 wherein:\n(A) said rate threshold is greater than said predetermined difference.\n7. A system according to claim 1 wherein:\n(A) said first computer means is operable to change said predetermined difference in accordance with an instruction from said second computer means.\n8. A system according to claim 1 wherein:\n(A) said data link is kept open for a predetermined period of time if the results of said diagnostic analysis indicates an abnormal condition.\n9. A system according to claim 8 wherein:\n(A) said predetermined period of time in which said data link is kept open is less than the time period between scheduled transmissions of the contents of said first data storage means.\n10. A system according to claim 8 wherein:\n(A) said data link means is automatically terminated if no new data has been transmitted during said predetermined period of time that said data link is kept open.\n11. A system according to claim 1 wherein:\n(A) the results of said diagnostic analysis are first displayed at said second location prior to being transmitted back to said first location.\n12. A system according to claim 1 wherein:\n(A) said process is the generation of electricity; and\n(B) said process includes at least one generator, an exciter for supplying excitation current to said generator and a steam turbine for driving said generator.\n13. A system according to claim 12 which includes:\n(A) a plurality of sensors for measuring the operating condition of said generator;\n(B) a plurality of sensors for measuring the operating condition of said exciter; and\n(C) a plurality of sensors for measuring the operating condition of said steam turbine.\n14. A system according to claim 1 which includes:\n(A) one or more other locations each remote from said diagnostic center;\n(B) each said other location including\n(i) data storage means;\n(ii) computer means operable to periodically scan the sensor output signals at that location and place into its data storage means those signals which exhibit a predetermined difference from its value from a previous scan and those signals which exceed respective predetermined threshold values; and\n(C) transmitter/receiver means, under control of said computer means for transmitting the contents of said data storage means, via a data link, to said diagnostic center at predetermined scheduled periods of time and for transmitting said contents at an unscheduled period of time whenever a signal exceeds its predetermined threshold.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3882305A",
        "US4305129A",
        "US4328556A",
        "US4410950A",
        "US4417336A"
    ],
    "citations_ftf": [
        "JPS4516007Y1",
        "CA969657A",
        "US4287567A",
        "JPS57162000A",
        "JPS6047918A"
    ],
    "citedby_own": [
        "US4568909A",
        "US4642782A",
        "US4644479A",
        "EP0220666A2",
        "EP0225115A2",
        "EP0229719A2",
        "US4697278A",
        "US4707796A",
        "US4752697A",
        "US4754410A",
        "US4755925A",
        "US4794544A",
        "US4839822A",
        "US4853946A",
        "US4908775A",
        "US4908778A",
        "US4916628A",
        "US4972453A",
        "US4985857A",
        "US4989146A",
        "US5034893A",
        "US5060279A",
        "US5099438A",
        "US5101337A",
        "US5132920A",
        "US5274572A",
        "US5287505A",
        "US5293323A",
        "US5321837A",
        "US5329465A",
        "US5349674A",
        "US5414798A",
        "US5490089A",
        "US5608845A",
        "US5700090A",
        "US5746511A",
        "US5828567A",
        "US5845272A",
        "US5956663A",
        "US6017143A",
        "US6047220A",
        "US6115681A",
        "US6144954A",
        "US6175934B1",
        "WO2001033513A1",
        "US6256664B1",
        "EP1113366A2",
        "US6263265B1",
        "US6263362B1",
        "US6286479B1",
        "US6298308B1",
        "US6298454B1",
        "US6324659B1",
        "US6336065B1",
        "US6338152B1",
        "US20020022894A1",
        "US20020029086A1",
        "US6356191B1",
        "US6363330B1",
        "US6370448B1",
        "US20020065884A1",
        "US20020065698A1",
        "US6405108B1",
        "US20020077711A1",
        "US6411678B1",
        "US6434504B1",
        "US6446026B1",
        "US6449574B1",
        "US20020128731A1",
        "US6473710B1",
        "US20020170002A1",
        "US6487478B1",
        "US20020183866A1",
        "US6494617B1",
        "US6505517B1",
        "US20030014462A1",
        "US6513024B1",
        "US20030028268A1",
        "US6519546B1",
        "US20030055666A1",
        "US6539267B1",
        "US6543007B1",
        "US6556145B1",
        "US6601005B1",
        "US20030154051A1",
        "US6611775B1",
        "US6615149B1",
        "US6615367B1",
        "US6622067B1",
        "US6622264B1",
        "US6625500B1",
        "US6625589B1",
        "US6629059B2",
        "US6633782B1",
        "US6633784B1",
        "US6636771B1",
        "US6643801B1",
        "US6647415B1",
        "US6651034B1",
        "US6654697B1",
        "US20040024568A1",
        "US20040025082A1",
        "US6701274B1",
        "US20040064225A1",
        "EP1412929A2",
        "US6735484B1",
        "US6742141B1",
        "US6754601B1",
        "US6772036B2",
        "US6778893B2",
        "US6795935B1",
        "US20040210380A1",
        "US20040233859A1",
        "US20040249583A1",
        "US20050011278A1",
        "US20050027845A1",
        "US20050096759A1",
        "EP1533479A2",
        "US6907383B2",
        "US20050157654A1",
        "US6920799B1",
        "US20050171661A1",
        "US20050210337A1",
        "US6970003B2",
        "US20050286685A1",
        "US20060042278A1",
        "US7018800B2",
        "US20060078859A1",
        "US20060095394A1",
        "US7046180B2",
        "US7085610B2",
        "US20060282580A1",
        "US20070010968A1",
        "US7221988B2",
        "US7246150B1",
        "US7272531B2",
        "US20070223568A1",
        "US7277919B1",
        "US20080010352A1",
        "US7321846B1",
        "US20080075012A1",
        "US7363368B2",
        "US20080125884A1",
        "US7383191B1",
        "US20080215291A1",
        "US20090045626A1",
        "US7516208B1",
        "US7523667B2",
        "US7557702B2",
        "US20090187303A1",
        "US7590511B2",
        "US7627441B2",
        "US7702401B2",
        "US7750642B2",
        "US20100192005A1",
        "US20100288054A1",
        "US7940189B2",
        "US7949495B2",
        "US7953501B2",
        "US8005647B2",
        "WO2011134589A1",
        "US8055479B2",
        "US8073967B2",
        "US8275577B2",
        "US8290721B2",
        "US8301676B2",
        "US8311774B2",
        "US8417595B2",
        "CN103116537A",
        "US8560474B2",
        "US8560903B2",
        "US8898036B2",
        "US8964338B2",
        "US8974573B2",
        "DE102014200357B3",
        "US20150142677A1",
        "US9052240B2",
        "US9121407B2",
        "US9140728B2",
        "US9201420B2",
        "US9207129B2",
        "US9207670B2",
        "US9285802B2",
        "US9310439B2",
        "US9310094B2",
        "CN106024078A",
        "US9551504B2",
        "US9602122B2",
        "US9638436B2",
        "US9765979B2",
        "US9803902B2",
        "US9823632B2",
        "US9885507B2",
        "US9927788B2",
        "US10295965B2",
        "EP3303889B1"
    ],
    "citedby_ftf": [
        "JPH083747B2",
        "GB2339277B",
        "JP4242335B2",
        "CN104104292B",
        "CN105811822B"
    ]
}