{
    "patent_link": "https://patents.google.com/patent/US4761748A/en",
    "patent_id": "US4761748A",
    "title": "Method for validating the value of a parameter",
    "abstract": "The method according to the invention consists of sampling, at successive times separated by constant or non-constant time intervals, signals supplied by redundant channels measuring or calculating the parameter and validating a value of said parameter, as a function of a sample of N values of each channel, in which N≧2. In a preferred manner, each sample of N values is modeled by a straight line using the method of least squares and the validated value of the parameter is worked out as a function of the inter-coherent models.",
    "inventors": [
        "Guy Le Rat",
        "Jean-Marc Lagache"
    ],
    "assignee": "Areva NP SAS",
    "classifications": [],
    "claims": "\n1. A signal validation method for generating a reliable signal from a plurality of redundant received signals, comprising the following steps:\nsimultaneously measuring samples of each of said received signals;\nmemorizing the values of the last N samples (N≧2) of each received signal;\ndetermining a plurality of model functions corresponding to the N memorized samples for each of said received signals, said model functions being defined as a plurality of parameters representing an approximate function for said N memorized samples;\ncalculating a dispersion coefficient representing the difference between each sample of the N memorized samples and a sample, determined by the model functions;\nvalidating said model functions by comparing said dispersion coefficient with a predetermined dispersion threshold, said model function being valid if said dispersion coefficient is smaller than said predetermined dispersion threshold; and\ngenerating said reliable signal by determining a value for a sample of said reliable signal as a function of at least some of said valid model functions.\n2. A signal validation method according to claim 1, wherein said approximate function is a straight line, the parameters of said approximate function being the slope and the ordinate at the origin, said parameters having values determined by the least square method.\n3. a signal validation method according to claim 2, comprising the further steps;\nfor each model function which is not valid, discarding from the N memorized samples of a respective received signal a sample having the greatest deviation from a sample determined by said model function;\ndetermining a new model function corresponding to a remaining N-1 memorized samples of said received signal;\ncalculating a new dispersion coefficient representing the deviation between each sample of the set of remaining N-1 samples and samples determined by the model function; and\ncomparing said new dispersion coefficient with said predetermined dispersion threshold, said new model function being called valid if said new dispersion coefficient is smaller than said predetermined dispersion threshold.\n4. A signal validation method according to claim 2 further comprising:\nfor each model which is not valid, discarding from the N memorized sample of a respective received signal the sample for which the difference between the value of said sample and the mean value of the samples of said N memorized samples function is the greatest;\nreplacing said discarded sample by a sample whose value is equal to said means value, to produce a set of modified N memorized samples;\ndetermining a new model function for the modified N memorized samples set;\ncalculating a new dispersion coefficient representing the deviation between each sample of said modified N memorized samples and samples determined by the model function; and\ncomparing said new dispersion coefficient with said predetermined dispersion threshold, said new model function being called valid if said new dispersion coefficient is smaller than said predetermined dispersion threshold.\n5. A signal validation method according to claim 1, further comprising testing the coherence of the valid model functions of the different received signals, and determining the value of a sample of the reliable signal as a function of the coherent valid model functions.\n6. A signal validation method according to claim 5, wherein said coherence is tested by measuring at least one of either drift, bias, noise or saturation of the valid models.\n7. A signal validation method according to claim 6 wherein:\nthe model function for each of the received signals is determined as a straight line, the slope and the ordinate at the origin being determined with relation to the set of N memorized samples of a respective received signal according to the least square method; and\nthe difference of the slopes of two model functions and a predetermined drift threshold, for each pair of model functions, are compared and the valid model functions having slopes exceeding said threshold corresponding to a drifted received signal are discarded when determining the value of the sample of the reliable signal.\n8. A signal validation method according to claim 7, wherein at each sample time, a reliable signal model function is determined, said reliable signal model function being a straight line whose slope is equal to the mean value of the slopes of the valid, coherent model functions for the received signals, and whose ordinate at the origin is the mean value of the ordinate at the origin of said valid, coherent model functions for the received signals.\n9. A signal validation method according to claim 8, wherein at each sampling time, the number of valid, coherent model functions is determined and compared with a predetermined number, a new reliable signal model function being determined if said number is equal or exceeds said predetermined number and the reliable signal model function determined at the previous sampling time being retained if said number is below said predetermined number.\n10. A signal validation method according to claim 6 wherein:\nthe model function for each of the received signals is a straight line, the slope and the ordinate at the origin being determined with relation to the set of N samples of a respective received signal according to the least square method;\na comparison is done between the difference of the ordinate at the origin of two model functions and a predetermined drift threshold to determine which model functions are biased for each pair of model functions, and the valid model functions corresponding to a biased received signal are discarded when determining the value of the sample of the reliable signal.\n11. A signal validation method according to claim 8, wherein when, at a sampling time, the number of valid coherent model functions for the received signals is below a predetermined number, the value of the sample of the reliable signal at said sampling time is equal to the value, at said sampling time, of a reliable signal model function determined at a previous sampling time.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US3476922A",
        "US3976860A",
        "US4276648A",
        "DE3011892A1",
        "US4472806A",
        "US4520483A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4908775A",
        "US4937763A",
        "US4956791A",
        "US5023816A",
        "US5107447A",
        "US5233542A",
        "US5339257A",
        "US5469447A",
        "US5715178A",
        "US6119111A",
        "US6356857B1",
        "US20020055826A1",
        "US6415246B1",
        "US20020087290A1",
        "US20020133320A1",
        "US20030055607A1",
        "US6556939B1",
        "US6609036B1",
        "US20040002776A1",
        "US6775641B2",
        "US20050210337A1",
        "US6957172B2",
        "DE102004040282A1",
        "US20080168339A1",
        "US20090113332A1",
        "US7539597B2",
        "FR2932881A1",
        "US20100174157A1",
        "US20100287066A1",
        "US7970722B1",
        "US8275577B2",
        "US8311774B2",
        "US8600915B2",
        "US8615282B2",
        "US8719196B2",
        "US20140142877A1",
        "US8777853B2",
        "US8792955B2",
        "US9247900B2",
        "US9986942B2",
        "US10610137B2",
        "US11432772B2",
        "US11559260B2",
        "US11562137B2",
        "US11589823B2"
    ],
    "citedby_ftf": []
}