{
    "patent_id": "US-2018165585-A1",
    "title": "Method for Providing Procurement Related Cognitive Insights Using Blockchains ",
    "assignee": "Cognitive Scale, Inc.",
    "publication_date": "2018-06-14",
    "patent_link": "https://patents.google.com/patent/US20180165585A1/en",
    "inventors": [
        "Manoj Saxena",
        "Matthew Sanchez",
        "Richard Knuszka"
    ],
    "classifications": [
        "G06N5/041",
        "G06F17/30867",
        "G06F17/3097",
        "G06F21/00",
        "G06N99/005",
        "G06Q30/0269",
        "G06N20/00",
        "G06Q50/01"
    ],
    "abstract": "A method, system and computer-usable medium for providing cognitive insights comprising receiving data from a plurality of data sources, at least some of the plurality of data sources comprising procurement related data sources and blockchain data sources; processing the data from the plurality of data sources to provide a cognitively processed procurement-related, blockchain-associated insight; and, providing the cognitively processed procurement-related, blockchain-associated insight to a destination.",
    "claims": "\n1. A method for providing procurement related cognitive insights comprising:\nreceiving data from a plurality of data sources, at least some of the plurality of data sources comprising procurement related data sources and blockchain data sources;\nprocessing the data from the plurality of data sources to provide a cognitively processed procurement-related, blockchain-associated insight; and,\nproviding the cognitively processed procurement-related, blockchain-associated insight to a destination.\n2. The method of claim 1, further comprising:\nperforming a single step procurement operation using the cognitively processed procurement-related, blockchain-associated insight.\n3. The method of claim 1, further comprising:\nperforming a learning operation to iteratively improve the cognitively processed procurement-related, blockchain-associated insight over time.\n4. The method of claim 1, wherein:\nthe plurality of data sources comprise at least one of situational data sources and temporal data sources, the situational data sources comprising a procurement related situational data source, the temporal data sources comprising a procurement related temporal data source; and,\nthe blockchain data comprises procurement related blockchain transaction data.\n5. The method of claim 1, wherein:\nthe cognitively processed procurement-related, blockchain-associated insight is associated with a procurement compliance requirement.\n6. The method of claim 1, wherein:\nthe cognitively processed procurement-related, blockchain-associated insight relates to at least one of a sourcing operation, a contract management operation, supplier management operation, procure-to-pay operation, a spend analysis operation, a strategic planning operation and a risk and compliance operation.",
    "status": "Abandoned",
    "citations_own": [
        "US20150356440A1",
        "US20170053295A1",
        "US20170193619A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "CN109118219A",
        "CN109146024A",
        "CN109377367A",
        "CN109408716A",
        "CN109447809A",
        "US10320662B1",
        "CN110383791A",
        "CN110473022A",
        "US10530780B2",
        "US10579440B2",
        "CN111415213A",
        "WO2020092446A3",
        "US10817356B2",
        "US10938817B2",
        "WO2021218778A1",
        "US11210640B2",
        "US11216750B2",
        "US20220261722A1",
        "US20220292769A1",
        "US11494836B2",
        "US11544782B2",
        "US11550299B2",
        "WO2023049348A1",
        "US11731577B2",
        "US11810027B2"
    ],
    "citedby_ftf": []
}