{
    "patent_link": "https://patents.google.com/patent/US20080027880A1/en",
    "patent_id": "US20080027880A1",
    "title": "Investment chart-based interactive trade simulation training and game system",
    "abstract": "An investment chart based interactive trade simulation and game system is provided. The system uses a computer or other computing device, real historical data, and a computer program to dynamically recreate the investment charts of any moment back to any date in the history, as long as the historical data exists. It interacts with players to dynamically recreate the real market environment in the history, and allows them to make investment decisions as though the market were today's market. The system can simulate any market, such as stock, bond, currency, and commodity markets, and any investment vehicle, such as options and futures.",
    "inventors": [
        "Dan Yu"
    ],
    "assignee": "Individual",
    "classifications": [
        "G06Q40/00",
        "A63F13/65",
        "G06Q40/06",
        "A63F2300/575",
        "A63F2300/69",
        "A63F2300/8094"
    ],
    "claims": "\n1. An investment chart based interactive trade simulation training and game method, said simulation training and game method comprising the steps of:\nusing at least one computer;\nusing at least one database accessible by the computer, wherein the database comprises real historical information for a plurality of investments, and wherein the database optionally comprises simulation settings for the investments;\nexecuting software on the computer that generates a simulation interface displayed on one or more screens, and wherein the simulation interface comprises one or more investment charts using the real historical data from the database; and\nproviding one or more users or players the ability to interact with the simulation interface and execute investment decisions within one or more simulated investment markets, wherein the investment markets are simulated based on the historical data.\n2. The method of claim 1, wherein the computer is a personal computer, a video game device, a network server, or a hand-held computing or communication device.\n3. The method of claim 1, further comprising:\nproviding only one key investment symbol representing settings of a simulation predefined in a Simulation Setting Method;\nwherein the key investment symbol may be selected by a player.\n4. The method of claim 1, further comprising:\nproviding a start date for the simulation, which may be selected by a player;\nwherein the start date is: 1) randomly selected by the simulation and game system; 2) specified by the player; 3) specified in one or more files selected by the player; or 4) predefined in the simulation and game system.\n5. The method of claim 1, further comprising:\nproviding a separate trading account and a saving account for the player, wherein funds may be transferred between the two accounts.\n6. The method of claim 1, further comprising:\nproviding a charting method that optionally hides prices and dates on the investment chart(s) from the player during the simulation.\n7. The method of claim 1, further comprising:\nproviding a Compressed Time Simulation Method, which allows for the simulation of investment(s) been conducted, but in a compressed manner with respect to time.\n8. The method of claim 7, wherein the Compressed Time Simulation Method causes the simulated investment market to run at X minutes of historical market time per one second of real time, where X could be any number range from 1 to 1440.\n9. The method of claim 1, further comprising:\nproviding a General Trading Method of Investments and a General Trading Method of Investment Vehicles, which allow a player to trade any investment through any investment vehicle in a unified and simplified manner.\n10. The method of claim 9, wherein the General Trading Method of Investment Vehicles comprises the steps of:\noptionally choosing a trading vehicle by a player;\nchoosing buy or sell of the selected trading vehicle for a trade by a player and further choosing a position to sell if sell is chosen and the player has more than one position;\noptionally deciding a money amount used to buy or a money amount reclaimed for sell by the player;\noptionally executing a buy or sell choice or confirming an order by a player;\nwherein the method steps may be applied to any investment vehicle.\n11. The method of claim 10, further comprising:\nproviding a Trade Engine to select an appropriate specific trade engine to handle the specific trading details of the selected trading vehicle;\n12. The method of claim 10, wherein the General Trading Method of Investment Vehicles could be applied to a new investment vehicle that might be created in the future by creating a new trade engine for the new investment vehicle and plugging it into a Trade Engine of the simulation and game method.\n13. The method of claim 10, wherein none, one, two or three of the optional steps are performed.\n14. The method of claim 10, wherein the amount to buy or amount reclaim for sell is expressed as an amount of money, a percentage of money available, or a percentage of an available amount of a position.\n15. The method of claim 1, further comprising:\nproviding a Visualized Setting Method for a player to set orders, warnings, conditions, and triggers directly on the investment charts.\n16. The method of claim 1, further comprising:\nproviding an Auto-recoding and Playback Method to automatically record the player's trade operations during the simulation.\n17. The method of claim 1, further comprising:\nproviding an Unlimited Investments Simulation Method to simulate multi-investments at the same time.\n18. The method of claim 17, further comprising:\nproviding a synchronized simulation for all investments simulated.\n19. The method of claim 1, further comprising:\nproviding a Missing Data Handling Method to smoothly handle many complicated situations resulting from missing data.\n20. The method of claim 1, further comprising a single investment simulation with daily investment chart method that uses limited historical data of an investment to simulate the market of that investment;\nwherein the limited historical data is a set of daily historical data and the daily historical data comprises the price of open, close, high, low and optionally the volume of one trading day.\n21. The method of claim 1, further comprising a single investment simulation with daily investment chart and intraday investment chart method that uses detailed historical data of an investment to simulate the market of that investment;\nwherein the detailed historical data is a set of daily historical data and a set of intraday data.\n22. The method of claim 1, further comprising a multi-investments simulation with daily investment chart method that uses limited historical data of the investments to simulate the markets of those investments;\nwherein the limited historical data is a sets of daily historical data and the daily historical data comprises the price of open, close, high, low and optionally the volume of one trading days.\n23. The method of claim 1, further comprising a multi-investments simulation with daily investment chart and intraday investment chart method that uses detailed historical data of the investments to simulate the markets of those investments;\nwherein the detailed historical data is a set of daily historical data and a set of intraday data of those investments.\n24. The method of claim 1, further comprising an on-line investment simulation competition method, wherein the on-line investment simulation competition method comprises the steps of:\nproviding an investment simulation that simulates one or more investments for which trading can occur with at least one investment chart;\nproviding an online chatting method to allow a player to chat with other players all over the world;\nallowing a player to start a competition or join a started competition; and\nproviding a score board to dynamically display the changing money other players earned throughout the competition.\n25. The method of claim 24, wherein the method is a synchronous online investment simulation competition by using a Synchronous Competition Method.\n26. The method of claim 24, wherein the method is an asynchronous online investment simulation competition by using an Asynchronous Competition Method.\n27. The method of claim 1, further comprising a 2-in-1 investment simulation and video game method, wherein the 2-in-1 investment simulation and video game method comprises the steps of:\nproviding an investment simulation that simulates one or more investment markets for which trading can occur with at least one investment chart; and\nproviding a video game in which players win or lose based on their performance in the investment simulation.\n28. An investment chart based interactive trade simulation training and game system, said system comprising:\none or more computers;\none or more databases accessible by the compute(s); wherein the databases have real historical information for a plurality of investments, and wherein the databases optionally comprise simulation settings for the investments;\nan optional internet connection that enables the system to work on-line and a player to communicate with other people all over the world;\nsoftware executing on the computer(s) to generate a simulation interface displayed on one or more screens, and wherein the simulation interface comprises one or more investment charts using the real historical data from the database; and\nwherein the system permits one or more users or players to interact with the simulation interface and execute investment decisions within one or more simulated investment markets, wherein the investment markets are simulated based on the historical data.\n29. The system of claim 28, wherein the computer is a personal computer, video game device, network server, or hand-held computing or communication device.\n30. The system of claim 28, wherein the system simulates investments in a compressed manner with respect to time.\n31. The system of claim 28, wherein the system simulates investments in a compressed manner with respect to time which causes the simulated investment markets to run at X minutes of historical market time per one second of real time, where X can be any number ranging from 1 to 1440.\n32. The system of claim 28, wherein the system simulates investments with a start date, wherein the start date is: 1) randomly selected by the system; 2) specified by a player; 3) specified in a file selected by the player; or 4) predefined in the system.\n33. The system of claim 28, wherein the system displays investment data in a form of one or more investment charts on one or more display screens, wherein the system optionally conceals prices and dates on the investment charts from the player during the simulation.\n34. The system of claim 28, further comprising a Simulation Setting System; wherein the Simulation Setting System collects the following information:\na main symbol for the simulation to be defined;\na simulation mode for the simulation to be defined;\nscreen definitions if multi-investments simulation is involved, which are provided with the help of a Multi-screens Definition System;\nsettings for different investment vehicles if multi-investment vehicles are involved in the simulation; and\nparameters for trading.\n35. The system of claim 34, wherein the Multi-screens Definition System defines one or more screens by collecting the following information:\na screen ID number for each screen to be defined;\na screen name for each screen to be defined;\ninvestment symbols and their layout on the screen for each screen to be defined; and\noptionally collecting the above information for each screen to define more screens.\n36. The system of claim 28, wherein the software comprises instructions for:\nproviding a separate trading account and a saving account for the player, wherein funds may be transferred between the two accounts.\n37. The system of claim 28, wherein the system further comprises a General Trading System of Investments and a General Trading System of Investment Vehicles, which allow a player to trade any investment through any investment vehicle in a unified and simplified manner.\n38. The system of claim 37, wherein the General Trading System of Investment and General Trading System of Investment Vehicles allows a player to trade any investment through any investment vehicle by the following steps:\noptionally choosing a trading vehicle;\nchoosing buy or sell of the selected trading vehicle for a trade by a player and further choosing a position to sell if sell is chosen and the player has more than one position;\noptionally deciding a money amount used to buy or a money amount reclaimed for sell;\noptionally executing a buy or sell choice or confirming an order;\nwherein none, one, two or three of the optional steps are performed.\n39. The system of claim 38, wherein the amount to buy or amount reclaim for sell is expressed as an amount of money, a percentage of money available, or a percent of an available amount of a position.\n40. The system of claim 37, wherein the General Trading System of Investment Vehicles has a Trade Engine to select an appropriate specific trade engine to handle the specific trading details of the selected trading vehicle.\n41. The system of claim 37, wherein the General Trading System of Investment Vehicles is applied to a new investment vehicle that might be created in the future by creating a new trade engine for the new investment vehicle and plugging it into a Trade Engine of said General Trading System of Investment Vehicles.\n42. The system of claim 28, further comprising a Visualized Setting System;\nwherein the Visualized Setting System 1) provides graphic cues on the investment chart; 2) allows a player to move the graphic cues to a appropriate price level on the investment chart to set price desired; and 3) allows the player to set warnings, open orders, set conditions, and set triggers after a desired price has been set.\n43. The system of claim 28, further comprising an Auto-recoding and Playback System to automatically record a player's trade operations during the simulation.\n44. The system of claim 28, further comprising an Unlimited Investments Simulation System to help the multi-investments simulation.\n45. The system of claim 44, wherein the Unlimited Investments Simulation System provides a synchronized simulation for all investments been simulated.\n46. The system of claim 28, further comprising a Missing Data Handling System to smoothly handle many complicated situations relating to missing data.\n47. The system of claim 28, further comprising a single investment simulation with daily investment chart system.\n48. The system of claim 28, further comprising a single investment simulation with daily investment chart and intraday investment chart system.\n49. The system of claim 28, further comprising a multi-investments simulation with daily investment chart system.\n50. The system of claim 28, further comprising a multi-investments simulation with daily investment chart and intraday investment chart system.\n51. The system of claim 28, further comprising an on-line investment simulation competition system, wherein the on-line investment simulation competition system comprises:\nproviding an investment simulation system that simulates one or more investments for which trading can occur with at least one investment chart;\nproviding an online chatting system to allow a player to chat with other players all over the world;\nallowing a player to start a competition or join a started competition; and\nproviding a score board to dynamically display the changing money other players earned throughout the competition.\n52. The system of claim 51, wherein the system is a synchronous on-line investment simulation competition system.\n53. The system of claim 51, wherein the system is an asynchronous on-line investment simulation competition system.\n54. The method of claim 28, further comprising a 2-in-1 investment simulation and video game system, wherein the 2-in-1 investment simulation and video game system comprises:\nproviding an investment simulation system that simulates one or more investment markets for which trading can occur with at least one investment chart; and\nproviding a video game system in which players win or lose based on their performance in the investment simulation.\n55. A storage medium comprising a computer program, wherein the computer program is capable of running on a computer and comprises instructions for:\nsimulating at least one market in which trading can occur using historical data and other information from that market; and\ndisplaying the data and information to a user in a form comprising at least one investment chart.\n56. The storage medium of claim 55, which is a portable storage medium, an optical compact disk, an optical digital virtual disk, a hard drive, or random access memory.",
    "status": "Abandoned",
    "citations_own": [
        "US6321212B1",
        "US6349291B1",
        "US20030009411A1",
        "US20030055761A1",
        "US6709330B1",
        "US20040064395A1",
        "US6773350B2",
        "US6907404B1",
        "US6939137B1",
        "US20070005481A1",
        "US7349878B1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20080065510A1",
        "US20080120248A1",
        "US20080207326A1",
        "US20090006241A1",
        "US20090198560A1",
        "US20090215537A1",
        "US20100102509A1",
        "US20100138360A1",
        "CN101763618A",
        "US20100169144A1",
        "US20100174665A1",
        "US8118654B1",
        "US20130310121A1",
        "US8662977B1",
        "US20140180763A1",
        "WO2015042494A3",
        "US20150269813A1",
        "US20160224995A1",
        "US20170103678A1",
        "US20180114269A1",
        "US20190213678A1",
        "US10636087B1",
        "CN111415080A",
        "USD918255S1",
        "US10997661B2"
    ],
    "citedby_ftf": [
        "SE536479C2"
    ]
}