{
    "patent_link": "https://patents.google.com/patent/US5444491A/en",
    "patent_id": "US5444491A",
    "title": "Television system with multiple transmission formats",
    "abstract": "A television receiver for receiving and decoding a transmitted television signal, wherein the television signal comprises a succession of encoded image frames encoded in transmission formats selected from a set of transmission formats, the set comprising at least two transmission formats that differ from each other in at least two non-program-content characteristics; wherein the receiver comprises: display means for displaying the television signal; means for receiving format identification information transmitted with the encoded image frames identifying the transmission format of the received frames; means for decoding the identification information to determine the transmission format of the encoded image frames being received; and means for using the identification information to decode the encoded image frames for any of the transmission formats.",
    "inventors": [
        "Jae S. Lim"
    ],
    "assignee": "Massachusetts Institute of Technology",
    "classifications": [
        "H04N7/015",
        "H04N7/01"
    ],
    "claims": "\n1. A television receiver for receiving and decoding a transmitted television signal, wherein the television signal comprises a succession of encoded image frames encoded in a plurality of different transmission formats selected from a set of transmission formats, the set comprising at least two transmission formats that differ from each other in at least two non-program-content characteristics;\nwherein the receiver comprises:\nmeans for receiving format identification information transmitted with the encoded image frames identifying the transmission format of the received frames;\nmeans for decoding the identification information to determine the transmission format of the encoded image frames being received, wherein the identification information and transmission formats can change during receipt of the television signal; and\nmeans for using the identification information to decode the encoded image frames for at least some of the transmission formats.\n2. The receiver of claim 1 wherein the non-program-content characteristics by which the transmission formats differ include spatial resolution and frame rate.\n3. The receiver of claim 2 wherein the transmission formats comprise at least three of the following four formats:\na low-spatial-resolution, low-frame-rate transmission format,\na low-spatial-resolution, high-frame-rate transmission format,\na high-spatial-resolution, low-frame-rate transmission format, and\na high-spatial-resolution, high-frame-rate transmission format.\n4. The receiver of claim 2 wherein the transmission formats comprise at least:\na low-spatial-resolution, high-frame-rate transmission format, and\na high-spatial-resolution, low-frame-rate transmission format.\n5. The receiver of claim 1, 2, 3, or 4 further comprising format transformation means for using the decoded identification information to transform the format of the received image frames to a display format.\n6. The receiver of claim 5 wherein the display format is different from at least some of the transmission formats.\n7. The receiver of claim 6 wherein the spatial resolution ratio between the low-spatial-resolution transmission formats and the high-spatial-resolution formats is a ratio of integers, wherein the integers range from one to ten in value.\n8. The receiver of claim 7 wherein the ratio of integers is selected from the group consisting of 3:2 and 2:1.\n9. The receiver of claim 6 wherein each of the transmission formats are progressively scanned, and wherein the low-spatial-resolution format has approximately 720 lines of pixels, and the high-spatial-resolution format has approximately 1080 lines of pixels.\n10. The receiver of claim 3 wherein the low-frame-rate transmission format has a frame rate of 24 frames per second, and the high-frame-rate transmission format has a frame rate of 30 frames per second.\n11. The receiver of claim 3 wherein the set of transmission formats comprises each of the four formats plus a fifth format: a low-spatial-resolution, higher-frame-rate format that has a higher frame rate than that of the low-spatial-resolution, high-frame-rate format.\n12. The receiver of claim 11 wherein the higher frame rate is 60 frames per second.\n13. The receiver of claim 1, 2, 3, 4, 11, or 12 wherein each of the transmission formats are progressively scanned formats.\n14. The receiver of claim 3 wherein the spatial resolution ratio between the low-spatial-resolution transmission formats and the high-spatial-resolution formats is a ratio of integers, wherein the set of transmission formats comprises each of the four transmission formats plus a fifth transmission format: a low-spatial-resolution, higher-frame-rate format that has a higher frame rate than that of the low-spatial-resolution, high-frame-rate format, and wherein each of the transmission formats are progressively scanned formats.\n15. The receiver of claim 14 wherein the low-spatial-resolution format has approximately 720 lines of pixels, and the high-spatial-resolution format has approximately 1080 lines of pixels.\n16. The receiver of claim 14 wherein the low-frame-rate transmission format has a frame rate of 24 frames per second, the high-frame-rate transmission format has a frame rate of 30 frames per second, and the higher-frame-rate transmission format has a frame rate of 60 frames per second.\n17. The receiver of claim 6 wherein the display format uses interlaced scanning.\n18. The receiver of claim 14 further comprising format transformation means for using the decoded identification information to transform the format of the received image frames to a display format and wherein the display format uses interlaced scanning.\n19. The receiver of claim 6 wherein the display format uses progressive scanning.\n20. The receiver of claim 14 further comprising format transformation means for using the decoded identification information to transform the format of the received image frames to a display format and wherein the display format uses progressive scanning.\n21. The receiver of claim 5 wherein the receiver comprises means for selectively transforming the received image frames from the transmission format to a second display format.\n22. The receiver of claim 5 wherein the format transformation means comprises means for spatial interpolation for processing received image frames with a transmission format having a spatial resolution lower than the spatial resolution of the display format.\n23. The receiver of claim 5 wherein the format transformation means comprises means for temporal interpolation for processing received image frames with a transmission format having a frame rate lower than the frame rate of the display format.\n24. The receiver of claim 5 wherein the format transformation means comprises means for spatial subsampling for processing received image frames with a transmission format having a spatial resolution greater than the spatial resolution of the display format.\n25. The receiver of claim 5 wherein the format transformation means comprises means for temporal subsampling for processing received image frames with a transmission format having a frame rate greater than the frame rate of the display format.\n26. A television system for receiving a production television signal having one of a plurality of production formats, processing the production television signal to produce a succession of encoded image frames having a transmission format selected from a set of transmission formats, the set comprising at least two transmission formats that differ from each other in at least two non-program-content characteristics;\nwherein the television system comprises:\nmeans for receiving production format identification information identifying the production format of the production television signal;\nformat transformation means for using the production format identification information to transform the television signal from the production format to one of the transmission formats;\nmeans for processing the television signal to produce the succession of encoded image frames in the transmission format; and\nmeans for encoding and transmitting transmission format identification information with the encoded image frames to identify the transmission format, wherein the identification information and transmission formats can change during transmission of the television signal.\n27. The system of claim 26 wherein the non-program-content characteristics by which the transmission formats differ include spatial resolution and frame rate.\n28. The system of claim 27 wherein the transmission formats comprise at least three of the following four formats:\na low-spatial-resolution, low-frame-rate transmission format,\na low-spatial-resolution, high-frame-rate transmission format,\na high-spatial-resolution, low-frame-rate transmission format, and\na high-spatial-resolution, high-frame-rate transmission format.\n29. The receiver of claim 27 wherein the transmission formats comprise at least:\na low-spatial-resolution, high-frame-rate transmission format, and\na high-spatial-resolution, low-frame-rate transmission format.\n30. The system of claim 26, 27, 28, or 29 wherein the production formats include interlaced scanning formats, the transmission formats include progressive scanning formats, and the format transformation means includes means for transforming the interlaced production formats to progressive formats.\n31. The system of claim 30 wherein the production formats include at least two formats having different frame rates and the format transformation means retains at least a portion of that difference in frame rate, so that the resulting transmission formats retain at least a portion of that difference in frame rate.\n32. The system of claim 31 wherein the production formats include at least two formats having different spatial resolutions and the format transformation means retains at least a portion of that difference in spatial resolution, so that the resulting transmission formats retain at least a portion of that difference in spatial resolution.\n33. The system of claim 26, 27, 28, or 29 further comprising a television receiver for receiving the transmitted television signal, the receiver comprising\nmeans for receiving the transmission format identification information transmitted with the encoded image frames identifying the transmission format of the received frames;\nmeans for decoding the transmission format identification information to determine the transmission format of the encoded image frames being received; and\nformat transformation means for using the decoded identification information to transform the format of the encoded image frames from the transmission format to the display format.\n34. The subject matter of claim 4 or 29, wherein a different low frame rate is used for the two transmission formats having a low frame rate.\n35. The subject matter of claim 34, wherein a different high frame rate is used for the two transmission formats having a high frame rate.\n36. A method of receiving and decoding a transmitted television signal, wherein the television signal comprises a succession of encoded image frames encoded in a plurality of different transmission formats selected from a set of transmission formats, the set comprising at least two transmission formats that differ from each other in at least two non-program-content characteristics, the method comprising the steps of:\nreceiving format identification information transmitted with the encoded image frames identifying the transmission format of the received frames;\ndecoding the identification information to determine the transmission format of the encoded image frames being received, wherein the identification information and transmission formats can change during receipt of the television signal; and\nusing the identification information to decode the encoded image frames for at least some of the transmission formats.\n37. The method of claim 36 wherein the non-program-content characteristics by which the transmission formats differ include spatial resolution and frame rate.\n38. The method of claim 37 wherein the transmission formats comprise at least three of the following four formats:\na low-spatial-resolution, low-frame-rate transmission format,\na low-spatial-resolution, high-frame-rate transmission format,\na high-spatial-resolution, low-frame-rate transmission format, and\na high-spatial-resolution, high-frame-rate transmission format.\n39. The method of claim 37 wherein the transmission formats comprise at least:\na low-spatial-resolution, high-frame-rate transmission format, and\na high-spatial-resolution, low-frame-rate transmission format.\n40. The method of claim 36 further comprising the step of using the decoded identification information to transform the format of the received image frames to a display format.\n41. The method of claim 40 wherein the display format is different from at least some of the transmission formats.\n42. The method of claim 41 wherein the spatial resolution ratio between the low-spatial-resolution transmission formats and the high-spatial-resolution formats is a ratio of integers, wherein the integers range from one to ten in value.\n43. The method of claim 42 wherein the ratio of integers is selected from the group consisting of 3:2 and 2:1.\n44. The method of claim 41 wherein each of the transmission formats are progressively scanned, and wherein the low-spatial-resolution format has approximately 720 lines of pixels, and the high-spatial-resolution format has approximately 1080 lines of pixels.\n45. The method of claim 38 wherein the low-frame-rate transmission format has a frame rate of 24 frames per second, and the high-frame-rate transmission format has a frame rate of 30 frames per second.\n46. The method of claim 38 wherein the set of transmission formats comprises each of the four formats plus a fifth format: a low-spatial-resolution, higher-frame-rate format that has a higher frame rate than that of the low-spatial-resolution, high-frame-rate format.\n47. The method of claim 46 wherein the higher frame rate is 60 frames per second.\n48. The method of claim 36 wherein each of the transmission formats are progressively scanned formats.\n49. The method of claim 38 wherein the spatial resolution ratio between the low-spatial-resolution transmission formats and the high-spatial-resolution formats is a ratio of integers, wherein the set of transmission formats comprises each of the four transmission formats plus a fifth transmission format: a low-spatial-resolution, higher-frame-rate format that has a higher frame rate than that of the low-spatial-resolution, high-frame-rate format, and wherein each of the transmission formats are progressively scanned formats.\n50. The method of claim 49 wherein the low-spatial-resolution format has approximately 720 lines of pixels, and the high-spatial-resolution format has approximately 1080 lines of pixels.\n51. The method of claim 49 wherein the low-frame-rate transmission format has a frame rate of 24 frames per second, the high-frame-rate transmission format has a frame rate of 30 frames per second, and the higher-frame-rate transmission format has a frame rate of 60 frames per second.\n52. The method of claim 41 wherein the display format uses interlaced scanning.\n53. The method of claim 49 further comprising the step of using the decoded identification information to transform the format of the received image frames to a display format and wherein the display format uses interlaced scanning.\n54. The method of claim 41 wherein the display format uses progressive scanning.\n55. The method of claim 49 further comprising the Step Of using the decoded identification information to transform the format of the received image frames to a display format and wherein the display format uses progressive scanning.\n56. The method of claim 36 further comprising the step of selectively transforming the received image frames from the transmission format to a second display format.\n57. The method of claim 40 wherein the format transformation includes the step of spatial interpolation for processing received image frames with a transmission format having a spatial resolution lower than the spatial resolution of the display format.\n58. The method of claim 40 wherein the format transformation includes the step of temporal interpolation for processing received image frames with a transmission format having a frame rate lower than the frame rate of the display format.\n59. The method of claim 40 wherein the format transformation includes the step of spatial subsampling for processing received image frames with a transmission format having a spatial resolution greater than the spatial resolution of the display format.\n60. The receiver of claim 40 wherein the format transformation includes the step of temporal subsampling for processing received image frames with a transmission format having a frame rate greater than the frame rate of the display format.\n61. A method for receiving a production television signal having one of a plurality of production formats, processing the production television signal to produce a succession of encoded image frames having a transmission format selected from a set of transmission formats, the set comprising at least two transmission formats that differ from each other in at least two non-program-content characteristics, the method comprising the steps of:\nreceiving production format identification information identifying the production format of the production television signal;\nusing the production format identification information to transform the television signal from the production format to one of the transmission formats;\nprocessing the television signal to produce the succession of encoded image frames in the transmission format; and\nencoding and transmitting transmission format identification information with the encoded image frames to identify the transmission format, wherein the identification information and transmission formats can change during transmission of the television signal.\n62. The method of claim 61 wherein the non-program-content characteristics by which the transmission formats differ include spatial resolution and frame rate.\n63. The method of claim 62 wherein the transmission formats comprise at least three of the following four formats:\na low-spatial-resolution, low-frame-rate transmission format,\na low-spatial-resolution, high-frame-rate transmission format,\na high-spatial-resolution, low-frame-rate transmission format, and\na high-spatial-resolution, high-frame-rate transmission format.\n64. The method of claim 62 wherein the transmission formats comprise at least:\na low-spatial-resolution, high-frame-rate transmission format, and\na high-spatial-resolution, low-frame-rate transmission format.\n65. The method of claim 61 wherein the production formats include interlaced scanning formats, the transmission formats include progressive scanning formats, and the format transformation step includes the step of transforming the interlaced production formats to progressive formats.\n66. The method of claim 65 wherein the production formats include at least two formats having different frame rates and the format transformation step retains at least a portion of that difference in frame rate, so that the resulting transmission formats retain at least a portion of that difference in frame rate.\n67. The method of claim 66 wherein the production formats include at least two formats having different spatial resolutions and the format transformation step retains at least a portion of that difference in spatial resolution, so that the resulting transmission formats retain at least a portion of that difference in spatial resolution.\n68. The method of claim 39 wherein a different low frame rate is used for the two transmission formats having a low frame rate.\n69. The method of claim 64 wherein a different low frame rate is used for the two transmission formats having a low frame rate.\n70. The method of claim 68 wherein a different high frame rate is used for the two transmission formats having a high frame rate.\n71. A television receiver for receiving and decoding a transmitted television signal, wherein the television signal comprises a succession of encoded image frames encoded in a plurality of different transmission formats selected from a set of transmission formats, the set comprising at least two transmission formats that differ from each other in at least one non-program-content characteristic;\nwherein the receiver comprises:\nmeans for receiving format identification information transmitted with the encoded image frames identifying the transmission format of the received frames;\nmeans for decoding the identification information to determine the transmission format of the encoded image frames being received, wherein the identification information and transmission format can change during receipt of the television signal; and\nmeans for using the identification information to decode the encoded image frames for at least some of the transmission formats.\n72. The receiver of claim 71 wherein the non-program-content characteristics by which the transmission formats differ include spatial resolution.\n73. The receiver of claim 71 wherein the non-program-content characteristics by which the transmission formats differ include frame rate.\n74. The receiver of claim 71 wherein the non-program-content characteristics by which the transmission formats differ include scanning format (interlaced or progressive).\n75. The receiver of claim 71, 72, 73, or 74 further comprising format transformation means for using the decoded identification information to transform the format of the received image frames to a display format.\n76. The receiver of claim 75 wherein the display format is different from at least some of the transmission formats.\n77. A television system for receiving a production television signal having one of a plurality of production formats, processing the production television signal to produce a succession of encoded image frames having a transmission format selected from a set of transmission formats, that differ from each other in at least one non-program-content characteristic;\nwherein the television system comprises:\nmeans for receiving production format identification information identifying the production format of the production signal;\nformat transformation means for using the production format identification information to transform the television signal from the production format to one of the transmission formats;\nmeans for processing the television signal to produce the succession of encoded image frames in the transmission format; and\nmeans for encoding and transmitting transmission format identification information with the encoded image frames to identify the transmission format, wherein the identification information and transmission format can change during transmission of the television signal.\n78. The system of claim 77 wherein the non-program-content characteristics by which the transmission formats differ include spatial resolution.\n79. The system of claim 77 wherein the non-program-content characteristics by which the transmission formats differ include frame rate.\n80. The system of claim 77 wherein the non-program-content characteristics by which the transmission formats differ include scanning format (interlaced or progressive).\n81. The system of claim 77, 78, 79, or 80 further comprising format transformation means for using the decoded identification information to transform the format of the received image frames to a display format.\n82. The system of claim 81 wherein the display format is different from at least some of the transmission formats.\n83. The system of claim 77, 78, 79, or 80 further comprising\na television receiver for receiving the transmitted television signal, the receiver comprising display means for displaying the television signal with a display format different from at least some of the transmission formats;\nmeans for receiving the transmission format identification information transmitted with the encoded image frames identifying the transmission format of the received frames;\nmeans for decoding the transmission format identification information to determine the transmission format of the encoded image frames being received; and\nformat transformation means for using the decoded identification information to transform the format of the received image frames from the transmission format to the display format.\n84. A method of receiving and decoding a transmitted television signal, wherein the television signal comprises a succession of encoded frames encoded in a plurality of different transmission formats selected from a set of transmission formats, the set comprising at least two transmission formats that differ from each other in at least one non-program-content characteristic, the method comprising the steps of:\nreceiving format identification information transmitted with the encoded image frames identifying the transmission format of the received frames;\ndecoding the identification information to determine the transmission format of the encoded image frames being received, wherein the identification information and transmission formats can change during receipt of the television signal; and\nusing the identification information to decode the encoded image frames for at least some of the transmission formats.\n85. The method of claim 84 wherein the non-program-content characteristics by which the transmission formats differ include spatial resolution.\n86. The method of claim 84 wherein the non-program-content characteristics by which the transmission formats differ include frame rate.\n87. The method of claim 84 wherein the non-program-content characteristics by which the transmission formats differ include scanning format (interlaced or progressive).\n88. The method of claim 84, 85, 86, or 87 further comprising the step of using the decoded identification information to transform the format of the encoded image frames to a display format.\n89. The method of claim 88 wherein the display format is different from at least some of the transmission formats.\n90. A method for receiving a production television signal having one of a plurality of production formats, processing the production television signal to produce a succession of encoded image frames having a transmission format selected from a set of transmission formats, the set comprising at least two transmission formats that differ from each other in at least one non-program-content characteristic, the method comprising the steps of:\nreceiving production format identification information identifying the production format of the production television signal;\nusing the production format identification information to transform the television signal from the production format to one of the transmission formats;\nprocessing the television signal to produce the succession of encoded image frames in the transmission format; and\nencoding and transmitting transmission format identification information with the encoded image frames to identify the transmission format, wherein the identification information and transmission formats can change during transmission of the television signal.\n91. The method of claim 90 wherein the non-program-content characteristics by which the transmission formats differ include spatial resolution.\n92. The method of claim 90 wherein the non-program-content characteristics by which the transmission formats differ include frame rate.\n93. The method of claim 90 wherein the non-program-content characteristics by which the transmission formats differ include scanning format (interlaced or progressive).",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3781818A",
        "US3912872A",
        "US4198651A",
        "US4309719A",
        "US4611225A",
        "US4641188A",
        "US4679091A",
        "US4688082A",
        "US4759018A",
        "US4838685A",
        "US4843468A",
        "US4860098A",
        "US4881125A",
        "US4931855A",
        "US4961112A",
        "US4962428A",
        "US4967273A",
        "US5010392A",
        "US5010405A",
        "US5025309A",
        "US5083205A",
        "US5132793A",
        "US5138659A",
        "US5187575A",
        "US5218436A",
        "US5235427A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "WO1996014711A1",
        "US5530484A",
        "US5555193A",
        "US5600376A",
        "US5610661A",
        "US5633686A",
        "US5661527A",
        "US5675379A",
        "WO1997044957A1",
        "WO1997049241A1",
        "US5717471A",
        "EP0833507A1",
        "US5739864A",
        "US5767907A",
        "US5818537A",
        "EP0873020A2",
        "US5835150A",
        "US5838750A",
        "US5842040A",
        "EP0918436A2",
        "US5999220A",
        "US6046711A",
        "US6061400A",
        "US6122321A",
        "US6148032A",
        "US6188438B1",
        "US6317164B1",
        "US20020009149A1",
        "US6370192B1",
        "US6370198B1",
        "US6385248B1",
        "US20020060746A1",
        "US20020114360A1",
        "US20020116705A1",
        "US20020136406A1",
        "WO2002098133A1",
        "US20020184637A1",
        "US20030035543A1",
        "US20030035645A1",
        "USRE38079E1",
        "US6553072B1",
        "US6590894B1",
        "US20030137601A1",
        "US6606596B1",
        "US20030152224A1",
        "US20030156718A1",
        "US6665873B1",
        "US20040071211A1",
        "US20040076297A1",
        "US6741288B1",
        "US20040129721A1",
        "US20040158721A1",
        "US20040181666A1",
        "US6798776B1",
        "US6813643B2",
        "US20040244059A1",
        "US20040268409A1",
        "US20050001930A1",
        "US6862043B1",
        "EP1443761A3",
        "US6873368B1",
        "US20050074063A1",
        "US20050201722A1",
        "US20050280537A1",
        "US20060056715A1",
        "US7051111B1",
        "EP1681877A2",
        "US20060271990A1",
        "US7151833B2",
        "US7155012B2",
        "US20070070221A1",
        "US7200859B1",
        "US7215770B2",
        "US7218738B2",
        "US7233669B2",
        "US7263187B2",
        "US7287168B2",
        "US7286667B1",
        "US7292692B2",
        "US7302058B2",
        "US7302059B2",
        "US20080030614A1",
        "US20080037952A1",
        "US20080059861A1",
        "US7343013B2",
        "US7346163B2",
        "US7350082B2",
        "US7376233B2",
        "US7388918B2",
        "US7409702B2",
        "US20090033791A1",
        "US20090067507A1",
        "US7508942B2",
        "US7530084B2",
        "US7555464B2",
        "US7567939B2",
        "US7620180B2",
        "US20100020878A1",
        "US7688803B1",
        "US7702589B2",
        "US7730300B2",
        "US7765567B2",
        "US7823174B2",
        "US7853980B2",
        "US7895616B2",
        "US7895617B2",
        "CN101060603B",
        "US20110134341A1",
        "US8041190B2",
        "US20110321070A1",
        "US8185921B2",
        "US8572408B2",
        "US8600217B2",
        "US8645988B2",
        "US8667525B2",
        "US8798136B2",
        "US8818896B2",
        "US9998750B2",
        "US10567703B2",
        "US11297203B2"
    ],
    "citedby_ftf": []
}