{
    "patent_link": "https://patents.google.com/patent/US6385462B1/en",
    "patent_id": "US6385462B1",
    "title": "Method and system for criterion based adaptive power allocation in a communication system with selective determination of modulation and coding",
    "abstract": "A method and system (102) for providing criterion based adaptive power allocation with selective determination of modulation and coding is provided. A method is presented which consists of providing adaptive power allocation with a target signal quality for each link based on a system criterion, and a modulation/coding rate for each link based on a signal quality associated with the transmit power of each link. A further method is provided which may alternatively, or additionally, consist of APA in which the transmit power for each link is assigned in an attempt to obtain a signal quality for each link within a range between or equal to a minimum and maximum. An additional method is disclosed consisting of APA in which the transmit power for each link is assigned in an attempt to obtain a signal quality for each link as close as possible to a common signal quality, when the power allocation method has a limited dynamic range. The method and system (102) of the present invention may be implemented in a wireless communication system (100) in any number of formats, such as code division multiple access or time division multiple access.",
    "inventors": [
        "Kevin Lynn Baum",
        "Brian Keith Classon",
        "Philippe Jean-Marc Sartori",
        "Theresa Ann Fry"
    ],
    "assignee": "Google Technology Holdings LLC",
    "classifications": [
        "H04W52/265",
        "H04L1/0015",
        "H04W52/262",
        "H04L1/0003",
        "H04L1/0009"
    ],
    "claims": "\n1. A method for transmitting signals in a communication system comprising the steps of:\n2. The method as recited in claim 1 wherein the step of determining a target signal quality comprises the step of choosing a common target signal quality for each planned link of the plurality of planned links based on the plurality of reference signal qualities and on the system criterion.\n3. The method as recited in claim 1 wherein the step of selecting a combination of a transmit power and a modulation/coding rate for each planned link comprises the step of selecting a common modulation/coding rate for all planned links of the plurality of planned links in the system.\n4. The method as recited in claim 3 wherein the common modulation/coding rate is selected from a finite set of modulation/coding rates.\n5. The method as recited in claim 1 wherein the signal quality is a bit error rate.\n6. The method as recited in claim 1 wherein the signal quality is a carrier to interference ratio.\n7. The method as recited in claim 1 wherein the signal quality is a carrier to interference plus noise ratio.\n8. The method as recited in claim 1 wherein the signal quality is a ratio of wanted to unwanted signal energy.\n9. The method as recited in claim 1 wherein the reference transmit power is a total system transmit power divided by a number of planned links.\n10. The method as recited in claim 1 wherein the plurality of planned links comprises currently active links and wherein the reference transmit power for a planned link is the transmit power currently assigned to the active link.\n11. In a wireless communication system, a method for transmitting signals comprising the steps of:\n12. The method as recited in claim 11 wherein the step of selecting comprises the steps of:\n13. The method as recited in claim 12 comprising the step of:\n14. The method as recited in claim 11 wherein the signal quality is a carrier to interference ratio.\n15. The method as recited in claim 11 wherein the signal quality is bit error rate.\n16. In a wireless communication system, a system for transmitting signals comprising:\n17. The system as recited in claim 16 wherein the target signal quality for each of the planned links is a common target signal quality for all of the planned links, and wherein the modulation/coding rate unit assigns a common modulation/coding rate to all planned links based on the target signal quality.\n18. The system as recited in claim 16 wherein the signal quality unit comprises:\n19. The system as recited in claim 18 wherein the transmit power unit comprises:\n20. The system as recited in claim 19, wherein the power selection unit, if there is not enough dynamic range to select a transmit power of a planned link such that the signal quality of the planned link, when transmitted, is greater than or equal to the minimum desired signal quality, removes that planned link from the plurality of planned links.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "GB2298338A",
        "US5764699A",
        "US5812938A",
        "US5839056A",
        "US5991329A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20020010001A1",
        "US20020094834A1",
        "US20020110101A1",
        "US20020110088A1",
        "US20020118733A1",
        "US20020123351A1",
        "US20020131376A1",
        "US20020136271A1",
        "US20020155853A1",
        "US20020191706A1",
        "US20030045320A1",
        "US20030064741A1",
        "US20030083088A1",
        "US20030087644A1",
        "US20030112744A1",
        "US20030129943A1",
        "US20030137950A1",
        "US20030161285A1",
        "US20030166404A1",
        "US20040013207A1",
        "WO2004025870A1",
        "US20040095880A1",
        "US20040100920A1",
        "US20040105460A1",
        "US20040110510A1",
        "US20040110470A1",
        "US20040162097A1",
        "US6782271B2",
        "US20040203455A1",
        "US20040232481A1",
        "US20050025254A1",
        "US20050107036A1",
        "US20050128970A1",
        "US20050128935A1",
        "US20050160171A1",
        "US20050163092A1",
        "US20050213552A1",
        "US6963752B1",
        "US20060050623A1",
        "US20060084447A1",
        "US20060164990A1",
        "US20060182068A1",
        "US20070081475A1",
        "US20070082620A1",
        "US20070096788A1",
        "US20070116092A1",
        "US20080013479A1",
        "US20080043657A1",
        "US7366200B2",
        "US20080123578A1",
        "US20080212517A1",
        "US20100111008A1",
        "CN1879325B",
        "EP2274943A1",
        "US20110028180A1",
        "US20110028170A1",
        "US20110134786A1",
        "US20110149836A1",
        "US20110228740A1",
        "US20120170514A1",
        "US8693440B2",
        "US9131387B2",
        "US20150327267A1",
        "US9215670B2",
        "US9344211B2",
        "US10651966B2"
    ],
    "citedby_ftf": [
        "FR2824685B1",
        "US7209517B2",
        "AU2002249746A1",
        "GB2391431A",
        "US7058039B2"
    ]
}