{
    "patent_id": "US-11740949-B2",
    "title": "Distribution of events in edge devices ",
    "assignee": "Microsoft Technology Licensing, Llc",
    "publication_date": "2023-08-29",
    "patent_link": "https://patents.google.com/patent/US11740949B2/en",
    "inventors": [
        "Samuel John George",
        "Cameron William SKINNER",
        "Elio Damaggio",
        "Affan Dar",
        "Michael R. YAGLEY",
        "Varun PURANIK",
        "Anca Mihaela ANTOCHI"
    ],
    "classifications": [
        "G06F9/542",
        "G06F16/27",
        "G06F8/60",
        "G06F8/654",
        "G06F9/547",
        "G06N5/046",
        "H04L41/0806",
        "H04L41/0813",
        "H04L41/0846",
        "H04L41/12",
        "H04L67/1095",
        "H04L67/12",
        "H04L67/125",
        "H04L67/34",
        "H04W12/35",
        "G06F8/61",
        "G06F8/64",
        "G06F9/44",
        "G06N20/00",
        "G06N3/02",
        "H04L63/20",
        "H04L67/56",
        "H04W12/009",
        "H04W4/70"
    ],
    "abstract": "The disclosed technology is generally directed to communications in an IoT environment. In one example of the technology, a plurality of module twins that respectively correspond to a plurality of modules of edge applications on a plurality of edge devices are stored. The plurality of module twins individually include metadata associated with the corresponding module of the plurality of modules. At least one module of the plurality of modules to be modified by adding a declarative rule is determined, such that the declarative rule causes determining whether an event has been triggered based on a particular event having been determined to have occurred, and, in response to the triggering of the event, communicating the triggering of the event to at least one declarative target. The determined at least one module of the plurality of modules is caused to be modified by adding the declarative rule.",
    "claims": "\n1. An apparatus, comprising:\nan IoT support service, including at least one memory adapted to store run-time data, and at least one processor that is adapted to execute processor-executable code that, in response to execution, causes the IoT support service to perform actions, including:\nstoring a plurality of module twins that respectively correspond to a plurality of modules of an edge application on an edge device,\nwherein the plurality of module twins individually include metadata associated with a corresponding module of the plurality of modules, and\nwherein the plurality of modules are compositable together into the edge application, and the modules of the plurality of modules are capable of being used interoperably with other modules without altering the other modules;\nenabling communications between the modules of the plurality of modules and the IoT support service according to a common security context;\ndetermining at least one module of the plurality of modules to be modified by adding a declarative rule, such that the declarative rule causes determining whether an event has been triggered, and, in response to the triggering of the event, communicating the triggering of the event to at least one declarative target; and\ncausing the determined at least one module of the plurality of modules to be modified by adding the declarative rule.\n2. The apparatus of claim 1, wherein the declarative rule further causes, upon the declarative rule being triggered based on a particular event having been determined to have occurred, the edge device that includes the module to connect to a network and to perform a data upload.\n3. The apparatus of claim 1, wherein the declarative rule further causes, upon the declarative rule being triggered based on a particular event having been determined to have occurred, the edge device that includes the module to connect to a network.\n4. The apparatus of claim 1, wherein the at least one declarative target includes at least one edge device.\n5. The apparatus of claim 1, wherein the at least one declarative target includes the IoT support service.\n6. The apparatus of claim 1, wherein causing the determined at least one module of the plurality of modules to be modified includes instructing the at least one edge device of the plurality of edge devices to download code for the declarative rule from a module depository.\n7. The apparatus of claim 1, wherein the common security context includes being provisioned by a provisioning service.\n8. The apparatus of claim 1, the actions further including synchronizing the metadata of each module twin of the plurality of module twins.\n9. A method, comprising:\nstoring a plurality of module twins that respectively correspond to a plurality of modules of an edge application on an edge device,\nwherein the plurality of module twins individually include metadata associated with a corresponding module of the plurality of modules, and\nwherein the plurality of modules are compositable together into the edge application and the modules of the plurality of modules are capable of being used interoperably with other modules without altering the other modules;\nusing at least one processor of an IoT support service to identify at least one module of the plurality of modules to be modified via inclusion of a declarative rule, such that the declarative rule causes determining whether an event has been triggered, and, in response to the triggering of the event, communicating the triggering of the event to at least one declarative target; and\ncausing the identified at least one module of the plurality of modules to be modified via inclusion of the declarative rule.\n10. The method of claim 9, wherein the declarative rule further causes, when the declarative rule is triggered based on a particular event having been determined to have occurred, the edge device that includes the module to perform a data upload.\n11. The method of claim 9, wherein the declarative rule further causes the edge device that includes the module to perform a data upload.\n12. The method of claim 9, wherein the at least one declarative target includes at least one edge device.\n13. The method of claim 9, wherein the at least one declarative target includes the IoT support service.\n14. The method of claim 9, wherein using the at least one processor of the IoT support service to identify at least one module of the plurality of modules to be modified includes instructing the at least one edge device of the plurality of edge devices to download code for the declarative rule from a module depository.\n15. An apparatus, comprising:\nan edge device, including at least one memory adapted to store run-time data, and at least one processor that is adapted to execute processor-executable code that, in response to execution, causes the edge device to perform actions, the actions including:\nexecuting a plurality of modules,\nwherein the plurality of modules are compositable together into an application for the edge device, and\nwherein the modules of the plurality of modules are capable of being used interoperably with other modules without altering the other modules;\nenabling communications between the modules of the plurality of modules and an IoT support service according to a common security context;\nbased on instructions from an IoT support service, modifying at least one module of the plurality of modules to add a declarative rule;\ndetermining whether the declarative rule has been triggered; and\nin response to the declarative rule being triggered, communicating the triggering of the event to at least one declarative target.\n16. The apparatus of claim 15, the actions further including, upon the declarative rule being triggered based on a particular event having been determined to have occurred, connecting to a network and performing a data upload.\n17. The apparatus of claim 15, the actions further including, upon the declarative rule being triggered based on a particular event having been determined to have occurred, performing a data upload.\n18. The apparatus of claim 15, wherein the at least one declarative target includes at least one edge device.\n19. The apparatus of claim 15, wherein the at least one declarative target includes the IoT support service.\n20. The apparatus of claim 15, wherein modifying the determined at least one module of the plurality of modules includes downloading code for the declarative rule from a module depository.",
    "status": "Active",
    "citations_own": [
        "US20170006135A1",
        "US20170005820A1",
        "US20190132236A1",
        "ES2882599T3"
    ],
    "citations_ftf": [
        "US6671809B1",
        "US7275098B1",
        "US8131838B2",
        "US9141410B2",
        "US9563480B2",
        "US9841517B2",
        "US9853826B2",
        "US20160088049A1",
        "US9350550B2",
        "KR101560470B1",
        "US9727314B2",
        "US20150288619A1",
        "EP2950510B1",
        "US20160065653A1",
        "US10171371B2",
        "WO2016051237A1",
        "KR101943430B1",
        "GB2532432B",
        "US20160149836A1",
        "US20160197773A1",
        "US9262152B1",
        "US10083291B2",
        "US10762475B2",
        "US10673959B2",
        "US10999380B2",
        "US10114618B2",
        "US9606817B1",
        "KR20170042156A",
        "US9838359B2",
        "US10631040B2",
        "US10776080B2",
        "US10270827B2",
        "US10083055B2",
        "US20170287090A1",
        "US10187258B2",
        "US10908627B2",
        "US10606818B2",
        "WO2018009160A1",
        "US10104672B2",
        "US10404569B2",
        "US10778810B2",
        "US10089610B2",
        "US10067994B2",
        "US11240093B2",
        "US20180137219A1",
        "US10255067B2",
        "US11204808B2",
        "US10362482B2",
        "US20200065123A1",
        "US10268524B2",
        "US10120669B2",
        "US10782668B2",
        "US20180307472A1",
        "US10305879B2",
        "JP6881028B2",
        "US10521223B1",
        "US11316932B2",
        "US10262019B1",
        "US10476751B2",
        "US10581798B2",
        "US10620947B2",
        "US10728340B2",
        "US11140019B2",
        "US11438413B2"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US10728043B2",
        "KR102092721B1",
        "US10523662B2",
        "US10425242B2",
        "US10798216B2",
        "US11764991B2",
        "US11204816B2",
        "US10262019B1",
        "US20190158370A1",
        "US10841156B2",
        "CN108632101B",
        "US10817275B2",
        "US20200014591A1",
        "US10187253B1",
        "US11080078B2",
        "US10834017B2",
        "CN109685202B",
        "US10430179B1",
        "US11616839B2",
        "CN111835578B",
        "US11635990B2",
        "US11501881B2",
        "EP4014113A4",
        "US20210064981A1",
        "US11102064B2",
        "CN110738739B",
        "CN114586000A",
        "CN115210700A",
        "US11163544B2",
        "US11537999B2",
        "US11568456B2",
        "US11568987B2",
        "CN111711994B",
        "US11677746B2",
        "CN114531467B",
        "US11726764B2",
        "US11665221B2",
        "US11516311B2",
        "US11736585B2",
        "US11769066B2",
        "US11704311B2",
        "US20230213903A1",
        "US11757710B2"
    ]
}