{
    "patent_link": "https://patents.google.com/patent/US20020087455A1/en",
    "patent_id": "US20020087455A1",
    "title": "Global foreign exchange system",
    "abstract": "A computerized trading system permits global currency trading. The system preferably includes multiple affiliates at the local level, each in a different country, that act as introducing agents. Between these local affiliates there is a global exchange or hub, with the local affiliates and the global hub being arranged in a hub-and-spoke arrangement. Introducing affiliates are responsible for handling customer accounts and information, and accepting orders. The global exchange is responsible for routing orders to one or multiple foreign exchange liquidity banks to handle foreign exchange transactions to convert one currency into another.",
    "inventors": [
        "Manolis Tsagarakis",
        "Bea Calo"
    ],
    "assignee": "Morgan Stanley Services Group Inc",
    "classifications": [
        "G06Q30/06",
        "G06Q20/382",
        "G06Q40/04"
    ],
    "claims": "\n1. A method of converting currency, comprising:\ntransmitting electronically to a global hub an order to sell or buy an amount of a first currency in exchange for a second currency, said global hub being connected electronically to a plurality of computers in a plurality of countries, wherein said global hub includes a bank and a foreign exchange facility;\nreceiving said order to sell or buy said first currency at said global hub;\ntransmitting from said global hub to said foreign exchange facility said order to sell or buy said first currency;\nexecuting said sale or purchase of said first currency;\nreceiving from said foreign exchange facility a confirmation of said sale or purchase, including an amount of the obtained or deliverable second currency;\ntransmitting electronically from said global hub said confirmation.\n2. The method of claim 1, wherein said transmission of said order to sell or buy said first currency is made because of a purchase or sale of a security.\n3. The method of claim 2, wherein said conversion of said currencies occurs on a settlement date for said purchase or sale.\n4. The method of claim 1, further comprising:\ntransmitting electronically from said foreign exchange facility to a bank said order to sell or buy, wherein said order is an order to sell;\nselling said first currency in exchange for said second currency;\nreceiving from said bank electronic confirmation of said sale of said first currency to said second currency.\n5. The method of claim 4, wherein said bank connects to a data source for currency exchange rate for said first currency to said second currency.\n6. The method of claim 1, wherein said global hub comprises at least one computer.\n7. The method of claim 1, wherein said foreign exchange facility receives data on currency exchange rates.\n8. The method of claim 7, wherein said data on currency exchange rates is provided to a customer prior to said step of transmitting said order to sell or buy said first currency.\n9. The method of claim 7, wherein said data on currency exchange rates is provided to a customer after said order is executed.\n10. The method of claim 1; wherein an introducing broker electronically transmits said order.\n11. The method of claim 10, wherein a customer connects to said introducing broker via the internet.\n12. The method of claim 10, wherein said introducing broker maintains customer account information.\n13. The method of claim 12, wherein said global hub does not maintain customer account information.\n14. The method of claim 1, wherein the asset class is currency.\n15. The method of claim 1, wherein said method is automated by software.\n16. The method of claim 1, further comprising:\ntransmitting electronically to a global hub an order to buy an amount of a third currency, said global hub being connected electronically to a plurality of computers in a plurality of countries, wherein said global hub includes a bank and a foreign exchange facility;\nreceiving said order to buy said third currency at said global hub;\ntransmitting from said global hub to said foreign exchange facility said order to buy said third currency;\nexecuting a purchase of said third currency in exchange for a fourth currency;\nreceiving from said foreign exchange facility a confirmation of an amount of said third currency obtained in exchange for said fourth currency;\ntransmitting electronically from said global hub said confirmation of obtaining said third currency.\n17. The method of claim 16, wherein said order to buy said first currency originates in a first country and said order to buy said third currency originates in a second country.\n18. The method of claim 1, further comprising:\ntransmitting electronically to a global hub an order to sell an amount of a third currency, said global hub being connected electronically to a plurality of computers in a plurality of countries, wherein said global hub includes a bank and a foreign exchange facility;\nreceiving said order to sell said third currency at said global hub;\ntransmitting from said global hub to said foreign exchange facility said order to sell said third currency;\nexecuting said sale of said third currency and receiving in exchange a fourth currency;\nreceiving from said foreign exchange facility a confirmation of an amount of said fourth currency obtained in exchange for said third currency;\ntransmitting electronically from said global hub said confirmation of obtaining said fourth currency.\n19. The method of claim 18, wherein said order to sell said first currency originates in a first country and said order to sell said third currency originates in a second country.\n20. The method of claim 1, wherein said step of transmitting said order to sell or buy is made by a computerized introducing affiliate and said global hub includes at least one set of computers.\n21. The method of claim 1, wherein said confirmation from said global hub is transmitted to a customer.\n22. A method of converting currency, comprising:\ntransmitting electronically from an introducing affiliate to a global hub an order to sell an amount of a first currency for an amount of a second currency, said global hub being connected electronically to a plurality of computers in a plurality of countries, wherein said global hub includes a bank and a foreign exchange facility;\nreceiving at said global hub said order to sell said first currency;\ntransmitting from said global hub to said foreign exchange facility said order to sell said first currency;\nexecuting at a foreign exchange bank said sale of said first currency in exchange for said second currency;\nreceiving at said global hub from said foreign exchange facility a confirmation of an amount of said second currency obtained in exchange for said first currency;\ndeducting fees from said amount of said second currency;\ntransmitting electronically from said global hub said confirmation of obtaining said second currency.\n23. The method of claim 22, wherein a preview amount of said first and second currencies is provided to a customer prior to transmitting said order from said introducing affiliate.\n24. A method of converting currency, comprising:\ntransmitting electronically from an introducing affiliate to a global hub an order to buy an amount of a first currency for an amount of a second currency, said global hub being connected electronically to a plurality of computers in a plurality of countries, wherein said global hub includes a bank and a foreign exchange facility;\nreceiving at said global hub said order to buy said first currency;\ntransmitting from said global hub to said foreign exchange facility said order to buy said first currency;\nexecuting at a foreign exchange bank said purchase of said first currency in exchange for said second currency;\nreceiving at said global hub from said foreign exchange facility a confirmation of an amount of said first currency obtained in exchange for said second currency;\nadding fees to said amount of said second currency;\ntransmitting electronically from said global hub said confirmation of obtaining said first currency.\n25. The method of claim 24, wherein a preview amount of said first and second currencies is provided to a customer prior to transmitting said order from said introducing affiliate.\n26. A method of converting a first currency into a second currency, comprising:\nentering into a computer an order to exchange a first currency into a second currency;\ntransmitting electronically said order from said computer to an introducing affiliate;\ntransmitting electronically said order from said introducing affiliate toward a global exchange;\nreceiving from said global exchange confirmation of a conversion of said first currency to said second currency;\nwherein said global exchange receives currency exchange orders from a plurality of countries.\n27. The method of claim 26, wherein said introducing affiliate is one or more computers.\n28. The method of claim 26, wherein said steps of entering into a computer and transmitting electronically said order to the introducing affiliate are done via the internet.\n29. The method of claim 26, wherein said global exchange connects to a foreign exchange liquidity bank.\n30. The method of claim 26, wherein said introducing affiliate maintains individual customer account information.\n31. The method of claim 30, wherein said global exchange does not maintain individual customer account information.\n32. The method of claim 26, wherein said transmission of said order is made because of a purchase or sale of a security.\n33. The method of claim 26, wherein said global exchange connects to a data source for currency exchange rates for said first currency to said second currency.\n34. The method of claim 26, further comprising:\ndeducting charges from an amount of said second currency prior to said step of receiving.\n35. The method of claim 26, wherein the asset class is currency.\n36. The method of claim 26 wherein except for said step of entering, said method is automated with software.\n37. The method of claim 26, further comprising:\nentering into a computer a second order, said second order being for the exchange of said first currency into a third currency;\ntransmitting electronically said second order from said computer to said introducing affiliate;\ntransmitting electronically said second order from said introducing affiliate toward said global exchange;\nreceiving from said global exchange confirmation of a conversion of said first currency to said third currency.\n38. The method of claim 26, wherein said global exchange connects to a plurality of introducing affiliates in a plurality of countries, said global exchange and introducing affiliates being arranged in a hub-and-spoke configuration.",
    "status": "Active",
    "citations_own": [
        "US20020087454A1"
    ],
    "citations_ftf": [
        "WO2004044811A1",
        "US7848997B2"
    ],
    "citedby_own": [
        "US20020138407A1",
        "US20020156718A1",
        "US20020184124A1",
        "US20030040994A1",
        "US20030236742A1",
        "US20040006533A1",
        "US20040078321A1",
        "US20040128225A1",
        "US20040133500A1",
        "US20040138985A1",
        "US20040148247A1",
        "US20040177028A1",
        "US20040215539A1",
        "US20040236646A1",
        "US20040267655A1",
        "US20050004872A1",
        "US20050010522A1",
        "US20050044043A1",
        "US20050086136A1",
        "US20050091145A1",
        "US20050114239A1",
        "US20050137955A1",
        "US20050246263A1",
        "US20050274792A1",
        "US20050278251A1",
        "US20050278255A1",
        "US20060015455A1",
        "US20060106708A1",
        "US20060106701A1",
        "US20060167792A1",
        "US20060167791A1",
        "US20060190386A1",
        "US20060206427A1",
        "US20060218809A1",
        "US20060229982A1",
        "US20070055582A1",
        "US7330835B2",
        "US20080097892A1",
        "US20080243700A1",
        "US20080249911A1",
        "AU2008200560B2",
        "US20090063344A1",
        "WO2009029122A1",
        "US7567928B1",
        "US7580886B1",
        "US20090248574A1",
        "US20090281946A1",
        "US7620578B1",
        "US20090327117A1",
        "US7647268B1",
        "US7680731B1",
        "US7716107B1",
        "US7770184B2",
        "US7818238B1",
        "US7822682B2",
        "US7827096B1",
        "US20100287087A1",
        "US7881996B1",
        "US7881992B1",
        "US7890407B2",
        "US7899722B1",
        "US7921050B1",
        "US7930228B1",
        "US20110131128A1",
        "US7966234B1",
        "US7970688B2",
        "US20110208640A1",
        "US20110231283A1",
        "US8090639B2",
        "US8121937B2",
        "US8209246B2",
        "US8266024B2",
        "US20120303507A1",
        "WO2012177910A1",
        "US8352354B2",
        "US8392285B2",
        "US8396811B1",
        "US20130066758A1",
        "US8423447B2",
        "US8538844B1",
        "US8548886B1",
        "US20130282549A1",
        "US20130290157A1",
        "US8589268B2",
        "US8688569B1",
        "US8694424B2",
        "US8700510B2",
        "US8712884B2",
        "US8738514B2",
        "US8751337B2",
        "US8762191B2",
        "US8762238B2",
        "GB2512104A",
        "WO2014147408A1",
        "US20150025873A1",
        "US8996481B2",
        "US20150161722A1",
        "US9058581B2",
        "US9063985B2",
        "US9230284B2",
        "US20160210637A1",
        "US20170109822A1",
        "US20170169515A1",
        "US9767514B2",
        "US9805344B1",
        "US9811868B1",
        "US20170323234A1",
        "US10204380B1",
        "TWI664597B",
        "US10387879B2",
        "US20200111165A1",
        "US10636018B2",
        "US11042882B2",
        "US11295308B1",
        "US20220108364A1",
        "US11436577B2",
        "US20220318906A1",
        "US11694168B2"
    ],
    "citedby_ftf": [
        "US7593884B2",
        "WO2004034196A2",
        "US8332292B2",
        "US8626653B1",
        "US20140180893A1",
        "US8799142B1",
        "US10789653B1",
        "EP3308343A4",
        "US11010731B1",
        "US20190347726A1"
    ]
}