{
    "patent_id": "US-11056099-B2",
    "title": "End-to-end speech recognition with policy learning ",
    "assignee": "Salesforce.Com, Inc.",
    "publication_date": "2021-07-06",
    "patent_link": "https://patents.google.com/patent/US11056099B2/en",
    "inventors": [
        "Yingbo Zhou",
        "Caiming Xiong"
    ],
    "classifications": [
        "G10L15/063",
        "G06N3/044",
        "G06N3/0445",
        "G06N3/045",
        "G06N3/0454",
        "G06N3/084",
        "G06N7/005",
        "G06N7/01",
        "G10L15/14",
        "G10L15/16",
        "G10L25/51",
        "G06N3/082"
    ],
    "abstract": "The disclosed technology teaches a deep end-to-end speech recognition model, including using multi-objective learning criteria to train a deep end-to-end speech recognition model on training data comprising speech samples temporally labeled with ground truth transcriptions. The multi-objective learning criteria updates model parameters of the model over one thousand to millions of backpropagation iterations by combining, at each iteration, a maximum likelihood objective function that modifies the model parameters to maximize a probability of outputting a correct transcription and a policy gradient function that modifies the model parameters to maximize a positive reward defined based on a non-differentiable performance metric which penalizes incorrect transcriptions in accordance with their conformity to corresponding ground truth transcriptions; and upon convergence after a final backpropagation iteration, persisting the modified model parameters learned by using the multi-objective learning criteria with the model to be applied to further end-to-end speech recognition.",
    "claims": "\n1. A computer-implemented method of training a deep end-to-end speech recognition model, the method comprising:\nreceiving training data comprising speech samples labeled with ground truth transcriptions;\ngenerating, via the deep end-to-end speech recognition model, a respective distribution of an output transcription corresponding to each speech sample from the training data;\njointly training the deep end-to-end speech recognition model with the received training data to update parameters of the model, wherein the joint training comprises:\ncomputing a maximum likelihood objective function based on the respective distribution of the output transcription;\ncomputing a self-critical sequence training (SCST) policy learning objective function based on the output transcription, a sampled transcription and a ground truth transcription from the training data;\nupdating the deep end-to-end speech recognition model based on a weighted sum of the maximum likelihood objective function and the SCST policy learning objective function; and\npersisting the modified model parameters learned by the joint training with the deep end-to-end speech recognition model to be applied to further end-to-end speech recognition.\n2. The method of claim 1, wherein the maximum likelihood objective function comprises a connectionist temporal classification (CTC) objective function.\n3. The method of claim 1, wherein the self-critical sequence training (SCST) policy learning determines a reward for an output transcription.\n4. The method of claim 1, wherein the model produces a normalized distribution of softmax probabilities over a set of transcription labels.\n5. The method of claim 4, wherein the maximum likelihood objective function maximizes a probability of the model outputting a correct transcription by:\ncombining individual probabilities of a plurality of candidate output transcriptions to produce an output transcription, wherein an individual probability of a candidate output transcription is determined by selecting a most probable label for each of a plurality of timesteps and multiplying softmax probabilities of each of the selected labels; and\nmeasuring differences between the output transcription and a ground truth transcription.\n6. The method of claim 4, wherein the self-critical sequence training (SCST) policy learning determines a reward for an output transcription by:\nindependently sampling a transcription label for each of a plurality of timesteps and concatenating the transcription labels sampled across the timesteps to produce the output transcription; and\nmeasuring differences between the output transcription and a ground truth transcription based on a performance metric.\n7. The method of claim 4, wherein the performance metric is word error rate (WER).\n8. The method of claim 4, wherein the performance metric is character error rate (CER).\n9. A deep end-to-end speech recognition system, comprising:\nan input port that receives digital audio samples of a signal comprising speech labeled with a ground truth transcription; and\na deep end-to-end speech recognition processor comprising hardware and a stack of layers running on the hardware including convolution layers and recurrent layers, coupled to the input port and configurable to process the digital audio samples, recognize speech from the audio samples, and output transcriptions corresponding to recognized speech;\nwherein the deep end-to-end speech recognition processor includes parameters jointly trained on training data to update parameters of the deep end-to-end speech recognition model,\nwherein the joint training comprises:\ncomputing a maximum likelihood objective function based on the respective distribution of the output transcription;\ncomputing a self-critical sequence training (SCST) policy learning objective function based on the output transcription, a sampled transcription and a ground truth transcription from the training data;\nupdating the deep end-to-end speech recognition model based on a weighted sum of the maximum likelihood objective function and the SCST policy learning objective function; and\nwherein the modified model parameters learned by the joint training are persisted with the model to be applied to further end-to-end speech recognition.\n10. The deep end-to-end speech recognition system of claim 9, wherein the maximum likelihood objective function comprises a connectionist temporal classification (CTC) objective function.\n11. The deep end-to-end speech recognition system of claim 9, wherein the self-critical sequence training (SCST) policy learning determines a reward for an output transcription.\n12. The deep end-to-end speech recognition system of claim 9, wherein the processor produces a normalized distribution of softmax probabilities over a set of transcription labels.\n13. The deep end-to-end speech recognition system of claim 12, wherein the maximum likelihood objective function maximizes the probability of the model outputting a correct transcription by:\ncombining individual probabilities of a plurality of candidate output transcriptions to produce an output transcription, wherein an individual probability of a candidate output transcription is determined by selecting a most probable label for each of a plurality of timesteps and multiplying softmax probabilities of each of the selected labels; and\nmeasuring differences between the output transcription and a ground truth transcription.\n14. The deep end-to-end speech recognition system of claim 12, wherein the self-critical sequence training (SCST) policy learning determines a reward for an output transcription by:\nindependently sampling a transcription label for each of a plurality of timesteps and concatenating the transcription labels sampled across the timesteps to produce the output transcription; and\nmeasuring differences between the output transcription and a ground truth transcription based on the performance metric.\n15. The deep end-to-end speech recognition system of claim 14, wherein the performance metric is word error rate (WER).\n16. The deep end-to-end speech recognition system of claim 14, wherein the performance metric is character error rate (CER).\n17. A tangible non-transitory computer readable storage medium having stored thereon program instructions executable by a processor, the instructions, when executed on a processor, implement a method including:\nreceiving training data comprising speech samples labeled with ground truth transcriptions;\ngenerating, via the deep end-to-end speech recognition model, a respective distribution of an output transcription corresponding to each speech sample from the training data;\njointly training a deep end-to-end speech recognition model on training data comprising speech samples to update parameters of the model, wherein the joint training comprises:\ncomputing a maximum likelihood objective function based on the respective distribution of the output transcription;\ncomputing a self-critical sequence training (SCST) policy learning objective function based on the output transcription, a sampled transcription and a ground truth transcription from the training data;\nupdating the deep end-to-end speech recognition model based on a weighted sum of the maximum likelihood objective function and the SCST policy learning objective function; and\npersisting the modified model parameters learned by the joint training with the deep end-to-end speech recognition model to be applied to further end-to-end speech recognition.\n18. The tangible non-transitory computer readable storage medium of claim 17, wherein the maximum likelihood objective function comprises a connectionist temporal classification (CTC) objective function.\n19. The tangible non-transitory computer readable storage medium of claim 17, wherein the self-critical sequence training (SCST) policy learning determines a reward for an output transcription.\n20. The tangible non-transitory computer readable storage medium of claim 17, wherein the model produces a normalized distribution of softmax probabilities over a set of transcription labels.\n21. The tangible non-transitory computer readable storage medium of claim 20, wherein the maximum likelihood objective function maximizes the probability of the model outputting a correct transcription by:\ncombining individual probabilities of a plurality of candidate output transcriptions to produce an output transcription, wherein an individual probability of a candidate output transcription is determined by selecting a most probable label for each of a plurality of timesteps and multiplying softmax probabilities of each of the selected labels; and\nmeasuring differences between the output transcription and a ground truth transcription.\n22. The tangible non-transitory computer readable storage medium of claim 20, wherein the self-critical sequence training (SCST) policy learning determines a reward for an output transcription by:\nindependently sampling a transcription label for each of a plurality of timesteps and concatenating the transcription labels sampled across the timesteps to produce the output transcription; and\nmeasuring differences between the output transcription and a ground truth transcription based on a performance metric.\n23. The tangible non-transitory computer readable storage medium of claim 22, wherein the performance metric is word error rate (WER).\n24. The tangible non-transitory computer readable storage medium of claim 22, wherein the performance metric is character error rate (CER).",
    "status": "Active",
    "citations_own": [
        "US20090234467A1",
        "US8775341B1",
        "US20140257803A1",
        "US20150055855A1",
        "US20160350653A1",
        "US20170024645A1",
        "US20170032280A1",
        "US20170140240A1",
        "US20170148433A1",
        "US20180082171A1",
        "US20180096267A1",
        "US20180121799A1",
        "US20180129938A1",
        "US20180129937A1",
        "US20180144248A1",
        "US20180268298A1",
        "US20180285682A1",
        "US20180300400A1",
        "US10121467B1",
        "US20180357554A1",
        "US20190108432A1",
        "US20190108439A1",
        "US20190130896A1",
        "US10282663B2",
        "US20190149834A1",
        "US10346721B2",
        "US20190236482A1",
        "US10573295B2",
        "US20200090048A1"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "US10565305B2",
        "US10565318B2",
        "US11386327B2",
        "US10817650B2",
        "US11604956B2",
        "US11562287B2",
        "US10573295B2",
        "US11170287B2",
        "US10592767B2",
        "US10542270B2",
        "US11276002B2",
        "US10776581B2",
        "US10929607B2",
        "US11227218B2",
        "US10783875B2",
        "US11106182B2",
        "US11138471B2",
        "US10909157B2",
        "US20200042825A1",
        "US10970486B2",
        "US11436481B2",
        "US11514915B2",
        "US11645509B2",
        "US11087177B2",
        "US11029694B2",
        "US10963652B2",
        "US11568306B2",
        "US11366969B2",
        "US11003867B2",
        "US11580445B2",
        "US11087092B2",
        "US11232308B2",
        "US11281863B2",
        "US11487939B2",
        "US11620572B2",
        "US11604965B2",
        "US11562251B2",
        "US11775775B2",
        "US11669712B2",
        "US11687588B2",
        "US11657269B2",
        "CN112133292A",
        "JP7290507B2",
        "US11615240B2",
        "CN110619885B",
        "CN110728365B",
        "CN110751944A",
        "US11568000B2",
        "US11599792B2",
        "US11640527B2",
        "US11620515B2",
        "US11347708B2",
        "US11288438B2",
        "US11334766B2",
        "US11537899B2",
        "US11416688B2",
        "US11640505B2",
        "US11487999B2",
        "US11256754B2",
        "US11573957B2",
        "CN111145729B",
        "CN111160035B",
        "US11669745B2",
        "US11562147B2",
        "US11263476B2",
        "US11328731B2",
        "US20210358490A1",
        "CN111798828B",
        "US11625543B2",
        "US11720559B2",
        "US11556788B2",
        "US11625436B2",
        "US20220115006A1",
        "US11527238B2",
        "CN112883633B",
        "CN112735478B",
        "CN113283588B",
        "CN113344136B",
        "CN113327631B",
        "US11682413B2",
        "KR102547001B1",
        "CN116151363B"
    ]
}