{
    "patent_link": "https://patents.google.com/patent/US20020036992A1/en",
    "patent_id": "US20020036992A1",
    "title": "Method and apparatus for packet size dependent link adaptation for wireless packet",
    "abstract": "Unlike earlier methods and systems in which Radio Link Control (RLC) performance was characterized in terms of the throughput, and the size of the higher layer Protocol Data Units (PDUs) or packets to be transferred was ignored, a method and apparatus is provided that is based on the delay of a higher layer PDU or packet. A method and apparatus so based have less delay than a method and apparatus based on employing adaptive coding and modulation to achieve the greatest mean throughput of a data block.",
    "inventors": [
        "Krishna Balachandran",
        "Kirk Chang",
        "Richard Ejzak",
        "Wei Luo",
        "Sanjiv Nanda"
    ],
    "assignee": "Nokia of America Corp",
    "classifications": [
        "H04L1/0009",
        "H04L1/0003",
        "H04L1/0007",
        "H04L1/0018",
        "H04L1/1812"
    ],
    "claims": "\n1. A method to reduce delay time of data delivery comprising the steps of:\nstoring at least one data packet to be transmitted over a link;\ntransmitting a first segment of the data packet at a first modulation and coding scheme level; and\ntransmitting a second segment of the data packet at a second modulation and coding scheme level which is more robust.\n2. An apparatus to reduce delay time of data delivery, comprising:\na buffer for storing at least one data packet to be transmitted over a link;\na modulator and coder for modulating and coding a first segment of the data packet at a first modulation-and-coding level;\nthe modulator and coder modulating and coding a second segment of the data packet at a second modulation-and-coding level which is more robust;\nand a transmitter transmitting the first and second segments..\n3. A data communication system for sending user data packets of varying length over a communication channel, comprising:\nmeans for segmenting each data packet for transmission on the communication channel;\nmeans for using link adaptation to select different modulation-and-coding-schemes for transmission of each data segment;\nmeans for selecting the modulation-and-coding-scheme for transmission of each packet based on both the channel quality and the packet delay performance objective.\n4. The system of claim 3, where each packet size is known, and the MCS is chosen for lower expected delay per packet.\n5. The system of claim 4, where the MCS is chosen for lower delay per packet for x % of the packets where x depends on a desired quality of service.\n6. The system of claim 4, wherein the MCS is chosen for a lower value of μ+aσ where μ denotes the expected delay per packet, σ denotes the standard deviation of delay and a>0 is chosen depending on the desired quality of service.\n7. The system of claim 3, wherein the MCS is also based on a round trip delay time of the channel.\n8. The system of claim 3, wherein the MCS is also based on a typical packet size, rather than an actual packet size.\n9. The system of claim 8, wherein the MCS is chosen for a lower expected delay per packet.\n10. The system of claim 3, wherein the MCS is determined based on a buffer backlog of user data and a lower expected delay in transmitting remaining data.\n11. The system of claim 10, wherein one MCS is chosen when a buffer backlog is greater than x, and wherein another MCS is chosen when a buffer backlog is less than y.\n12. The system of claim 3, wherein the MCS is determined based on a buffer backlog of user data per packet and a lower expected delay in transmitting each packet.\n13. The system of claim 12, wherein one MCS is chosen when a buffer backlog is greater than x, and wherein another MCS is chosen when a buffer backlog is less than y.\n14. The system of claim 13, where x equals y.\n15. The system of claim 13, wherein x is determined such that the MCS that results in the lowest expected delay also results in the highest expected throughput.\n16. A method for data communication by data packets of varying length over a communication channel, comprising the steps of:\nsegmenting each data packet for transmission on the communication channel; and\ndetermining a modulation-and-coding-scheme from a plurality of modulation and coding schemes for transmission of each data segment according to link adaptation.\n17. The method of claim 16, wherein said determination of the modulation-and-coding-scheme for transmission of each packet segment is based on both channel quality and packet delay performance.\n18. The method of claim 16, wherein said determination of the modulation-and-coding-scheme for transmission of each packet segment is based on channel quality.\n19. The method of claim 16, wherein said link adaptation selection for the modulation-and-coding-scheme for transmission of each packet segment is based on packet delay performance.",
    "status": "Expired - Lifetime",
    "citations_own": [],
    "citations_ftf": [
        "US6167031A",
        "US5909469A",
        "US6307867B1",
        "US6308082B1",
        "US20010056560A1",
        "US6275488B1"
    ],
    "citedby_own": [
        "US20020080719A1",
        "US20020155853A1",
        "US20030100291A1",
        "WO2004008678A1",
        "US20040081248A1",
        "US7095719B1",
        "US7124193B1",
        "US20070011504A1",
        "US20070096788A1",
        "WO2008018755A1",
        "US20080144570A1",
        "US20080212517A1",
        "CN100433643C",
        "CN102415034A",
        "US20150326941A1",
        "WO2017116293A1",
        "US9955387B1",
        "US11509413B2"
    ],
    "citedby_ftf": [
        "US6859466B1",
        "SE517030C2",
        "JP2002026877A",
        "US7068619B2",
        "US6704571B1",
        "JP2002152259A",
        "US7043210B2",
        "US7106711B2",
        "US6769086B2",
        "TWI455509B",
        "US7489703B2",
        "FR2850516B1",
        "US7467219B2",
        "US7519657B2",
        "US20050114224A1",
        "US7536308B2",
        "US20050114432A1",
        "US7693741B2",
        "US7464179B2",
        "US7711575B2",
        "US7509373B2",
        "US7343416B2",
        "KR100591891B1",
        "JP2005341317A",
        "US8588203B2",
        "US8149875B2",
        "US7898980B2",
        "US7848782B2",
        "EP1915878B1",
        "KR100555729B1",
        "US8676188B2",
        "US7865147B2",
        "US8131223B2",
        "US8208433B2",
        "US8204544B2",
        "EP2114030B1",
        "US8630197B2",
        "EP3681199A4"
    ]
}