{
    "patent_id": "US-11562207-B2",
    "title": "Set of neural networks ",
    "assignee": "Dassault Systemes",
    "publication_date": "2023-01-24",
    "patent_link": "https://patents.google.com/patent/US11562207B2/en",
    "inventors": [
        "Eloi Mehr"
    ],
    "classifications": [
        "G06N3/045",
        "G06N3/08",
        "G06N3/0454",
        "G06F30/27",
        "G06N20/00",
        "G06N3/088",
        "G06N5/04",
        "G06N5/041",
        "G06T17/00",
        "G06T19/003"
    ],
    "abstract": "The disclosure notably relates to a computer-implemented method of machine-learning. The method includes obtaining a dataset including 3D modeled objects which each represent a respective mechanical part and further includes providing a set of neural networks. Each neural network has respective weights. Each neural network is configured for inference of 3D modeled objects. The method further includes modifying respective weights of the neural networks by minimizing a loss. For each 3D modeled object, the loss selects a term among a plurality of terms. Each term penalizes a disparity between the 3D modeled object and a respective 3D modeled object inferred by a respective neural network of the set. The selected term is a term among the plurality of terms for which the disparity is the least penalized. This constitutes an improved method of machine-learning with a dataset including 3D modeled objects which each represent a respective mechanical part.",
    "claims": "\n1. A computer-implemented method of machine-learning, the method comprising:\nobtaining:\na dataset including 3D modeled objects which each represent a respective mechanical part, and\na set of neural networks, each neural network having respective weights, each neural network being configured for inference of 3D modeled objects; and\nmodifying respective weights of the neural networks by minimizing a loss which, for each 3D modeled object of the dataset, selects a term among a plurality of terms, each respective term of the plurality of terms being a measure of a disparity between the 3D modeled object and a respective 3D modeled object inferred by a respective neural network of the set, the respective term penalizing the disparity the selected term being a term among the plurality of terms for which the disparity is the least penalized.\n2. The method of claim 1, wherein the disparity between the 3D modeled object and the respective 3D modeled object inferred by the respective neural network of the set involves a distance between the 3D modeled object and the respective 3D modeled object inferred by the respective neural network of the set.\n3. The method of claim 2, wherein the distance is a distance between a first point cloud representing the 3D modeled object and a second point cloud representing the respective 3D modeled object inferred by the respective neural network of the set.\n4. The method of claim 1, wherein each neural network is configured for inference of deformations of a respective base template each into a respective 3D modeled object, each respective base template being a 3D modeled object.\n5. The method of claim 4, wherein each respective base template is a 3D modeled object which represents a centroid of the 3D modeled objects of a sub-dataset of the dataset.\n6. The method of claim 4, wherein the loss is of the type:\n7. The method of claim 1, wherein the minimizing includes iterations of:\nselecting a set of 3D modeled objects of the dataset;\nfor each 3D modeled object of the selected set, assigning to the 3D modeled object a respective neural network by rewarding smallness of the disparity between the 3D modeled object and the respective 3D modeled object inferred by the respective neural network, each respective neural network being assigned to one or more 3D modeled objects of the selected set, weights of each respective neural network being modified as a result of the assigning.\n8. The method of claim 1, wherein each respective neural network is a respective autoencoder which includes a respective decoder configured for the inference of the 3D modeled objects.\n9. A computer-implemented method of applying a set of neural networks obtainable according to a method of machine-learning, the method of machine-learning comprising:\nobtaining:\na dataset including 3D modeled objects which each represent a respective mechanical part, and\nthe set of neural networks, each neural network having respective weights, each neural network being configured for inference of 3D modeled objects; and\nmodifying respective weights of the neural networks by minimizing a loss which, for each 3D modeled object of the dataset, selects a term among a plurality of terms, each respective term of the plurality of terms being a measure of a disparity between the 3D modeled object and a respective 3D modeled object inferred by a respective neural network of the set, the respective term penalizing the disparity, the selected term being a term among the plurality of terms for which the disparity is the least penalized.\n10. The method of claim 9, wherein the disparity between the 3D modeled object and the respective 3D modeled object inferred by the respective neural network of the set involves a distance between the 3D modeled object and the respective 3D modeled object inferred by the respective neural network of the set.\n11. The method of claim 10, wherein the distance is a distance between a first point cloud representing the 3D modeled object and a second point cloud representing the respective 3D modeled object inferred by the respective neural network of the set.\n12. The method of claim 9, wherein each neural network is configured for inference of deformations of a respective base template each into a respective 3D modeled object, each respective base template being a 3D modeled object.\n13. The method of claim 9, wherein each neural network is a respective autoencoder which includes a respective decoder configured for the inference of the 3D modeled objects, the method comprising:\nobtaining two or more 3D modeled objects;\nprojecting the two or more 3D modeled objects each on a latent space of a respective autoencoder of the set of neural networks:\ncomputing one or more interpolations, on the latent space, between the projected two or more 3D modeled objects; and\napplying the decoder to each computed interpolation.\n14. The method of claim 9, wherein each neural network is a respective autoencoder which includes a respective decoder configured for the inference of the 3D modeled objects, the method comprising:\nobtaining a part of a 3D modeled object;\napplying a respective autoencoder to the part of the 3D modeled object; and\nfitting, to the part of the 3D modeled object, the result of the applying of the respective autoencoder to the part of the 3D modeled object.\n15. The method of claim 9, wherein each neural network is a respective autoencoder which comprises a respective decoder configured for the inference of the 3D modeled objects, the method comprising:\nobtaining a 3D modeled object;\napplying one or more respective autoencoders to the 3D modeled object; and\nselecting a respective autoencoder based on the applying.\n16. A device comprising:\na processor; and\na non-transitory data storage medium having recorded thereon a computer program comprising instructions for machine-learning that when executed by the possessor cause the processor to be configured to:\nobtain a dataset including 3D modeled objects which each represent a respective mechanical part,\nobtain a set of neural networks, each neural network having respective weights, each neural network being configured for inference of 3D modeled objects, and\nmodify respective weights of the neural networks by minimizing a loss which, for each 3D modeled object of the dataset, selects a term among a plurality of terms, each respective term of the plurality of terms being a measure of a disparity between the 3D modeled object and a respective 3D modeled object inferred by a respective neural network of the set, the respective term penalizing the disparity, the selected term being a term among the plurality of terms for which the disparity is the least penalized.\n17. The device of claim 16, wherein the disparity between the 3D modeled object and the respective 3D modeled object inferred by the respective neural network of the set involves a distance between the 3D modeled object and the respective 3D modeled object inferred by the respective neural network of the set.\n18. The device of claim 17, wherein the distance is a distance between a first point cloud representing the 3D modeled object and a second point cloud representing the respective 3D modeled object inferred by the respective neural network of the set.\n19. The device of claim 16, wherein each neural network is configured for inference of deformations of a respective base template each into a respective 3D modeled object, each respective base template being a 3D modeled object.\n20. A non-transitory computer readable medium having stored thereon a program that when executed by a computer causes the computer to implement the method according to claim 1.",
    "status": "Active",
    "citations_own": [
        "US20170193699A1",
        "US20180068414A1",
        "US20180120813A1",
        "US20180260793A1",
        "EP3396603A1",
        "US20180341248A1",
        "US20190005195A1",
        "US20190026917A1",
        "US20190030371A1",
        "US20190050999A1",
        "US20190087544A1",
        "US20190147221A1",
        "US20190156206A1",
        "US20190291277A1",
        "US20200013232A1",
        "US20200211678A1",
        "US20200210814A1",
        "US20200210845A1",
        "US20200210636A1",
        "US20200250540A1",
        "US11274929B1"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "EP3671660A1",
        "EP3674984A1",
        "US11157772B2",
        "WO2022005158A1",
        "CN111986106B",
        "US11468634B2",
        "US11694415B2",
        "CN112734913B",
        "JP7108329B1",
        "WO2022208143A1",
        "EP4120203A1",
        "CN114925584B"
    ]
}