{
    "patent_id": "US-11308170-B2",
    "title": "Systems and methods for data verification ",
    "assignee": "Consumerinfo.Com, Inc.",
    "publication_date": "2022-04-19",
    "patent_link": "https://patents.google.com/patent/US11308170B2/en",
    "inventors": [
        "Albert Chia-Shu Chang",
        "Gregory Dean Jones",
        "Carolyn Paige Soltes Matthies"
    ],
    "classifications": [
        "G06F16/951",
        "G06Q50/01",
        "G06F16/24578",
        "G06N5/02",
        "H04L51/23",
        "H04L51/30",
        "G06N20/00",
        "G06N5/022"
    ],
    "abstract": "Embodiments are directed to data verification of business or consumer data. Certain embodiments include a data verification system that receives or selects data to be verified, selects one or more verification methods to verify, update, and/or append/enhance the data. The data verification system may verify the data with one or more data verification methods, either alone or in combination. The methods may include a web-crawling verification method, an agent web verification method, a call verification method, a direct mail method, an email method, an in-person verification method, or other methods. The system has the ability to, automatically or manually, (1) blend automatic and manual segmentation of records or elements by criteria such as industry type, best times of day/month/year to verify, update, or append, cost, and level of importance (2) select the best verification processing method(s), and (3) manage the results and properly verify, update, append/enhance records.",
    "claims": "\n1. An automated system for verifying data comprising one or more processors configured to:\nselect at least a portion of data to be verified, wherein the data is located by searching content of a plurality of internet data sources using at least one of: web crawling or web scraping; and\nselect one or more data verification methods, based on prior results of the use of the one or more data verification methods, to apply to the selected portion of the data, wherein the data is verified, updated, or appended as a result of the application of the one or more selected data verification methods to the selected portion of the data, wherein the one or more data verification methods comprise at least one of: web-crawling, tele-verification, agent web verification, direct-mail verification, email verification, or in-person verification.\n2. The system of claim 1, wherein to select the data comprises selecting the data by at least one of: an automated web spider or web robot.\n3. The system of claim 1, wherein the one or more processors are further configured to assess trustworthiness of the internet data sources prior to performing web crawling or web scraping on the internet data sources.\n4. The system of claim 3, wherein the internet data sources comprise a webpage maintained by a person in association with a social networking service.\n5. The system of claim 3, wherein the internet data sources are associated with at least one of: a company website or a government website.\n6. The system of claim 1, wherein verifying, updating, or appending the data is based at least in part on a trustworthiness ranking associated with the internet data sources and a trustworthiness ranking of at least one other source of information regarding a person.\n7. The system of claim 1, wherein the one or more processors are further configured to further configured to, prior to storing the verified, updated, or appended data, verify the data at least in part by identifying the data from a source other than the internet data sources.\n8. The system of claim 7, wherein verifying the data from a source other than the internet data sources comprises applying a verification method that includes an automated telephone calling program executed by a computing system.\n9. The system of claim 1, wherein to select the one or more data verification methods is based at least in part on a determination of value associated with the data.\n10. The system of claim 9, wherein to select the one or more data verification methods is further based on a cost associated with at least one of the one or more selected data verification methods.\n11. The system of claim 9, wherein to select the one or more data verification methods is further based on a reliability associated with at least one of the one or more selected data verification methods.\n12. The system of claim 1, wherein to select the one or more data verification methods is based on a cost associated with at least one of the one or more selected data verification methods.\n13. The system of claim 12, wherein to select the one or more data verification methods is based on a reliability associated with at least one of the one or more selected data verification methods.\n14. The system of claim 1, wherein to select the one or more data verification methods is based on a reliability associated with at least one of the one or more selected data verification methods.\n15. The system of claim 1, wherein to select the portion of the data to be verified comprises selecting information regarding a person on the internet data sources.\n16. The system of claim 15, wherein the one or more processors are further configured to further configured to identify the information regarding the person on the internet data sources via web crawling.\n17. The system of claim 1, wherein the one or more processors are further configured to determine a creation date for the selected portion of the data, wherein the data is verified, updated, or appended based on the creation date.\n18. The system of claim 17, wherein the one or more processors are further configured to compare the creation date for the selected portion of the data with a creation date of information identified from the selected one or more data verification methods.\n19. The system of claim 1, wherein the one or more processors are further configured to store the verified, updated, or appended data in an electronic data store.\n20. A computerized method comprising:\nselecting at least a portion of data to be verified, wherein the data is located by searching content of a plurality of internet data sources using at least one of web crawling or web scraping; and\nselecting one or more data verification methods, based on prior results of the use of the one or more data verification methods, to apply to the selected portion of the data, wherein the data is verified, updated, or appended as a result of the application of the one or more selected data verification methods to the selected portion of the data, wherein the one or more data verification methods comprise at least one of: web-crawling, tele-verification, agent web verification, direct-mail verification, email verification, or in-person verification."
}