{
    "patent_id": "US-7233935-B1",
    "title": "Policy-based automation using multiple inference techniques ",
    "assignee": "Veritas Operating Corporation",
    "publication_date": "2007-06-19",
    "patent_link": "https://patents.google.com/patent/US7233935B1/en",
    "inventors": [
        "Christopher James Elphinstone Chandler"
    ],
    "classifications": [],
    "abstract": "System and method for policy-based decision-making using a combination of two or more inference approaches or techniques. Embodiments may provide a policy evaluation mechanism that evaluates policies using two or more inference techniques, including inference techniques that support “fuzzy” concepts, to generate a “yes/no” answer and a confidence level in the answer. In some embodiments, the policy evaluation mechanism may be a component of a decision engine that provides policy-based automation in a system or network environment. In one embodiment, a hierarchy of decision engines may be implemented that may include a central decision engine to administer system-wide policies and one or more local decision engines to administer component-level policies. Some embodiment may use a decision support language, such as FRIL (Fuzzy Relational Inference Language) or FRIL++, to express policy rules and to resolve uncertainty in policy rules using multiple AI inference techniques.",
    "claims": "\n1. A system, comprising:\na processor; and\na memory comprising program instructions, wherein the program instructions are executable by the processor to implement a policy-based automation mechanism configured to evaluate policies to provide automated computer system administration in an information technology (IT) environment, wherein each policy specifies a set of one or more rules and a process to be automatically initiated in the IT environment dependent upon an evaluation of the policy, and wherein, to evaluate policies, the policy-based automation mechanism is configured to:\naccess a policy and information relevant to an evaluation of the policy;\nevaluate the same policy according to the information using two or more different inference techniques to generate a positive or negative answer as to whether a process specified by the policy is to be automatically initiated and a confidence level for the positive or negative answer;\ninitiate the process specified by the policy in the IT environment if the positive or negative answer and the confidence level indicate that the process is to be initiated; and\nnot initiate the process specified by the policy in the IT environment if the positive or negative answer and the confidence level indicate that the process is not to be initiated.\n2. The system as recited in claim 1, wherein the inference techniques include one or more of probability calculus, fuzzy logic and evidential logic.\n3. The system as recited in claim 1, wherein the policy-based automation mechanism is further configured to provide the positive or negative answer and the confidence level for the positive or negative answer to a user of the system.\n4. The system as recited in claim 1, wherein, to initiate the process specified by the policy in the IT environment if the positive or negative answer and the confidence level indicate that the process is to be initiated, the policy-based automation mechanism is configured to initiate the process automatically in the IT environment if the positive or negative answer indicates that the process is to be initiated and if the confidence level for the positive or negative answer is higher than a predetermined confidence threshold.\n5. The system as recited in claim 1, wherein the policy-based automation mechanism is configured to evaluate policies to provide automated administration for one or more of a storage management mechanism and an application management mechanism.\n6. The system as recited in claim 1, wherein the inference techniques are implemented according to an uncertainty logic programming language.\n7. The system as recited in claim 6, wherein the uncertainty logic programming language is one of Fuzzy Relational Inference Language (FRIL) and FRIL++.\n8. A system, comprising:\nmeans for evaluating policies each specifying a set of one or more rules and a process to be automatically initiated in an information technology (IT) environment if an evaluation of the policy indicates that the specified process is to be automatically initiated, said means using two or more different inference techniques to evaluate the same policy and generate a positive or negative answer as to whether the process specified by the policy is to be automatically initiated and a confidence level for the positive or negative answer; and\nmeans for automatically initiating the process specified by the policy in the IT environment if the positive or negative answer and the confidence level for the positive or negative answer indicate that the process is to be initiated.\n9. A method, comprising:\nevaluating policies to provide automated computer system administration in an information technology (IT) environment, wherein each policy specifies a set of one or more rules and a process to be automatically initiated in the IT environment if an evaluation of the policy indicates that the process is to be automatically initiated, and wherein said evaluating policies comprises:\naccessing a policy and information relevant to an evaluation of the policy; and\nevaluating the same policy according to the information using two or more different inference techniques including one or more of probability calculus, fuzzy logic and evidential logic to generate a positive or negative answer as to whether a process specified by the policy is to be automatically initiated and a confidence level for the positive or negative answer;\ninitiating the process specified by the policy in the IT environment if the positive or negative answer and the confidence level indicate that the process is to be initiated; and\nnot initiating the process specified by the policy in the IT environment if the positive or negative answer and the confidence level indicate that the process is not to be initiated.\n10. The method as recited in claim 9, further comprising providing the positive or negative answer and the confidence level for the positive or negative answer to a user in the IT environment.\n11. The method as recited in claim 9, wherein said initiating the process specified by the policy in the IT environment if the positive or negative answer and the confidence level indicate that the process is to be initiated comprises automatically initiating the process in the IT environment if the positive or negative answer indicates that the process is to be initiated and if the confidence level for the positive or negative answer is higher than a predetermined confidence threshold.\n12. The method as recited in claim 9, wherein said automated computer system administration in the IT environment comprises automated administration of one or more of a storage management mechanism and an application management mechanism.\n13. The method as recited in claim 9, wherein the inference techniques are implemented according to one of Fuzzy Relational Inference Language (FRIL) and FRIL++.\n14. A computer-accessible storage medium comprising program instructions, wherein the program instructions are configured to implement:\nevaluating policies to provide automated computer system administration in an information technology (IT) environment, wherein each policy specifies a set of one or more rules and a process to be automatically initiated in the IT environment if an evaluation of the policy indicates that the process is to be automatically initiated, and wherein said evaluating policies comprises:\naccessing a policy and information relevant to an evaluation of the policy;\nevaluating the same policy according to the information using two or more different inference techniques including one or more of probability calculus, fuzzy logic and evidential logic to generate a positive or negative answer as to whether a process specified by the policy is to be automatically initiated and a confidence level for the positive or negative answer; and\ninitiating the process specified by the policy in the IT environment if the positive or negative answer and the confidence level indicate that the process is to be initiated; and\nnot initiating the process specified by the policy in the IT environment if the positive or negative answer and the confidence level indicate that the process is not to be initiated.\n15. The computer-accessible medium as recited in claim 14, wherein said automated computer system administration in the IT environment comprises automated administration of one or more of a storage management mechanism and an application management mechanism.\n16. A system, comprising:\na processor; and\na memory comprising program instructions, wherein the program instructions are executable by the processor to implement a self-tuning policy evaluation mechanism configured to evaluate policies to provide automated computer system administration in an information technology (IT) environment, wherein each policy specifies a set of one or more rules and a process to be automatically initiated in the IT environment if an evaluation of the policy indicates that the process is to be automatically initiated, and wherein the self-tuning policy evaluation mechanism is configured to:\nevaluate a policy according to information relevant to an evaluation of the policy using two or more different inference techniques to generate results including a positive or negative answer as to whether a process specified by the policy is to be automatically initiated and a confidence level for the positive or negative answer;\ninitiate the process specified by the policy in the IT environment if the positive or negative answer and the confidence level indicate that the process is to be initiated;\nstore the results of the policy evaluation in a database of historical information about the policy; and\naccess the historical information stored in the database in subsequent evaluations of the policy to generate more accurate results.\n17. The system as recited in claim 16, wherein the inference techniques includes one or more of probability calculus, fuzzy logic and evidential logic.\n18. The system as recited in claim 16, wherein, to initiate the process specified by the policy, the self-tuning policy evaluation mechanism is further configured to automatically initiate the process specified by the policy in the IT environment if the positive or negative answer indicates that the process is to be initiated and if the confidence level for the positive or negative answer is higher than a predetermined confidence threshold.\n19. The system as recited in claim 16, wherein the self-tuning policy evaluation mechanism is configured to evaluate policies to provide automated administration for one or more of a storage management mechanism and an application management mechanism.\n20. The system as recited in claim 16, wherein the inference techniques are implemented according to one of Fuzzy Relational Inference Language (FRIL) and FRIL++.\n21. A system for providing automated computer system administration in an information technology (IT) environment according to policy evaluations, comprising:\nmeans for evaluating policies each specifying a set of one or more rules and a process to be automatically initiated in an information technology (IT) environment if an evaluation of the policy indicates that the specified process is to be automatically initiated, said means using two or more different inference techniques to evaluate the same policy and generate results including a positive or negative answer and a confidence level for the positive or negative answer;\nmeans for initiating the process specified by the policy in the IT environment if the positive or negative answer and the confidence level indicate that the process is to be initiated;\nmeans for storing the results of the policy evaluations as historical information about the policy; and\nmeans for applying the historical information about the policy in subsequent evaluations of the policy to generate more accurate results.\n22. A method, comprising:\nevaluating policies to provide automated computer system administration in an information technology (IT) environment, wherein each policy specifies a set of one or more rules and a process to be automatically initiated in the IT environment if an evaluation of the policy indicates that the process is to be automatically initiated, and wherein said evaluating policies comprises:\nevaluating a policy according to information relevant to an evaluation of the policy using two or more different inference techniques including one or more of probability calculus, fuzzy logic and evidential logic to generate results including a positive or negative answer as to whether a process specified by the policy is to be automatically initiated and a confidence level for the positive or negative answer;\ninitiating the process specified by the policy in the IT environment if the positive or negative answer and the confidence level indicate that the process is to be initiated;\nstoring the results of the policy evaluation in a database of historical information about the policy; and\naccessing the historical information stored in the database in subsequent evaluations of the policy to generate more accurate results.\n23. The method as recited in claim 22, wherein said initiating the process specified by the policy in the IT environment comprises automatically initiating the process specified by the policy in the IT environment if the positive or negative answer indicates that the process is to be initiated and if the confidence level for the positive or negative answer is higher than a predetermined confidence threshold.\n24. The method as recited in claim 22, wherein said automated computer system administration in the IT environment comprises automated administration of one or more of a storage management mechanism and an application management mechanism.\n25. The method as recited in claim 22, wherein the inference techniques are implemented according to one of Fuzzy Relational Inference Language (FRIL) and FRIL++.\n26. A computer-accessible storage medium comprising program instructions, wherein the program instructions are configured to implement:\nevaluating policies to provide automated computer system administration in an information technology (IT) environment, wherein each policy specifies a set of one or more rules and a process to be automatically initiated in the IT environment if an evaluation of the policy indicates that the process is to be automatically initiated, and wherein said evaluating policies comprises:\nevaluating a policy according to information relevant to an evaluation of the policy using two or more different inference techniques including one or more of probability calculus, fuzzy logic and evidential logic to generate results including a positive or negative answer as to whether a process specified by the policy is to be automatically initiated and a confidence level for the positive or negative answer;\ninitiating the process specified by the policy in the IT environment if the positive or negative answer and the confidence level indicate that the process is to be initiated;\nstoring the results of the policy evaluation in a database of historical information about the policy; and\naccessing the historical information stored in the database in subsequent evaluations of the policy to generate more accurate results.\n27. The computer-accessible medium as recited in claim 26, wherein, in said initiating the process specified by the policy in the IT environment, the program instructions are configured to further implement automatically initiating the process specified by the policy in the IT environment if the positive or negative answer indicates that the process is to be initiated and if the confidence level for the positive or negative answer is higher than a predetermined confidence threshold.\n28. The computer-accessible medium as recited in claim 26, wherein said automated computer system administration in the IT environment comprises automated administration of one or more of a storage management mechanism and an application management mechanism.\n29. A system for automated administration of an information technology (IT) environment, comprising:\na plurality of decision engines comprising:\none or more local decision engines each configured to provide automated administration for one component in the IT environment according to one or more local policies for the component, wherein each local policy specifies a set of one or more rules and a process to be automatically initiated in the IT environment if an evaluation of the local policy indicates that the process is to be automatically initiated; and\na central decision engine configured to provide automated administration of the IT environment according to one or more high-level policies for the IT environment, wherein each high-level policy specifies a set of one or more rules and a process to be automatically initiated in the IT environment if an evaluation of the high-level policy indicates that the process is to be automatically initiated;\nwherein each of the decision engines is configured to:\nevaluate a policy associated with the decision engine according to information relevant to an evaluation of the policies using two or more different inference techniques including probability calculus, fuzzy logic and evidential logic to generate results including a positive or negative answer as to whether a process specified by the policy is to be automatically initiated and a confidence level for the positive or negative answer; and\nautomatically initiate the process specified by the policy in the IT environment if the positive or negative answer indicates that the process is to be initiated and if the confidence level for the positive or negative answer is higher than a predetermined confidence threshold.\n30. The system as recited in claim 29, wherein the components include one or more of a storage management mechanism and an application management mechanism.\n31. The system as recited in claim 29, wherein the local decision engines are further configured to provide the results of local policy evaluations to the central decision engine for use in evaluations of the high-level policies for the IT environment.\n32. The system as recited in claim 29, wherein, to provide automated administration of the IT environment according to one or more high-level policies for the IT environment, the central decision engine is configured to:\nevaluate the high-level policies using two or more different inference techniques to generate results including positive or negative answers as to whether processes specified by the high-level policies is to be automatically initiated and associated confidence levels for the positive or negative answers generated by the high-level policy evaluations; and\ndelegate local policies to the one or more local decision engines for evaluation.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US20030051026A1",
        "US20030172133A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20060025962A1",
        "US20060230432A1",
        "US20060277591A1",
        "US20070112870A1",
        "US20070150936A1",
        "US20070239700A1",
        "US20070255759A1",
        "US20090089072A1",
        "US20090132557A1",
        "EP2120192A1",
        "US20100106933A1",
        "WO2010123576A2",
        "US20110093426A1",
        "US8364623B1",
        "US9026996B2",
        "US20170134793A1",
        "US9749193B1",
        "TWI602133B",
        "US10313346B1"
    ],
    "citedby_ftf": []
}