{
    "patent_link": "https://patents.google.com/patent/US5414632A/en",
    "patent_id": "US5414632A",
    "title": "System and method for predicting failure in machine tool",
    "abstract": "In system and method for predicting an occurrence of failure in a machine tool, at least one monitor data (for example, position deviation variable of a tool with respect to a target position of the tool as a result of rotation of a servomotor) which is changed according to an operating situation in a series of working processes in the machine tool is detected, a prediction level of failure against the monitor data is set, the prediction level being set according to the operating situation, a comparison period of time is set according to the series of the working processes, the monitor data detected is compared with the prediction level set during a predetermined one of the series of working processes of the machine tool set as the comparison period of time, a failure prediction signal is output when the value of the monitor data exceeds the prediction level, and the prediction of the occurrence of failure is informed through a CRT on the basis of the received failure prediction signal.",
    "inventors": [
        "Yasumasa Mochizuki",
        "Tomoaki Yoshino",
        "Shinichi Hasegawa",
        "Masakazu Sano"
    ],
    "assignee": "JATCO Ltd",
    "classifications": [
        "G05B19/406",
        "G05B2219/37083",
        "G05B2219/37245",
        "G05B2219/41363",
        "G05B2219/42308",
        "G05B2219/42327",
        "G05B2219/42328",
        "G05B2219/42329",
        "G05B2219/50197",
        "G05B2219/50276"
    ],
    "claims": "\n1. A system for predicting an occurrence of failure in a machine tool, comprising:\na) first means for detecting a monitor data which is changed according to an operating situation in a series of working processes of the machine tool within an operating cycle, said first means including fifth means for detecting a position deviation variable of a tool as a result of rotation of a servomotor installed in the machine tool as the monitor data, the position deviation variable being defined as a deviation in position of the tool between contents of a movement instruction for the tool derived from a CPU to the servomotor and contents of an output pulse signal of a pulse encoder indicating an actual movement distance of the tool;\nb) second means for variably setting a prediction level of failure against the monitor data, the prediction level being varied according to different types of operating situations in the machine tool within the operating cycle;\nc) third means for comparing the monitor data detected by the first means with the prediction level set by the second means during a predetermined one of the series of working processes of the machine tool, said predetermined one of the series of working processes including the servomotor rotation, and outputting a failure prediction signal when the value of the monitor data exceeds the prediction level; and\nd) fourth means for informing the prediction of the occurrence of failure on the basis of the received failure prediction signal.\n2. A system for predicting an occurrence of failure in a machine tool as set forth in claim 1, wherein said machine tool is a Numerical Control machine tool which is operated in accordance with a predetermined working program and wherein said third means sets the predetermined working process as a comparison period of time during which the third means compares the monitor data with the prediction level on the basis of a time during which a predetermined command in the working program of the Numerical Control machine tool has been processed.\n3. A system for predicting an occurrence of failure in a machine tool as set forth in claim 2, wherein said third means sets the comparison period on the time when a constant speed feed of the tool with no load on the tool is carried out.\n4. A system for predicting an occurrence of failure in a machine tool as set forth in claim 3, wherein said third means sets the comparison period of time in such a way that the third means reads a working program stored in a RAM and determines that a M code is present in one of the series of working programs on the movement instruction read from the RAM, the read timing of the M code being a start timing of the comparison period of time, and determines that an end signal of completion of processing of the movement instruction is output from the CPU, the read timing of the end signal being an end timing of the comparison period of time.\n5. A system for predicting an occurrence of failure in a machine tool as set forth in claim 4, wherein said second means sets the prediction level which is a predetermined multiplied number as large as a maximum follow-up deviation variable emax when the machine tool moves the tool at its maximum speed Vmax.\n6. A system for predicting an occurrence of failure in a machine tool as set forth in claim 5, wherein said second means includes a data input device of the NC machine tool.\n7. A system for predicting an occurrence of failure in a machine tool as set forth in claim 6, wherein said third means includes a Programmable Controller connected to the CPU via a system bus.\n8. A system for predicting an occurrence of failure in a machine tool as set forth in claim 7, wherein said fourth means includes a micro-executor, a CRT controller, and a CRT, the micro-executor being operated to switch a displayed image on the CRT to a prediction image when said Programmable Controller determines that a detected position deviation variable exceeds the prediction level, to compare a magnitude of a present value of the detected position deviation variable with that of a previous value thereof, and to output a larger value of the present and previous values of the position deviation variable to the CRT controller as a peak value so that the CRT displays the prediction image on which the peak value is superimposed together with the prediction level and the presently detected deviation variable.\n9. A system for predicting an occurrence of failure in a machine tool as set forth in claim 2, wherein said first means detects a time duration defined as an orientation time during which in order to carry out a tool replacement a CPU issues an instruction to position and stop a main axle installed in the machine tool at a constant rotation position and the operation in response thereto at the main axle is actually ended.\n10. A system for predicting an occurrence of failure in a machine tool as set forth in claim 9, wherein said third means sets the comparison period of time on the basis of the orientation time when the machine tool operates normally.\n11. A system for predicting an occurrence of failure in a machine tool as set forth in claim 10, wherein said orientation time is a time duration during which the CPU issues an orientation start instruction and thereafter the CPU issues an orientation end signal and the orientation end signal is input into a system bus via an input/output unit on a basis of an output signal of a position sensor for detecting a rotation position of the main axle.\n12. A system for predicting an occurrence of failure in a machine tool as set forth in claim 2, wherein said first means detects a time duration defined as a speed arrival time during which a main axle installed in the machine tool reaches a predetermined rotation speed from a predetermined time at which the main axle starts rotation.\n13. A system for predicting an occurrence of failure in a machine tool as set forth in claim 12, wherein said third means sets the comparison period of time on the basis of the speed arrival time when the machine tool operates normally.\n14. A system for predicting an occurrence of failure in a machine tool as set forth in claim 13, wherein said speed arrival time is a time duration during which a predetermined check flag incorporated into the working program for the main tool operation is read by a Programmable Controller, thereafter, a rotation instruction to rotate the main axle a predetermined target rotation speed is issued, the issued timing of the rotation instruction being a start timing for the measurement of the speed arrival time and a speed arrival signal is derived from a main axle amplifier via an input/output unit to a system bus, the timing at which the speed arrival signal is output being an end timing of the measurement of the speed arrival time.\n15. A system for predicting an occurrence of failure in a machine tool comprising:\na) first means for detecting a monitor data which is changed according to an operating situation in a series of working processes of the machine tool within an operating cycle, said first means including fifth means for detecting a load current of a servomotor installed in the machine tool as the monitor data, sixth means for detecting a position deviation variable of the servomotor, seventh means for detecting an orientation time of a main axle of the machine tool, and eighth means for detecting a speed arrival time at which the rotation of the main axle reaches a predetermined target speed;\nb) second means for variably setting a prediction level of failure against the monitor data, the prediction level being varied according to different types of operating situations in the machine tool within the operating cycle;\nc) third means for comparing the monitor data detected by the first means with the prediction level set by the second means during a predetermined one of the series of working processes of the machine tool, said predetermined one of the series of working processes including servomotor operation and main axle rotation, and outputting a failure prediction signal when the value of the monitor data exceeds the prediction level; and\nd) fourth means for informing the prediction of the occurrence of failure on the basis of the received failure prediction signal,\nwherein said machine tool is a Numerical Control machine tool which is operated in accordance with a predetermined working program and wherein said third means sets the predetermined working process as a comparison period of time during which the third means compares the monitor data with the prediction level on the basis of a time during which a predetermined command related to the servomotor operation and the main axle rotation in the working program of the Numerical Control machine tool has been processed.\n16. A system for predicting an occurrence of failure in a machine tool as set forth in claim 15, wherein said first means includes a Programmable controller which reads a feedback data from a servo amplifier to a servo controller of a servo mechanism around the servomotor via a data bus.\n17. A system for predicting an occurrence of failure in a machine tool as set forth in claim 16, wherein said third means sets the comparison period of time in such a way that said third means measures a time duration from a time at which a feed of a tool with no load on the tool is started, a point of time at which the time duration has passed being the start timing of the comparison period of time, and said third means determines that an end signal of positioning the tool is issued from a CPU as the end timing of the comparison period.\n18. A system for predicting an occurrence of failure in a machine tool as set forth in claim 17, wherein said third means includes a timer for measuring the time duration during which a large load current rises.\n19. A system for predicting an occurrence of failure in a machine tool as set forth in claim 15, wherein said different types of operating situations include a servomotor operation and a main axle orientation.\n20. A system for predicting an occurrence of failure in a machine tool as set forth in claim 19, wherein said different types of operating situations further include a main axle rotation.\n21. A method for predicting an occurrence of failure in a machine tool, comprising the steps of:\na) detecting at least one monitor data which is changed according to an operating situation in a series of working processes in the machine tool within an operating cycle, said at least one monitor data including a position deviation variable of a tool as a result of rotation of a servomotor installed in the machine tool;\nb) variably setting a prediction level of failure against the monitor data, the prediction level being varied according to different types of operating situations in the machine tool within the operating cycle;\nc) setting a comparison period of time according to the series of the working processes and comparing the monitor data detected in the step a) with the prediction level set in the step b) during a predetermined one of the series of working processes of the machine tool set as the comparison period of time, said predetermined one of the series of working processes including servomotor rotation;\nd) outputting a failure prediction signal when the value of the monitor data exceeds the prediction level; and\ne) informing the prediction of the occurrence of failure on the basis of the received failure prediction signal.\n22. A method for predicting an occurrence of failure in a machine tool, comprising the steps of:\na) detecting at least one monitor data which is changed according to an operating situation in a series of working processes in the machine tool within an operating cycle, said monitor data being a load current of a servomotor installed in the machine tool;\nb) variably setting a prediction level of failure against the monitor data, the prediction level being varied according to different types of operating situations in the machine tool within the operating cycle;\nc) setting a comparison period of time according to the series of the working processes and comparing the monitor data detected in the step a) with the prediction level set in the step b) during a predetermined one of the series of working processes of the machine tool set as the comparison period of time;\nd) outputting a failure prediction signal when the value of the monitor data exceeds the prediction level; and\ne) informing the prediction of the occurrence of failure on the basis of the received failure prediction signal.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4542471A",
        "US4551808A",
        "US4713770A",
        "JPS6314205A",
        "JPH01121637A",
        "US4918616A",
        "US5115403A",
        "US5221884A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5486997A",
        "EP0791872A1",
        "EP0813130A2",
        "US5754451A",
        "US5822212A",
        "WO1998055904A1",
        "US5895177A",
        "US5905989A",
        "US20010012973A1",
        "US20020087290A1",
        "US6442511B1",
        "US20020133320A1",
        "US6490500B1",
        "EP1276027A2",
        "US20030055607A1",
        "US6556939B1",
        "US20030139908A1",
        "US6651032B2",
        "US6748341B2",
        "US20040257217A1",
        "US6934696B1",
        "EP1752845A1",
        "US20070143076A1",
        "US20070229019A1",
        "US20080147361A1",
        "US20080215291A1",
        "US7539597B2",
        "US20100152882A1",
        "US7822578B2",
        "US20110057594A1",
        "US8275577B2",
        "US8311774B2",
        "CN108427374A"
    ],
    "citedby_ftf": [
        "JP2002132310A",
        "DE102004030076A1",
        "JP5360811B2",
        "CN108334033A"
    ]
}