{
    "patent_id": "US-11501194-B2",
    "title": "Managing computational workloads of computing apparatuses powered by renewable resources ",
    "assignee": "Microsoft Technology Licensing, Llc",
    "publication_date": "2022-11-15",
    "patent_link": "https://patents.google.com/patent/US11501194B2/en",
    "inventors": [
        "David Tennyson Harper, III",
        "Eric C. Peterson",
        "Shaun L. Harris",
        "Christian L. Belady"
    ],
    "classifications": [
        "G06N7/005",
        "G06F1/329",
        "G06N7/01",
        "G01W1/10",
        "G06F1/3206",
        "Y02D10/00"
    ],
    "abstract": "A method described herein includes an act of receiving data that is indicative of predicted weather conditions for a particular geographic region, wherein the particular geographic region has an energy generation system therein, and wherein the energy generation system utilizes at least one renewable energy resource to generate electrical power. The method also includes the act of scheduling a computational workload for at least one computer in a data center based at least in part upon the data that is indicative of the predicted weather conditions for the particular geographic region.",
    "claims": "\n1. A method executed by a computing system, comprising:\nscheduling a computational workload for a computing device in a data center based upon:\nan amount of electrical power that is predicted to be provided to the data center by a power system at a point in time in the future, wherein the power system generates different amounts of electrical power as weather conditions change; and\na service level agreement (SLA) for a customer of the data center,\nwherein the computing device executes the computational workload based upon the scheduling of the computational workload.\n2. The method of claim 1, further comprising:\nscheduling a second computing device in the data center for maintenance based upon a second amount of electrical power that is predicted to be provided to the data center by the power system at a second point in time in the future.\n3. The method of claim 1, wherein the amount of electrical power that is predicted to be provided to the data center at the point in time in the future is based upon a predicted weather condition at a geographic location.\n4. The method of claim 3, wherein the predicted weather condition at the geographic location is based upon:\nhistorical data obtained from a plurality of sources; and\noutput of a sensor located at the geographic location, the output of the sensor being indicative of a weather condition at the geographic location.\n5. The method of claim 4, wherein the plurality of sources include one or more of:\na weather service;\nan airport;\nan Internet web site; or\na television station.\n6. The method of claim 1, further comprising:\nprior to scheduling the computational workload for the computing device in the data center, generating a probability that a weather condition will occur; and\ngenerating a predicted range of values for the weather condition, wherein the amount of power that is predicted to be provided to the data center by the power system at the point in time in the future is based upon the probability and the predicted range of values.\n7. The method of claim 6, wherein the predicted range of values is a range of wind velocity values.\n8. The method of claim 6, wherein the predicted range of values is a range of solar radiation values.\n9. The method of claim 1, wherein the SLA includes threshold computing requirements for the customer that are to be satisfied by the data center.\n10. The method of claim 1, wherein the power system generates electrical power based upon a renewable resource.\n11. A computing system comprising:\na processor; and\nmemory storing instructions that, when executed by the processor, cause the processor to perform acts comprising:\nscheduling a computational workload for a computing device in a data center based upon:\nan amount of electrical power that is predicted to be provided to the data center by a power system at a point in time in the future, wherein the power system generates different amounts of electrical power based upon a renewable resource as weather conditions change; and\na service level agreement (SLA) for a customer of the data center,\nwherein the computing device executes the computational workload based upon the scheduling of the computational workload.\n12. The computing system of claim 11, wherein the amount of electrical power that is predicted to be provided to the data center at the point in time in the future is based upon a predicted weather condition at a geographic location.\n13. The computing system of claim 12, wherein the predicted weather condition at the geographic location is based upon:\nhistorical data obtained from a plurality of sources; and\noutput of a sensor located at the geographic location, the output of the sensor being indicative of a weather condition at the geographic location.\n14. The computing system of claim 13, wherein the output of the sensor is indicative of one or more of:\nwind speed;\nbarometric pressure;\ntemperature; or\nhumidity.\n15. The computing system of claim 11, wherein scheduling the computational workload for the computing device in the data center is further based upon a current amount of electrical power being generated by the power system.\n16. The computing system of claim 11, wherein the power system is a solar power system or a wind power system.\n17. The computing system of claim 11, wherein scheduling the computational workload for the computing device in the data center is further based upon a second SLA for a second customer of the data center.\n18. The computing system of claim 11, wherein the SLA comprises a guarantee with respect to system uptime of the data center.\n19. A system comprising:\na power system that generates electrical power based upon a renewable resource;\na data center that comprises a plurality of computing devices, wherein the power system provides the data center with the electrical power; and\na computing device that is configured to:\nschedule a computational workload for at least one computing device in the plurality of computing devices in the data center based upon:\nan amount of electrical power that is predicted to be provided to the data center by the power system at a point in time in the future, wherein the power system generates different amounts of electrical power as weather conditions change; and\na service level agreement (SLA) for a customer of the data center,\nwherein the at least one computing device executes the computational workload based upon the scheduling of the computational workload.\n20. The system of claim 19, wherein the computing device is further configured to:\npredict a weather condition, wherein the amount of electrical power that is predicted to be provided to the data center at the point in time in the future is based upon the predicted weather condition.",
    "status": "Active",
    "citations_own": [
        "US6449603B1",
        "US20020194113A1",
        "US6581008B2",
        "US20030193777A1",
        "US20040167676A1",
        "US20050039787A1",
        "US20070250838A1",
        "US20090265568A1",
        "US20090276095A1",
        "US20100023174A1",
        "US20100037225A1",
        "US20100057641A1",
        "US7698233B1",
        "US20100138062A1",
        "US20100161147A1",
        "US20100198420A1",
        "US20100211669A1",
        "US7783390B2",
        "US20100213761A1",
        "US20100228861A1",
        "US20110040550A1",
        "US20110040417A1",
        "US7962769B1",
        "US20110144814A1",
        "US20110145621A1",
        "US20110276269A1",
        "US20110282982A1",
        "US20110307109A1",
        "US20120005683A1",
        "US20120065788A1",
        "US8700929B1",
        "US20140298349A1",
        "US9159042B2",
        "US9405348B2"
    ],
    "citations_ftf": [],
    "citedby_own": [],
    "citedby_ftf": [
        "US10746901B2",
        "US9348394B2",
        "US9030048B2",
        "JP5582016B2",
        "US9069103B2",
        "US8548640B2",
        "WO2013002155A1",
        "US9945980B2",
        "US9037443B1",
        "US9229786B2",
        "WO2015073996A2",
        "US9429925B2",
        "US11068799B2",
        "US10454273B2",
        "US11070058B2",
        "US9881108B2",
        "CN107709764B",
        "US10928816B2",
        "DK201570559A1",
        "WO2017000963A1",
        "CN106443833B",
        "US10613252B1",
        "DE102016104070A1",
        "US10495787B2",
        "CN106525415B",
        "US10819116B2",
        "US11733427B1",
        "CN107169555B",
        "CN111448431A",
        "US10923915B2",
        "CN109103926B",
        "US10975836B2",
        "US20220173597A1",
        "US20220173598A1",
        "CN112507619A"
    ]
}