{
    "patent_link": "https://patents.google.com/patent/US5416067A/en",
    "patent_id": "US5416067A",
    "title": "Dry, water-soluble, substituted phenoxy and/or benzoic acid herbicides and method of preparing same",
    "abstract": "A dry, water-soluble, substituted phenoxy and/or benzoic acid herbicide is prepared by grinding and dry blending the herbicide in acid form with anhydrous trisodium phosphate or tripotassium phosphate which functions as a solid solubilization medium. From about 0.6 mole to about 16.9 moles of the medium is provided for each mole of active herbicidal agent in the initially dry blended mixture. Herbicidal agents are selected from the group consisting of 2,4-D, 2,4-DB, MCPP, MCPA, dichlorprop, dicamba, and chloramben.",
    "inventors": [
        "John L. Van Haften",
        "Roger P. Cahoy"
    ],
    "assignee": "Pbi-Gordon Corp",
    "classifications": [
        "A01N25/08",
        "A01N37/40",
        "A01N37/44",
        "A01N39/02",
        "A01N39/04"
    ],
    "claims": "\n1. A dry, water-soluble substituted phenoxy and/or benzoic acid herbicide powder composition consisting essentially of:\na dry blended admixture of\na first quantity of dry, powder particles of a substantially solid herbicidal agent selected from the group consisting of substituted herbicidally active phenoxy acids and substituted herbicidally active benzoic acids selected from the group consisting of (2,4-dichlorophenoxy)acetic acid (2,4-D), 4-(2,4-dichlorophenoxy)butanoic acid (2,4-DB), (+)-2-(4-chloro-2-methylphenoxy) propanoic acid (MCPP), (4-chloro-2-methylphenoxy) acetic acid (MCPA), (+)-2-(2,4-dichlorophenoxy)propanoic acid (dichlorprop), 3,6-dichloro-2-methoxybenzoic acid (dicamba), and 3-amino-2,5-dichlorobenzoic acid (chloramben), which alone are not readily soluble in water, and\na second quantity of dry, solid, powder particles selected from the group consisting of trisodium phosphate and tripotassium phosphate as a solubilization medium for the herbicidal agent,\nsaid first and second quantities of the herbicidal agent and the solubilization medium being the predominate constituents of the composition,\nthere being from about 0.6 mole to about 16.9 moles of solubilization medium for each mole of herbicidal agent,\nsaid herbicidal agent and the solubilization medium having been dry blended in powdered form without changing the physical state of the particles to retain the discrete particulate character of each of said first and second quantities of said particles, and in the absence of chemical reaction between said herbicidal agent and said solubilization medium to form a relatively uniform dry mixture thereof,\nthere being a sufficient quantity of the phosphate medium in the dry blended mixture in relationship to the quantity of herbicidal agent combined therewith such that the dry blended powder mixture will dissolve in water during preparation of a herbicidal solution therefrom that contains an adequate proportion of the herbicidal agent to provide from about 0.1 to about 21/2% by weight of the active herbicidal agent in the herbicidal solution.\n2. An herbicide as set forth in claim 1 wherein said dry solubilization medium is trisodium phosphate.\n3. An herbicide as set forth in claim 1 wherein said dry solubilization medium is tripotassium phosphate.\n4. An herbicide as set forth in claim 1 wherein the dry blended admixture includes a mixture of substituted phenoxy acid and substituted benzoic acid herbicides.\n5. An herbicide as set forth in claim 1 wherein said active substituted phenoxy acid herbicidal agent is 2,4-dichlorophenoxy acetic acid.\n6. An herbicide as set forth in claim 1 wherein said active substituted phenoxy acid herbicidal agent is 4-(2,4-dichlorophenoxy)butanoic acid.\n7. An herbicide as set forth in claim 1 wherein said active substituted phenoxy acid herbicidal agent is (±)-2-(4-chloro-2-methylphenoxy)propanoic acid.\n8. An herbicide as set forth in claim 1 wherein said active substituted phenoxy acid herbicidal agent is (4-chloro-2-methylphenoxy)acetic acid.\n9. An herbicide as set forth in claim 1 wherein said active substituted phenoxy acid herbicidal agent is (±)-2-(2,4-dichlorophenoxy)propanoic acid.\n10. An herbicide as set forth in claim 1 wherein said active substituted benzoic acid herbicidal agent is 3,6-dichloro-2-methoxybenzoic acid.\n11. An herbicide as set forth in claim 1 wherein said active substituted benzoic acid herbicidal agent is 3-amino-2,5-dichlorobenzoic acid.\n12. An herbicide as set forth in claim 1 wherein is included a mixture of said herbicidally active agents which are dry blended with the phosphate medium.\n13. An herbicide as set forth in claim 1 wherein is included an anti-caking agent relatively uniformly distributed throughout in the dry blended mixture.\n14. A method of preparing a dry, water-soluble, substituted phenoxy and/or benzoic acid herbicide powder composition consisting essentially of the steps of:\nproviding a first quantity of dry, powder particles of a substantially solid herbicidal agent selected from the group consisting of herbicidally active phenoxy acids and substituted herbicidally active benzoic acids selected from the group consisting of (2,4-dichlorophenoxy)acetic acid (2,4-D), 4-(2,4-dichlorophenoxy)butanoic acid (2,4-DB), (+)-2-(4-chloro-2-methylphenoxy)propanoic acid (MCPP), (4-chloro-2-methylphenoxy)acetic acid (MCPA), (+)-2-(2,4-dichlorophenoxy)propanoic acid (dichlorprop), 3,6-dichloro-2-methoxybenzoic acid (dicamba), and 3-amino-2,5-dichlorobenzoic acid (chloramben), which are not readily soluble in water;\nproviding a second quantity of dry, solid powder particles selected from the group consisting of trisodium phosphate and tripotassium phosphate as a solubilization medium for the herbicidal agent,\nsaid first and second quantities of the herbicidal agent and the solubilization medium being the predominate constituents of the composition,\nthere being at from 0.6 mole to 16.9 moles of solubilization medium for each mole of herbicidal agent; and\ndry blending the herbicidal agent and the solubilization medium in powdered form without changing the physical state of the particles to retain the discrete particulate character of each of said first and second quantities of said particles, and in the absence of chemical reaction between said herbicidal agent and said solubilization medium to produce a relatively uniform dry mixture thereof,\na sufficient quantity of the phosphate solubilization medium being provided in the dry blended mixture in relationship to the quantity of herbicidal agent combined therewith to cause the powdered dry blended mixture to substantially dissolve in water during preparation by the applicator of a herbicidal solution which contains an adequate proportion of the herbicidal agent to provide from about 0.1% to about 21/2% by weight of the active herbicidal agent in the herbicidal solution.\n15. A method as set forth in claim 14 wherein said dry solubilization medium is trisodium phosphate.\n16. A method as set forth in claim 14 wherein said dry solubilization medium is tripotassium phosphate.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US4015970A",
        "US5022182A",
        "US5022917A",
        "US5221319A",
        "US5332614A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5819226A",
        "US20020107149A1",
        "US20030153461A1",
        "US6714918B2",
        "WO2005102302A1",
        "US20060032911A1",
        "US20060270557A1"
    ],
    "citedby_ftf": []
}