{
    "patent_link": "https://patents.google.com/patent/US20020055906A1/en",
    "patent_id": "US20020055906A1",
    "title": "Methods and apparatus for intelligent selection of goods and services in telephonic and electronic commerce",
    "abstract": "Apparatus and methods are provided for effecting remote commerce, such as in telemarketing (either inbound or outbound) and in electronic commerce, which are particularly adapted for the intelligent selection and proffer of products, services or information to a user or customer. In one aspect of the invention, goods, service or information are provided to the user via electronic communication, such as through a telephone, videophone or other computer link, as determined by the steps of first, establishing communication via the electronic communications device between the user and the system to effect a primary transaction or primary interaction, second, obtaining data with respect to the primary transaction or primary interaction, including at least in part a determination of the identity of the user or prospective customer, third, obtaining at least a second data element relating to the user, fourth, utilizing the primary transaction or primary interaction data along with the at least second data element as factors in determining at least one good, service or item of information for prospective upsell to the user or prospective customer, and offering the item to the prospective customer. In the preferred embodiment, the selection of the proffer of goods, services or information comprises an upsell with respect to the primary transaction or primary interaction data. The offer of the upsell is preferably generated and offered in real time, that is, during the course of the communication initiated with the primary transaction or primary interaction.",
    "inventors": [
        "Ronald Katz",
        "Gary West",
        "Thomas Barker"
    ],
    "assignee": "Intrado Corp",
    "classifications": [
        "G06Q20/10",
        "G06Q30/02",
        "G06Q30/0601",
        "G06Q40/03"
    ],
    "claims": "\n1. A method for providing offers of goods or services in the form of offers for purchase by potential customers as users of a system, utilizing an electronic communications link between the user and the offeror, comprising the steps of:\nestablishing a communication via the electronic communications link between the user and the offeror for the purpose of a user initiated primary transaction for purchase of a specific good or service,\nobtaining primary transaction data with respect to the primary transaction, including the identity of the prospective customer and of the good or service for purchase in the primary transaction,\ngenerating an upsell offer as a result of the user initiated primary transaction by:\nutilizing the primary transaction data to obtain credit information relating to the user,\nutilizing at least in part the primary transaction data including the identity of the good or service of the primary transaction and the credit information and determining at least one item for a prospective upsell transaction with the prospective customer, and\noffering the item to the prospective customer and receiving an acceptance of the offer from at least one user.\n2. The method for providing offers of claim 1 wherein the credit information includes a credit score.\n3. The method for providing offers of claim 2 wherein the credit information includes a FICA/FICO score.\n4. The method for providing offers of claim 1 wherein the credit information includes a loan-to-value percentage.\n5. The method for providing offers of claim 1 wherein the credit information includes a home equity value.\n6. The method for providing offers of claim 1 wherein the credit information includes an income value.\n7. The method for providing offers of claim 6 wherein the income value is a net income for the user.\n8. A method for providing offers of goods or services in the form of offers for purchase to prospective customers as users of a system, utilizing at least two electronic communications links between the user and the offeror, comprising the steps of:\nestablishing a first communication via a first electronic communications link between the user and the offeror for the purpose of a user initiated primary transaction,\nobtaining primary transaction data with respect to the primary transaction, including the identity of the prospective customer,\ngenerating an upsell offer as a result of the user initiated primary transaction by:\nutilizing the identity of the prospective customer to obtain at least a second data element relating to the user,\nutilizing at least in part the primary transaction data including the identity of the prospective customer and the second data element and determining at least one item for a prospective upsell transaction with the prospective customer,\nestablishing a second communication via a second electronic communications link between the user and the offeror, and\noffering the item for a prospective upsell to the prospective customer via the second electronic communications link and receiving an acceptance of the offer from at least one user.\n9. The method for providing offers of claim 8 wherein the first electronic communications link is an electronic communication network.\n10. The method for providing offers of claim 9 wherein the electronic communication network is the internet.\n11. The method for providing offers of claim 9 wherein the second electronic communications link is telephonic communication.\n12. The method for providing offers of claim 9 wherein the second electronic communication link is a facsimile.\n13. The method for providing offers of claim 9 wherein the second electronic communication link is e-mail.\n14. The method for providing offers of claim 8 wherein the first electronic communication link is telephonic communication.\n15. The method for providing offers of claim 14 wherein the second electronic communication link is a facsimile.\n16. The method for providing offers of claim 14 wherein the second electronic communication link is e-mail.\n17. The method for providing offers of claim 14 wherein the second electronic communication link is a cable connection.\n18. The method for providing offers of claim 14 wherein the second electronic communication link is the internet.\n19. The method of claim 8 wherein the primary transaction is for the purchase of a specific good or service.\n20. The method of claim 19 wherein the identity of the specific good or service is used in the determination of the item for a prospective upsell transaction.\n21. The method of claim 8 wherein the offer of an item for a prospective upsell is made in real time during the course of the user initiated communication.\n22. The method of claim 8 wherein the identification data includes user specific data.\n23. The method of claim 22 wherein the user specific data includes the user's electronic address.\n24. The method of claim 23 wherein the user's electronic address includes an electronic mail (e-mail) address.\n25. The method of claim 8 wherein the primary transaction data includes user local identification data.\n26. The method of claim 25 wherein the user local identification data is a user's telephone number.\n27. The method of claim 8 wherein the identity of the prospective customer is further used to access third party data to obtain another data element relating to the user, the said another data element being utilized in the said determining of at least one item for a prospective upsell transaction with the prospective customer.\n28. The method of claim 27 wherein the third party data is external to the system.\n29. The method of claim 28 wherein the third party data is combined with local database data.\n30. A method for providing offers of goods or services in the form of offers for purchase to potential customers as users of a system, utilizing an electronic communications device, comprising the steps of:\nestablishing a communication via the electronic communications device between the user and the system for the purpose of a user initiated primary transaction,\nobtaining primary transaction data with respect to the primary transaction, including the identity of the prospective customer,\ngenerating an upsell offer as a result of the user initiated primary transaction by:\nutilizing the identity of the prospective customer to obtain at least a second data element relating to the user,\nutilizing at least in part the primary transaction data and the second data element and determining at least one item for a prospective upsell transaction with the prospective customer, and\noffering the item to the prospective customer,\nwherein said electronic communications device is one of the group comprising an automatic teller machine, an electronic signature device, an automatic ticket sales device, and a networked vending machine.\n31. The method of claim 30 wherein the identification data includes user specific data.\n32. The method of claim 31 wherein the user specific data includes the user's electronic address.\n33. The method of claim 32 wherein the user's electronic address includes an electronic mail (e-mail) address.\n34. The method of claim 31 wherein the user specific data includes the user's customer number.\n35. The method of claim 31 wherein the user specific data includes the user's electronic signature.\n36. The method of claim 31 wherein the user specific data includes the user's billing data.\n37. The method of claim 36 wherein the user's billing data includes a credit card number.\n38. The method of claim 36 wherein the user's billing data includes a debit card number.\n39. The method of claim 31 wherein the user specific data includes the user's PIN.\n40. The method of claim 31 wherein the user specific data includes the user's name.\n41. The method of claim 31 wherein the user specific data includes the user's address.\n42. The method of claim 30 wherein the primary transaction data includes user local identification data.\n43. The method of claim 42 wherein the user local identification data is a user's telephone number.\n44. The method of claim 30 wherein the second data element includes demographic information.\n45. The method of claim 44 wherein the demographic information includes an indication of the user's age.\n46. The method of claim 44 wherein the demographic information includes an indication of the user's sex.\n47. The method of claim 44 wherein the demographic information includes an indication of the user's income.\n48. The method of claim 44 wherein the demographic information includes an indication of the user's occupation.\n49. The method of claim 44 wherein the demographic information includes an indication of the user's education level.\n50. The method of claim 44 wherein the demographic information includes an indication of the user's family status.\n51. The method of claim 44 wherein the demographic information includes an indication of the user's lifestyle.\n52. The method of claim 44 wherein the demographic information includes an indication of the user's interests.\n53. The method of claim 44 wherein the demographic information includes a coded indication for the user.\n54. The method of claim 30 wherein the second data element includes credit data.\n55. The method of claim 54 wherein the credit data includes credit data for both the primary transaction and the prospective upsell transaction, the credit data for both the primary transaction and the prospective upsell transactions being obtained at the same time.\n56. A method for providing offers of goods or services in the form of offers for purchase to potential customers as users of a system, utilizing an electronic communications device, comprising the steps of:\nestablishing a communication via the electronic communications device between the user and the system for the purpose of a user initiated primary transaction relating to a specific good or service,\nobtaining primary transaction data with respect to the primary transaction, including at least the method of payment by the user for the primary transaction,\ngenerating an upsell offer as a result of the user initiated primary transaction by:\nutilizing the primary transaction data to obtain at least a second data element relating to the user,\nutilizing at least in part the primary transaction data and the second data element and determining at least one item for a prospective upsell transaction with the prospective customer, and\noffering the item to the prospective customer and receiving an acceptance of the offer from at least one user during the course of the user initiated communication.\n57. The method of claim 56 wherein the method of payment is a credit card.\n58. The method of claim 56 wherein the method of payment is contained in a response to a billed invoice.\n59. The method of claim 56 wherein the electronic communications device is an electronic communication network.\n60. The method of claim 59 wherein the electronic communication network is the internet.\n61. The method of claim 56 wherein the electronic communications device is telephonic communication.\n62. The method of claim 56 wherein a credit availability check is the second data element.\n63. The method of claim 56 wherein chronological information is the second data element.\n64. The method of claim 63 wherein the chronological information is obtained from a calendar.\n65. The method of claim 63 wherein the chronological information is obtained from a clock.\n66. The method of claim 56 wherein credit data is checked in the course of the primary transaction.\n67. The method of claim 66 wherein an indication of the amount of available credit remaining is obtained.\n68. The method of claim 66 wherein the credit data is a credit card authorization.\n69. The method of claim 56 wherein the primary transaction data includes the type of good or service that is the subject of the primary transaction.\n70. The method of claim 56 wherein the primary transaction data includes the specific good or service that is the subject of the primary transaction.\n71. A method for providing offers of goods or services in the form of offers for purchase to potential customers as users of a system, utilizing an electronic communications device, comprising the steps of:\nestablishing a communication via the electronic communications device between the user and the system for the purpose of a user initiated primary transaction relating to a specific good or service, obtaining primary transaction data with respect to the primary transaction, including the identity of the user,\ngenerating an upsell offer as a result of the user initiated primary transaction by:\nutilizing the primary transaction data to obtain at least a second data element relating to the user,\nutilizing at least in part the primary transaction data and the second data element and determining at least one item for a prospective upsell transaction with the prospective customer, and\noffering the item to the prospective customer and receiving an acceptance of the offer from at least one user during the course of the user initiated communication.\n72. The method of claim 71 wherein the second data element includes the actual income of the user.\n73. The method of claim 71 wherein the second data element includes the estimated income of the user.\n74. The method of claim 71 wherein the second data element includes prior purchasing data of the user.\n75. The method of claim 74 wherein the prior purchasing data includes prior credit card purchase data.\n76. The method of claim 74 wherein the prior purchasing data includes prior debit card purchase data.\n77. The method of claim 71 wherein the second data element includes a change to a financial account owned by the user.\n78. The method of claim 71 wherein the second data element includes the creation of a financial account by the user.\n79. The method of claim 77 wherein the change to a financial account comprises a change to the balance of the account.\n80. The method of claim 79 wherein the change to a balance of the account includes a decrease in the value of the account.\n81. The method of claim 79 wherein the change to a balance of the account includes an increase in the value of the account.\n82. The method of claim 77 wherein the change to a financial account comprises the use of a direct deposit feature with the account.\n83. The method of claim 71 wherein the second data element comprises a direct deposit amount for a financial account associated with the user.\n84. The method of claim 71 wherein the second data element comprises a profitability score associated with the user.\n85. The method of claim 71 wherein the second data element comprises credit data associated with the user.\n86. The method of claim 85 wherein the credit data comprises a credit worthiness score.\n87. A method for providing offers of goods or services in the form of offers for purchase by potential customers as users of a system, utilizing an electronic communications link between the user and the offeror, comprising the steps of:\nestablishing a communication via the electronic communications link between the user and the offeror for the purpose of a user initiated primary transaction, obtaining primary transaction data with respect to the primary transaction, generating an upsell offer as a result of the user initiated primary transaction by:\nutilizing at least in part the primary transaction data to determine at least one item for a prospective upsell transaction with the prospective customer,\ndetermining a price for the at least one item for a prospective upsell using dynamic pricing, and\noffering the item to the prospective customer and receiving an acceptance of the offer from at least one user.\n88. The method of claim 87 wherein the primary transaction is for purchase of a specific good or service.\n89. The method of claim 87 wherein the primary transaction data includes the identity of the prospective customer.\n90. The method of claim 87 wherein the primary transaction data includes caller demographic information.\n91. The method of claim 87 wherein the primary transaction data includes caller credit information.\n92. The method of claim 87 wherein the primary transaction data includes caller purchase history information.\n93. The method of claim 87 wherein the price for the at least one item for prospective upsell is based at least in part upon the primary transaction data.\n94. The method of claim 87 wherein the price for the at least one item for prospective upsell is based at least in part upon inventory data.\n95. The method of claim 87 wherein the price for the at least one item for prospective upsell is based at least in part upon the date of the primary transaction.\n96. The method of claim 87 wherein the price for the at least one item for prospective upsell is based at least in part upon the time of day of the primary transaction.",
    "status": "Abandoned",
    "citations_own": [
        "US4195864A",
        "US4706121A",
        "US4758823A",
        "US4792968A",
        "US4799156A",
        "US4812628A",
        "US4845658A",
        "US4910672A",
        "US4967366A",
        "US5010485A",
        "US5237620A",
        "US5293615A",
        "US5295064A",
        "US5327508A",
        "US5369571A",
        "US5398186A",
        "US5442771A",
        "US5446891A",
        "US5483278A",
        "US5500681A",
        "US5515130A",
        "US5532735A",
        "US5535130A",
        "US5537590A",
        "US5566353A",
        "US5592378A",
        "US5615408A",
        "US5630068A",
        "US5675662A",
        "US5679940A",
        "US5687322A",
        "US5687372A",
        "US5701400A",
        "US5713851A",
        "US5717923A",
        "US5721583A",
        "US5732400A",
        "US5732265A",
        "US5732398A",
        "US5749081A",
        "US5748907A",
        "US5748908A",
        "US5754938A",
        "US5761601A",
        "US5774868A",
        "US5778178A",
        "US5780133A",
        "US5782370A",
        "US5790793A",
        "US5790935A",
        "US5806045A",
        "US5815665A",
        "US5821513A",
        "US5826240A",
        "US5838314A",
        "US5842199A",
        "US5870721A",
        "US5873068A",
        "US5878403A",
        "US5878401A",
        "US5890137A",
        "US5914472A",
        "US5918213A",
        "US5933811A",
        "US5940809A",
        "US5948061A",
        "US5970469A",
        "US5970473A",
        "US5991735A",
        "US5999914A",
        "US6009411A",
        "US6010669A",
        "US6014638A",
        "US6014634A",
        "US6018715A",
        "US6018587A",
        "US6029149A",
        "US6035288A",
        "US6125356A",
        "US6138911A",
        "US6196458B1",
        "US6242706B1",
        "US20010014868A1",
        "US6314089B1",
        "US6317722B1",
        "US20020023272A1",
        "US20020026496A1",
        "US6397057B1",
        "US6574614B1",
        "US6598026B1",
        "US20030172000A1",
        "US20030196204A1",
        "US20040019900A1",
        "US20040143838A1",
        "US6823319B1",
        "US20050132404A1"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US20010037250A1",
        "US20020032647A1",
        "WO2002037729A2",
        "US20020147652A1",
        "US20030083955A1",
        "US20030114139A1",
        "US20030233325A1",
        "US20040024888A1",
        "US20040090914A1",
        "US20040117426A1",
        "US20040158480A1",
        "US20040162671A1",
        "US20040167680A1",
        "US20040215508A1",
        "US20040235458A1",
        "US20040243527A1",
        "US20040244029A1",
        "US20040260608A1",
        "US20050004864A1",
        "US20050165637A1",
        "US20050177525A1",
        "US20050273384A1",
        "US20060031884A1",
        "US20060061806A1",
        "US7031935B1",
        "US7031951B2",
        "US20060100937A1",
        "US20060105781A1",
        "US20060107329A1",
        "US20060149854A1",
        "US20060281469A1",
        "US20070016512A1",
        "US20070016499A1",
        "US20070121845A1",
        "US20070179839A1",
        "US20070179879A1",
        "US20070208682A1",
        "US20080008295A1",
        "US20080040262A1",
        "US20080075238A1",
        "US20080089288A1",
        "US20080133538A1",
        "US20080133706A1",
        "US20080183572A1",
        "US20080228636A1",
        "US20080270295A1",
        "US20080294625A1",
        "US20080313122A1",
        "US20090018894A1",
        "US20090024453A1",
        "US20090035069A1",
        "US20090043626A1",
        "US20090077641A1",
        "US20090099935A1",
        "US20090164316A1",
        "US20090182615A1",
        "US20090222327A1",
        "US20090309591A1",
        "US20100057661A1",
        "US20100088124A1",
        "US20100125497A1",
        "US20100191663A1",
        "US7812860B2",
        "US20100262535A1",
        "US20100312613A1",
        "US20100325040A1",
        "US20100332267A1",
        "US20110010258A1",
        "US20110010421A1",
        "US20110060673A1",
        "US20110161813A1",
        "US7990556B2",
        "US7996279B1",
        "US8010422B1",
        "US20110210170A1",
        "US20110258038A1",
        "US8078503B1",
        "US8086503B1",
        "US20110317820A1",
        "US8144850B2",
        "US8155297B1",
        "US8156045B2",
        "US8179563B2",
        "US8201727B1",
        "US20120158461A1",
        "US8261094B2",
        "US8271378B2",
        "US8306908B1",
        "US8315909B1",
        "US8336085B2",
        "US8346617B1",
        "US8346620B2",
        "US8347078B2",
        "US8353046B2",
        "US20130041766A1",
        "US20130080219A1",
        "WO2013043714A1",
        "US20130085809A1",
        "US8418055B2",
        "US8438645B2",
        "US8442331B2",
        "US8447066B2",
        "US8458072B1",
        "US8464348B2",
        "US8489624B2",
        "US8505090B2",
        "US8577916B1",
        "US8600196B2",
        "US8606626B1",
        "US8620083B2",
        "US8639920B2",
        "US8688503B2",
        "US20140095220A1",
        "US8700535B2",
        "US8712857B1",
        "US8725646B2",
        "US8732004B1",
        "US8769567B1",
        "US8781228B2",
        "US8781969B2",
        "US8818888B1",
        "US8874504B2",
        "US8892495B2",
        "US20140344128A1",
        "US8990235B2",
        "US9058340B1",
        "US9075958B2",
        "US9081799B2",
        "US20150235161A1",
        "US9116890B2",
        "US9143638B2",
        "US9152727B1",
        "US9189605B2",
        "US9230283B1",
        "US9256904B1",
        "US9268852B2",
        "US9323784B2",
        "US9363481B2",
        "USD759689S1",
        "USD759690S1",
        "USD760256S1",
        "US9400589B1",
        "US9406085B1",
        "US9436804B2",
        "US20160260182A1",
        "US9443268B1",
        "US9449288B2",
        "US9477737B1",
        "US9536263B1",
        "US9535563B2",
        "US9542553B1",
        "US9552599B1",
        "US9654541B1",
        "US9665854B1",
        "US9710852B1",
        "US9767309B1",
        "US9830646B1",
        "US9853959B1",
        "US9870589B1",
        "US9892457B1",
        "US9928531B2",
        "CN108055359A",
        "US20180253734A1",
        "US10075446B2",
        "US10102570B1",
        "US10108714B2",
        "US10176233B1",
        "US10217131B2",
        "US10255598B1",
        "US10262364B2",
        "US10325314B1",
        "US10552849B2",
        "US10621657B2",
        "US10671749B2",
        "US10678894B2",
        "US10685398B1",
        "US10735406B1",
        "US10810605B2",
        "US11157139B2",
        "US11238656B1",
        "US11257117B1",
        "US11315179B1",
        "US11682041B1"
    ],
    "citedby_ftf": []
}