{
    "patent_id": "US-11323884-B2",
    "title": "System, device, and method of detecting, mitigating and isolating a signaling storm ",
    "assignee": "Allot Ltd.",
    "publication_date": "2022-05-03",
    "patent_link": "https://patents.google.com/patent/US11323884B2/en",
    "inventors": [
        "Boris Lifshitz",
        "Itai Weissman",
        "Itai Ephraim Zilbershtein",
        "Nimrod Dezent"
    ],
    "classifications": [
        "H04W12/122",
        "G06N20/00",
        "G06N20/20",
        "G06N5/01",
        "H04L41/0893",
        "H04L41/14",
        "H04L43/12",
        "H04L63/1416",
        "H04W4/70",
        "H04W48/06",
        "H04W76/27",
        "H04W8/08",
        "H04W8/26",
        "G06N20/10",
        "G06N7/01",
        "H04L2463/144",
        "H04L43/16",
        "H04W24/08",
        "H04W8/18",
        "H04W8/22"
    ],
    "abstract": "Detecting, mitigating and isolating a Signaling Storm, particularly in 5G communication networks. A Control Plane signal probe is connected at a first network node located between a Radio Access Network and a 5G Core Network, to monitor control messages originating from 5G-capable devices. A User Plane signal probe is connected at a second network node located between the 5G Core Network and remote entities to which the 5G-capable devices are sending messages, to monitor control messages passing through the second network node. An Inventory Management sub-system stores data correlating between 5G-capable devices and IMSI numbers. A Protector Unit is configured to receive (i) data collected by the Control Plane signal probe, and (ii) data collected by the User Plane signal probe, and (iii) a subset of IMSI numbers. The Protector Unit performs Machine Learning analysis, and detects and quarantines particular 5G-capable devices that are compromised or malfunctioning.",
    "claims": "\n1. A system for detecting and mitigating a 5G signaling storm generated by one or more 5G-capable devices, the system comprising:\na Control Plane (CP) signal probe, connected in-line at a first network node located between a Radio Access Network (RAN) and a 5G Core Network, to monitor Control Plane control messages originating from the 5G-capable devices and passing through the first network node;\na User Plane (UP) signal probe, connected in-line at a second network node located between the 5G Core Network and one or more remote entities to which the 5G-capable devices are sending messages, to monitor User Plane control messages passing through the second network node;\nan Inventory Management (IM) sub-system, to store data correlating between a particular 5G-capable device and an International Mobile Subscriber Identity (IMSI) number allocated to it;\na Protector Unit, configured (A) to receive (i) data collected by the CP signal probe, and (ii) data collected by the UP signal probe, and (iii) a subset of IMSI numbers from the IM sub-system, and (B) to generate a list of particular 5G-capable devices that are detected to be compromised or malfunctioning, and (C) to trigger quarantining of control messages outgoing from said particular 5G-capable devices that are in said list;\nwherein the Protector Unit is configured to perform Machine Learning analysis of (i) data collected by the Control Plane signal probe and (ii) data collected by the User Plane signal probe, and based on said Machine Learning analysis, to generate a determination that a particular 5G-capable device is compromised or malfunctioning;\nwherein said Machine Learning analysis comprises at least a Random Forest analysis of (i) data collected by the Control Plane signal probe and (ii) data collected by the User Plane signal probe;\nwherein in said Random Forest analysis, each point is a feature of deviation of counters from corresponding pre-defined normal-operation range-of-values represented as a pair of minimum value and maximum value;\nwherein in said Random Forest analysis, each point is allocated a value that corresponds to either (i) an indicator of regular communications by the 5G-capable device, or (ii) an indicator of minor abnormality that is below a pre-defined threshold value of abnormal communications, or (iii) an indicator of major abnormality that is equal to or greater than said pre-defined threshold value of abnormal communications.\n2. The system of claim 1,\nwherein the Protector Unit is to perform analysis of (i) data collected by the Control Plane signal probe and (ii) data collected by the User Plane signal probe, and based on said analysis, to generate a determination that a particular 5G-capable device is compromised or malfunctioning.\n3. The system of claim 2,\nwherein the Protector Unit is to select a particular protection policy, from a pool of pre-defined protection policies, based on one or more characteristics of said particular 5G-capable device.\n4. The system of claim 3,\nwherein, based on said particular protection policy, the Protector Unit is to dynamically configure the Control Plane signal probe, to discard at the first network node all outbound control messages that are outgoing from said particular 5G-capable device.\n5. The system of claim 3,\nwherein, based on said particular protection policy, the Protector Unit is to dynamically configure the User Plane signal probe, to discard at the second network node all outbound control messages that are outgoing from said particular 5G-capable device.\n6. The system of claim 3,\nwherein, based on said particular protection policy, the Protector Unit is to dynamically configure the Control Plane signal probe, to selectively discard at the first network node only outbound control messages that are outgoing from said particular 5G-capable device to a particular destination.\n7. The system of claim 3,\nwherein, based on said particular protection policy, the Protector Unit is to dynamically configure the User Plane signal probe, to selectively discard at the second network node only outbound control messages that are outgoing from said particular 5G-capable device to a particular destination.\n8. The system of claim 1,\nwherein the Protector Unit is to perform Machine Learning analysis of (i) values of message counters per time-unit per IMSI number, and (ii) a pre-defined Device Profile that indicates a normal range for the number of control messages that a particular 5G-capable device is authorized to send per time-unit; and based on said Machine Learning analysis, to generate a determination that a particular 5G-capable device is compromised or malfunctioning.\n9. The system of claim 1,\nwherein the Protector Unit is to perform Random Forest analysis of (i) values of message counters per time-unit per IMSI number, and (ii) a pre-defined Device Profile that indicates a normal range for the number of control messages that a particular 5G-capable device is authorized to send per time-unit; and based on said Random Forest analysis, to generate a determination that a particular 5G-capable device is compromised or malfunctioning.\n10. The system of claim 1,\nwherein, upon detection that a particular 5G-capable device is compromised or malfunctioning, the Protector Unit is to perform a Machine Learning analysis to select one or more policy rules to be enforced on outbound control messages of said particular 5G-capable device.\n11. The system of claim 1,\nwherein, upon detection that a particular 5G-capable device is compromised or malfunctioning, the Protector Unit is to perform a Random Forest analysis to select one or more policy rules to be enforced on outbound control messages of said particular 5G-capable device.\n12. The system of claim 11,\nwherein said Random Forest analysis utilizes at least two of the following features:\nan indicator of whether the particular 5G-capable device exhibits minor abnormality or major abnormality in communications;\n13. The system of claim 1,\nwherein the Protector Unit is connected to a particular network node, and monitors outbound control signals that pass through said particular network node, and causes selective discarding of control messages that pass through said particular network node;\n14. The system of claim 1,\nwherein the Protector Unit is connected to a particular network node, and monitors outbound control signals that pass through said particular network node, and causes selective discarding of control messages that pass through said particular network node;\n15. The system of claim 1,\nwherein the Protector Unit is connected to a particular network node, and monitors outbound control signals that pass through said particular network node, and causes selective discarding of control messages that pass through said particular network node;\n16. The system of claim 1,\nwherein the Protector Unit is to trigger full quarantine or selective quarantine of outbound control messages of a particular 5G-capable device, by dynamically modifying a record associated with said particular 5G-capable device, in at least one of: a Home Subscriber Server (HSS), an Equipment Identity Register (EIR),\nwherein said record is modified by the Protector Unit to indicate that a SIM card of said 5G-capable device was stolen; wherein said record, once modified by the Protector Unit, causes suspension of cellular communication services to said particular 5G-capable device.\n17. The system of claim 1,\nwherein the Protector Unit is connected to a particular network node, and monitors outbound control signals that pass through said particular network node, and causes selective discarding of control messages that pass through said particular network node;\nwherein said particular network node is located between a Mobility Management Entity (MME) and a Serving Gateway Control-Plane (S-GW-C) Function.\n18. The system of claim 1,\nwherein the Radio Access Network (RAN) is an Open RAN (O-RAN);\n19. The system of claim 1,\nwherein the User Plane (UP) signal probe performs User Plane monitoring of at least: SYN messages, SYN-ACK messages, FIN messages, FIN-ACK messages, ACK messages, and Selective ACK (SACK) messages;\nwherein the Control Plane (CP) signal probe performs Control Plane monitoring of at least: RRC Connection Requests, Attach Requests, Create Session Requests;\nwherein the Protector Unit determines that a particular IoT device is compromised or malfunctioning, based on Machine Learning (ML) analysis of both (i) control messages monitored by the UP signal probe in the User Plane, and (ii) control messages monitored by the CP signal probe in the Control Plane.\n20. The system of claim 1,\nwherein, based on said particular protection policy, the Protector Unit is to dynamically configure the Control Plane signal probe, to discard all outbound control messages that are outgoing from said particular 5G-capable device.\n21. The system of claim 1,\nwherein, based on said particular protection policy, the Protector Unit is to dynamically configure the Control Plane signal probe, to selectively discard only outbound control messages that are outgoing from said particular 5G-capable device to a particular destination.\n22. A method for detecting and mitigating a 5G signaling storm generated by one or more 5G-capable devices, the system comprising:\nat a Control Plane (CP) signal probe, connected in-line at a first network node located between a Radio Access Network (RAN) and a 5G Core Network, monitoring Control Plane control messages originating from the 5G-capable devices and passing through the first network node;\nat a User Plane (UP) signal probe, connected in-line at a second network node located between the 5G Core Network and one or more remote entities to which the 5G-capable devices are sending messages, monitoring User Plane control messages passing through the second network node;\nat an Inventory Management (IM) sub-system, storing data correlating between a particular 5G-capable device and an International Mobile Subscriber Identity (IMSI) number allocated to it;\nat a Protector Unit, (A) receiving (i) data collected by the CP signal probe, and (ii) data collected by the UP signal probe, and (iii) a subset of IMSI numbers from the IM sub-system, and (B) generating a list of particular 5G-capable devices that are detected to be compromised or malfunctioning, and (C) triggering quarantining of control messages outgoing from said particular 5G-capable devices that are in said list;\nwherein the method comprises:\nat the Protector Unit, performing Machine Learning analysis of (i) data collected by the Control Plane signal probe and (ii) data collected by the User Plane signal probe, and based on said Machine Learning analysis, generating a determination that a particular 5G-capable device is compromised or malfunctioning;\nwherein said Machine Learning analysis comprises at least a Random Forest analysis of (i) data collected by the Control Plane signal probe and (ii) data collected by the User Plane signal probe;\nwherein in said Random Forest analysis, each point is a feature of deviation of counters from corresponding pre-defined normal-operation range-of-values represented as a pair of minimum value and maximum value;\nwherein in said Random Forest analysis, each point is allocated a value that corresponds to either (i) an indicator of regular communications by the 5G-capable device, or (ii) an indicator of minor abnormality that is below a pre-defined threshold value of abnormal communications, or (iii) an indicator of major abnormality that is equal to or greater than said pre-defined threshold value of abnormal communications."
}