{
    "patent_link": "https://patents.google.com/patent/US5291550A/en",
    "patent_id": "US5291550A",
    "title": "Dynamic network call distributor",
    "abstract": "This invention relates to a method of distributing calls among a plurality of destinations of a customer. The calls are distributed according to a customer specified policy to maximize revenue or profit, to minimize waiting time or to minimize probability of abandonment. Different types of calls, such as orders, repair requests, and general information requests can be distributed differently. For example, if the criterion is maximizing profit, then calls of the most profitable type may be given preference for completion, while, during a busy period, some of the less profitable calls are rejected.",
    "inventors": [
        "Yonatan A. Levy",
        "Rodolfo A. Milito"
    ],
    "assignee": "Nokia Bell Labs",
    "classifications": [
        "H04Q3/66",
        "H04M3/523",
        "H04M2207/12",
        "H04M3/5125",
        "H04M3/5232",
        "H04M3/5237",
        "H04M7/00"
    ],
    "claims": "\n1. In a telecommunications network, a method of selecting one of a plurality of destinations for a call from a caller to a customer, each destination comprising apparatus for connecting a call to one of a plurality of agents, said method for connection of said call via said telecommunications network from said caller to said customer, said caller originating one of a plurality of types of calls, comprising:\nin a data base of said network, maintaining a record of a number of calls currently connected to each of said destinations, each destination comprising apparatus for connecting a call to one of a plurality of agents;\nusing said record, a type of said call from said caller to said customer, and routing parameters, said routing parameters based on information provided by said customer for each type of call to said customer, for selecting one of said destinations for connecting said call from said caller to one of a plurality of agents connected by said one of said destinations.\n2. The method of claim 1 wherein said customer provided information comprises a cost per call for a call to each destination.\n3. The method of claim 2 wherein said customer provided information further comprises a cost per type of call for each destination.\n4. The method of claim 2 wherein said customer provided information further comprises revenue information for each type of call and wherein said selecting comprises selecting one of said destinations to maximize an expected net revenue for an average call.\n5. The method of claim 1 wherein said maintaining comprises maintaining a record of a number of calls being served at each of said customer destinations.\n6. The method of claim 5 wherein said record comprises a queue length and a number of calls being served at each of said destinations.\n7. The method of claim 1 wherein said maintaining comprises maintaining a record of a number of calls of each type in progress at each of said customer destinations.\n8. The method of claim 1 wherein said routing parameters comprise traffic parameters for rejecting a type of call for a destination.\n9. The method of claim 1 wherein said routing parameters comprise traffic parameters for rejecting a type of call for all destinations.\n10. The method of claim 1 wherein said customer provided information comprises revenue generated per call for each type of call.\n11. The method of claim 1 wherein said record comprises a queue length and a number of calls being served at each of said destinations.\n12. The method of claim 11 wherein the customer provided information comprises expected revenue generated per call for each type of call further comprising:\ncalculating an expected wait at each of said destinations based on said queue length and said number of calls being served; and\ncalculating an expected probability of an abandonment prior to serving said call;\nwherein said step of selecting comprises modifying said expected revenue by said expected probability of an abandonment.\n13. The method of claim 11 further comprising:\nselecting a destination to minimize an expected waiting time for said call.\n14. The method of claim 11 further comprising:\nselecting a destination to minimize an expected waiting time for an average call to said customer.\n15. The method of claim 11 further comprising:\nselecting a destination to minimize an expected waiting time for an average call of said type of said call.\n16. The method of claim 1 further comprising the step of:\ncalculating said routing parameters by said customer in response to a routing policy selected by said customer and data supplied by said customer.\n17. The method of claim 1 wherein said information comprises a routing policy.\n18. The method of claim 17 wherein said routing policy comprises maximizing profit.\n19. The method of claim 18 wherein said information further comprises average revenue for each type of call.\n20. The method of claim 19 wherein said information further comprises average cost for each type of call as a function of destination.\n21. The method of claim 17 wherein said routing policy comprises minimizing expected waiting time.\n22. The method of claim 17 wherein said routing policy comprises minimizing expected waiting time for at least one of said types of calls.\n23. The method of claim 17 wherein said routing policy comprises minimizing probability of abandonment.\n24. The method of claim 17 wherein said routing policy comprises minimizing probability of abandonment for at least one of said types of calls.\n25. The method of claim 1 wherein said information comprises customer parameters.\n26. The method of claim 25 wherein said customer parameters comprise data regarding probability of abandonment as a function of waiting time.\n27. The method of claim 25 wherein said customer parameters comprise data regarding average holding time for a call to said customer.\n28. The method of claim 25 wherein said customer parameters comprise data regarding average holding time for each type of call to said customer.\n29. The method of claim 25 wherein said information comprises data relating to the number of attendants at each customer destination.\n30. The method of claim 1 wherein said information comprises data relating to the number of attendants at each customer destination.\n31. The method of claim 1 wherein said customer has an automatic call distributor (ACD) serving at least one of said destinations and wherein said information comprises ACD parameters for said at least one destination.\n32. The method of claim 31 wherein said ACD parameters comprise a parameter specifying a number of servers dedicated to a specified at least one of said types of calls.\n33. The method of claim 31 wherein said ACD has a plurality of queues and said ACD parameters comprise parameters specifying priorities, buffer limits, and types of calls for ones of said plurality of queues.\n34. The method of claim 31 wherein said information comprises information describing service disciplines for said at least one of said destinations.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4191860A",
        "US4737983A",
        "US4757529A",
        "US4788718A",
        "US4953204A",
        "US4988209A",
        "US5023868A",
        "US5042064A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US5402478A",
        "US5452350A",
        "US5475813A",
        "EP0689367A1",
        "US5500889A",
        "US5509055A",
        "US5537611A",
        "US5546452A",
        "US5568541A",
        "EP0755144A2",
        "EP0761059A1",
        "US5619557A",
        "US5633924A",
        "US5675636A",
        "US5734709A",
        "WO1998019440A1",
        "US5787160A",
        "US5812654A",
        "EP0772335A3",
        "US5822400A",
        "EP0897238A1",
        "US5926535A",
        "US5949869A",
        "US5978577A",
        "US5987115A",
        "US6011844A",
        "US6055307A",
        "US6064973A",
        "US6070142A",
        "WO2000044160A1",
        "US6115693A",
        "US6115462A",
        "US6122364A",
        "US6134530A",
        "US6141410A",
        "US6163607A",
        "US6222920B1",
        "EP1114388A1",
        "EP1122936A1",
        "US6275572B1",
        "EP1126731A1",
        "US6324276B1",
        "US6333979B1",
        "US20020052199A1",
        "US20020076030A1",
        "US20020087393A1",
        "US20020143592A1",
        "US20020143661A1",
        "US6490347B2",
        "US6493446B1",
        "US20020194119A1",
        "US6526135B1",
        "US20030110293A1",
        "US6614902B1",
        "US20030177017A1",
        "US20030174830A1",
        "US6633539B1",
        "US6665393B1",
        "US6668050B1",
        "US6684250B2",
        "US20040071082A1",
        "US20040111310A1",
        "US6757740B1",
        "US6760727B1",
        "US6801520B2",
        "US6801613B1",
        "US6807269B1",
        "US6819754B1",
        "US6823060B1",
        "US6823062B2",
        "US6823051B1",
        "US20040264677A1",
        "US6839418B1",
        "US20050002516A1",
        "US20050071241A1",
        "US20050071844A1",
        "US6912278B1",
        "GB2410148A",
        "US20050177380A1",
        "US20050182672A1",
        "US20050222786A1",
        "US6956941B1",
        "US6970555B1",
        "US20060010252A1",
        "US20060015388A1",
        "US20060023859A1",
        "US20060023858A1",
        "US7006620B1",
        "US20060067506A1",
        "US7023979B1",
        "US7031714B1",
        "US7096192B1",
        "US20060271418A1",
        "US20070007331A1",
        "US20070054040A1",
        "US20070071222A1",
        "US20070083572A1",
        "US20070150972A1",
        "US20070201311A1",
        "US20070255611A1",
        "US20080120125A1",
        "US20080140576A1",
        "US20080275751A1",
        "US7567653B1",
        "US20090213846A1",
        "US7620169B2",
        "US20100036670A1",
        "US7676034B1",
        "US7711104B1",
        "US7734032B1",
        "US7747705B1",
        "US7751548B1",
        "US20100202285A1",
        "US7779042B1",
        "US7787609B1",
        "US7817796B1",
        "US7822587B1",
        "US7835514B1",
        "US20100293560A1",
        "US20100296417A1",
        "US20100296646A1",
        "US7844504B1",
        "US7844729B1",
        "US7881450B1",
        "US7885401B1",
        "US20110047002A1",
        "US20110075821A1",
        "US20110077726A1",
        "US7936867B1",
        "US20110113116A1",
        "US20110116505A1",
        "US7949121B1",
        "US7949123B1",
        "US8000989B1",
        "US20110206199A1",
        "US20110280392A1",
        "US8073129B1",
        "US8116237B2",
        "US8116446B1",
        "US8208613B1",
        "US8234141B1",
        "US8238541B1",
        "US8300798B1",
        "US8312099B1",
        "US8358774B2",
        "US8385532B1",
        "US8385533B2",
        "US8391463B1",
        "US8411843B1",
        "US8442197B1",
        "US8472612B1",
        "US8504534B1",
        "US8675860B2",
        "US8767944B1",
        "US8811597B1",
        "US8831206B1",
        "US8855292B1",
        "US8856182B2",
        "US8867733B1",
        "US8938063B1",
        "US8971216B2",
        "US9002920B2",
        "US9008075B2",
        "USRE45583E1",
        "USRE45606E1",
        "US9083804B2",
        "USRE46060E1",
        "USRE46153E1",
        "US9516171B2",
        "US9553755B2",
        "USRE46438E1",
        "US9736308B1",
        "USRE46528E1",
        "US10567975B2",
        "US10572879B1",
        "US10718031B1",
        "US10943273B2",
        "US20220245647A1"
    ],
    "citedby_ftf": []
}