{
    "patent_link": "https://patents.google.com/patent/US4125862A/en",
    "patent_id": "US4125862A",
    "title": "Aspect ratio and scan converter system",
    "abstract": "An aspect ratio and scan converter system adapts signal information derivedrom optical scanning of a rectangular field of view having an aspect ratio of the order of 60 to 1. The signal information is converted to digital form and serially stored in a bulk storage memory which may be addressed for reading out selected sequences of the serially stored digital signals. The selected sequences are stored in a random access memory having a two dimensional format and then read out by repetitive scan in a direction orthogonally related to the direction in which the sequences were stored. The digital signals thus read out are converted to analog form and applied to a suitable display means such as a TV type monitor CRT, providing a visual display of the selected portion of the elongate field of view.",
    "inventors": [
        "Paul S. Catano"
    ],
    "assignee": "US Department of Navy",
    "classifications": [
        "H04N7/0105",
        "H04N5/53"
    ],
    "claims": "\n1. An aspect ratio and scan converter system for use with signal information developed from optical scanning of a rectangular field of view at a high scan speed along the minor axis relative to low scan speed along the major axis of the field of view comprising:\nan analog-to-digital converter connected to receive said signal information for developing commensurate digital signals;\na bulk storage memory for serially storing the sequences of digital signals developed from high speed optical scanning along said minor axis and representing said entire rectangular field of view;\nmeans for addressing said bulk storage memory for reading out selected sequences of digital signals serially stored therein representing a selected portion of said field of view;\na random access memory for receiving and storing each of said selected sequences of digital signals in a first direction of a two-dimensional format;\nmeans for addressing said random access memory to read out the stored selected sequences of digital signals by repetitive scan in the second direction of said two-dimensional format;\na digital-to-analog converter for receiving the digital output of said random access memory and developing commensurate analog signals; and\ndisplay means responsive to said analog signals for producing a raster format of the visual information contained in said selected portion of said field of view.\n2. An aspect ratio and scan converter system as claimed in claim 1 and including a photoresponsive linear array scanned in a plane normal to the principal axis of said array for developing the signal information representative of said rectangular field of view.\n3. An aspect ratio and scan converter system as claimed in claim 2 wherein said photoresponsive linear array is driven through an arcuate scan in a plane normal to the principal axis of said array.\n4. An aspect ratio and scan converter system as claimed in claim 2 wherein said photoresponsive linear array comprises solid state self-scanning photodiodes.\n5. An aspect ratio and scan converter system as claimed in claim 2 wherein said photoresponsive linear array comprises a charge coupled device.\n6. An aspect ratio and scan converter system as claimed in claim 2 wherein said photoresponsive linear array detects infrared radiation.\n7. An aspect ratio and scan converter system as claimed in claim 1 wherein said display means comprises a cathode ray tube.\n8. An aspect ratio and scan converter system as claimed in claim 7 and including second and third random access memories interconnected with said random access memory and said bulk storage memory, and responsive to said means for addressing said bulk storage memory for receiving and storing selected sequences of digital signals representing second and third selected portions of said field of view contiguous to the selected portion of said field of view stored in said random access memory.\n9. An aspect ratio and scan converter system as claimed in claim 1 wherein said means for addressing said bulk storage memory is adapted for automatically reading out digital signals stored therein in serial order from beginning to end to provide sequential scanning through the entire major axis of said field of view in a search mode of operation.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US3542948A",
        "US3810174A",
        "US3964064A",
        "US4002827A",
        "US4013832A",
        "US4025950A",
        "US4058835A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4220969A",
        "US4271476A",
        "US4322750A",
        "US4335400A",
        "FR2501944A1",
        "EP0069325A2",
        "US4449143A",
        "US4496995A",
        "FR2559329A1",
        "US4567508A",
        "DE3323946A1",
        "US4571631A",
        "US4590505A",
        "WO1986004204A1",
        "USRE32358E",
        "US4644395A",
        "US4723124A",
        "US4754331A",
        "US4843462A",
        "US4876597A",
        "US4985762A",
        "US5029001A",
        "US5040055A",
        "US5153716A",
        "US5258749A",
        "EP0695085A1",
        "US5870581A",
        "US5877801A",
        "US5903319A",
        "US5946222A",
        "GB2346754A",
        "US6157385A",
        "US6201574B1",
        "US6243131B1",
        "US20030220971A1",
        "US20040001091A1",
        "US6731284B1",
        "US7714936B1"
    ],
    "citedby_ftf": []
}