{
    "patent_id": "US-11195532-B2",
    "title": "Handling multiple intents in utterances ",
    "assignee": "Oracle International Corporation",
    "publication_date": "2021-12-07",
    "patent_link": "https://patents.google.com/patent/US11195532B2/en",
    "inventors": [
        "Saba Amsalu Teserra",
        "Vishal Vishnoi"
    ],
    "classifications": [
        "H04L51/02",
        "G10L15/26",
        "G06F40/211",
        "G06F40/263",
        "G06F40/284",
        "G06F40/295",
        "G06F40/30",
        "G06F40/35",
        "G06N20/00",
        "G06N5/041",
        "G10L15/02",
        "G10L15/22",
        "H04L51/18"
    ],
    "abstract": "The present disclosure relates to chatbot systems, and more particularly, to techniques for detecting that there are multiple intents represented in an utterance and then matching each detected intent to an intent associated with a chatbot in a chatbot system. In certain embodiments, a chatbot system receives an utterance from a user. A language of the utterance is determined and a set of rules identified for the language of the utterance. The utterance is parsed to extract information relating to the sentence structure of the utterance. The set of one or more rules is used to (1) determine whether the utterance is formed of two or more parts that each correspond to a separate intent of a user, and (2) split the utterance into the two or more parts for separate processing including matching of each user intent to an intent configured for a chatbot.",
    "claims": "\n1. A method comprising:\nreceiving, by a computer system with at least one chatbot, an utterance, wherein the utterance comprises text forming at least a sentence fragment;\nparsing, by the computer system, the utterance, the parsing producing information on a sentence structure of the utterance;\nidentifying, by the computer system, one or more rules that are applicable to the sentence structure of the utterance;\ndetecting, by the computer system using the one or more rules, that the utterance comprises two or more parts which represent separate user intents;\nsplitting, by the computer system, the utterance into the two or more parts;\nanalyzing, by the computer system, the two or more parts separately, wherein the analyzing comprises identifying a first chatbot for handling a first part of the two or more parts; and\ncommunicating, by the computer system, the first part to the first chatbot.\n2. The method of claim 1, further comprising:\ndetermining, by the computer system, that a user intent represented in the first part corresponds to a bot intent with which the first chatbot has been configured, wherein the bot intent represents a task that the first chatbot is capable of performing.\n3. The method of claim 2, further comprising:\ndetermining, by the computer system executing the first chatbot, a response to the first part, wherein the response is associated with the bot intent and comprises an action to be performed by the first chatbot or a message for the user.\n4. The method of claim 2, wherein determining that the user intent represented by the first part corresponds to the bot intent comprises analyzing the first part using a classifier that has been trained on a set of one or more example utterances provided for the bot intent.\n5. The method of claim 1, wherein detecting that the utterance comprises two or more parts which represent separate user intents comprises determining, using the information on the sentence structure of the utterance, that the utterance matches a sentence pattern specified by the one or more rules.\n6. The method of claim 5, wherein the information on the sentence structure of the utterance includes part of speech (POS) tags for the utterance and information on dependencies between linguistic units in the utterance, and wherein the sentence pattern is specified in terms of POS tags and dependencies between linguistic units.\n7. The method of claim 1, wherein splitting the utterance into the two or more parts comprises separating and reformatting the two or more parts according to one or more sentence splitting rules.\n8. The method of claim 7, wherein reformatting the two or more parts comprises:\ndetermining, based on the one or more sentence splitting rules, that a portion of a second part of the two or more parts is relevant to the first part; and\nreplicating the portion of the second part in the first part.\n9. The method of claim 1, further comprising:\ndetermining, by the computer system, an order in which the two or more parts should be handled, wherein the first part is communicated to the first chatbot according to the determined order.\n10. The method of claim 9, wherein determining the order in which the two or more parts should be handled comprises analyzing the information on the sentence structure of the utterance to determine whether the utterance contains markers that indicate precedence.\n11. A system comprising:\none or more processors; and\na memory coupled to the one or more processors, the memory storing a plurality of instructions that, when executed by the one or more processors, causes the one or more processors to perform processing comprising:\nreceiving an utterance, wherein the utterance comprises text forming at least a sentence fragment;\nparsing the utterance, the parsing producing information on a sentence structure of the utterance;\nidentifying one or more rules that are applicable to the sentence structure of the utterance;\ndetecting, using the one or more rules, that the utterance comprises two or more parts which represent separate user intents;\nsplitting the utterance into the two or more parts;\nanalyzing the two or more parts separately, wherein the analyzing comprises identifying a first chatbot for handling a first part of the two or more parts; and\ncommunicating the first part to the first chatbot.\n12. The system of claim 11, wherein the plurality of instructions further causes the one or more processors to perform processing comprising:\ndetermining that a user intent represented in the first part corresponds to a bot intent with which the first chatbot has been configured, wherein the bot intent represents a task that the first chatbot is capable of performing.\n13. The system of claim 12, wherein the plurality of instructions further causes the one or more processors to perform processing comprising:\ndetermining, as part of executing the first chatbot, a response to the first part, wherein the response is associated with the bot intent and comprises an action to be performed by the first chatbot or a message for the user.\n14. The system of claim 12, wherein determining that the user intent represented by the first part corresponds to the bot intent comprises analyzing the first part using a classifier that has been trained on a set of one or more example utterances provided for the bot intent.\n15. The system of claim 11, wherein detecting that the utterance comprises two or more parts which represent separate user intents comprises determining, using the information on the sentence structure of the utterance, that the utterance matches a sentence pattern specified by the one or more rules.\n16. The system of claim 15, wherein the information on the sentence structure of the utterance includes part of speech (POS) tags for the utterance and information on dependencies between linguistic units in the utterance, and wherein the sentence pattern is specified in terms of POS tags and dependencies between linguistic units.\n17. The system of claim 11, wherein splitting the utterance into the two or more parts comprises separating and reformatting the two or more parts according to one or more sentence splitting rules.\n18. The system of claim 17, wherein reformatting the two or more parts comprises:\ndetermining, based on the one or more sentence splitting rules, that a portion of a second part of the two or more parts is relevant to the first part; and\nreplicating the portion of the second part in the first part.\n19. The system of claim 11, wherein the plurality of instructions further causes the one or more processors to perform processing comprising:\ndetermining an order in which the two or more parts should be handled, wherein the first part is communicated to the first chatbot according to the determined order.\n20. A non-transitory computer-readable memory storing a plurality of instructions that, when executed by one or more processors, causes the one or more processors to perform processing comprising:\nreceiving an utterance, wherein the utterance comprises text forming at least a sentence fragment;\nparsing the utterance, the parsing producing information on a sentence structure of the utterance;\nidentifying one or more rules that are applicable to the sentence structure of the utterance;\ndetecting, using the one or more rules, that the utterance comprises two or more parts which represent separate user intents;\nsplitting the utterance into the two or more parts;\nanalyzing the two or more parts separately, wherein the analyzing comprises identifying a first chatbot for handling a first part of the two or more parts; and\ncommunicating the first part to the first chatbot."
}