{
    "patent_id": "US-11720856-B2",
    "title": "System and method for providing API version control ",
    "assignee": "Capital One Services, Llc",
    "publication_date": "2023-08-08",
    "patent_link": "https://patents.google.com/patent/US11720856B2/en",
    "inventors": [
        "Satish Kesiboyana",
        "Rajaboopathy Vijayaraghavan",
        "Pedro Betancourt",
        "David Gillam"
    ],
    "classifications": [
        "G06Q10/10",
        "G06F16/258",
        "G06F16/9558",
        "G06F16/9562",
        "G06F18/24",
        "G06F21/53",
        "G06F21/602",
        "G06F21/604",
        "G06F21/606",
        "G06F21/6209",
        "G06F21/6227",
        "G06F21/6245",
        "G06F40/103",
        "G06F40/174",
        "G06F40/18",
        "G06F9/44505",
        "G06F9/54",
        "G06F9/547",
        "G06N20/00",
        "G06N3/02",
        "G06N3/084",
        "G06N5/025",
        "G06N5/047",
        "G06Q20/382",
        "G06Q20/4014",
        "G06Q30/0185",
        "G06Q30/0206",
        "G06Q30/0601",
        "G06Q30/0613",
        "G06Q30/0619",
        "G06Q30/0637",
        "G06Q30/0643",
        "G06Q40/02",
        "G06Q40/03",
        "H04L63/0428",
        "H04L63/0435",
        "H04L63/0471",
        "H04L63/0478",
        "H04L63/08",
        "H04L63/0815",
        "H04L63/102",
        "H04L63/123",
        "H04L63/166",
        "H04L63/168",
        "H04L67/01",
        "H04L9/0825",
        "H04L9/0894",
        "G06F2221/2107",
        "G06F8/65",
        "G06F8/71",
        "G06K7/1417",
        "G06N20/10",
        "G06N3/048",
        "G06N5/01",
        "G06Q2220/00",
        "G06Q50/265",
        "H04L63/0442",
        "H04L9/0822"
    ],
    "abstract": "Described herein is a system for providing version control across APIs. In an embodiment, an application of a client device may transmit communications to a service application API that are in a format not accepted by the service application API, using the application API. A central (or public) API may receive the communication transmitted by the application's API. The central API may identify the versions of the application's API and the service application API. The central API may format the communication based on the mapped fields, to a format accepted by the service application API. The central API 106 may forward the formatted communication to the service application.",
    "claims": "\n1. A method for providing version control, the method comprising:\nreceiving, by one or more computing devices providing a central application program interface (API), a request from a client application API of a client application intended to be transmitted to a service application, wherein the client application API is a different version than a service application API, the version of the service application API being unknown to the client application API;\nidentifying, by the one or more computing devices, at the central API, the version of the client application API and the version of the service application API of the service application;\nmapping, by the one or more computing devices, data included in the request to fields compatible with the version of the service application API;\nformatting, by the one or more computing devices, the mapped data based on a predetermined format corresponding to each of the fields, wherein the predetermined format corresponding to each of the fields is compatible with the version of the service application API; and\nforwarding, by the one or more computing devices, the formatted data to the service application.\n2. The method of claim 1, further comprising identifying, by the one or more computing devices, the service application from a plurality of service applications as an intended recipient of the request, using the central API.\n3. The method of claim 2, wherein the central API identifies the service application as an intended recipient of the data based on the request.\n4. The method of claim 1, further comprising transmitting, by the one or more computing devices, a response from the service application API to a client device, using the central API.\n5. The method of claim 1, wherein the version of the service application API is configured to receive data in a format of the formatted data and the fields correspond with the format of data accepted by the version of the service application API.\n6. The method of claim 1, wherein the central API identifies the version of the client application API based on a format of the data received from the client application API.\n7. The method of claim 1, wherein the service application uses publish-subscribe messaging system to communicate with other service applications.\n8. A system for providing version control, the system comprising:\na memory; and\na processor coupled to the memory, wherein the processor is configured to:\nreceive, at a central application program interface (API), a request from a client application API of a client application intended to be transmitted to a service application, wherein the client application API is a different version than a service application API, the version of the service application API being unknown to the client application API;\nidentify, at the central API, the version of the client application API and the version of the service application API of the service application;\nmap data included in the request to fields compatible with the version of the service application API;\nformat the mapped data based on a predetermined format corresponding to each of the fields, wherein the predetermined format corresponding to each of the fields is compatible with the version of the service application API; and\nforward the formatted data to the service application.\n9. The system of claim 8, wherein the processor is further configured to identify the service application from a plurality of service applications as an intended recipient of the request, using the central API.\n10. The system of claim 9, wherein the central API identifies the service application as an intended recipient of the data based on the request.\n11. The system of claim 8, wherein the processor is further configured to transmit a response from the service application API to a client device, using the central API.\n12. The system of claim 8, wherein the version of the service application API is configured to receive data in a format of the formatted data and the fields correspond with the format of data accepted by the version of the service application API.\n13. The system of claim 8, wherein the central API identifies the version of the client application API based on a format of the data received from the client application API.\n14. The system of claim 8, wherein the service application uses publish-subscribe messaging system to communicate with other service applications.\n15. A non-transitory computer-readable medium having instructions stored thereon that, when executed by at least one computing device, cause the at least one computing device to perform operations for providing version control, the operations comprising:\nreceiving, at a central application program interface (API), a request from a client application API of a client application intended to be transmitted to a service application, wherein the client application API is a different version than a service application API, the version of the service application API being unknown to the client application API;\nidentifying, at the central API, the version of the client application API and the version of the service application API of the service application;\nmapping data included in the request to fields compatible with the version of the service application API;\nformatting the mapped data based on a predetermined format corresponding to each of the fields, wherein the predetermined format corresponding to each of the fields is compatible with the version of the service application API; and\nforwarding the formatted data to the service application.\n16. The non-transitory computer-readable medium of claim 15, wherein the operations further comprise identifying the service application from a plurality of service applications as an intended recipient of the request, using the central API.\n17. The non-transitory computer-readable medium of claim 16, wherein the central API identifies the service application as an intended recipient of the data based on the request.\n18. The non-transitory computer-readable medium of claim 15, wherein the operations further comprise transmitting a response from the service application API to a client device, using the central API.\n19. The non-transitory computer-readable medium of claim 15, wherein the version of the service application API is configured to receive data in a format of the formatted data and the fields correspond with the format of data accepted by the version of the service application API.\n20. The non-transitory computer-readable medium of claim 15, wherein the central API identifies the version of the client application API based on a format of the data received from the client application API.",
    "status": "Active",
    "citations_own": [
        "WO2000046717A2",
        "US20040117295A1",
        "WO2005010731A2",
        "US8433650B1",
        "US20140172531A1",
        "US20140249991A1",
        "US20150074644A1",
        "US20150206234A1",
        "US20150379632A1",
        "AU2015203014A1",
        "US20160171555A1",
        "US20160267588A1",
        "US20160283203A1",
        "US20160371770A1",
        "US20180053253A1",
        "US20190138995A1",
        "US10417706B1",
        "US20200051153A1",
        "US20200372577A1"
    ],
    "citations_ftf": [
        "US5930776A",
        "CA2350541A1",
        "US7107241B1",
        "US8504438B2",
        "US20020023051A1",
        "US6874139B2",
        "WO2002029682A1",
        "WO2002029521A2",
        "US7499885B2",
        "US7447656B2",
        "WO2003048905A2",
        "US7461080B1",
        "US20050086176A1",
        "US7630933B2",
        "US7707103B2",
        "US7149086B2",
        "US20060178983A1",
        "CA2618577A1",
        "US7860767B1",
        "US20140020068A1",
        "US7970699B1",
        "US7620597B2",
        "US20110313884A1",
        "US8001387B2",
        "US7908210B2",
        "US8099605B1",
        "US8619982B2",
        "CA2709237A1",
        "US20090300474A1",
        "JP5331203B2",
        "US20100131390A1",
        "US20110270659A1",
        "US9183374B2",
        "WO2012057969A1",
        "US9129107B2",
        "US9497184B2",
        "US20140006048A1",
        "US8909551B2",
        "US20130191629A1",
        "US8924720B2",
        "US8997197B2",
        "US9276869B2",
        "US20140207571A1",
        "US9124582B2",
        "US20140279399A1",
        "US20140304170A1",
        "US9137228B1",
        "US20150026038A1",
        "CN103366283A",
        "WO2015026877A1",
        "WO2015035396A1",
        "US10243945B1",
        "US9998448B2",
        "RU2573785C2",
        "WO2015136503A1",
        "US9558363B2",
        "US20160232546A1",
        "CA2900072A1",
        "EP3180768B1",
        "US11403309B2",
        "US10769654B2",
        "WO2016182509A1",
        "US20160350850A1",
        "US10171448B2",
        "US10033702B2",
        "US9762616B2",
        "US10909186B2",
        "WO2017100318A1",
        "US10171457B2",
        "US10419401B2",
        "US20180041338A1",
        "US20180040064A1",
        "US10380222B2",
        "US9646172B1",
        "US20180158139A1",
        "US10691811B2",
        "US20180218121A1",
        "US10243743B1",
        "US11087352B2",
        "US11126670B2",
        "EP3692451A4",
        "US20190114705A1",
        "US20190130480A1",
        "US20190238321A1",
        "US20190333142A1",
        "US11645688B2",
        "US11057366B2",
        "US10783270B2",
        "US20200153814A1",
        "US11636537B2"
    ],
    "citedby_own": [],
    "citedby_ftf": [
        "US8586556B2",
        "US8039010B2",
        "US8821870B2",
        "ES2672099T3",
        "US10783579B1",
        "JP6795531B2",
        "US20210015834A1",
        "US11321773B2",
        "US10990993B2",
        "US11651425B2",
        "US10698704B1",
        "US10649745B1",
        "US11481430B1",
        "US11593875B2",
        "US20210314166A1",
        "US20210374758A1",
        "US11115373B1",
        "US20220058278A1",
        "US11599662B2",
        "US11470037B2",
        "US20220075877A1",
        "US11641665B2",
        "US11475010B2",
        "US20220156808A1",
        "CN113052007A",
        "CN112988391B",
        "WO2022238823A1",
        "US11522949B1",
        "CN114429408B",
        "US20230222575A1",
        "WO2023163754A1",
        "CN114679301B"
    ]
}