{
    "patent_link": "https://patents.google.com/patent/US3888312A/en",
    "patent_id": "US3888312A",
    "title": "Method and compositions for fracturing well formations",
    "abstract": "A crosslinked aqueous gel useful for fracturing and placing propping agents within a subterranean formation is disclosed. The gel has a high viscosity in said formation and has pumping characteristics in turbulent flow similar to those of water.",
    "inventors": [
        "Robert L Tiner",
        "Marlin D Holtmyer",
        "Bobby J King",
        "Richard A Gatlin"
    ],
    "assignee": "Halliburton Co",
    "classifications": [
        "C09K8/685",
        "E21B43/26",
        "Y10S507/903",
        "Y10S507/922"
    ],
    "claims": "\n1. A PROCESS FOR FRACTURING A SUBSTERRANEAN FORMATION WHICH COMPRISES INTRODUCING INTO SAID FORMATION A CROSSLINKED GEL AT A FLOW RATE AND PRESSURE SUFFICIENT TO PRODUCE A FRACTURE IN SAID FORMATION; WHEREIN SAID CROSSLINKED GEL IS COMPRISED OF AN AQUEOUS LIQUID, A GELLING AGENT SELECTED FROM SOLVATABLE POLYSACCHARIDES HAING MOLECULAR WEIGHTS OF AT LEAST ABOUT 100,000, AND A CROSSLINKING COMPOUND SELECTED FROM ORGANOTITANATES HAVING TITANIUM IN THE +4 OXIDATION STATE.\n2. The process of claim 1 wherein said solvatable polysaccharides are selected from galactomannan gums, glucomannan gums, and cellulose derivatives.\n3. The process of claim 1 wherein said solvatable polysaccharides have molecular weights in the range of from about 200,000 to about 300,000.\n4. The process of claim 1 wherein said solvatable polysaccharides are selected from guar gum, locust bean gum, karaya gum, sodium carboxymethylguar, hydroxyethylguar, sodium carboxymethylhydroxyethylguar, hydroxypropylguar, sodium carboxymethylhydroxypropylguar, sodium carboxymethylcellulose, sodium carboxymethylhydroxyethylcellulose, and hydroxyethylcellulose.\n5. The process of claim 1 wherein said gelling agent is present in said aqueous liquid in a concentration in the range of from about 0.3 to about 3% by weight of said aqueous liquid.\n6. The process of claim 1 wherein said aqueous liquid is a water - alcohol solution having in the range of about zero to 100% alcohol by volume of solution.\n7. The process of claim 6 wherein said alcohol is selected from alkanols having 1 to 5 carbon atoms.\n8. The process of claim 1 wherein said organotitanate is selected from ammonium tetralactotitanate(IV) and bis(triethanolamine)bis(isopropol)titanium(IV).\n9. The process of claim 1 wherein said organotitanate is present in the range of from about 0.003 to in excess of about 0.5% by weight of said aqueous liquid.\n10. A process for hydraulically fracturing a subterranean formation penetrated by a well bore which comprises preparing a base gel by mixing an aqueous liquid with a gelling agent selected from solvatable polysaccharides having molecular weights of at least about 100,000, introducing said base gel into said well bore in admixture with a crosslinking compound selected from organotitanates having titanium in the +4 oxidation state, permitting said base gel and said crosslinking compound to react in said well bore to form a crosslinked gel, and introducing said crosslinked gel into said formation from said well bore at a flow rate and pressure sufficient to produce a fracture in said formation.\n11. The process of claim 10 wherein said aqueous liquid is a water - alcohol solution having in the range of about 0 to about 80% alcohol by volume of solution.\n12. The process of claim 10 wherein the pH of said aqueous liquid is not more than about 7.\n13. The process of claim 11 wherein said solvatable polysaccharides are selected from galactomannan gums, glucomannan gums, and cellulose derivatives, and further wherein said solvatable polysaccharides have molecular weights in the range of from about 200,000 to about 300,000.\n14. The process of claim 11 wherein said solvatable polysaccharides are selected from guar gum, locust bean gum, karaya gum, sodium carboxymethylguar, hydroxyethylguar, sodium carboxymethylhydroxyethylguar, hydroxypropylguar, sodium carboxymethylhydroxypropylguar, sodium carboxymethylcellulose, sodium carboxymethylhydroxyethylcellulose, and hydroxyethylcellulose.\n15. The process of claim 14 wherein said gelling agent is present in said aqueous liquid in a concentration in the range of from about 0.4 to about 2.0% by weight of said aqueous liquid.\n16. The process of claim 15 wherein said organotitanate is selected from ammonium tetralactotitanate(IV) and bis(triethanolamine)bis(isopropo)titanium(IV), and further wherein said organotitanate is present in the range of from about 0.006 to about 0.25% by weight of said aqueous liquid.\n17. The process of claim 16 wherein said crosslinking compound is present in an aqueous solution in the range of about 0.5 to about 50% by weight of said aqueous solution upon being admixed with said base gel.\n18. The process of claim 17 wherein said aqueous solution is comprised of said crosslinking compound dissolved in liquids selected from water, alcohol and mixtures of water and alcohol.\n19. The process of claim 18 wherein the pH of said aqueous liquid is adjusted with a pH adjusting chemical to a value in the range of about 1.5 to about 7 prior to admixing said base gel and said crosslinking compound, wherein said pH adjusting chemical is selected from acids, acid buffers, mixtures of acids and acid buffers and mixtures of acids and bases.\n20. The process of claim 19 wherein said alcohol in said aqueous liquid is selected from alkanols having 1 to 5 carbon atoms.\n21. A process for producing a fracture in a subterranean well formation penetrated by a well bore comprising: preparing a base gel by adding in the range of about 40 to about 70 pounds of a gelling agent selected from guar gum, sodium carboxymethylhydroxyethylguar and sodium carboxymethylcellulose to each 1,000 gallons of an aqueous liquid; introducing said base gel into said well bore and admixing with said base gel in said well bore an aqueous solution of an organotitanate compound having titanium in the +4 oxidation state, wherein said organotitanate compound is present in said aqueous solution in the amount of about 50% by weight of said aqueous solution and further wherein said aqueous solution containing said organotitanate compound is added to said base gel at the rate of about 0.1 gallons per each 10 pounds of said gelling agent added to each 1,000 gallons of said aqueous liquid; permitting said base gel and said organotitanate compound to react in said well bore to form a crosslinked gel; and injecting said crosslinked gel into said formation from said well bore at a flow rate and pressure sufficient to produce a fracture in said formation.\n22. The process of claim 21 wherein the pH of said aqueous liquid is adjusted to a value in the range of about 2 to 7 prior to preparation of said base gel.\n23. The process of claim 22 wherein said pH is adjusted by adding to said aqueous liquiD a sufficient quantity of an agent selected from fumaric acid, formic acid, and sodium bicarbonate.\n24. The process of claim 23 wherein said aqueous liquid is an alkanol-water solution comprising 0 to about 40 percent alkanol by volume of solution, said alkanol containing in the range of about 1 to 5 carbon atoms.\n25. The process of claim 24 wherein said alkanol is methanol.\n26. The process of claim 25 wherein said organotitanate is ammonium tetralactotitanate(IV).\n27. The process of claim 24 wherein said organotitanate is bis(triethanolamine)bis(isopropo)titanium(IV).\n28. The process of claim 26 wherein said gelling agent is sodium carboxymethylcellulose.\n29. The process of claim 27 wherein said gelling agent is sodium carboxymethylcellulose.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US2270006A",
        "US3762476A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US3948325A",
        "EP0001190A1",
        "US4186802A",
        "US4205724A",
        "US4210206A",
        "US4257903A",
        "US4313834A",
        "US4324668A",
        "US4369124A",
        "US4428432A",
        "US4442897A",
        "EP0104927A3",
        "US4462917A",
        "US4464270A",
        "US4463810A",
        "US4470915A",
        "US4477360A",
        "US4488975A",
        "US4502967A",
        "US4505826A",
        "US4534870A",
        "US4552674A",
        "US4552675A",
        "US4563291A",
        "JPS6189202A",
        "US4606772A",
        "US4609479A",
        "US4618435A",
        "US4623649A",
        "US4624795A",
        "US4683068A",
        "US4686052A",
        "EP0236598A1",
        "EP0282253A2",
        "US4798902A",
        "US4799550A",
        "US4801389A",
        "US4885103A",
        "US4946604A",
        "US4953621A",
        "US4958038A",
        "US4982793A",
        "US5067565A",
        "US5106518A",
        "US5443636A",
        "EP0725206A2",
        "WO1999052991A1",
        "US5979555A",
        "US6076046A",
        "US6310008B1",
        "WO2002070861A1",
        "US6640898B2",
        "US6659175B2",
        "US6729408B2",
        "US20040094297A1",
        "US20050038199A1",
        "WO2005040552A1",
        "US20050227874A1",
        "US20060116296A1",
        "US20060144588A1",
        "US7122690B1",
        "US20070173414A1",
        "US20070173413A1",
        "US20070191233A1",
        "US20070199712A1",
        "US20070199695A1",
        "US20070199699A1",
        "US20070199705A1",
        "US20070199702A1",
        "US20070199700A1",
        "US20070199704A1",
        "US20070199713A1",
        "US20070199707A1",
        "US20070199710A1",
        "US20070199708A1",
        "US20070199701A1",
        "US20070199706A1",
        "US20070199697A1",
        "US20070199698A1",
        "US20070199711A1",
        "US20070215385A1",
        "US20070214878A1",
        "US20080004188A1",
        "US20080099207A1",
        "US20080108522A1",
        "US20080197085A1",
        "US20080242563A1",
        "US20080243675A1",
        "US20080257556A1",
        "US20080269082A1",
        "US20080280790A1",
        "US20080283242A1",
        "US20080287325A1",
        "US20080314124A1",
        "US20080318812A1",
        "US20090101347A1",
        "US20090114390A1",
        "US20090200027A1",
        "US20090227479A1",
        "US20090275488A1",
        "US20100000795A1",
        "US20100012901A1",
        "US20100077938A1",
        "US20100122815A1",
        "US20100130388A1",
        "US20100140186A1",
        "US20100181071A1",
        "US20100197968A1",
        "US20100204069A1",
        "US20100212905A1",
        "US20100252262A1",
        "US20100252261A1",
        "US20100305010A1",
        "US20100311620A1",
        "US20110001083A1",
        "US20110005756A1",
        "US20110028354A1",
        "US7992653B2",
        "WO2011112519A1",
        "US8242060B2",
        "US8273693B2",
        "US8466094B2",
        "WO2013115845A1",
        "US8524639B2",
        "WO2013150203A1",
        "US8596911B2",
        "US8835364B2",
        "US8841240B2",
        "US8846585B2",
        "US8851174B2",
        "US8899328B2",
        "US8932996B2",
        "US8944164B2",
        "US8955585B2",
        "US9022120B2",
        "WO2015071750A2",
        "US9062241B2",
        "US9085724B2",
        "WO2015112297A1",
        "US9234125B2",
        "US9334713B2",
        "WO2016079625A1",
        "US9447657B2",
        "US9464504B2",
        "RU2627807C1",
        "US9909404B2",
        "US9945220B2",
        "CN108517201A",
        "WO2018172684A1",
        "US10202828B2",
        "US10392553B2",
        "US10494564B2",
        "US10604693B2",
        "US10669468B2",
        "WO2021080780A1",
        "US11236609B2",
        "US11248163B2",
        "US11560510B2",
        "FR3126988A1"
    ],
    "citedby_ftf": []
}