{
    "patent_id": "US-11681000-B2",
    "title": "Self ensembling techniques for generating magnetic resonance images from spatial frequency data ",
    "assignee": "Hyperfine Operations, Inc.",
    "publication_date": "2023-06-20",
    "patent_link": "https://patents.google.com/patent/US11681000B2/en",
    "inventors": [
        "Jo Schlemper",
        "Seyed Sadegh Mohseni Salehi",
        "Michal Sofka"
    ],
    "classifications": [
        "G01R33/5611",
        "G06T11/003",
        "A61B5/055",
        "G01R33/36",
        "G01R33/383",
        "G01R33/445",
        "G01R33/4835",
        "G01R33/5608",
        "G01R33/56509",
        "G06F18/21347",
        "G06N20/00",
        "G06N3/045",
        "G06N3/08",
        "G06N3/082",
        "G06N3/088",
        "G06N7/01",
        "G06T11/006",
        "G06T11/008",
        "G06T3/60",
        "G06T5/002",
        "G06T7/0012",
        "G06T7/207",
        "G06T7/262",
        "G06T7/38",
        "G06V10/30",
        "G06V10/431",
        "G06V10/454",
        "G06V10/52",
        "G06V10/7515",
        "G06V10/82",
        "G06V10/89",
        "G06V10/92",
        "G16H30/40",
        "G01R33/4824",
        "G06T2207/10088",
        "G06T2207/20056",
        "G06T2207/20081",
        "G06T2207/20084",
        "G06T2207/20182",
        "G06T2207/20216",
        "G06T2207/20224",
        "G06T2207/30016",
        "G06T2210/41",
        "G06V2201/03"
    ],
    "abstract": "Techniques for generating magnetic resonance (MR) images of a subject from MR data obtained by a magnetic resonance imaging (MRI) system, the techniques including: obtaining input MR data obtained by imaging the subject using the MRI system; generating a plurality of transformed input MR data instances by applying a respective first plurality of transformations to the input MR data; generating a plurality of MR images from the plurality of transformed input MR data instances and the input MR data using a non-linear MR image reconstruction technique; generating an ensembled MR image from the plurality of MR images at least in part by: applying a second plurality of transformations to the plurality of MR images to obtain a plurality of transformed MR images; and combining the plurality of transformed MR images to obtain the ensembled MR image; and outputting the ensembled MR image.",
    "claims": "\n1. A method for generating magnetic resonance (MR) images of a subject from MR data obtained by a magnetic resonance imaging (MRI) system, the method comprising:\ngenerating a first set of one or more MR images from first input MR data obtained by imaging the subject using the MRI system;\ngenerating a second set of one or more MR images from second input MR data obtained by imaging the subject using the MRI system;\naligning the first set of one or more MR images and the second set of one or more MR images using a neural network model to obtain aligned first and second sets of one or more MR images, the neural network model comprising a first neural network and a second neural network, the aligning comprising:\nestimating, using the first neural network, a first transformation between the first set of one or more MR images and the second set of one or more MR images;\ngenerating a first updated set of one or more MR images from the second set of one or more MR images using the first transformation;\nestimating, using the second neural network, a second transformation between the first set of one or more MR images and the first updated set of one or more MR images; and\naligning the first set of one or more MR images and the second set of one or more MR images at least in part by using the first transformation and the second transformation;\ncombining the aligned first and second sets of one or more MR images to obtain a combined set of one or more MR images; and\noutputting the combined set of one or more MR images.\n2. The method of claim 1, wherein obtaining the second input MR data is performed after obtaining the first input MR data.\n3. The method of claim 1, wherein generating the first updated set of one or more MR images from the second set of one or more MR images comprises applying the first transformation to the second set of one or more MR images.\n4. The method of claim 3, wherein generating the first updated set of one or more MR images further comprises interpolating results of applying the first transformation to the second set of one or more MR images to obtain the first updated set of one or more MR images.\n5. The method of claim 1, wherein estimating the first transformation comprises estimating a rigid transformation.\n6. The method of claim 1, wherein estimating the first transformation comprises estimating a plurality of translation parameters and a plurality of rotation parameters.\n7. The method of claim 6, wherein estimating the plurality of rotation parameters comprises estimating Euler angles.\n8. The method of claim 1, wherein aligning the first set of one or more MR images and the second set of one or more MR images comprises:\ncalculating a composed transformation at least in part by composing the first and second transformations; and\napplying the composed transformation to the second set of one or more MR images to obtain a set of one or more MR images aligned to the first set of one or more MR images.\n9. The method of claim 1, wherein aligning the first set of one or more MR images and the second set of one or more MR images comprises:\nobtaining a set of one or more MR images aligned to the first set of one or more MR images from the first updated set of one or more MR images.\n10. The method of claim 1, wherein the neural network model further comprises a third neural network, and wherein the aligning further comprises:\ngenerating a second updated set of one or more MR images from the first updated set of one or more MR images using the second transformation;\nestimating, using the third neural network, a third transformation between the first updated set of one or more MR images and the second updated set of one or more MR images; and\naligning the first set of one or more MR images and the second set of one or more MR images at least in part by using the first transformation, the second transformation, and the third transformation.\n11. The method of claim 1, wherein the first neural network comprises one or more two-dimensional (2D) convolutional layers.\n12. The method of claim 1, wherein the first neural network comprises one or more three-dimensional (3D) convolutional layers configured to simultaneously process data in multiple images of the first set of one or more MR images.\n13. The method of claim 1, wherein combining the aligned first and second sets of one or more MR images comprises averaging the aligned first and second sets of one or more MR images.\n14. The method of claim 1, wherein the aligning is performed by at least one processor that is a part of the MRI system.\n15. The method of claim 1, wherein estimating the first transformation is performed at least in part by using the aligning is performed by at least one graphics processing unit (GPU) part of the MRI system.\n16. The method of claim 1, wherein the first set of one or more MR images consists of one image and the second set of one or more MR images consists of one MR image.\n17. At least one non-transitory computer-readable storage medium storing processor-executable instructions that, when executed by at least one processor, cause the at least one processor to perform a method for generating magnetic resonance (MR) images of a subject from MR data obtained by a magnetic resonance imaging (MRI) system, the method comprising:\ngenerating a first set of one or more MR images from first input MR data obtained by imaging the subject using the MRI system;\ngenerating a second set of one or more MR images from second input MR data obtained by imaging the subject using the MRI system;\naligning the first set of one or more MR images and the second set of one or more MR images using a neural network model to obtain aligned first and second sets of one or more MR images, the neural network model comprising a first neural network and a second neural network, the aligning comprising:\nestimating, using the first neural network, a first transformation between the first set of one or more MR images and the second set of one or more MR images;\ngenerating a first updated set of one or more MR images from the second set of one or more MR images using the first transformation;\nestimating, using the second neural network, a second transformation between the first set of one or more MR images and the first updated set of one or more MR images; and\naligning the first set of one or more MR images and the second set of one or more MR images at least in part by using the first transformation and the second transformation;\ncombining the aligned first and second sets of one or more MR images to obtain a combined set of one or more MR images; and\noutputting the combined set of one or more MR images.\n18. A magnetic resonance imaging (MRI) system, comprising:\na magnetics system having a plurality of magnetics components to produce magnetic fields for performing MRI; and\nat least one processor configured to perform:\ngenerating a first set of one or more MR images from first input MR data obtained by imaging a subject using the MRI system;\ngenerating a second set of one or more MR images from second input MR data obtained by imaging the subject using the MRI system;\naligning the first set of one or more MR images and the second set of one or more MR images using a neural network model to obtain aligned first and second sets of one or more MR images, the neural network model comprising a first neural network and a second neural network, the aligning comprising:\nestimating, using the first neural network, a first transformation between the first set of one or more MR images and the second set of one or more MR images;\ngenerating a first updated set of one or more MR images from the second set of one or more MR images using the first transformation;\nestimating, using the second neural network, a second transformation between the first set of one or more MR images and the first updated set of one or more MR images; and\naligning the first set of one or more MR images and the second set of one or more MR images at least in part by using the first transformation and the second transformation;\ncombining the aligned first and second sets of one or more MR images to obtain a combined set of one or more MR images; and\noutputting the combined set of one or more MR images.\n19. The MRI system of claim 18, wherein the magnetics system comprises a permanent B0 magnet configured to generate a B0 magnetic field, the permanent B0 magnet comprising a plurality of concentric permanent magnet rings.\n20. The MRI system of claim 19, wherein the B0 magnetic field has a strength between 20 milliTesla and 0.2 Tesla."
}