{
    "patent_id": "US-10834026-B2",
    "title": "Artificial intelligence assisted service provisioning and modification for delivering message-based services ",
    "assignee": "Jiseki Health, Inc.",
    "publication_date": "2020-11-10",
    "patent_link": "https://patents.google.com/patent/US10834026B2/en",
    "inventors": [
        "Chandra Nagaraja",
        "Tushar Vasisht"
    ],
    "classifications": [
        "G06N20/00",
        "G06N3/006",
        "G06N5/02",
        "G06N5/027",
        "G06N5/041",
        "G16H10/20",
        "G16H10/60",
        "G16H40/20",
        "G16H40/67",
        "G16H50/20",
        "G16H50/30",
        "G16H80/00",
        "H04L41/16",
        "H04L51/02",
        "H04L67/16",
        "H04L67/306",
        "H04L67/51",
        "G06N20/10",
        "G06N3/043",
        "G06N3/044",
        "G06N3/045",
        "G06N3/049",
        "G06N3/084",
        "G06N3/088",
        "G06N3/126",
        "G06N7/01",
        "G06N7/023",
        "H04L51/18",
        "H04L51/222"
    ],
    "abstract": "A method for AI-assisted service provisioning and modification for delivering message-based services, including: receiving an input sequence from a user in relation to a request for a service, the input sequence including one or more inputs; processing the input sequence to determine a service type; associating a workflow with the request based at least in part on the service type and a profile of the user, the workflow including a set of one or more steps, a step of the set of one or more steps corresponding to a set of attributes including at least one of: a communication mode, a communication type, or a communication priority, the workflow being performed by at least one of: a chatbot, an AI assistant, or a service professional; and interacting with the user based at least in part on the workflow to deliver the service.",
    "claims": "\n1. A method for AI-assisted service provisioning and modification for delivering message-based services, comprising:\nreceiving an input sequence from a user in relation to a request for a service, the input sequence including one or more input items;\nprocessing the input sequence to determine a service type;\nassociating a workflow with the request based at least in part on the service type and a profile of the user, the workflow including a set of one or more steps, a step of the set of one or more steps corresponding to a set of attributes including at least one of: a communication mode, a communication type, or a communication priority, the workflow being performed by at least one of: a chatbot, an AI assistant, or a service professional; and\ninteracting with the user based at least in part on the workflow to deliver the service, comprising:\nreceiving a new input sequence from the user;\nanalyzing the new input sequence to determine a set of one or more elements, an element of the set of one or more elements triggering a change in the workflow;\nin response to the determining the set of one or more elements is not empty, modifying the workflow based at least in part on the set of one or more elements; and\nresponding to the request based on the workflow.\n2. The method of claim 1, wherein the modifying of the workflow further comprises modifying the workflow based at least in part on the profile of the user.\n3. The method of claim 1, wherein the modifying of the workflow further comprises modifying the workflow based at least in part on communication with another user.\n4. The method of claim 1, wherein the profile of the user is updated based at least in part on previous communication with the user to deliver a service of the same service type, and/or communication with the user to deliver a service of a type other than the service type.\n5. The method of claim 1, wherein the workflow is generated by a rule engine evaluating a ruleset corresponding to the service type.\n6. The method of claim 5, wherein a rule of the ruleset corresponding to the service type is modified using an artificial intelligence model trained based at least in part on communication related to delivering services of the service type.\n7. The method of claim 1, wherein the input sequence from the user comprises a token indicating a service type.\n8. The method of claim 7, wherein the token is a hashtag.\n9. A system for AI-assisted service provisioning and modification for delivering message-based services, comprising:\na processor; and\na memory coupled with the processor, wherein the memory is configured to provide the processor with instructions which when executed cause the processor to:\nreceive an input sequence from a user in relation to a request for a service, the input sequence including one or more inputs;\nprocess the input sequence to determine a service type;\nassociate a workflow with the request based at least in part on the service type and a profile of the user, the workflow including a set of one or more steps, a step of the set of one or more steps corresponding to a set of attributes including at least one of: a communication mode, a communication type, or a communication priority, the workflow being performed by at least one of: a chatbot, an AI assistant, or a service professional; and\ninteract with the user based at least in part on the workflow to deliver the service, comprising to:\nreceive a new input sequence from the user;\nanalyze the new input sequence to determine a set of one or more elements, an element of the set of one or more elements triggering a change in the workflow;\nin response to the determining the set of one or more elements is not empty, modify the workflow based at least in part on the set of one or more elements; and\nrespond to the request based on the workflow.\n10. The system of claim 9, wherein the processor is further configured to modify the workflow based on the profile of the user.\n11. The system of claim 9, wherein the processor is further configured to modify the workflow based at least in part on communication with another user.\n12. The system of claim 9, wherein the profile of the user is updated based at least in part on previous communication with the user to deliver a service of the same service type, and/or communication with the user to deliver a service of a type other than the service type.\n13. The system of claim 9, wherein the workflow is generated by a rule engine evaluating a ruleset corresponding to the service type.\n14. The system of claim 13, wherein a rule of the ruleset corresponding to the service type is modified using an artificial intelligence model trained based at least in part on communication related to delivering services of the service type.\n15. The system of claim 9, wherein the input sequence from the user comprises a token indicating a service type.\n16. The system of claim 15, wherein the token is a hashtag.\n17. A computer program product embodied in a non-transitory tangible computer readable storage medium and comprising computer instructions for:\nreceiving an input sequence from a user in relation to a request for a service, the input sequence including one or more inputs;\nprocessing the input sequence to determine a service type;\nassociating a workflow with the request based at least in part on the service type and a profile of the user, the workflow including a set of one or more steps, a step of the set of one or more steps corresponding to a set of attributes including at least one of: a communication mode, a communication type, or a communication priority, the workflow being performed by at least one of: a chatbot, an AI assistant, or a service professional; and\ninteracting with the user based at least in part on the workflow to deliver the service, comprising:\nreceiving a new input sequence from the user;\nanalyzing the new input sequence to determine a set of one or more elements, an element of the set of one or more elements triggering a change in the workflow;\nin response to the determining the set of one or more elements is not empty, modifying the workflow based at least in part on the set of one or more elements; and\nresponding to the request based on the workflow.\n18. The computer program product of claim 17, wherein the instructions further comprise modifying the workflow based on the profile of the user.\n19. The computer program product of claim 17, wherein the instructions further comprise modifying the workflow based at least in part on communication with another user.\n20. The computer program product of claim 17, wherein the input sequence from the user comprises a token indicating a service type.",
    "status": "Active",
    "citations_own": [
        "US20150314454A1",
        "US20170206064A1",
        "US20180247648A1",
        "US20190103095A1",
        "US20190102078A1",
        "US20190354874A1",
        "US20190356736A1",
        "US20200057946A1",
        "US20200134018A1",
        "US20200244605A1",
        "US20200252205A1",
        "US20200250747A1"
    ],
    "citations_ftf": [
        "US10839302B2",
        "WO2019060639A1"
    ],
    "citedby_own": [
        "US11436508B2"
    ],
    "citedby_ftf": [
        "US11361853B2",
        "KR101731867B1",
        "US11763265B2",
        "US10834026B2",
        "US20210020284A1",
        "US11456979B2",
        "US11411893B2",
        "US11227583B2",
        "KR20210085159A",
        "US11431658B2",
        "US11694289B2",
        "US11349800B2",
        "US11290409B2",
        "US11645466B2",
        "US11539648B2",
        "US11343114B2",
        "CN112152913B",
        "US20220107966A1",
        "US20220215957A1",
        "US11218862B1",
        "WO2022174161A1",
        "US11496556B1",
        "US20220400091A1",
        "US11489908B1",
        "WO2023009661A1",
        "CN114124859B",
        "US20230065223A1",
        "US20230072752A1",
        "WO2023038809A1",
        "US20230082014A1",
        "WO2023043621A1",
        "US11782695B2",
        "US20230187031A1",
        "US20230283515A1"
    ]
}