{
    "patent_link": "https://patents.google.com/patent/US6095413A/en",
    "patent_id": "US6095413A",
    "title": "System and method for enhanced fraud detection in automated electronic credit card processing",
    "abstract": "A method and system for authorizing an electronic credit card transaction having enhanced measures for detecting fraudulent transactions. A user at a remote terminal attempting to conduct an electronic credit card transaction is prompted to input the user's credit card information, address, and social security number. The information input by the user is retrieved and used for identification purposes. Initially, the input credit card information is submitted to an issuer of the user's credit card to determine whether the input credit card information is valid. The social security number input by the user is next checked to determine if it corresponds to the user. A database having a stored list of social security numbers is accessed, wherein each of the stored social security numbers includes at least one address stored therewith corresponding to an address of an individual identified by the respective social security number. The addresses stored in association with the input social security number are retrieved and compared with the input address to determine if the input address corresponds to any of the retrieved stored addresses. If the input credit card information has been confirmed by the issuer as being valid and the address input by the user matches any of the retrieved addresses stored in association with the input social security number, the electronic credit card transaction is authorized and allowed to transpire. The social security number database is stored and accessed separately from the issuer's credit card information database to provide an added measure of protection against a person fraudulently gaining access to one of the databases, since access to the information in both databases is required to complete the financial transaction.",
    "inventors": [
        "Donald Tetro",
        "Edward Lipton",
        "Andrew Sackheim"
    ],
    "assignee": "Automated Transaction Corp",
    "classifications": [
        "G07F7/08",
        "G06Q20/04",
        "G06Q20/40",
        "G06Q20/403",
        "G06Q20/4037"
    ],
    "claims": "\n1. A method of authorizing an electronic credit card transaction, comprising the steps of:\ngenerating a request for a user at a remote terminal to input the user's credit card information, address, and social security number;\nreceiving the information input by the user;\ncommunicating the input information to a credit card database provided by an issuer of the user's credit card to determine whether the input information is valid;\naccessing a social security number database having a list of social security numbers stored therein, wherein each of said stored social security numbers includes at least one address stored therewith corresponding to an address of an individual identified by the respective social security number;\nretrieving the at least one stored address associated with the input social security number;\ncomparing the input address with the at least one retrieved stored address to corroborate the information stored in the credit card database with the information stored in the social security number database; and\nauthorizing the electronic credit card transaction when said input information is determined to correspond to information stored in both the credit card database and the social security number database.\n2. The method of authorizing an electronic credit card transaction as defined in claim 1, wherein the social security number database is stored separately from the credit card information stored by the issuer.\n3. The method of authorizing an electronic credit card transaction as defined in claim 1, wherein the address input by the user is communicated to the issuer along with the input credit card information for validation by the issuer.\n4. The method of authorizing an electronic credit card transaction as defined in claim 1, further comprising the steps of:\ncollecting a phone number from which the remote terminal is communicating;\ncomparing the collected phone number with a stored list of blocked phone numbers which are not authorized to perform electronic credit card transactions; and\nrejecting authorization if the collected phone number matches any of the blocked phone numbers on the stored list.\n5. The method of authorizing an electronic credit card transaction as defined in claim 1, further comprising the steps of:\ndelivering a negative response to the user indicating that the electronic credit card transaction is being refused when authorization is not granted; and\nnotifying the user of the reason for which the credit card transaction is refused.\n6. The method of authorizing an electronic credit card transaction as defined in claim 1, further comprising the steps of:\ndetermining whether a predetermined expenditure limit has been exceeded within a given time period by the credit card identified by the input credit card information; and\ndenying authorization if the predetermined expenditure limit has been exceeded.\n7. The method of authorizing an electronic credit card transaction as defined in claim 1, wherein the address input by the user includes the street address and zip code of the user.\n8. The method of authorizing an electronic credit card transaction as defined in claim 7, wherein said address comparing step compares the input street address and zip code with the retrieved stored addresses in the social security database to determine if the input street address and zip code match any of the street addresses and zip codes in the retrieved stored addresses.\n9. The method of authorizing an electronic credit card transaction as defined in claim 8, further comprising the step of determining whether the input street address is a P.O. Box if the input street address does not initially match a retrieved stored address.\n10. The method of authorizing electronic credit card transactions as defined in claim 1, wherein the entire authorizing procedure is automated without the need for human intervention.\n11. The method of authorizing an electronic credit card transaction as defined in claim 1, wherein the social security number database is independent from the user's credit card information.\n12. An automated system for authorizing an electronic credit card transaction, comprising:\ninquiry means for requesting a user at a remote terminal to input the user's credit card information, address, and social security number;\nreceiving means for collecting the information input by the user;\ncomparing means for comparing the input information with information stored in a credit card information database provided by an issuer of the user's credit card to determine whether the input information is valid;\nretrieval means for accessing a social security number database of stored social security numbers having at least one address stored therewith corresponding to an address of an individual identified by the respective social security number and retrieving the at least one stored address associated with the social security number input by the user;\nprocessing means for comparing the input address with the at least one retrieved stored address from the social security number database and corroborating the information stored in the credit card information database; and\nauthorizing means for authorizing the electronic credit card transaction when said input information is determined to correspond to the retrieved information stored in both the credit card information database and the social security number database.\n13. The automated system for authorizing an electronic credit card transaction as defined in claim 12, wherein the social security number database is stored separately from the credit card information stored by the issuer.\n14. The automated system for authorizing an electronic credit card transaction as defined in claim 12, wherein the address of the user is communicated to the issuer along with the credit card information for validation by the issuer.\n15. The automated system for authorizing an electronic credit card transaction as defined in claim 12, further comprising:\nnumber identification means for collecting a phone number from which the remote terminal is communicating; and\ncomparison means for comparing the collected phone number with a stored list of blocked phone numbers which are not authorized to perform electronic credit card transactions and rejecting authorization if the collected phone number matches any of the blocked phone numbers on the stored list.\n16. The automated system for authorizing an electronic credit card transaction as defined in claim 12, further comprising notification means for generating a negative response to the user indicating that the electronic credit card transaction is being refused when authorization is not granted and notifying the user of the reason for which the credit card transaction is refused.\n17. The automated system for authorizing an electronic credit card transaction as defined in claim 12, further comprising delimiting means for determining whether a predetermined expenditure limit has been exceeded within a given time period by the credit card identified by the input credit card information and denying authorization if the predetermined expenditure limit has been exceeded.\n18. The automated system for authorizing an electronic credit card transaction as defined in claim 12, wherein the address input by the user includes the street address and zip code of the user.\n19. The automated system for authorizing an electronic credit card transaction as defined in claim 16, wherein said processing means further compares the input street address and zip code with the retrieved stored addresses in the social security database to determine if the input street address and zip code match any of the street addresses and zip codes in the retrieved stored addresses.\n20. The automated system for authorizing an electronic credit card transaction as defined in claim 19, wherein said processing means determines whether the input street address is a P.O. Box if the input street address does not initially match a retrieved stored address.\n21. The automated system for authorizing an electronic credit card transaction as defined in claim 12, wherein the entire system is automated without the need for human intervention.\n22. The automated system for authorizing an electronic credit card transaction as defined in claim 12, wherein the social security number database is independent from the user's credit card information.",
    "status": "Ceased",
    "citations_own": [
        "US32985A",
        "US3872438A",
        "US4123747A",
        "US4317957A",
        "GB2112190A",
        "US4439670A",
        "US4472626A",
        "US4498000A",
        "US4594663A",
        "US4656342A",
        "US4801787A",
        "USRE32985E",
        "US4891503A",
        "US4947027A",
        "US4947028A",
        "US5012077A",
        "US5103079A",
        "US5163086A",
        "US5177342A",
        "US5202826A",
        "US5223699A",
        "US5231569A",
        "US5311594A",
        "US5365046A",
        "US5426281A",
        "US5457305A",
        "US5500513A",
        "US5832464A"
    ],
    "citations_ftf": [
        "US6029154A",
        "US5914472A",
        "EP1080415B1",
        "WO2001031556A1",
        "AU2001259838A1"
    ],
    "citedby_own": [
        "US20010025331A1",
        "US20020099648A1",
        "US20020120585A1",
        "US20020133371A1",
        "US20020174062A1",
        "US6496936B1",
        "US20030023541A1",
        "US20030033228A1",
        "US20030074327A1",
        "US20030101137A1",
        "US20030167237A1",
        "US20030191778A1",
        "US20040030641A1",
        "US20040054619A1",
        "US6714919B1",
        "US6714918B2",
        "US20040064401A1",
        "US6715672B1",
        "US6717592B2",
        "US20040128681A1",
        "US20040232224A1",
        "US20040243832A1",
        "US20040254867A1",
        "WO2004111892A1",
        "US20050021460A1",
        "US20050021462A1",
        "US20050081052A1",
        "US20050187883A1",
        "US20060000893A1",
        "US20060000891A1",
        "US20060000892A1",
        "US20060015421A1",
        "US20060016875A1",
        "US20060016874A1",
        "US20060026097A1",
        "US20060059110A1",
        "US20060206506A1",
        "US20060219775A1",
        "US20070051795A1",
        "US20070136199A1",
        "US20070136189A1",
        "US7240363B1",
        "US20070174208A1",
        "US20070174164A1",
        "US7313544B1",
        "US7314165B2",
        "US20080005037A1",
        "US7318550B2",
        "WO2008036550A2",
        "US20080086759A1",
        "US7363504B2",
        "US7379916B1",
        "US20080167980A1",
        "US20080184351A1",
        "US20080217399A1",
        "US20080288376A1",
        "US7458508B1",
        "US20080319904A1",
        "US20080319869A1",
        "US7562814B1",
        "US7620599B2",
        "US7630924B1",
        "US7668750B2",
        "US7686214B1",
        "US7690577B2",
        "US7705732B2",
        "US7725427B2",
        "US7740168B2",
        "US20100218111A1",
        "US7814332B2",
        "US20100312667A1",
        "US7889052B2",
        "US7988038B2",
        "US20110191248A1",
        "US8001054B1",
        "USRE43157E1",
        "US8279042B2",
        "US8289136B2",
        "US8294552B2",
        "US8386377B1",
        "US8396455B2",
        "US8478692B2",
        "US8533118B2",
        "US20130324230A1",
        "US8666841B1",
        "US8918891B2",
        "USRE45416E1",
        "US9024719B1",
        "US9031880B2",
        "US9065643B2",
        "US9171306B1",
        "US9392332B2",
        "US9454752B2",
        "US9542687B2",
        "US9607189B2",
        "US10037528B2",
        "US10373150B2",
        "US10395227B2",
        "US10521857B1",
        "US10528951B2",
        "US10839388B2"
    ],
    "citedby_ftf": [
        "US20060131385A1",
        "US20060131390A1",
        "US20070061396A1",
        "US20070073889A1",
        "US7552865B2",
        "US8141149B1",
        "US8463612B1",
        "US8122122B1",
        "US20070136197A1",
        "US20070209081A1",
        "US7552467B2",
        "US7792864B1",
        "US20100192201A1"
    ]
}