{
    "patent_link": "https://patents.google.com/patent/US5231492A/en",
    "patent_id": "US5231492A",
    "title": "Video and audio multiplex transmission system",
    "abstract": "A system is disclosed for multiplexing, transmitting, and receiving picture data and sound data, wherein the picture data and sound data are balanced in a limited transmission capacity so as to obtain a better overall quality to effectively use the transmission ability of a medium. The content of at least one of the picture data and sound data are detected and used for control of the content of the transmission. The content of the transmission is controlled by changing data and sound to correct a difference between the processing speed of the picture data and the sound data, thereby improving the quality of a video conference system or the like where the transmission capacity is insufficient.",
    "inventors": [
        "Ryoichi Dangi",
        "Takehiko Fujiyama",
        "Toshiaki Usui",
        "Takashi Kawabata"
    ],
    "assignee": "Fujitsu Ltd",
    "classifications": [
        "H04N21/2368",
        "H04B14/046",
        "H04N19/152",
        "H04N21/2335",
        "H04N21/23439",
        "H04N21/242",
        "H04N21/2662",
        "H04N21/4341",
        "H04N7/148",
        "H04N7/15",
        "H04N7/54",
        "H04N19/50"
    ],
    "claims": "\n1. A video and audio multiplex transmission system having a transmission unit connectable to receive an audio input and a video input and to transmit a multiplexed signal, comprising:\nan audio A/D converter connected to convert the audio input to a digital sound signal,\nan audio coding unit for coding the digital sound signal, for outputting coded sound data having a format that enables selection of a transmission amount and for outputting audio content data,\na video A/D converter connected to convert the video input to a digital picture signal,\na video coding unit for coding the digital picture signal and for outputting coded picture data,\na coding control unit for determining and outputting control data including an allocation signal indicative of a transmission ratio of the coded sound signal and the coded video data in accordance with the transmission amount of at least one of the coded sound data and the coded picture data, and\na multiplexing unit for multiplexing the coded sound data and the coded picture data based on the allocation signal so as to obtain a certain transmission frame length, and\nwherein said audio coding unit comprises an SB-ADPCM coding unit which divides the digital sound signal into a low frequency bit portion and a high frequency bit portion for coding and selects an amount of allocation of the high frequency bit portion based on the allocation signal.\n2. A video and audio multiplex transmission system according to claim 1, wherein said audio coding unit is an adaptive type which outputs a plurality of coded sounds with different coding bit rates and wherein one of the plurality of coded sounds is selected based on an allocation bit rate output as the allocation signal.\n3. A video and audio multiplex transmission system according to claim 2, wherein said audio coding unit outputs an optimal audio bit rate signal.\n4. A video and audio multiplex transmission system according to claim 3, wherein said coding control unit outputs the optimal audio bit rate signal as the allocation signal.\n5. A video and audio multiplex transmission system according to claim 1, wherein said transmission unit further comprises an interframe rate of change judgment unit which finds a rate of change of interframe data of the digital picture signal, compares it with a threshold value, and outputs an interframe rate of change signal based on the comparison.\n6. A video and audio multiplex transmission system according to claim 2, wherein said transmission unit further comprises an interframe rate of change judgment unit which finds a rate of change of interframe data of the digital picture signal, compares it with a threshold value, and outputs an interframe rate of change signal based on the comparison.\n7. A video and audio multiplex transmission system according to claim 3, wherein said transmission unit further comprises an interframe rate of change judgment unit which finds a rate of change of interframe data of the digital picture signal, compares it with a threshold value, and outputs an interframe rate of change signal based on the comparison.\n8. A video and audio multiplex transmission system according to claim 1, wherein said transmission unit further comprises an interframe rate of change judgment unit which finds a rate of change of interframe data of said digital picture, compares it with a threshold value, and outputs an interframe rate of change signal based on the comparison.\n9. A video and audio multiplex transmission system according to claim 1, wherein said video coding unit comprises:\na video coding unit for coding the digital picture signal to produce the coded picture data,\na variable length coding unit for coding in variable lengths the coded video data to produce variable length coded picture data,\na buffer for temporarily storing the variable length coded video data, and\na buffer judgment unit for outputting a storage amount signal in accordance with an amount of the variable length coded picture data stored in said buffer.\n10. A video and audio multiplex transmission system according to claim 2, wherein said video coding unit comprises:\na video coding unit for coding the digital picture signal to produce the coded picture data,\na variable length coding unit for coding in variable lengths the coded video data to produce variable length coded picture data,\na buffer for temporarily storing the variable length coded video data, and\na buffer judgment unit for outputting a storage amount signal in accordance with an amount of the variable length coded picture data stored in said buffer.\n11. A video and audio multiplex transmission system according to claim 3, wherein said video coding unit comprises:\na video coding unit for coding the digital picture signal to produce the coded picture data,\na variable length coding unit for coding invariable lengths of the coded picture data to produce variable length coded picture data,\na buffer for temporarily storing the variable length coded video data, and\na buffer judgment unit for outputting a storage amount signal in accordance with an amount of the variable length coded picture data stored in said buffer.\n12. A video and audio multiplex transmission system according to claim 1, wherein said video coding unit comprises:\na video coding unit for coding the digital picture signal to produce the coded picture data,\na variable length coding unit for coding in variable lengths the coded picture data to produce variable length coded picture data,\na buffer for temporarily storing the variable length coded video data, and\na buffer judgment unit for outputting a storage amount signal in accordance with an amount of the variable length coded picture data stored in said buffer.\n13. A video and audio multiplex transmission system according to claim 7, wherein said video coding unit comprises:\na video coding unit for coding the digital picture signal to produce the coded picture data,\na variable length coding unit for coding in variable lengths the coded picture data to produce variable length coded picture data,\na buffer for temporarily storing the variable length coded video picture data, and\na buffer judgment unit for outputting a storage amount signal in accordance with an amount of the variable length coded picture data stored in said buffer.\n14. A video and audio multiplex transmission system according to claim 8, wherein said video coding unit comprises:\na video coding unit for coding the digital picture signal to produce the coded picture data,\na variable length coding unit for coding in variable lengths the coded picture data to produce variable length coded picture data,\na buffer for temporarily storing the variable length coded video picture data, and\na buffer judgment unit for outputting a storage amount signal in accordance with an amount of the variable length coded picture data stored in said buffer.\n15. A video and audio multiplex transmission system according to claim 6, wherein said coding control unit generates the allocation signal based on the interframe rate of change signal.\n16. A video and audio multiplex transmission system according to claim 10, wherein said coding control unit generates the allocation signal based on the storage amount signal.\n17. A video and audio multiplex transmission system according to claim 7, wherein said coding control unit generates the allocation signal in accordance with the interframe rate of change signal and the optimal audio bit rate signal.\n18. A video and audio multiplex transmission system according to claim 11, wherein said coding control unit generates the allocation signal in accordance with the storage amount signal and the optimal audio bit rate signal.\n19. A video and audio multiplex transmission system according to claim 13, wherein said coding control unit generates the allocation signal in accordance with the interframe rate of change signal, the storage amount signal, and the optimal audio bit rate signal.\n20. A video and audio multiplex transmission system according to claim 14, wherein said coding control unit generates the allocation signal in accordance with the interframe rate of change signal and the storage amount signal.\n21. A video and audio multiplex transmission system according to claim 1, wherein said transmission unit further comprises a delay amount calculation unit which generates delay time data based on the coded video data nd the digital sound signal and wherein said multiplexing unit multiplexes based on the delay time data.\n22. A video and audio multiplex transmission system according to claim 8, wherein said coding control unit generates the allocation signal based on the interframe rate of change signal.\n23. A video and audio multiplex transmission system according to claim 12, wherein said coding control unit generates the allocation signal based on the storage amount signal.\n24. A video and audio multiplex transmission system according to claim 13, wherein said coding control unit generates the allocation signal in accordance with the storage amount signal and the optimal audio bit rate signal.\n25. A video and audio multiplex transmission system according to claim 2, wherein said transmission unit further comprises a delay amount calculation unit which generates delay time data based on the coded video data and the digital sound signal and wherein said multiplexing unit multiplexes based on the delay time data.\n26. A video and audio multiplex transmission system according to claim 3, wherein said transmission unit further comprises a delay amount calculation unit which generates delay time data based on the coded video data and the digital sound signal and wherein said multiplexing unit multiplexes based on the delay time data.\n27. A video and audio multiplex transmission system according to claim 1, wherein said transmission unit further comprises a delay amount calculation unit which generates delay time data based on the coded video data and the digital sound signal and wherein said multiplexing unit multiplexes based on the delay time data.\n28. A video and audio multiplex transmission system according to claim 6, wherein said transmission unit further comprises a delay amount calculation unit which generates delay time data based on the coded video data and the digital sound signal and wherein said multiplexing unit multiplexes based on the delay time data.\n29. A video and audio multiplex transmission system according to claim 13, wherein said transmission unit further comprises a delay amount calculation unit which generates delay time data based on the coded video data and the digital sound signal and wherein said multiplexing unit multiplexes based on the delay time data.\n30. A video and audio multiplex transmission system, wherein said system comprises:\na transmission unit connectable to receive an audio input and a video input, comprising:\nan audio A/D converter connected to convert the audio input to a digital sound signal,\nan audio coding unit for coding the digital sound signal, for outputting coded sound data having a format that enables selection of a transmission amount and for outputting audio content data,\na video A/D converter connected to convert the input to a digital picture signal,\na video coding unit for coding the digital picture signal and for outputting coded picture data,\na coding control unit for determining and outputting control data including an allocation signal indicative of a transmission ratio of the coded sound signal and the coded video data in accordance with the transmission amount of at least one of the coded sound data and the coded picture data, and\na multiplexing unit for multiplexing the coded sound data and the coded picture data based on the allocation signal to output a multiplexed signal so as to obtain a certain transmission frame length, and\na reception unit comprising:\na demultiplexing unit for receiving and outputting coded sound data, coded picture data and control data including an allocation signal,\nan audio decoding unit for decoding the coded sound data to obtain a digital sound signal,\na video decoding unit for decoding the coded picture data to obtain a digital picture signal,\na decoding control unit for performing control of said audio decoding unit and said video decoding unit based on the allocation signal,\nan audio D/A converter connected to convert the digital sound signal to an audio output, and\na video D/A converter for converting said picture signal to a video output, and\nwherein said audio coding unit comprises an SB-ADPCM coding unit which divides the digital sound signal into a low frequency bit portion and a high frequency bit portion for coding and selects an amount of allocation of the high frequency bit portion based on the allocation signal, and\nwherein said audio decoding unit performs SB-ADPCM decoding of said coded sound based on the allocation signal.\n31. A video and audio multiplex transmission system according to claim 30,\nwherein said audio coding unit is an adaptive type which outputs a plurality of coded sounds with different coding bit rates and wherein one of the plurality of coded sound is selected based on an allocation bit rate output as the allocation signal, and\nwherein said decoding control unit performs control based on a demultiplexed allocation signal, i.e., said allocation bit rate.\n32. A video and audio multiplex transmission system according to claim 31, wherein said audio coding unit outputs an optimal bit rate signal.\n33. A video and audio multiplex transmission system according to claim 32, wherein said coding control unit includes the optimal bit rate signal in the allocation signal.\n34. A video and audio multiplex transmission system according to claim 30, wherein said transmission unit further comprises an interframe rate of change judgment unit which finds a rate of change of interframe data of the digital picture signal, compares it with a threshold value, and outputs an interframe rate of change signal based on the comparison.\n35. A video and audio multiplex transmission system according to claim 31, wherein said transmission unit further comprises an interframe rate of change judgment unit which finds a rate of change of interframe data of the digital picture signal, compares it with a threshold value, and outputs an interframe rate of change signal based on the comparison.\n36. A video and audio multiplex transmission system according to claim 32, wherein said transmission unit further comprises an interframe rate of change judgment unit which finds a rate of change of interframe data of the digital picture signal, compares it with a threshold value, and outputs an interframe rate of change signal based on the comparison.\n37. A video and audio multiplex transmission system according to claim 30, wherein said video coding unit comprises:\na video coding unit for coding the digital picture signal to produce the coded picture data,\na variable length coding unit for coding in variable lengths the coded video data to produce variable length coded picture data,\na buffer for temporarily storing the variable length coded video data, and\na buffer judgment unit for outputting a storage amount signal in accordance with an amount of the variable length coded picture data stored in said buffer.\n38. A video and audio multiplex transmission system according to claim 31, wherein said video coding unit comprises:\na video coding unit for coding the digital picture signal to produce the coded picture data,\na variable length coding unit for coding in variable lengths the coded video data to produce variable length coded picture data,\na buffer for temporarily storing the variable length coded video data, and\na buffer judgment unit for outputting a storage amount signal in accordance with an amount of the variable length coded picture data stored in said buffer.\n39. A video and audio multiplex transmission system according to claim 32, wherein said video coding unit comprises:\na video coding unit for coding the digital picture signal to produce the coded picture data,\na variable length coding unit for coding in variable lengths of the coded video data to produce variable length coded picture data,\na buffer for temporarily storing the variable length coded video data, and\na buffer judgment unit for outputting a storage amount signal in accordance with an amount of the variable length coded picture data stored in said buffer.\n40. A video and audio multiplex transmission system according to claim 30, wherein said reception unit further comprises a variable delay control unit for delaying the coded sound data in accordance with delay time data.\n41. A video and audio multiplex transmission system according to claim 30, wherein said transmission unit further comprises a delay amount calculation unit which generates delay time data based on the coded video data and the digital sound signal and wherein said multiplexing unit multiplexes based on the delay time data.\n42. A video and audio multiplex transmission system according to claim 31, wherein said transmission unit further comprises a delay amount calculation unit which generates delay time data based on the coded video data and the digital sound signal and wherein said multiplexing unit multiplexes based on the delay time data.\n43. A video and audio multiplex transmission system according to claim 30, wherein said transmission unit further comprises a delay amount calculation unit which generates delay time data based on the coded video data and the digital sound signal and wherein said multiplexing unit multiplexes based on the delay time data.\n44. A video and audio multiplex transmission system having a transmission unit to receive an audio input and a video input and to transmit a multiplexed signal, comprising:\nan audio A/D converter connected to convert the audio input to a digital sound signal,\nan audio coding unit for coding the digital sound signal to output coded sound data,\na video A/D converter connected to convert the video input to a digital picture signal,\na video coding unit for coding the digital picture signal to output coded video data,\na delay amount of calculation unit for calculating the variable time necessary to code the digital picture signal and output the coded video data in said video coding unit and for subtracting a fixed time necessary to code the digital sound signal and to decode the coded sound data from said variable time and output delay time data to be used for adaptively synchronizing a video reproduced signal and an audio reproduced signal in a reception unit connected to said transmission unit, and\na multiplexing unit for multiplexing the coded video data, the coded sound data and the delay time data.\n45. A video and audio multiplex transmission system wherein said system comprises:\na transmission unit connectable to receive an audio input and a video input, comprising:\nan audio A/D converter connected to convert the audio input to a digital sound signal,\nan audio coding unit for coding the digital sound signal to output coded sound data,\na video A/D converter connected to convert the video input to a digital picture signal,\na video coding unit for coding the digital sound signal to output coded video data,\na delay amount calculation unit for calculating the variable time necessary to code the digital picture signal and output the coded video data in said video coding unit and for subtracting a fixed time necessary to code the digital sound signal and to decode the coded sound data from said variable time and output delay time data to be used for adaptively synchronizing a video reproduced signal and an audio reproduced signal in a reception unit connected to said transmission unit, and\na multiplexing unit for multiplexing the coded video data, the coded sound data and the delay time data, and\na reception unit comprising:\na demultiplexing unit connected to receive the multiplexed signal from the transmission line and to output audio data, coded picture data, and delay time data by subtraction of a fixed time necessary to code the digital sound signal and decode the coded sound data from a variable time necessary to code the digital picture signal and output the coded video data,\na variable delay control unit for delaying the audio data in accordance with the delay time data and for outputting delayed audio data,\nan audio decoding unit for decoding the delayed audio data to output digital sound data,\nan audio D/A converter connected to convert the digital sound data to an audio output,\na video coding unit for decoding the coded picture data, and\na video D/A converter for converting said decoded digital picture to a video output.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4237552A",
        "JPS61159883A",
        "US4630257A",
        "US4665431A",
        "JPS62226781A",
        "JPS6315559A",
        "JPS63252083A",
        "US4831636A"
    ],
    "citations_ftf": [
        "US4541008A",
        "JPS61198941A",
        "JPS62266959A",
        "JPH0227887A",
        "JP2537722B2"
    ],
    "citedby_own": [
        "US5351090A",
        "US5430485A",
        "EP0661880A2",
        "US5434913A",
        "US5446491A",
        "US5461619A",
        "WO1995029559A1",
        "US5493568A",
        "US5500672A",
        "US5506954A",
        "US5512939A",
        "US5515107A",
        "US5521927A",
        "US5521922A",
        "US5523795A",
        "US5524141A",
        "US5528309A",
        "US5550593A",
        "US5553220A",
        "US5561466A",
        "US5566238A",
        "US5570372A",
        "US5574934A",
        "US5579389A",
        "US5592547A",
        "US5598576A",
        "US5600684A",
        "US5600797A",
        "US5603058A",
        "US5606362A",
        "US5615401A",
        "US5617145A",
        "US5617135A",
        "US5623690A",
        "US5623490A",
        "US5627581A",
        "US5631967A",
        "US5673393A",
        "US5699474A",
        "US5701581A",
        "US5719511A",
        "US5729535A",
        "US5751700A",
        "US5754765A",
        "US5768350A",
        "US5774483A",
        "US5784112A",
        "US5784457A",
        "US5790881A",
        "US5809237A",
        "US5819048A",
        "US5818468A",
        "US5818514A",
        "US5821947A",
        "US5821995A",
        "US5831666A",
        "US5831681A",
        "US5862388A",
        "US5874997A",
        "US5898457A",
        "US5903734A",
        "US5928330A",
        "US5940070A",
        "US5943648A",
        "US5949891A",
        "US5953049A",
        "US5982816A",
        "US6009305A",
        "US6055270A",
        "US6101475A",
        "US6118444A",
        "US6125398A",
        "US6128726A",
        "US6195024B1",
        "US6212547B1",
        "US6219357B1",
        "US20010000457A1",
        "US6271892B1",
        "US6275537B1",
        "DE10007579A1",
        "US6333763B1",
        "US6345390B1",
        "US6356945B1",
        "US20020124051A1",
        "US20020163598A1",
        "US6490250B1",
        "US20030043902A1",
        "US6624761B2",
        "US20030189900A1",
        "US6654956B1",
        "US6674477B1",
        "US6687770B1",
        "US6694480B1",
        "US20040076435A1",
        "US6738380B1",
        "US6738357B1",
        "WO2004045197A3",
        "US6798829B1",
        "US6898620B1",
        "US6944221B1",
        "US20060077996A1",
        "US20060109870A1",
        "US7058087B1",
        "US20060184687A1",
        "US7181608B2",
        "US7185054B1",
        "US20070053665A1",
        "US20070093672A1",
        "US7230650B2",
        "US20070237176A1",
        "US7376772B2",
        "US7386046B2",
        "US7395345B2",
        "US7400274B2",
        "US20080187054A1",
        "US20080195744A1",
        "US20080198265A1",
        "US20080219381A1",
        "US7483417B2",
        "US7512698B1",
        "USRE40704E1",
        "US20090193137A1",
        "US7664097B2",
        "US7813332B1",
        "US7817619B1",
        "US7830860B2",
        "US7835344B1",
        "US20100322308A1",
        "US7859571B1",
        "US7948968B2",
        "DE19620186B4",
        "US8249141B1",
        "US20120320979A1",
        "US8692695B2",
        "US8938062B2",
        "US9143546B2",
        "US9191505B2",
        "US20160078883A1",
        "US11638050B1"
    ],
    "citedby_ftf": [
        "US5587735A",
        "AU645914B2",
        "EP0778704A3",
        "CA2107727C",
        "JP3197766B2",
        "US5594660A",
        "JPH11150711A",
        "US6697343B1",
        "JP3295402B2",
        "GB0000874D0",
        "JP2003529905A",
        "CN100420250C",
        "EP1359722A1",
        "GB0306296D0",
        "AU2003292795A1",
        "JP2007096470A"
    ]
}