{
    "patent_link": "https://patents.google.com/patent/US6138012A/en",
    "patent_id": "US6138012A",
    "title": "Method and apparatus for reducing signal blocking in a satellite communication system",
    "abstract": "A communication system is established for providing dual-coverage areas using communication satellites, one or more terrestrial stations and one or more dual-coverage subscriber units (DCSU). The communication system determines when and where to establish dual-coverage areas. Dual-coverage areas are provided using separate beams from two or more satellites. The satellites can be located in a variety of orbits around the earth. DCSUs receive signals and process data from at least two satellites at one time. DCSUs can also transmit signals to at least two satellites at one time. Data packets which are missing from one channel are replaced by data packets on another channel. Path delays are compensated for on the transmit side to minimize processing requirements on the receive side.",
    "inventors": [
        "Michael William Krutz",
        "James Powers Redden",
        "Daniel Richard Tayloe"
    ],
    "assignee": "CDC Propriete Intellectuelle",
    "classifications": [
        "H04B7/18513",
        "H04B7/18534"
    ],
    "claims": "\n1. In a communication system, a method for reducing data interruptions due to signal blocking and signal fading, said method comprising the steps of:\n(a) obtaining a first block of data at a first communication satellite, said first communication satellite being at a first location;\n(b) obtaining a second block of data at a second communication satellite, said second communication satellite being at a second location and being coupled to said first communication satellite via a space-based cross-link;\n(c) identifying a dual-coverage subscriber unit, said dual-coverage subscriber unit being at a third location, said dual-coverage subscriber unit comprising two separate radio frequency (RF) subsystems having separate antennas;\n(d) establishing a primary communication channel from said first communication satellite to said dual-coverage subscriber unit;\n(e) establishing a secondary communication channel from said second communication satellite to said dual-coverage subscriber unit, said dual-coverage subscriber unit using said two separate RF subsystems to simultaneously receive and process signals from said primary communication channel and said secondary communication channel, said primary and secondary channel determinations being based on a combination of signal strength and bit error rates for the channels;\n(f) sending said first block of data from said first communication satellite to said dual-coverage subscriber unit using said primary communication channel;\n(g) sending said second block of data from said second communication satellite to said dual-coverage subscriber unit using said secondary communication channel, wherein said space-based cross-link is used to coordinate the sending of said first block of data from said first communication satellite and the sending of said second block of data from said second communication satellite;\n(h) receiving a third block of data at said dual-coverage subscriber unit, wherein said third block of data is a corrupted version of said first block of data;\n(i) receiving a fourth block of data at said dual-overage subscriber unit, wherein said fourth block of data is a corrupted version of said second block of data; and\n(j) processing said third block of data and said fourth block of data at said dual-coverage subscriber unit, said dual-coverage subscriber unit determining which frequencies and timeslots to use for said two separate RF subsystems.\n2. The method as claimed in claim 1, wherein said first location is in a first non-geosynchronous orbit about an Earth and said second location is in a second non-geosynchronous orbit about the Earth.\n3. The method as claimed in claim 1, wherein said first location is in a non-geosynchronous orbit about earth and said second location is in a geosynchronous orbit about the earth.\n4. The method as claimed in claim 1, wherein said first location is in a geosynchronous orbit about an earth and said second location is in a non-geosynchronous orbit about the earth.\n5. The method as claimed in claim 1, wherein said first location is in a first geosynchronous orbit about an earth and said second location is in a second geosynchronous orbit about the earth.\n6. The method as claimed in claim 1, wherein step (c) further comprises the steps of:\n(c1) reading, by said first communication satellite, header information from said first block of data; and\n(c2) identifying, by said first communication satellite, said dual-coverage subscriber unit using said header information.\n7. The method as claimed in claim 6, wherein step (c) further comprises the steps of:\n(c3) reading, by said second communication satellite, header information from said second block of data; and\n(c4) identifying, by said second communication satellite, said dual-coverage subscriber unit using said header information.\n8. The method as claimed in claim 1, wherein step (j) further comprises the steps of:\n(j1) determining a first number of data packets in said third block of data;\n(j2) establishing a sequence number for each of said first number of data packets;\n(j3) determining when a data packet is missing from said first number of data packets, wherein a missing data packet is identified using a particular sequence number; and\n(j4) replacing said missing data packet with a redundant data packet obtained from said fourth block of data, said redundant data packet having said particular sequence number.\n9. A method for operating a system control center to provide improved communication services to a dual-coverage subscriber unit (DCSU) in a communication system, said communication system comprising a plurality of communication satellites and a plurality of DCSUs, said plurality of communication satellites being cross-linked to each other and communicating with said system control center, said method comprising the steps of:\nreceiving a request for dual coverage service from an origination DCSU;\ndetermining from said request a first dual-service coverage area, said first dual-service coverage area being determined using a location for said origination DCSU;\nidentifying a first primary satellite, said first primary satellite providing a beam for a first part of said first dual-service coverage area;\nidentifying a first secondary satellite, said first secondary satellite providing a beam for a second part of said first dual-service coverage area;\ndetermining from said request a second dual-service coverage area, said second dual-service coverage area being determined using a location for a termination DCSU;\nidentifying a second primary satellite, said second primary satellite providing a beam for a first part of said second dual-service coverage area;\nidentifying a second secondary satellite, said second secondary satellite providing a beam for a second part of said second dual-service coverage area;\ndetermining a primary signal path between said origination DCSU and said termination DCSU;\ndetermining a secondary signal path between said origination DCSU and said termination DCSU; and\nsending primary signal path and secondary signal path information to said origination DCSU and said termination DCSU\nwherein a space-based cross-link between a primary satellite and a secondary satellite is used to coordinate the establishing of said primary signal path and the establishing of said secondary signal path.\n10. The method as claimed in claim 9, wherein said method further comprises the steps of:\ndetermining delay information for said primary signal path and secondary signal path; and\nsending said delay information to said origination DCSU and said termination DCSU.\n11. The method as claimed in claim 9, wherein said method further comprises the step of:\nestablishing said primary signal path and secondary signal path using at least one terrestrial-based link and at least one space-based link.\n12. A method for operating a dual-coverage subscriber unit (DCSU) to provide communication services to said DCSU in a communication system, said communication system comprising a plurality of cross-linked communication satellites, said plurality of cross-linked communication satellites using space-based cross-links for communicating with said DCSU, said method comprising the steps of:\nsending a request for a dual-satellite service to a system control center via a first RF channel with a first satellite of said plurality of cross-linked communication satellites, said dual-coverage subscriber unit comprising two separate radio frequency (RF) subsystems having separate antennas, wherein said DCSU uses a first RF subsystem to establish said first RF channel;\nreceiving a reply to said request from said system control center via said first satellite;\nestablishing said dual-satellite service, said DCSU determining if said dual-satellite service is available and establishing said dual-satellite service when said dual-satellite service is available, wherein said DCSU establishes a second RF channel with a second satellite of said plurality of cross-linked communication satellites, wherein a space-based cross-link is established between said second satellite and said first satellite, and determines a primary channel and a secondary channel based on a combination of signal strength and bit error rates for said RF channels, said DCSU using a second RF subsystem to establish said second RF channel; and\nmaintaining single-satellite service, when said dual-satellite service is not available.\n13. The method as claimed in claim 12, wherein said establishing step further comprises the steps of:\ndetermining hand-off priority for said primary channel; and\ndetermining hand-off priority for said secondary channel.\n14. The method as claimed in claim 13, wherein said establishing step further comprises the steps of:\ndetermining which frequencies to allocate to said primary channel based on signal strength; and\ndetermining which frequencies to allocate to said secondary channel also based on signal strength.\n15. The method as claimed in claim 14, wherein said establishing step further comprises the steps of:\ndetermining which timeslots to allocate to said primary channel using an expected signal delay for a primary path; and\ndetermining which timeslots to allocate to the secondary channel using an expected signal delay for a secondary path.\n16. The method as claimed in claim 15, wherein said establishing step further comprises the steps of:\nstoring data from a certain number of timeslots; and\nreplacing missing data packets on said primary channel with data packets from said secondary channel.\n17. The method as claimed in claim 12, wherein said method further comprises the step of:\ndetermining a location for said DCSU.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4901307A",
        "US5101501A",
        "US5161248A",
        "US5446922A",
        "US5485485A",
        "US5537679A",
        "US5539730A",
        "US5561673A",
        "EP0748065A2",
        "US5590395A",
        "US5592481A",
        "US5608722A",
        "WO1997011536A1",
        "WO1997022188A2",
        "WO1997023065A2",
        "US5664006A",
        "US5768684A",
        "US5839053A",
        "US5841766A",
        "US5867789A",
        "US5898928A",
        "US5956619A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6269242B1",
        "US6295440B2",
        "US6339585B1",
        "US6470058B1",
        "US20030043798A1",
        "US6539200B1",
        "US6559797B1",
        "US20030165200A1",
        "US6662011B1",
        "US6678267B1",
        "US6678520B1",
        "US6725013B1",
        "US6744757B1",
        "US6751458B1",
        "US6757256B1",
        "US6763242B1",
        "US6765904B1",
        "US6785553B2",
        "US6788917B1",
        "US20040193373A1",
        "US6801532B1",
        "US6801499B1",
        "US6804244B1",
        "US20040204111A1",
        "US20040252701A1",
        "US20040252700A1",
        "US6920309B1",
        "US6920323B1",
        "US20050207375A1",
        "US6952580B2",
        "US6963548B1",
        "US6990314B1",
        "US7046718B1",
        "US7068733B2",
        "US7103317B2",
        "US20060209737A1",
        "US7133377B1",
        "US7200360B1",
        "US20070096788A1",
        "US7215954B1",
        "US7240347B1",
        "US20070248041A1",
        "CN101238651A",
        "US20080212517A1",
        "US7711873B1",
        "US8744360B2",
        "US20160037434A1",
        "WO2016058982A1",
        "US10149200B2",
        "US10204246B1",
        "CN112817013A",
        "US11044008B2",
        "US11070856B2",
        "US11171715B2"
    ],
    "citedby_ftf": [
        "US6628922B1",
        "US6636734B1",
        "JP6692868B2"
    ]
}