{
    "patent_link": "https://patents.google.com/patent/US6088718A/en",
    "patent_id": "US6088718A",
    "title": "Methods and apparatus for using resource transition probability models for pre-fetching resources",
    "abstract": "Building resource (e.g., Internet content) and attribute transition probability models and using such models for pre-fetching resources, editing resource link topology, building resource link topology templates, and collaborative filtering.",
    "inventors": [
        "Steven J. Altschuler",
        "Greg Ridgeway"
    ],
    "assignee": "Microsoft Technology Licensing LLC",
    "classifications": [],
    "claims": "\n1. In a system comprising:\na client having a resource requester;\na server having a storage area, containing stored resources, and a resource retriever for accessing the storage area and servicing requests for any of the stored resources; and\na network connected between the client and the server and for facilitating communication therebetween;\na method for pre-fetching resources comprising the steps of:\n(A) in the server, providing to the client from the server, in response to a fetch request, issued by the resource requester, for a particular resource, the particular resource and a list specifying both at least one resource and a corresponding probability measure associated therewith, the probability measure defining a measure of probability of the user transitioning from the particular resource to a corresponding resource specified in the list;\n(B) in the client computer, selecting, in response to the corresponding probability measures associated with all the resources in the list, a specific resource to be pre-fetched and issuing a pre-fetch request to the server for the specific resource; and\n(C) in the server;\n(C1) in response to the pre-fetch request, downloading the specific resource from the server to the client computer;\n(C2) forming the list from a plurality of resources then specified in usage logs stored in the server; and\n(C3) updating the usage logs in response to the fetch request but not in response to the pre-fetch request.\n2. The method of claim 1 further comprising the step, performed in the client computer, of storing the specific resource, obtained in response to the pre-fetch request, in a cache storage area of the client.\n3. The method of claim 2 further comprising the step of reporting a cache hit from the client computer to the server computer if the specific resource resides within the cache storage area.\n4. The method of claim 3 further comprising a step, in the server computer, of updating the list in response to the cache hit.\n5. The method of claim 1 further comprising the step of downloading the specific resource whenever communications resources between the client and the server are idle.\n6. The method of claim 1 further comprising the steps of:\nmonitoring communications resources between the client and the server; and\ndownloading, in response to the monitoring step, the specific resource whenever the communications resources between the client and the server are idle.\n7. In a system having:\n(A) a server computer comprising:\n(A1) a storage area, which stores resources and usage logs, and a resource requester for accessing the storage area and servicing requests for any of the stored resources, wherein the usage logs specify individual ones of the stored resources that have been accessed by a client computer; and\n(A2) a usage log maintainer for subsequently updating the usage logs in response to one of the stored resources having been provided by the server computer to the client computer; and\n(B) a network for permitting communications to and from the server; and\n(C) the client computer comprising:\n(C1) a resource requester;\n(C2) an input/output interface unit, coupled with the network and the resource requester, for receiving requested resources, pre-fetched resources and resource transition probability lists and for sending, to the server computer, fetch resource requests, in response to resource requests from the resource requester, and pre-fetch resource requests;\n(C3) a storage area for storing the resource transition probability lists received by the input/output interface unit, wherein each of the resource transition probability lists has a first resource name, at least one second resource name, and a separate corresponding probability measure, the probability measure defining a probability of a user transitioning from the resource identified by the first resource name to a corresponding one of the resources, in the list, identified by said one second resource name;\n(C4) a cache storage area for storing pre-fetched resources received by the input/output interface unit; and\n(C5) a resource renderer for rendering the requested resource to a user; and\n(D) wherein:\n(D1) in response to a fetch request, for a particular resource identified by the first resource name, issued by the resource requester in the client, the server computer provides the particular resource and a corresponding one of the resource transition probability lists, via the network, to the client;\n(D2) in response to the probabilities contained in the corresponding list, the pre-fetch resource requester of the client then generates a pre-fetch request to the server computer for a specific resource set forth in the list;\n(D3) in response to the pre-fetch request, the specific resource is downloaded from the server into the cache storage area; and\n(D4) the corresponding list is formed from a plurality of resources then specified in the usage logs, wherein the usage log maintainer updates the usage logs in response to the fetch request but not in response to the pre-fetch request.\n8. The client of claim 7 wherein the resource requester comprises:\na user interface for accepting a user resource selection made by a user;\na navigator, responsive to the user interface, for forming the fetch request for the particular resource based on the user selection;\na pre-fetcher for forming the pre-fetch request based on the corresponding resource transition probability list; and\na cache manager, operative in response to the user resource selections, for storing pre-fetched resources to the cache storage area and for retrieving pre-fetched and cached resources from the cache storage area.\n9. The client of claim 8 wherein the pre-fetcher forms the pre-fetch request when communications resources between the client and the server are idle, and, thereafter, provides the pre-fetch request to the input/output interface unit.\n10. The client of claim 8 further comprising a communications resource monitor for monitoring communications resources between the client and the server, wherein, whenever the communications resource monitor determines that communications resources between the client and the server are idle, the pre-fetcher forms a pre-fetch request and provides the pre-fetch request to the input/output interface unit.\n11. The client of claim 8 wherein when the cache management process retrieves a pre-fetched and cached resource in response to a user resource selection, the cache management process forming a cache hit message which is reported to the server.\n12. A system comprising:\n(A) a client computer, coupled to a network, comprising:\n(A1) a pre-fetch resource requester;\n(A2) a cache storage area which contains stored pre-fetched resources;\n(A3) a resource transition probability list storage area;\n(A4) a resource requester for requesting resources in response to user selections;\n(A5) a resource renderer for rendering resources, received by the client, to a user; and\n(A6) a cache manager for managing the cache storage area; and\n(B) a server computer, also coupled to the network, comprising:\n(B1) a storage area which contains stored resources and stored usage logs, the usage logs specifying individual ones of the stored resources that have been accessed by the client computer;\n(B2) a resource retriever for accessing the storage area and for servicing requests from the client computer for the stored resources;\n(B3) a usage log maintainer for subsequently updating the usage logs in response to a resource having been provided by the server to a client computer; and\n(B4) a storage area storing a list of resources and associated probabilities, each of said probabilities being a measure of probability of the user transitioning from a particular resource specified in a fetch request to a corresponding one of the resources specified in the list; and\n(C) wherein:\n(C1) in response to a fetch request for the particular resource issued by the resource requester in the client, the server provides the particular resource and the list, via the network, to the client;\n(C2) in response to the probabilities contained in the list, the pre-fetch resource requester of the client then generates a pre-fetch request to the server for a specific resource set forth in the list;\n(C3) in response to the pre-fetch request, the specific resource is downloaded from the server into the cache storage area; and\n(C4) the list is formed from a plurality of resources then specified in the usage logs, wherein the usage log maintainer updates the usage logs in response to the fetch request but not in response to the pre-fetch request.\n13. The system of claim 12 wherein:\nthe cache manager generates a hit report when a user selects a pre-fetched resource stored in the cache storage;\nthe client computer transmits the hit report to the server; and\nthe usage log maintainer updates the usage logs in response to the hit report.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5802292A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6175838B1",
        "WO2002010954A2",
        "US20020087390A1",
        "US6427172B1",
        "US20020156911A1",
        "US20020169851A1",
        "US6510439B1",
        "US6611842B1",
        "US20030212594A1",
        "US20040111474A1",
        "US20040158815A1",
        "US20050021613A1",
        "FR2858078A1",
        "US20050086335A1",
        "US20050154779A1",
        "US20050193414A1",
        "US20050195660A1",
        "US20050262047A1",
        "US20060046686A1",
        "US7036113B1",
        "US20060173842A1",
        "US7117239B1",
        "US20060272023A1",
        "US20060271508A1",
        "US20060271509A1",
        "US20060288251A1",
        "US20070130132A1",
        "US7231419B1",
        "US7260600B1",
        "US7308417B1",
        "US20080189361A1",
        "US20090012930A1",
        "US20100005046A1",
        "US20100023949A1",
        "US20100121940A1",
        "US7730169B1",
        "US7752203B2",
        "US7774451B1",
        "US20110044354A1",
        "CN102033769A",
        "US7937370B2",
        "US7949937B2",
        "US20110138056A1",
        "US7966418B2",
        "US7971204B2",
        "US8060886B2",
        "US8065397B2",
        "US8099758B2",
        "US8108543B2",
        "US8321871B1",
        "US8370479B2",
        "US8406119B2",
        "US8478861B2",
        "US8805957B2",
        "US20150046385A1",
        "US9313114B2",
        "US20170116556A1",
        "US9948709B2",
        "US10313463B2",
        "US10341458B2",
        "US10498849B1",
        "US10733028B2",
        "US20210349964A1",
        "US11205103B2",
        "US11496415B2",
        "US11494235B2",
        "US11522952B2",
        "US11526304B2",
        "US11630704B2",
        "US11650857B2",
        "US11658916B2",
        "US11720290B2"
    ],
    "citedby_ftf": [
        "EP3920025A1"
    ]
}