{
    "patent_link": "https://patents.google.com/patent/US6622036B1/en",
    "patent_id": "US6622036B1",
    "title": "Method for classifying and treating physiologic brain imbalances using quantitative EEG",
    "abstract": "Neurophysiologic information such as quantitative electroencephalography (QEEG) is used in a method for classifying, diagnosing, and treating physiologic brain imbalances. Neurophysiologic information is also used to guide sample selection in clinical tests for psychopharmacologic drug candidates. Finally, neurophysiologic information is used for remotely assessing and treating patients with physiologic brain imbalances.",
    "inventors": [
        "Stephen Suffin"
    ],
    "assignee": "Mynd Analytics Inc A California Corp",
    "classifications": [
        "A61B5/4833",
        "A61B5/0006",
        "A61B5/16",
        "A61B5/165",
        "A61B5/369",
        "A61B5/374",
        "A61B5/377",
        "A61B5/7264",
        "A61P25/00",
        "A61P25/12",
        "A61P25/18",
        "A61P25/28",
        "G16H10/60",
        "G16H15/00",
        "G16H20/70",
        "A61B5/1104",
        "A61B5/7257",
        "A61B5/7275",
        "G16H30/40"
    ],
    "claims": "\n1. A method for treating physiologic brain imbalances, comprising: obtaining neurophysiologic information from a patient, quantifying the neurophysiologic information, and correlating the quantified neurophysiologic information to medication therapy responsivity profiles, without regard to psychiatric diagnostic category.\n2. A method according to claim 1, wherein the neurophysiologic information is collected using a neurophysiologic technique selected from the group consisting of electroencephalograhy, magnetic resonance imaging, positron emission tomography, single photon emission computerized tomography, and any combination thereof.\n3. A method according to claim 2 wherein the neurophysiologic technique is electroencephalography.\n4. A method according to claim 3 wherein the electroencephalography is digitized fast Fourier transform quantitative electroencephalography.\n5. A method according to claim 1, further comprising storing the neurophysiologic information in a database.\n6. A method according to claim 1, further comprising storing the quantified neurophysiologic information in a database.\n7. A method according to claim 1, further comprising storing the correlations between quantified neurophysiologic information and therapy responsivity profiles in a database.\n8. A method according to claim 1 further comprising determining from the therapy responsivity profile a treatment of the physiologic brain imbalance of the patient.\n9. A method for classifying brain imbalances, comprising: comparing quantified neurophysiologic information from a patient with neurophysiologic information from a reference population of individuals to produce a group of differences for the patient, organizing the differences by neurophysiologic output measurements to provide a differences profile of the physiological state of the patient's brain function, and correlating the differences profile of the patient with a series of medication treatment modalities to produce a treatment recommendation, without regard to psychiatric diagnostic category.\n10. A method according to claim 8 wherein the quantified neurophysiologic information is nonparoxysmal.\n11. A method according to claim 8 wherein the quantified neurophysiologic information is at least in part paroxysmal.\n12. A method according to claim 9, wherein the quantified neurophysiologic information is general or FFT quantitative electroencephalography (QEEG) information.\n13. A method according to claim 9, wherein the quantified neurophysiologic information from a patient and from a reference population is general or FFT QEEG multivariate output measurements.\n14. A method according to claim 9 wherein the general or FFT QEEG multivariate output measurements are selected from a group consisting of absolute power, relative power, frequency, intrahemispheric coherence, interhemispheric coherence, intrahemispheric asymmetry, and interhemispheric asymmetry, and ratios or combinations thereof.\n15. A method according to claim 9 wherein the general or FFT QEEG multivariate output measurements are determined from combinations of EEG electrodes found in the anterior, posterior, right hemisphere, left hemisphere regions of the scalp.\n16. A method according to claim 9 wherein the general or FFT QEEG multivariate output measurements are determined from electrodes or combinations of electrodes in the delta, theta, alpha, or beta EEG frequency bands.\n17. A method according to claim 9 wherein Z scores are determined for each general or FFT QEEG multivariate output measurement.\n18. A method according to claim 9 wherein the general or FFT QEEG multivariate output measurements are expressed in terms of Z scores.\n19. A method according to claim 9, wherein the reference population is drawn from individuals who are asymptomatic for physiologic brain imbalances.\n20. A method for analyzing physiologic brain imbalances of a patient, comprising: comparing the differences profile of the patient according to claim 16 with neurophysiologic information from a second reference population of individuals who are symptomatic for physiologic brain imbalances to produce a group of similarities for the patient, and organizing the similarities by neurophysiologic output measurements to provide a similarities profile of the physiological state of the patient's brain function.\n21. A method for treating physiologic brain imbalances of a patient, comprising: correlating the similarities profile of the patient according to claim 20 with a series of treatment modalities for the second reference group to produce a treatment recommendation.\n22. A method for analyzing physiologic brain imbalances of a patient, comprising: comparing the differences profile of the patient according to claim 6 with neurophysiologic information from a second reference population who are symptomatic for physiologic brain imbalances to produce a group of similarities for the patient, and organizing the similarities by neurophysiologic output measurements to provide a similarities profile of the physiological state of the patient's brain function.\n23. A method for treating physiologic brain imbalances of a patient, comprising: correlating the similarities profile of the patient according to claim 22 with a series of treatment modalities for the second reference group to produce a treatment recommendation.\n24. A method according to claim 23 wherein the physiologic brain imbalance is associated with behaviorally or non-behaviorally diagnosed brain pathologies.\n25. A method according to claim 24 wherein the brain pathology is selected from the group consisting of agitation, Attention Deficit Hyperactivity Imbalance, Abuse, Alzheimer's disease/dementia, anxiety, panic, and phobic disorders, bipolar disorder, borderline personality disorder, behavior control problems, body dysmorphic disorders, cognitive problems, Creutzfeldt-Jakob disease, depression, dissociative disorders, eating, appetite, and weight problems, edema, fatigue, hiccups, impulse-control problems, irritability, jet lag, mood problems, movement problems, obsessive-compulsive disorder, pain, personality imbalances, posttraumatic stress disorder, schizophrenia and other psychotic disorder, seasonal affective disorder, sexual disorder, sleep disorder, stuttering, substance abuse, tic disorder/Tourette's Syndrome, traumatic brain injury, Trichotillomania, Parkinson's disease, violent/self-destructive behaviors, and any combination thereof.\n26. A treatment modality according to claim 23 wherein the treatment modality is drug ther apy and the drug is selected from the group consisting of a psychotropic agent, a neurotropic agent, a multiple of a psychotropic agent or a neurotropic agent, and any combination thereof.\n27. A treatment modality according to claim 26 wherein the drug has a direct or indirect effect on the CNS system of the patient.\n28. A treatment modality according to claim 27 wherein the drug is selected from the group consisting of alprazolam, amantadine, amitriptyline, atenolol, bethanechol, bupropion, buspirone, carbamazepine, chlorpromazine, chlordiazepoxide, citalopram, clomipramine, clonidine, clonazepam, clozapine, cyproheptadine, dexamethasone, divalproex, deprenyl, desipramine, dexamethasone, dextroamphetamine, diazepam, disulfram, divalproex, doxepin, ethchlorvynol, fluoxetine, fluvoxamine, felbamate, fluphenazine, gabapentin, haloperidol, imipramine, isocarboxazid, lamotrigine, levothyroxine, liothyronine, lithium carbonate, lithium citrate, lorazepam, loxapine, maprotiline, meprobamate, mesoridazine, methamphetamine, midazolam, meprobamate, mirtazapine, molindone, moclobemide, molindone, naltrexone, phenelzine, nefazodone, nortriptyline, olanzapine, oxazepam, paroxetine, pemoline, perphenazine, phenelzine, pimozide, pindolol, prazepam, propranolol, protriptyline, quetiapine, reboxetine, risperidone, selegiline, sertraline, sertindole, trifluoperazine, trimipramine, temazepam, thioridazine, topiramate, tranylcypromine, trazodone, triazolam, trihexyphenidyl, trimipramine, valproic acid, venlafaxine, and any combination thereof.\n29. A method according to claim 23 further comprising: obtaining follow-up quantified neurophysiologic information to track physiologic changes produced by the administration of treatment modalities, and making therapy regime changes based on the follow-up neurophysiologic information and a patient assessment tool.\n30. A method according to claim 23 wherein the physiologic brain imbalance accompanies panic disorder and the treatment modality is drug therapy using a drug selected from the group consisting of valproic acid, clonazepam, carbamazepine, methylphenidate and dextroamphetamine.\n31. A method according to claim 23 wherein the physiologic brain imbalance accompanies eating disorder and the treatment modality is drug therapy using a drug selected from the group consisting of methylphenidate and dextroamphetamine.\n32. A method according to claim 23 wherein the physiologic brain imbalance accompanies learning disorder and the treatment modality is drug therapy using a drug selected from the group consisting of amantadine, valproic acid, clonazepam and carbamazepine.\n33. A method according to claim 6 wherein the quantitative electroencephalography is fast Fourier transform quantitative electroencephalography.\n34. A method for analyzing physiologic brain imbalances of a patient compnsing: comparing quantified neurophysiologic information from the patient with neurophysiologic information from a reference population of individuals who are symptomatic for physiologic brain imbalances to produce a group of similarities for the patient, and organizing the similarities by neurophysiologic output measurements to provide a similarities profile of the physiological state of the patient's brain function, without regard to psychiatric diagnostic category.\n35. A method according to claim 34 wherein the symptomatic patients from whom the neurophysical output measurements are collected exhibit behavioral indicia of physiologic brain imbalances.\n36. A method according to claim 34 wherein the symptomatic patients from whom the neurophysiologic output measurements are collected exhibit non-behavioral indicia of physiologic brain imbalances.\n37. A method for treating physiologic brain imbalances of a patient, comprising: correlating the similarities profile of the patient according to claim 20 with a series of treatment modalities for the reference group to produce a treatment recommendation.\n38. A method for classifying, analyzing, and treating brain imbalances, comprising:",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US4201224A",
        "US4913160A",
        "US5083571A",
        "US5176145A",
        "US5230346A",
        "US5267570A",
        "US5287859A",
        "US5357976A",
        "US5445162A",
        "US5447166A",
        "US5730146A",
        "US5871517A",
        "US5873823A",
        "US5884626A",
        "US6021346A",
        "US6223074B1"
    ],
    "citations_ftf": [
        "US4128641A",
        "US4579125A",
        "US4753246A",
        "US4794533A",
        "US4776345A",
        "CA2142906A1",
        "US6067467A",
        "US5737539A",
        "EP0800680A4",
        "EP0879449A2",
        "EP0979092A2",
        "CU22550A1",
        "US6622036B1",
        "US6016449A",
        "US6016444A",
        "US6195576B1",
        "US6463321B2",
        "US6434419B1",
        "EP2275959A3"
    ],
    "citedby_own": [
        "US20030060690A1",
        "US20030073713A1",
        "US20030181821A1",
        "US20040059241A1",
        "WO2004047632A1",
        "US20040143296A1",
        "US20040167423A1",
        "US20050043774A1",
        "US20050070458A1",
        "US20050171088A1",
        "US20050216071A1",
        "US20050239138A1",
        "EP1595575A2",
        "US20060039867A1",
        "US20060122127A1",
        "US20060135877A1",
        "US20060167722A1",
        "US20060167370A1",
        "US20060217628A1",
        "US20060224067A1",
        "US20060240050A1",
        "WO2006111687A1",
        "US20070081700A1",
        "US20070100251A1",
        "US20070239230A1",
        "US20070260289A1",
        "US20070260286A1",
        "US20070265677A1",
        "US20080027347A1",
        "US20080039737A1",
        "US20080125669A1",
        "US20080214592A1",
        "US20080220400A1",
        "US20080228100A1",
        "US20090054801A1",
        "US20090156954A1",
        "US20090264956A1",
        "US20090264957A1",
        "US20090264967A1",
        "US20100076912A1",
        "US20100076334A1",
        "US20100114237A1",
        "US20100160294A1",
        "US7747325B2",
        "US7853329B2",
        "US7865234B1",
        "US7929737B2",
        "US20110119212A1",
        "US20110137371A1",
        "US20110144519A1",
        "US8000788B2",
        "US8036736B2",
        "US8088786B2",
        "US8112153B2",
        "US8112148B2",
        "US8209009B2",
        "US8295934B2",
        "US8473043B1",
        "US8485979B2",
        "US8565886B2",
        "US8579812B2",
        "US8588933B2",
        "US8626264B1",
        "US8652527B1",
        "US8706181B2",
        "US8725243B2",
        "US8722085B2",
        "US8744573B2",
        "US8762065B2",
        "US8786624B2",
        "US8815889B2",
        "US8849390B2",
        "US8868172B2",
        "US8916195B2",
        "US20150073294A1",
        "US20150112232A1",
        "US9042988B2",
        "US20150157235A1",
        "CN104720798A",
        "US9101545B2",
        "US9129054B2",
        "US9248123B2",
        "US9259591B2",
        "US9375573B2",
        "US9415222B2",
        "US9421373B2",
        "US9545359B2",
        "US9622675B2",
        "US9633575B2",
        "US9643019B2",
        "US20170273611A1",
        "US9788744B2",
        "US9898656B2",
        "US10010612B2",
        "US10058554B2",
        "US10238647B2",
        "US10406345B2",
        "WO2020068688A1",
        "US10617599B2",
        "US11020402B2",
        "US11273283B2",
        "US11324741B2",
        "US11351175B2",
        "US11364361B2",
        "US11406317B2",
        "US11452839B2",
        "US11717686B2",
        "US11723579B2",
        "US11786694B2"
    ],
    "citedby_ftf": [
        "ES2258010T3",
        "JP2005502937A",
        "US20050215552A1",
        "EP1378851A1",
        "FR2845883B1",
        "AU2003902115A0",
        "US8825166B2",
        "US20090220429A1",
        "US20070156453A1",
        "US8311622B2",
        "US8320649B2",
        "CN101478912A",
        "US20140214730A9",
        "US20110004412A1",
        "US20090312663A1",
        "EP3586923B1",
        "CA2764444C",
        "WO2011025953A1",
        "US8532757B2",
        "US8538513B2",
        "CN102906752B",
        "US9814885B2",
        "US8442626B2",
        "US8406890B2",
        "EP2734107B1",
        "EP2768385B1",
        "WO2013148557A1",
        "JP6123167B2",
        "EP2863986A4",
        "CN102715903B",
        "WO2014036170A1",
        "US10136830B2",
        "US20160022206A1",
        "WO2014143896A2",
        "JP6676522B2",
        "US11096619B2",
        "CA2965615A1",
        "US10929753B1",
        "EP3177200A4",
        "US10702208B2",
        "CN104825159B",
        "CN106175799A",
        "DE102015109853A1",
        "CA2901477C",
        "US11020035B2",
        "US20170340272A1",
        "JP2018015327A",
        "WO2018026858A1",
        "CN110234636B",
        "US10034645B1",
        "CN107411739A",
        "WO2018235076A1",
        "KR102065151B1",
        "CN108388343B",
        "US11219416B2",
        "US11457855B2",
        "WO2019241019A1",
        "US11327563B2",
        "US11287883B2",
        "US11500460B2",
        "US11500461B2",
        "US11789531B2",
        "CA3134744A1",
        "US11487361B1",
        "US20210307672A1",
        "RU2751816C1",
        "CN112617859B",
        "CN116847789A",
        "KR102287191B1",
        "US20220310263A1"
    ]
}