{
    "patent_link": "https://patents.google.com/patent/US6266649B1/en",
    "patent_id": "US6266649B1",
    "title": "Collaborative recommendations using item-to-item similarity mappings",
    "abstract": "A recommendations service recommends items to individual users based on a set of items that are known to be of interest to the user, such as a set of items previously purchased by the user. In the disclosed embodiments, the service is used to recommend products to users of a merchant's Web site. The service generates the recommendations using a previously-generated table which maps items to lists of “similar” items. The similarities reflected by the table are based on the collective interests of the community of users. For example, in one embodiment, the similarities are based on correlations between the purchases of items by users (e.g., items A and B are similar because a relatively large portion of the users that purchased item A also bought item B). The table also includes scores which indicate degrees of similarity between individual items. To generate personal recommendations, the service retrieves from the table the similar items lists corresponding to the items known to be of interest to the user. These similar items lists are appropriately combined into a single list, which is then sorted (based on combined similarity scores) and filtered to generate a list of recommended items. Also disclosed are various methods for using the current and/or past contents of a user's electronic shopping cart to generate recommendations. In one embodiment, the user can create multiple shopping carts, and can use the recommendation service to obtain recommendations that are specific to a designated shopping cart. In another embodiment, the recommendations are generated based on the current contents of a user's shopping cart, so that the recommendations tend to correspond to the current shopping task being performed by the user.",
    "inventors": [
        "Gregory D. Linden",
        "Jennifer A. Jacobi",
        "Eric A. Benson"
    ],
    "assignee": "Amazon Technologies Inc",
    "classifications": [
        "G06Q30/02",
        "G06Q10/08345",
        "G06Q30/0201",
        "G06Q30/0253",
        "G06Q30/0277",
        "G06Q30/0631",
        "G06Q30/0633"
    ],
    "claims": "\n1. In a multi-user computer system that provides user access to a database of items, a method of recommending items to a user, the method comprising the computer-implemented steps of:\n2. The method of claim 1, wherein step (a) comprises analyzing purchase histories of users to identify correlations between purchases of items.\n3. The method of claim 2, wherein step (a) comprises, for each of a plurality of popular items, identifying other items for which a relatively large portion of users that purchased the popular item also purchased the other item.\n4. The method of claim 3, wherein step (a) comprises calculating, for each (popular item, other item) pair, a similarity score which reflects a number of users that purchased both the popular item and the other item relative to a number of users that purchased at least one of the popular item and the other item.\n5. The method of claim 1, wherein step (a) comprises calculating, for each of a plurality of item pairs (item_A, item_B), a similarity score which reflects a number of users that indicated an interest in both item_A and item_B relative to a number of users that indicated an interest in at least one of item_A and item_B.\n6. The method of claim 5, wherein step (a) comprises storing the similarity scores within the data structure, and step (d) comprises using the similarity scores to combine sets of similar items.\n7. The method of claim 1, wherein step (a) is repeated periodically, so that item similarities reflected in the data structure reflect current preferences of the community of users.\n8. The method of claim 1, wherein the computer system implements online shopping carts for allowing users to select and hold items for possible purchase, and step (b) comprises selecting items that are currently in the user's shopping cart.\n9. The method of claim 1, wherein step (b) comprises identifying a plurality of items that were previously purchased by the user.\n10. The method of claim 1, wherein step (b) comprises selecting only items that have been placed within a designated shopping cart of a plurality of shopping carts of the user, the method thereby generating recommendations that are specific to a role of the designated shopping cart.\n11. The method of claim 1, wherein step (d) comprises weighting at least some of the similar items sets identified in step (c) based on information about the user's affinity for corresponding items of known interest.\n12. The method of claim 1, wherein the computer system implements online shopping carts for allowing users to select and hold items for possible purchase, and keeps track of deletions of items from shopping carts, and wherein step (e) further comprises selecting to recommend to the user an item that was previously removed from the user's shopping cart.\n13. The method of claim 1, wherein step (a)-(e) are performed without requiring any users to have rated items.\n14. The method of claim 1, further comprising filtering out similar items identified in step (c) to remove items already purchased by the user.\n15. The method of claim 1, further comprising filtering out similar items identified in step (c) to remove items that do not fall within an item category designated by the user.\n16. In a multi-user computer system that provides access to a database of items, a system for recommending items to users, comprising:\n17. The system of claim 16, wherein the first process determines a similarity between a pair of items, item_A and item_B, by at least calculating a similarity score which reflects a number of users that are interested in both item_A and item_B relative to a number of users that are interested in item_A or item_B.\n18. The system of claim 17, wherein the first process determines a similarity between a pair of items, item_A and item_B, by at least calculating a score value which reflects a number of users that purchased both item_A and item_B relative to a number of users that purchased item_A or item_B.\n19. The system of claim 16, wherein the first process generates and stores within the data structure similarity scores that indicate degrees of similarity between items, and the second process uses the similarity scores to combine sets of similar items.\n20. The system of claim 16, wherein the first process is an off-line process which executes separately from the second process, and the second process generates recommendations substantially in real-time in response to requests from users.\n21. The system of claim 16, wherein the first process is executed periodically to generate a new data structure, so that item similarities reflected in the data structure reflect current preferences of the community of users.\n22. The system of claim 16, wherein the computer system implements online shopping carts for allowing users to select and hold items for possible purchase, and wherein the second process generates recommendations for the user based on items that are currently in the user's shopping cart.\n23. The system of claim 16, wherein the second process weights at least some of the identified similar items sets based on information about the user's affinity for corresponding items of known interest.\n24. The system of claim 16, wherein the computer system allows a user to create multiple shopping carts within a single account, and the second process generates shopping cart specific recommendations to allow a user with multiple shopping carts to obtain recommendations specific to a role of a particular shopping cart.\n25. The system of claim 16, wherein the system generates personal recommendations without requiring users to rate items.\n26. The system of claim 16, wherein the second process filters out items already purchased by the user from the similar items sets identified from the data structure.\n27. The system of claim 16, wherein the second process filters out items from the similar items sets identified from the data structure based on item categories specified by users.\n28. In a system for generating personalized recommendations of items from a database of items that are accessed by a community of users, a method of recommending items to users, the method comprising:\n29. The method of claim 28, wherein step (a) comprises calculating a score which is further based on the number of users that are interested in the first item.\n30. The method as in claim 1, wherein the items are products that are available for online purchase.\n31. The system as in claim 16, wherein the items are products that are available for online purchase.\n32. The system as in claim 28, wherein the items are products that are available for online purchase.\n33. A method of generating instant product recommendations for online users, comprising:\n34. The method as in claim 33, wherein generating the data structure comprises using customer purchase histories to predict similarities between products.\n35. The method as in claim 34, wherein generating the data structure further comprises generating, for each of multiple pairs of products, a similarity score which is based at least on a number of users that purchased both products in the pair.\n36. The method as in claim 35, wherein generating the data structure further comprises using the purchase histories to determine popularity levels of products, and using said popularity levels to select the plurality of products for which to identify and store corresponding sets of similar products.\n37. The method as in claim 33, wherein the action by the online user is a request to view a personal shopping cart, and the method comprises looking up from the data structure respective similar products sets for each of multiple products represented within the shopping cart.\n38. The method as in claim 33, wherein the method comprises inhibiting selection in (c) of products already purchased by the user.\n39. The method as in claim 33, wherein the data structure is a B-tree.\n40. The method as in claim 33, further comprising replicating the data structure across multiple machines to accommodate heavy loads.\n41. The method as in claim 1, wherein (d) comprises generating a ranked set of similar items in which a similar item's ranking reflects whether that similar item appears within more than one of the sets identified in step (c).\n42. The system of claim 16, wherein the list of recommended items is a ranked list in which an item's ranking reflects whether that item appears within more than one of said similar items sets.\n43. A computer-implemented method of recommending products to users, comprising:\n44. The method as in claim 43, wherein using the data structure and scores to provide personalized product recommendations comprises:\n45. The method as in claim 44, wherein combining the multiple sets comprises combining scores of like products, so that a product's ranking reflects whether or not that product appears within more than one of the multiple sets.\n46. The method as in claim 44, wherein identifying multiple products that are of interest to the user comprises identifying products that are currently in a shopping cart of the user.\n47. The method as in claim 46, wherein recommending products to the user from the ranked set comprises displaying recommended products within a web page that displays current contents of the shopping cart.\n48. The method as in claim 43, wherein using the data structure and scores to provide personalized product recommendations comprises generating and displaying personal recommendations substantially in real time in response to online actions of users.\n49. The method as in claim 43, wherein the scores are generated and stored within the data structure in an off-line processing mode.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "EP0265083A1",
        "US4870579A",
        "US4992940A",
        "US4996642A",
        "US5235509A",
        "US5583763A",
        "EP0751471A1",
        "US5704017A",
        "EP0827063A1",
        "US5749081A",
        "US5774670A",
        "US5790426A",
        "US5794210A",
        "US5867799A",
        "US5905973A",
        "US5909023A",
        "US5909492A",
        "US5918014A",
        "GB2336925A",
        "US6006218A",
        "US6018738A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "WO2000079453A2",
        "US20010037500A1",
        "WO2001093067A1",
        "US20010051893A1",
        "US20010053999A1",
        "WO2001099001A1",
        "WO2001098998A1",
        "US6356879B2",
        "US20020032723A1",
        "US20020046111A1",
        "US20020051020A1",
        "US20020062268A1",
        "US20020078152A1",
        "US20020083039A1",
        "US20020083055A1",
        "US6415368B1",
        "US20020087390A1",
        "US20020107733A1",
        "US20020116291A1",
        "US20020120935A1",
        "US20020128907A1",
        "US20020128899A1",
        "US20020143660A1",
        "US20020142722A1",
        "US20020143613A1",
        "US20020147652A1",
        "US20020156686A1",
        "US6473738B1",
        "US20020161664A1",
        "US20020161779A1",
        "US6477509B1",
        "US20020174018A1",
        "US20020178057A1",
        "US20020178445A1",
        "US6490602B1",
        "US20020184107A1",
        "US20020180805A1",
        "US20020194087A1",
        "US20020194058A1",
        "US20020199186A1",
        "US20030004999A1",
        "US20030014759A1",
        "US6525747B1",
        "US20030051240A1",
        "US6549941B1",
        "US20030093338A1",
        "US20030093331A1",
        "US20030097357A1",
        "US20030097300A1",
        "US20030101325A1",
        "US20030101060A1",
        "US6584448B1",
        "US20030130898A1",
        "US20030135607A1",
        "US20030177066A1",
        "US6636836B1",
        "US20030212996A1",
        "US20030217121A1",
        "US20030217061A1",
        "US20030217328A1",
        "US20040003096A1",
        "US20040003097A1",
        "US20040039657A1",
        "US6708174B1",
        "US20040059626A1",
        "US20040064379A1",
        "US20040064431A1",
        "US20040068413A1",
        "US20040073485A1",
        "US20040078214A1",
        "US20040078295A1",
        "US20040088323A1",
        "US20040088275A1",
        "US20040088287A1",
        "US20040088322A1",
        "US20040088325A1",
        "US20040088276A1",
        "US20040088312A1",
        "US20040098229A1",
        "US6742032B1",
        "US20040104931A1",
        "US20040111467A1",
        "WO2004052010A1",
        "US20040117366A1",
        "US20040128320A1",
        "US20040143508A1",
        "US20040153373A1",
        "US20040158480A1",
        "US20040158503A1",
        "US20040158504A1",
        "US6778982B1",
        "US20040162783A1",
        "US6782370B1",
        "US6785671B1",
        "US20040172274A1",
        "US20040172342A1",
        "US20040172275A1",
        "US20040172267A1",
        "US20040186791A1",
        "US20040199419A1",
        "US20040204979A1",
        "US20040205516A1",
        "US20040210561A1",
        "US20040210132A1",
        "US20040225553A1",
        "US20040236216A1",
        "US20040243480A1",
        "US20040243479A1",
        "US20040244029A1",
        "US20040243527A1",
        "US20040249700A1",
        "US20040249713A1",
        "US20040249719A1",
        "US20040254942A1",
        "US20040260688A1",
        "US20040260574A1",
        "US20040260621A1",
        "US20040259874A1",
        "US20040267613A1",
        "US20040267604A1",
        "US20040267596A1",
        "US20040267669A1",
        "US20050004808A1",
        "US20050010857A1",
        "US20050013918A1",
        "US20050021420A1",
        "US6850899B1",
        "US20050038781A1",
        "US20050050031A1",
        "US20050051106A1",
        "US20050060280A1",
        "US20050071251A1",
        "US6876977B1",
        "WO2004079551A3",
        "US20050097137A1",
        "US20050114510A1",
        "US20050114366A1",
        "US20050125379A1",
        "US20050125307A1",
        "US20050125229A1",
        "US20050144066A1",
        "US20050149411A1",
        "US20050160270A1",
        "US20050171858A1",
        "US20050171860A1",
        "US20050177401A1",
        "US20050197909A1",
        "US20050194182A1",
        "US20050197946A1",
        "US20050197961A1",
        "US20050216844A1",
        "US20050228775A1",
        "US20050234781A1",
        "US20050240608A1",
        "US20050241727A1",
        "US6963848B1",
        "US6963850B1",
        "US20050256756A1",
        "WO2005122020A1",
        "US20050288961A1",
        "US20060004713A1",
        "US6985896B1",
        "US20060036510A1",
        "US7010747B1",
        "US20060053449A1",
        "US7016892B1",
        "US7016866B1",
        "US20060069639A1",
        "US7031951B2",
        "US20060085321A1",
        "US20060085282A1",
        "US7035864B1",
        "US20060106665A1",
        "US20060112099A1",
        "US20060117097A1",
        "US20060123340A1",
        "US20060122895A1",
        "US7062510B1",
        "US20060136344A1",
        "US20060136284A1",
        "US20060143072A1",
        "US7072858B1",
        "US20060149641A1",
        "US20060168507A1",
        "US20060167918A1",
        "US20060179023A1",
        "US20060212349A1",
        "US20060212367A1",
        "US7117163B1",
        "US7127414B1",
        "US20060242269A1",
        "US20060242048A1",
        "US20060242050A1",
        "US20060242266A1",
        "US20060277197A1",
        "US20060277585A1",
        "US20060274763A1",
        "US20060282304A1",
        "US20060282504A1",
        "US20060288000A1",
        "US20060294084A1",
        "US7158971B1",
        "US7159011B1",
        "US20070005437A1",
        "US20070005450A1",
        "US20070011173A1",
        "US20070043758A1",
        "US20070043617A1",
        "US20070061401A1",
        "US7194477B1",
        "US20070067371A1",
        "US20070073774A1",
        "US20070100992A1",
        "US20070118441A1",
        "US20070143172A1",
        "US20070150452A1",
        "US20070168191A1",
        "US20070168342A1",
        "US20070192684A1",
        "US20070192683A1",
        "US20070203887A1",
        "US20070208729A1",
        "US20070208682A1",
        "US20070208583A1",
        "US20070213857A1",
        "US20070214149A1",
        "US20070214148A1",
        "US20070213986A1",
        "US20070214067A1",
        "US20070226114A1",
        "US20070233551A1",
        "US20070233571A1",
        "EP1844386A2",
        "US20070250407A1",
        "US20070264982A1",
        "US20070265870A1",
        "US20070265972A1",
        "US20070271146A1",
        "US20070277233A1",
        "US20070276866A1",
        "US20070277088A1",
        "US20080010148A1",
        "US20080016205A1",
        "US7324953B1",
        "US20080040313A1",
        "US20080040341A1",
        "US20080040748A1",
        "US20080060257A1",
        "US20080077471A1",
        "US7353187B1",
        "US20080082576A1",
        "US20080082393A1",
        "US20080082635A1",
        "US20080086454A1",
        "US20080091535A1",
        "US7360698B1",
        "US20080114866A1",
        "US20080119277A1",
        "US20080125892A1",
        "US20080126020A1",
        "US7389241B1",
        "US20080162153A1",
        "US20080161945A1",
        "US20080162152A1",
        "US20080162554A1",
        "US20080162131A1",
        "US20080161944A1",
        "US20080162130A1",
        "US20080161948A1",
        "US20080177628A1",
        "US20080177620A1",
        "US20080195654A1",
        "US20080195425A1",
        "US20080208673A1",
        "US20080215583A1",
        "US20080222232A1",
        "US20080222658A1",
        "US20080228689A1",
        "US20080228723A1",
        "US20080228552A1",
        "US7428500B1",
        "US7428528B1",
        "US20080243733A1",
        "US20080250323A1",
        "US20080249867A1",
        "US20080250312A1",
        "US20080249865A1",
        "US20080249864A1",
        "US20080249835A1",
        "US20080249858A1",
        "US20080249837A1",
        "US20080249859A1",
        "US20080249793A1",
        "US20080249868A1",
        "US20080249869A1",
        "US20080249870A1",
        "US20080249843A1",
        "US20080249836A1",
        "US20080249856A1",
        "US20080249857A1",
        "US20080249866A1",
        "US20080256088A1",
        "US20080255966A1",
        "US20080270398A1",
        "US20080270250A1",
        "US20080275893A1",
        "US20080281680A1",
        "US20080281974A1",
        "CN100437740C",
        "CN100437570C",
        "US20080294617A1",
        "US7461058B1",
        "US20080301241A1",
        "US20080301186A1",
        "US20080301187A1",
        "US20080301240A1",
        "US20090006125A1",
        "US20090005650A1",
        "US20090006295A1",
        "US20090006286A1",
        "US20090013053A1",
        "US20090018845A1",
        "US20090037431A1",
        "US20090043795A1",
        "US20090043781A1",
        "US20090049030A1",
        "US20090049076A1",
        "US20090048992A1",
        "US20090046101A1",
        "US20090049045A1",
        "US20090055396A1",
        "US20090055759A1",
        "US20090070184A1",
        "US20090076881A1",
        "US20090077052A1",
        "US20090077095A1",
        "US20090077220A1",
        "US20090083117A1",
        "US20090083121A1",
        "US20090083116A1",
        "US20090083122A1",
        "US20090089107A1",
        "US7523060B1",
        "US20090119294A1",
        "US20090125588A1",
        "US20090132459A1",
        "US20090138113A1",
        "US7542951B1",
        "US20090144226A1",
        "US20090150786A1",
        "US20090150340A1",
        "US20090157795A1",
        "US20090164514A1",
        "US20090164429A1",
        "US20090164199A1",
        "US20090171932A1",
        "US20090171687A1",
        "US20090171760A1",
        "US20090176509A1",
        "US20090182642A1",
        "US20090198774A1",
        "US20090210320A1",
        "US20090210442A1",
        "US7584159B1",
        "US20090234708A1",
        "US20090240771A1",
        "US20090259621A1",
        "US20090265333A1",
        "KR100925511B1",
        "US20090313086A1",
        "US7636677B1",
        "US7644375B1",
        "US7650304B1",
        "US20100023374A1",
        "US20100031178A1",
        "US7660815B1",
        "EP2153312A1",
        "US20100049627A1",
        "US7676034B1",
        "US7685192B1",
        "US20100076983A1",
        "US7690013B1",
        "US7698165B1",
        "US7707074B1",
        "US20100106730A1",
        "US7720723B2",
        "US20100127868A1",
        "US20100131343A1",
        "US7729945B1",
        "US20100145937A1",
        "US7739162B1",
        "US20100162115A1",
        "US20100169342A1",
        "US20100169262A1",
        "US20100169343A1",
        "US20100169340A1",
        "US20100169313A1",
        "US20100169338A1",
        "US20100186041A1",
        "US20100191619A1",
        "US20100191663A1",
        "US20100198767A1",
        "US7774335B1",
        "US20100205034A1",
        "US20100217654A1",
        "US7788123B1",
        "US7792703B1",
        "US7792702B1",
        "US7797421B1",
        "USRE41754E1",
        "US20100262611A1",
        "US7818209B1",
        "US20100268661A1",
        "US20100269050A1",
        "US20100269062A1",
        "US7822647B1",
        "USRE41899E1",
        "US7831548B1",
        "US7836051B1",
        "US20100293053A1",
        "US20100306028A1",
        "US20100312613A1",
        "US7853485B2",
        "US7853488B1",
        "US7853594B2",
        "US7856434B2",
        "US20100332426A1",
        "US7865396B1",
        "US20110010331A1",
        "US7873765B1",
        "US20110022563A1",
        "US7885849B2",
        "US7894595B1",
        "US20110047213A1",
        "US20110066497A1",
        "US20110071874A1",
        "US7916858B1",
        "US20110083096A1",
        "US7925723B1",
        "US7930218B1",
        "US7930716B2",
        "US20110093361A1",
        "US20110093494A1",
        "US20110099085A1",
        "US7941394B2",
        "US20110113028A1",
        "US7945861B1",
        "US7949722B1",
        "US7966632B1",
        "US7966224B1",
        "US7966334B1",
        "US7966395B1",
        "US7966219B1",
        "US20110153414A1",
        "US20110153423A1",
        "US7970922B2",
        "US7974714B2",
        "US20110173570A1",
        "US7984056B1",
        "US20110184834A1",
        "US7991732B2",
        "US20110191311A1",
        "US20110197159A1",
        "US8001003B1",
        "US20110213675A1",
        "US20110213786A1",
        "US20110213661A1",
        "US8019752B2",
        "US20110225046A1",
        "US8024323B1",
        "US8032714B2",
        "US8046313B2",
        "US8050969B2",
        "US8051040B2",
        "US8056092B2",
        "US20110276383A1",
        "US8060463B1",
        "US8060525B2",
        "US20110282821A1",
        "US20110288924A1",
        "US20110288939A1",
        "WO2011156665A2",
        "US20120005192A1",
        "US8108255B1",
        "US20120036084A1",
        "US20120041820A1",
        "US20120084155A1",
        "US20120084669A1",
        "US8175989B1",
        "US8180688B1",
        "US8180680B2",
        "US8200683B2",
        "US8201727B1",
        "US8209378B2",
        "US20120173338A1",
        "US8239256B2",
        "US20120203660A1",
        "US8260656B1",
        "US20120226533A1",
        "US8266274B2",
        "US20120233032A1",
        "US8275673B1",
        "US8280357B2",
        "US8285602B1",
        "US8290809B1",
        "US8290818B1",
        "US8300798B1",
        "US8298087B1",
        "US8302012B2",
        "US8306908B1",
        "US8306975B1",
        "US8315909B1",
        "US20120303376A1",
        "US8326673B1",
        "US8332418B1",
        "EP2536120A1",
        "US20130041774A1",
        "US8386509B1",
        "US20130054407A1",
        "US8392281B1",
        "US8392245B1",
        "US8402068B2",
        "CN102999588A",
        "US8423408B1",
        "US8429539B1",
        "US20130110627A1",
        "US8438052B1",
        "US8442858B1",
        "US20130124564A1",
        "US8452797B1",
        "US8468164B1",
        "US8468155B2",
        "US8484311B2",
        "US8484227B2",
        "US8484203B1",
        "US8491384B2",
        "US20130191377A1",
        "US8498573B2",
        "US20130198040A1",
        "US20130198022A1",
        "US8504440B1",
        "US8510134B1",
        "US8510325B1",
        "US8510247B1",
        "US20130212495A1",
        "US8515998B1",
        "US8533094B1",
        "US8538869B1",
        "US20130246178A1",
        "WO2013153438A1",
        "US8571930B1",
        "US20130290142A1",
        "US8577874B2",
        "US8583791B2",
        "US8589440B1",
        "US20130317937A1",
        "US8615458B2",
        "US8620717B1",
        "US8620919B2",
        "US8630929B2",
        "US20140046794A1",
        "US8661034B2",
        "US8671120B1",
        "US8676802B2",
        "US20140082505A1",
        "US20140081974A1",
        "US20140081756A1",
        "US8682770B2",
        "US8694319B2",
        "US8694403B2",
        "US8700490B1",
        "JP2014067438A",
        "US20140108316A1",
        "US8712857B1",
        "US8712218B1",
        "JP2014078179A",
        "US8725740B2",
        "US8732072B2",
        "US8738609B2",
        "US20140157295A1",
        "US20140156481A1",
        "US20140156381A1",
        "US20140156688A1",
        "US8751333B1",
        "US20140172501A1",
        "US8762218B1",
        "US8769567B1",
        "US8775919B2",
        "US8775245B2",
        "US20140195331A1",
        "US8781933B2",
        "US8781954B2",
        "US8782099B2",
        "US8782197B1",
        "US8788388B2",
        "US8793236B2",
        "US8813123B2",
        "US8825520B2",
        "US8825407B2",
        "US8827147B2",
        "US20140257930A1",
        "US20140304084A1",
        "US8874465B2",
        "US8874589B1",
        "US8880599B2",
        "US8886799B1",
        "US8886575B1",
        "US8909667B2",
        "US8914500B1",
        "US8918391B2",
        "US20140379617A1",
        "US20150026019A1",
        "US20150025996A1",
        "US20150025995A1",
        "US8943514B2",
        "US20150066952A1",
        "US20150095111A1",
        "US9002839B1",
        "US9019266B2",
        "US20150120690A1",
        "US20150127576A1",
        "US9031937B2",
        "US9053185B1",
        "WO2013096749A3",
        "US9065727B1",
        "US9075882B1",
        "US9081863B2",
        "US9092542B2",
        "US9098577B1",
        "US9098572B1",
        "US9123335B2",
        "US9135339B2",
        "US9141590B1",
        "US20150278859A1",
        "US9153141B1",
        "US9191722B2",
        "US9195988B2",
        "US9195753B1",
        "US20150339688A1",
        "US9208471B2",
        "US20150363502A1",
        "EP2791892A4",
        "US9241015B1",
        "US9311383B1",
        "US9319735B2",
        "US9319379B1",
        "US20160147892A1",
        "US9361623B2",
        "US9374335B2",
        "US20160180439A1",
        "US9390402B1",
        "US9401058B2",
        "US9412102B2",
        "US9424612B1",
        "US9426509B2",
        "US9430773B2",
        "US9436928B2",
        "US20160260153A1",
        "US9477988B2",
        "US9477672B2",
        "US9489680B2",
        "US9508090B1",
        "US9507830B2",
        "US9514483B2",
        "US9519932B2",
        "US9519915B1",
        "US9524090B1",
        "US9524522B2",
        "US9537706B2",
        "US9542690B2",
        "US20170010768A1",
        "US9552433B2",
        "USRE46310E1",
        "US9569499B2",
        "US9569789B2",
        "US9576294B2",
        "US9590938B1",
        "US9613361B2",
        "US9614934B2",
        "US9626684B2",
        "US9628573B1",
        "US9633362B2",
        "US9648088B1",
        "US9672289B1",
        "US20170161618A1",
        "US9679259B1",
        "US20170206582A1",
        "US9715697B2",
        "US9721314B2",
        "US9736524B2",
        "US9734515B1",
        "US9754271B2",
        "US9767205B2",
        "US9767505B1",
        "US9773284B2",
        "US9773285B2",
        "US9779095B2",
        "US9785995B2",
        "US9792640B2",
        "US9799041B2",
        "US9798440B2",
        "US9799064B2",
        "US9818133B1",
        "US9836533B1",
        "US9836771B1",
        "US9870465B1",
        "US9882946B2",
        "US9892468B1",
        "US9900659B1",
        "US20180053210A1",
        "US9923981B2",
        "US9922347B1",
        "US20180082348A1",
        "US9934537B2",
        "US9946430B2",
        "US9984395B1",
        "US20180150851A1",
        "US10007946B1",
        "US10013707B1",
        "US10033847B2",
        "US10055757B1",
        "US10055776B2",
        "US10068261B1",
        "US20180253762A1",
        "US10102562B1",
        "US10102278B2",
        "US10109001B1",
        "US10110687B2",
        "US10108968B1",
        "US20180307765A1",
        "US10115074B1",
        "US10118099B2",
        "US10127596B1",
        "CN108874813A",
        "US10147129B1",
        "US10152680B1",
        "WO2019038736A1",
        "US10229445B2",
        "US10242019B1",
        "US10242067B2",
        "EP3360102A4",
        "US10261938B1",
        "US10268891B2",
        "US10268704B1",
        "US10269021B2",
        "US10275818B2",
        "US10284454B2",
        "US10286326B2",
        "US10296159B2",
        "US10304117B2",
        "US10311466B1",
        "US10311386B2",
        "US10315113B2",
        "US10318572B2",
        "US10354263B2",
        "US10360596B2",
        "US10361802B1",
        "USD854552S1",
        "USD855060S1",
        "USD855061S1",
        "US10366439B2",
        "USD855062S1",
        "US20190236652A1",
        "US10380656B2",
        "US10376793B2",
        "US10387795B1",
        "US10395237B2",
        "US20190266552A1",
        "US10402901B2",
        "US10405173B1",
        "US10410414B2",
        "US10410237B1",
        "JP2019175482A",
        "US10445760B2",
        "US10462508B2",
        "US10471348B2",
        "US10489471B2",
        "US10489765B2",
        "US10504132B2",
        "US10500498B2",
        "US10503797B2",
        "US10540607B1",
        "US10540686B1",
        "CN110782287A",
        "US10567975B2",
        "US10561945B2",
        "US10572555B1",
        "US10580025B2",
        "USRE47908E1",
        "US10600011B2",
        "US10614459B2",
        "CN111046229A",
        "US10627983B2",
        "US10643265B2",
        "US10643292B1",
        "US10657580B2",
        "US10664851B1",
        "US10664883B2",
        "US10664901B2",
        "US10678894B2",
        "USRE48056E1",
        "KR20200092640A",
        "US10733595B2",
        "US10740822B1",
        "US10757202B2",
        "US10755229B2",
        "US10765948B2",
        "CN111681107A",
        "US20200311159A1",
        "US10796321B1",
        "US10798211B2",
        "US10824960B2",
        "US10832304B2",
        "US10885552B2",
        "US10909604B1",
        "US10909442B1",
        "US10936653B2",
        "US10936629B2",
        "US10943273B2",
        "US10956928B2",
        "US10963744B2",
        "US10963887B1",
        "US10963687B1",
        "US10963961B1",
        "US10974150B2",
        "US20210126904A1",
        "US10997565B2",
        "US11023928B2",
        "US11023516B2",
        "US11040286B2",
        "US20210201351A1",
        "US11055758B2",
        "US20210241154A1",
        "US11087338B2",
        "US11097193B2",
        "US11107158B1",
        "US11120471B2",
        "US11138632B2",
        "US20210334880A1",
        "US11199943B2",
        "US11250338B2",
        "US11308537B1",
        "US11351459B2",
        "US11354584B2",
        "US11363106B2",
        "US11367116B1",
        "US11392751B1",
        "US11392840B2",
        "US11461831B2",
        "US11494832B2",
        "US11524234B2",
        "US20220398649A1",
        "US11532025B2",
        "US11537495B2",
        "US11538083B2",
        "US11568008B2",
        "US11625651B1",
        "US11635878B2",
        "US11635877B2",
        "US11640630B2",
        "US20230139513A1",
        "US20230140551A1",
        "US11657417B2",
        "US11657347B2",
        "US11663631B2",
        "WO2023096501A1",
        "US11669886B2",
        "US11669866B2",
        "US20230177582A1",
        "US11679330B2",
        "US11712627B2",
        "US11715132B2",
        "US11734642B2",
        "US11741501B2",
        "US11741533B2",
        "US11823244B2"
    ],
    "citedby_ftf": [
        "FR2792094B1",
        "WO2001006398A2",
        "GB2376385B",
        "KR20010109954A",
        "US9047610B1",
        "DE10036712A1",
        "DE10053738A1",
        "GB2373347B",
        "JP4378524B2",
        "US7827055B1",
        "EP1785929A1",
        "US20090327193A1",
        "CN100412870C",
        "EP2145265A4",
        "US8219447B1",
        "US20090234876A1",
        "EP2609557A4",
        "US20150156545A1",
        "WO2014116774A1",
        "US20150127419A1",
        "US10826862B1",
        "WO2019210987A1"
    ]
}