{
    "patent_id": "US-2020133964-A1",
    "title": "System and method for analysis and determination of relationships from a variety of data sources ",
    "assignee": "Kpmg Llp",
    "publication_date": "2020-04-30",
    "patent_link": "https://patents.google.com/patent/US20200133964A1/en",
    "inventors": [
        "John Hyung LEE",
        "James Johnson Gardner",
        "Justin EDWARDS",
        "Gregory Alexander Vorsanger",
        "David Anthony SCRIPKA",
        "Rachel A. WAGNER-KAISER"
    ],
    "classifications": [
        "G06F16/355",
        "G06F16/288",
        "G06F16/258",
        "G06F16/93",
        "G06N20/00",
        "G06N5/022",
        "G06N5/041",
        "G06N3/044",
        "G06N3/08",
        "G06N7/01"
    ],
    "abstract": "The invention relates to computer-implemented systems and methods for analyzing data from a variety of data sources. Embodiments of the systems and the methods further provide for generating responses to specific questions based on the analyzed data, wherein the generating includes: retrieving related documents associated with the analyzed data; determining which information should be reported from which of the retrieved related documents; and providing a response based on the determination and a graph schema associated with the related documents.",
    "claims": "\n1. A computer-implemented method for analyzing data from a variety of data sources, the method comprising:\nreceiving, as inputs, data from the variety of data sources;\nconverting the received data from each of the variety of data sources into a common data structure;\nidentifying keywords in the received data;\ngenerating sentence or word embeddings based on the identified keywords;\nreceiving a selection of one or more labels based on the generated sentence or word embeddings;\nadding the selected one or more labels to a model;\ntraining the model over the common data structure based on a configuration file; and\ngenerating a result in response to a user question based on the model, wherein the generating includes:\nretrieving related documents from the received data;\ndetermining which information should be reported from which of the retrieved related documents; and\nproviding the result based on the determination and a graph schema associated with the related documents.\n2. The method of claim 1, wherein the variety of data sources includes at least one of a machine-readable document, non-machine readable document, spreadsheet, image, a Hypertext Markup Language file.\n3. The method of claim 1, further comprising:\nsplitting the received data into component documents, wherein the received data is split based on one of a heuristic model and a trained model.\n4. The method of claim 1, further comprising:\ntokenizing at least one of word elements and sentence elements in the received data; and\nadding default word embeddings to at least one of the tokenized word elements and sentence elements.\n5. The method of claim 1, wherein the configuration file includes instructions regarding at least one of a task type, algorithm type, and features.\n6. The method of claim 5, wherein (i) the task type is one of: train, validate, and predict, (ii) the algorithm type is one of a regression algorithm and a recursive algorithm, and (iii) the features include word embeddings.\n7. The method of claim 1, further comprising:\nperforming at least one quality assessment check.\n8. The method of claim 1, further comprising:\nreceiving, via a user interface, at least one expression;\nproviding the at least one expression to the model;\nselecting, with an application programming interface, annotation candidates associated with the at least one expression; and\ntraining the model based on the selected annotation candidates.\n9. The method of claim 1, wherein, during training, target truth labels and features are extracted from a training dataset, and then provided to the model\n10. A computer-implemented system for analyzing data from a variety of data sources, the system comprising:\na processor, wherein the processor is configured to:\nreceive, as inputs, data from the variety of data sources;\nconvert the received data from each of the variety of data sources into a common data structure;\nidentify keywords in the received data;\ngenerate word or sentence embeddings based on the identified keywords;\nreceive a selection of one or more labels based on the generated word or sentence embeddings;\nadd the selected one or more labels to a model;\ntrain the model over the common data structure based on a configuration file; and\ngenerate a result in response to a user question based on the model, wherein the generating includes:\nretrieving related documents from the received data;\ndetermining which information should be reported from which of the retrieved related documents; and\nproviding the result based on the determination and a graph schema associated with the related documents.\n11. The system of claim 10, wherein the variety of data sources includes at least one of a machine-readable document, non-machine readable document, spreadsheet, image, a Hypertext Markup Language file.\n12. The system of claim 10, wherein the processor is further configured to:\nsplit the received data into component documents, wherein the received data is split based on one of a heuristic model and a trained model.\n13. The system of claim 10, wherein the processor is further configured to:\ntokenize at least one of word elements and sentence elements in the received data; and\nadd default word embeddings to at least one of the tokenized word elements and sentence elements.\n14. The system of claim 10, wherein the configuration file includes instructions regarding at least one of a task type, algorithm type, and features.\n15. The system of claim 14, wherein (i) the task type is one of: train, validate, and predict, (ii) the algorithm type is one of a regression algorithm and a recursive algorithm, and (iii) the features include word embeddings.\n16. The system of claim 10, wherein the processor is further configured to:\nperform at least one quality assessment check.\n17. The system of claim 10, wherein the processor is further configured to:\nreceive, via a user interface, at least one expression;\nprovide the at least one expression to the model;\nselect, with an application programming interface, annotation candidates associated with the at least one expression; and\ntrain the model based on the selected annotation candidates.\n18. The system of claim 10, wherein, during training, target truth labels and features are extracted from a training dataset, and then provided to the model.\n19. A computer-implemented system for analyzing data from a variety of data sources, the system comprising:\nan application programming interface; and\na processor, wherein the processor is configured to:\ngenerate a result in response to a user question based on a machine learning model, wherein the generating includes:\nretrieving related documents from the received data;\ndetermining which information should be reported from which of the retrieved related documents; and\nproviding the result based on the determination and a graph schema associated with the related documents;\nwherein the machine learning model is trained on annotation candidates provided by the application programming interface.",
    "status": "Active",
    "citations_own": [],
    "citations_ftf": [
        "CN1240011C",
        "US7139752B2",
        "US20050289182A1",
        "US7596536B2",
        "US9015301B2",
        "EP2218023A2",
        "WO2009087431A1",
        "US9002773B2",
        "US10069837B2",
        "US9690770B2",
        "US8418249B1",
        "US9519706B2",
        "US10579634B2",
        "US20140156833A1",
        "US9053085B2",
        "US20140344173A1",
        "JP6150282B2",
        "US9626459B2",
        "US9280340B2",
        "US10303798B2",
        "US9846901B2",
        "US20170060993A1",
        "US9984428B2",
        "US10540442B2",
        "US10360507B2",
        "US10671631B2",
        "US20180137419A1",
        "GB2558062A",
        "US10628471B2",
        "US10678816B2",
        "US10846341B2"
    ],
    "citedby_own": [
        "US20210124739A1",
        "US11163942B1",
        "US11182545B1",
        "US20210382924A1",
        "CN113791791A",
        "US11222286B2",
        "US20220019624A1",
        "US20220107923A1",
        "US11397762B2",
        "US11449556B2",
        "US20220335258A1",
        "US20220374719A1",
        "WO2022246034A1",
        "US20220398236A1",
        "US11580379B1",
        "EP4160499A1",
        "WO2023055984A1",
        "US20230105459A1",
        "US11636252B1",
        "US20230153335A1"
    ],
    "citedby_ftf": [
        "GB201911760D0"
    ]
}