{
    "patent_id": "US-11376001-B2",
    "title": "Surgical stapling device with rotary multi-turn retraction mechanism ",
    "assignee": "Cilag Gmbh International",
    "publication_date": "2022-07-05",
    "patent_link": "https://patents.google.com/patent/US11376001B2/en",
    "inventors": [
        "Frederick E. Shelton, IV",
        "Emily A. Schellin",
        "Jerome R. Morgan",
        "Jeffrey S. Swayze",
        "Steven G. Hall"
    ],
    "classifications": [
        "A61B17/072",
        "A61B17/068",
        "A61B17/00234",
        "A61B17/07207",
        "A61B17/105",
        "A61B34/10",
        "A61B34/30",
        "A61B34/74",
        "A61B34/76",
        "A61B90/03",
        "A61B90/37",
        "A61B90/90",
        "A61B90/96",
        "G06F21/60",
        "G06F3/016",
        "G06F3/0416",
        "G06F3/0488",
        "G06T11/60",
        "G09G5/14",
        "G16H20/40",
        "G16H40/63",
        "G16Z99/00",
        "H01M10/425",
        "H01M10/48",
        "H01M50/572",
        "H02J7/00",
        "H02J7/0068",
        "H02J7/342",
        "A61B2017/00017",
        "A61B2017/00084",
        "A61B2017/00115",
        "A61B2017/00119",
        "A61B2017/00123",
        "A61B2017/00137",
        "A61B2017/00154",
        "A61B2017/0019",
        "A61B2017/00199",
        "A61B2017/00221",
        "A61B2017/00367",
        "A61B2017/00398",
        "A61B2017/00402",
        "A61B2017/00407",
        "A61B2017/0046",
        "A61B2017/00464",
        "A61B2017/00473",
        "A61B2017/00477",
        "A61B2017/00482",
        "A61B2017/00486",
        "A61B2017/00734",
        "A61B2017/07214",
        "A61B2017/07228",
        "A61B2017/07257",
        "A61B2017/07271",
        "A61B2017/07278",
        "A61B2017/07285",
        "A61B2017/2901",
        "A61B2017/291",
        "A61B2017/2923",
        "A61B2017/2927",
        "A61B2017/2929",
        "A61B2017/2941",
        "A61B2017/2946",
        "A61B2034/252",
        "A61B2034/254",
        "A61B2034/256",
        "A61B2090/035",
        "A61B2090/037",
        "A61B2090/0803",
        "A61B2090/0804",
        "A61B2090/0807",
        "A61B2090/0808",
        "A61B2090/0811",
        "A61B2090/0814",
        "A61B2090/372",
        "A61B2560/0214",
        "A61B34/25",
        "A61B90/98",
        "G06F3/04817",
        "G06F3/0482",
        "G06F3/04845",
        "H01M2220/30",
        "H02J2310/23",
        "H02J9/061",
        "H03K2217/96062",
        "Y02E60/10"
    ],
    "abstract": "A powered surgical device configured to clamp and fasten tissue is disclosed. The powered surgical device comprises a shaft, an articulation joint, a motor-driven flexible drive member movably supported in the shaft, an I-beam coupled to the motor-driven flexible drive member, and a housing. The shaft comprises a proximal end. The motor-driven flexible drive member passes through the articulation joint during a tissue clamping motion. The motor-driven flexible drive member is driven distally away from the proximal end of the shaft during the tissue clamping motion. The housing is coupled to the proximal end of the shaft. The housing comprises a rotary multi-turn unidirectional manually-operated retraction mechanism. A rotation of the rotary multi-turn unidirectional manually-operated retraction mechanism in a first direction is configured to retract the motor-driven flexible drive member proximally toward the proximal end of the shaft.",
    "claims": "\n1. A powered surgical device configured to clamp and fasten tissue, the powered surgical device comprising:\na shaft comprising a proximal end;\nan articulation joint;\na motor-driven flexible drive member movably supported in said shaft, wherein said motor-driven flexible drive member passes through said articulation joint during a tissue clamping motion, and wherein said motor-driven flexible drive member is driven distally away from said proximal end of said shaft during the tissue clamping motion;\nan I-beam coupled to said motor-driven flexible drive member; and\na housing coupled to said proximal end of said shaft, wherein said housing comprises a rotary multi-turn unidirectional manually-operated retraction mechanism, and wherein a rotation of said rotary multi-turn unidirectional manually-operated retraction mechanism in a first direction is configured to retract said motor-driven flexible drive member proximally toward said proximal end of said shaft.\n2. The powered surgical device of claim 1, further comprising an end effector comprising a first jaw and a second jaw, wherein at least one of said first jaw and said second jaw is configured to receive a fastener cartridge.\n3. The powered surgical device of claim 2, wherein a first distal advancement of said I-beam is configured to close said first jaw and said second jaw during the tissue clamping motion, and wherein a subsequent distal advancement of said I-beam is configured to fire fasteners from the fastener cartridge during a firing motion.\n4. The powered surgical device of claim 3, wherein said I-beam is retracted proximally by said rotary multi-turn unidirectional manually-operated retraction mechanism during a tissue unclamping motion.\n5. The powered surgical device of claim 1, wherein said housing further comprises a clutch mechanism positioned intermediate said rotary multi-turn unidirectional manually-operated retraction mechanism and said motor-driven flexible drive member.\n6. The powered surgical device of claim 5, further comprising a clutch intermediate said motor-driven flexible drive member and said rotary multi-turn unidirectional manually-operated retraction mechanism.\n7. The powered surgical device of claim 6, wherein distal advancement of said motor-driven flexible drive member by said rotary multi-turn unidirectional manually-operated retraction mechanism is prevented.\n8. The powered surgical device of claim 7, wherein said clutch is structured to only allow a proximal retraction of said motor-driven flexible drive member by said rotary multi-turn unidirectional manually-operated retraction mechanism.\n9. The powered surgical device of claim 8, wherein said clutch comprises a radial array of teeth, wherein each tooth comprises an interlocking surface and a slip surface, and wherein said slip surface is configured to slip with respect to said rotary multi-turn unidirectional manually-operated retraction mechanism upon a rotation of said rotary multi-turn unidirectional manually-operated retraction mechanism in a second direction.\n10. The powered surgical device of claim 9, wherein said interlocking surface comprises a flat surface, and wherein said slip surface comprises a sloping surface.\n11. The powered surgical device of claim 1, further comprising a gear and a threaded member coupled to said motor-driven flexible drive member, wherein said gear and said threaded member are configured to convert a rotary input from a motor into a linear displacement of said motor-driven flexible drive member.\n12. A powered surgical device configured to clamp and fasten tissue, the powered surgical device comprising:\na shaft comprising a proximal end;\nan articulation joint;\na motor-driven drive member movably supported in said shaft, wherein said motor-driven drive member extends through said articulation joint, and wherein said motor-driven drive member is driven distally away from said proximal end of said shaft during a tissue clamping motion;\na beam coupled to said motor-driven drive member;\na housing coupled to said proximal end of said shaft, wherein said housing comprises a multi-turn manually-operated retraction mechanism, wherein rotation of said multi-turn manually-operated retraction mechanism is configured to retract said motor-driven drive member proximally toward said proximal end of said shaft; and\na clutch intermediate said motor-driven drive member and said multi-turn manually-operated retraction mechanism, wherein distal advancement of said motor-driven drive member by said multi-turn manually-operated retraction mechanism is prevented by said clutch.\n13. The powered surgical device of claim 12, wherein said clutch is configured to allow unidirectional displacement of said motor-driven drive member by said multi-turn manually-operated retraction mechanism.\n14. The powered surgical device of claim 13, wherein said clutch comprises a radial array of teeth, wherein each tooth comprises an interlocking surface and a slip surface, and wherein said slip surface is configured to slip with respect to said multi-turn manually-operated retraction mechanism upon a rotation of said multi-turn manually-operated retraction mechanism in a second direction.\n15. The powered surgical device of claim 12, further comprising an end effector, comprising:\nan elongate channel configured to receive a fastener cartridge; and\nan anvil.\n16. The powered surgical device of claim 15, further comprising said fastener cartridge installed in said elongate channel, wherein a first distal advancement of said beam is configured to close said end effector, and wherein a subsequent distal advancement of said beam is configured to fire fasteners from said fastener cartridge.\n17. The powered surgical device of claim 16, wherein said beam comprises:\na first flange configured to cammingly engage said anvil during the tissue clamping motion; and\na second flange configured to cammingly engage said elongate channel during the tissue clamping motion.\n18. A powered surgical device configured to clamp and fasten tissue, the powered surgical device comprising:\na shaft comprising a proximal end and a distal end;\nan articulation joint;\nan end effector extending from said distal end, said end effector comprising an anvil and a fastener cartridge comprising a plurality of fasteners;\na motor-driven drive member movably supported in said shaft, wherein said motor-driven drive member extends through at least a portion of said articulation joint, wherein a first distal advancement of said motor-driven drive member is configured to clamp said anvil and said fastener cartridge, and wherein a second distal advancement of said motor-driven drive member is configured to fire said fasteners from said fastener cartridge; and\na housing coupled to said proximal end of said shaft, wherein said housing comprises a multi-turn manually-operated retraction mechanism, wherein a rotation of said multi-turn manually-operated retraction mechanism is configured to retract said motor-driven drive member proximally toward said proximal end of said shaft, and wherein said multi-turn manually-operated retraction mechanism is configured to effect displacement of said motor-driven drive member in a single direction.\n19. The powered surgical device of claim 18, further comprising a clutch intermediate said motor-driven drive member and said multi-turn manually-operated retraction mechanism, wherein distal advancement of said motor-driven drive member by said multi-turn manually-operated retraction mechanism is prevented by said clutch.\n20. The powered surgical device of claim 18, further comprising an I-beam comprising:\na first flange configured to cammingly engage said anvil during a fastener firing stroke; and\na second flange configured to cammingly engage an elongate channel during the fastener firing stroke."
}