{
    "patent_link": "https://patents.google.com/patent/US6108698A/en",
    "patent_id": "US6108698A",
    "title": "Node-link data defining a graph and a tree within the graph",
    "abstract": "Node-link data defining a graph also include tree defining data. The node-link data with the tree defining data further define a tree within the graph. The tree defining data indicate a set of elements in the graph that are represented in the tree. Each of a subset of elements in the set is represented more than once in the tree. For at least one element in the subset, the tree defining data indicate which representations of the element have descendants in the tree and which representations have none. The tree defining data can, for example, be expansion flags for links in the graph that are in the set of elements, with each links expansion flag indicating whether the link's to-node is expanded or contracted in the tree. In response to each of a series of expand and contract signals from a user, an iteration can modify the tree defining data and use it to present a representation of the graph with the indicated node expanded or contracted as requested.",
    "inventors": [
        "Tichomir G. Tenev",
        "Ramana B. Rao",
        "Harold J. Shinsato, Jr.",
        "John O. Lamping"
    ],
    "assignee": "SAP America Inc",
    "classifications": [],
    "claims": "\n1. A method of obtaining node-link data; the method comprising:\n(A) obtaining node-link data defining a graph;\nin which (A) comprises:\nobtaining tree defining data that are included in the node-link data; the node-link data with the tree defining data further defining a tree within the graph; the tree defining data indicating a set of elements in the graph that are represented in the tree; a subset of elements in the set being represented more than once in the tree; for at least one element in the subset, the tree defining data indicating which representations of the element have descendants in the tree and which representations of the element have no descendants in the tree.\n2. The method of claim 1 in which the tree defining data comprise expansion/contraction data indicating, for each link in the set of elements, whether the link's to-node is expanded or contracted.\n3. The method of claim 2 in which the expansion/contraction data include, for each link in the set of elements, a flag indicating whether the link's to-node is expanded or contracted.\n4. The method of claim 3 in which the expansion/contraction data include, for the incoming links of each node in the set of elements, at most one link with a flag indicating that the node is expanded.\n5. The method of claim 1 in which the tree defining data indicate at most one representation of the element in the tree that has descendants, all other representations of the element in the tree having no descendants.\n6. The method of claim 1 in which (A) further comprises a series of iterations, each iteration obtaining respective tree defining data.\n7. The method of claim 6 in which each iteration comprises:\nreceiving a navigation signal from a user;\nresponding to the navigation signal by obtaining the iteration's tree defining data; and\nusing the node-link data including the iteration's tree defining data to present a representation of the graph.\n8. The method of claim 7 in which the navigation signal is an expand signal or a contract signal.\n9. The method of claim 8 in which the navigation signal further indicates a node feature in the representation presented in the preceding iteration, the node feature representing a node in the graph, the representation further including a link feature leading to the node feature, the link feature representing an incoming link to the node in the graph.\n10. The method of claim 9 in which the navigation signal is an expand signal, the act of obtaining the iteration's tree defining data comprising:\nmodifying the previous iteration's tree defining data to indicate that the incoming link represented by the link feature is expanded and that all other incoming links to the node in the graph are contracted.\n11. The method of claim 9 in which the navigation signal is a contract signal, the act of obtaining the iteration's tree defining data comprising:\nmodifying the previous iteration's tree defining data to indicate that the incoming link represented by the link feature is contracted.\n12. The method of claim 9 in which the node feature includes an indication of whether the node it represents is expanded or contracted in the tree.\n13. A system for obtaining node-link data, the system comprising:\na processor for obtaining node-link data defining a graph; the processor, in obtaining the node-link data, obtaining tree defining data that are included in the node-link data; the node-link data with the tree defining data further defining a tree within the graph; the tree defining data indicating a set of elements in the graph that are represented in the tree; a subset of elements in the set being represented more than once in the tree; for at least one element in the subset, the tree defining data indicating which representations of the element have descendants in the tree and which representations of the element have no descendant in the tree.\n14. An article of manufacture for use in a system that includes:\na storage medium access device; and\na processor connected for receiving data accessed on a storage medium by the storage medium access device;\nthe article of manufacture comprising:\na storage medium; and\ninstruction data stored by the storage medium; the instruction data indicating instructions the processor can execute; the processor, in executing the instructions, obtaining node-link data defining a graph; the processor, in obtaining the node-link data, obtaining tree defining data that are included in the node-link data; the node-link data with the tree defining data further defining a tree within the graph; the tree defining data indicating a set of elements in the graph that are represented in the tree; a subset of elements in the set being represented more than once in the tree; for at least one element in the subset, the tree defining data indicating which representations of the element have descendants in the tree and which representations of the element have no descendants in the tree.\n15. A method of transferring data between first and second machines over a network, the second machine including memory and a processor connected for accessing the memory; the memory being for storing instruction data; the method comprising:\nestablishing a connection between the first and second machines over the network; and\noperating the first and second machines to transfer instruction data from the first machine to the memory of the second machine; the instruction data indicating instructions the processor can execute; the processor, in executing the instructions, obtaining node-link data defining a graph; the processor, in obtaining the node-link data, obtaining tree defining data that are included in the node-link data; the node-link data with the tree defining data further defining a tree within the graph; the tree defining data indicating a set of elements in the graph that are represented in the tree; a subset of elements in the set being represented more than once in the tree; for at least one element in the subset, the tree defining data indicating which representations of the element have descendants in the tree and which representations of the element have no descendants in the tree.",
    "status": "Expired - Lifetime",
    "citations_own": [
        "US5337404A",
        "US5394556A",
        "US5414836A",
        "US5515487A",
        "US5590250A",
        "US5619632A",
        "US5784557A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US6377259B2",
        "US20020133516A1",
        "US20020138518A1",
        "US20020143815A1",
        "US20020156814A1",
        "US20030007002A1",
        "US20030037222A1",
        "US20030067498A1",
        "US20030074440A1",
        "US6654761B2",
        "US20030218639A1",
        "US20030220989A1",
        "US20040103199A1",
        "US20040107183A1",
        "US20040122789A1",
        "US20040215725A1",
        "US20040230587A1",
        "US20040230602A1",
        "US20040239683A1",
        "US20040254824A1",
        "US6848100B1",
        "US20050030555A1",
        "US6868525B1",
        "US20050065965A1",
        "US6897885B1",
        "US20050137902A1",
        "US20050144174A1",
        "US20050165831A1",
        "US6938075B1",
        "US20050256887A1",
        "US20050289175A1",
        "US20060031586A1",
        "US20060053369A1",
        "US20060059210A1",
        "US20060070605A1",
        "US20060080255A1",
        "US20060101346A1",
        "US7069278B2",
        "US7085759B2",
        "US20070156677A1",
        "US20070240035A1",
        "US20070266039A1",
        "US7305667B1",
        "US20070294056A1",
        "US7321900B1",
        "US7328211B2",
        "US20080052623A1",
        "US7340650B2",
        "US20080063003A1",
        "US20080077875A1",
        "US20080098025A1",
        "US7392471B1",
        "US7401156B2",
        "US7409634B2",
        "US7437662B1",
        "US7499933B1",
        "US20090132466A1",
        "US20100161651A1",
        "US20100195909A1",
        "US7802180B2",
        "US7827125B1",
        "US7974714B2",
        "US8046313B2",
        "US8065606B1",
        "US8104076B1",
        "US20130016116A1",
        "US20130173667A1",
        "US8874553B2",
        "US8935129B1",
        "US9038177B1",
        "US9092547B2",
        "US20150248190A1",
        "US20160044061A1",
        "US9292588B1",
        "US20160321376A1",
        "USRE46310E1",
        "CN106445487A",
        "US20180046801A1",
        "US10361802B1",
        "US10505820B2",
        "US10540373B1",
        "USRE47908E1",
        "USRE48056E1",
        "US10866878B2",
        "US10922404B2",
        "US11256748B2"
    ],
    "citedby_ftf": [
        "US6961733B2",
        "KR20060016744A",
        "EP1510938B1",
        "US7782324B2",
        "JP6372892B2",
        "RU2636098C1"
    ]
}