{
    "patent_link": "https://patents.google.com/patent/US4807168A/en",
    "patent_id": "US4807168A",
    "title": "Hybrid analog-digital associative neural network",
    "abstract": "Random access memory is used to store synaptic information in the form of a matrix of rows and columns of binary digits. N rows read in sequence are processed through switches and resistors, and a summing amplifier to N neural amplifiers in sequence, one row for each amplifier, using a first array of sample-and-hold devices S/H1 for commutation. The outputs of the neural amplifiers are stored in a second array of sample-and-hold devices S/H2 so that after N rows are processed, all of said second array of sample-and-hold devices are updated. A second memory may be added for binary values of 0 and -1, and processed simultaneously with the first to provide for values of 1, 0, and -1, the results of which are combined in a difference amplifier.",
    "inventors": [
        "Alexander W. Moopenn",
        "Anilkumar P. Thakoor",
        "John J. Lambe"
    ],
    "assignee": "National Aeronautics and Space Administration NASA",
    "classifications": [
        "G06J1/00",
        "G06N3/063"
    ],
    "claims": "\n1. A hybrid analog-digital neural network comprising\na first random access memory for storing an N×N matrix of synaptic information in the form of binary 1 and 0 digits,\nan array of N analog amplifiers for performing the neuron function of said network, said array of amplifiers being numbered 1 through N corresponding to columns of said matrix,\na first array of N electronic switches, each having an input terminal, an output terminal and a control terminal, one switch for each column having its control terminal connected to receive a binary signal of said synaptic information matrix stored in said first memory to enable current to flow through the switch from an input terminal to an output terminal thereof,\na first summing amplifier having input and output terminals and a first array of N resistors, one resistor for each of said switches, connecting said switches to the input terminal of said summing amplifier,\na first array of N sample-and-hold devices for sampling and holding an output signal at the output terminal of said summing amplifier in response to a control signal, said array of N sample-and-hold devices having its output terminals connected to said array of analog amplifiers, each device being connected to a corresponding one of said amplifiers numbered 1 through N in sequence,\nmeans for generating first and second timing signals where said first consists of N timing signals for every one of said second timing signals,\nmeans for producing and sequentially applying said control signal to said first array of N sample-and-hold devices in response to said first timing signal, said first array of N sample-and-hold devices having its output terminals connected to said array of analog amplifiers, each device being connected to a corresponding one of said amplifiers numbered 1 through N in sequence,\na second array of N sample-and-hold devices having its input terminals connected to said array of analog amplifiers for sampling analog signals in response to said second timing signals, each device being connected to a corresponding one of said amplifiers numbered 1 through N in sequence, and having its output terminals connected to said array of N electronic switches, each device being connected to a corresponding one of said switches numbered 1 through N in sequence, and\nmeans for addressing said memory one row at a time to read out in parallel one row of binary digits from said matrix at a time in response to N timing signals to enable said switches in response to said binary digits.\n2. A neural network as defined in claim 1 wherein each of said analog amplifiers performing the neuron function of said network includes a second input terminal for receiving a prompt signal and a third input terminal for receiving an inhibit signal which sets a threshold level for the amplifier, every amplifier receiving said inhibit signal, and each amplifier receiving a distinct prompt signal.\n3. A neural network as defined in claim 2 including an additional resistor connected to one of said first and second summing amplifiers, and means connected to said additional resistor for producing a prompt signal consisting of N binary 1 and 0 digits in series while said first array of sample-and-hold devices sample the output of said difference amplifier in sequence, thereby storing signals in response to said N prompt digits in said first array of N sample-and-hold devices.\n4. A neural network as defined in claim 1 including a second random memory for storing an N×N matrix of binary 1 and 0 digits, where binary 1 digits represent a negative unit value and may not occupy a position in said second memory corresponding to a position occupied by a binary digit 1 in said first memory, said second memory being addressed in parallel with said first memory,\na second array of N electronic switches, each having an input terminal, an output terminal and a control terminal, one switch for each column having its control terminal connected to receive a binary signal of said synaptic information matrix stored in said second memory to enable current to flow through the switch from an input terminal to an output terminal thereof,\na second summing amplifier and a second array of resistors, one resistor for each of said switches, connecting each of said second array of switches to the input terminal of said summing amplifier, and\na difference amplifier having first and second input terminals connected to output terminals of said first and second summing amplifiers, and an output terminal connected to said second array of sample-and-hold devices.\n5. A neural network as defined in claim 1 including a microprocessor, wherein said first memory is addressed one row at a time in response to said first timing signals and said second array of sample-and-hold devices are enabled to sample in parallel by said second timing signal, and said means for generating said first and second timing signals is controlled to run by said microprocessor in response to a control signal.\n6. A neural network as defined in claim 5 including means controlled by said microprocessor for monitoring said network to determine after each cycle of said second timing signal when stability has been reached in the operation of the network.\n7. A neural network as defined in claim 6 wherein said monitoring means includes means for sampling in sequence and converting the output signals of said analog amplifiers after each matrix cycle for comparison with output signals from previous matrix cycles to determine when stability has been reached.\n8. A neural network as defined in claim 7 including a microprocessor, wherein said first memory is addressed one row at a time in response to said first timing signals and said second array of sample-and-hold devices are enabled to sample in parallel by said second timing signal, and said means for generating said first and second timing signals is controlled to run by said microprocessor in response to a control signal.\n9. A neural network as defined in claim 8 including means controlled by said microprocessor for monitoring said network to determine after each cycle of said second timing signal when stability has been reached in the operation of the network.\n10. A neural network as defined in claim 9 wherein said monitoring means includes means for sampling in sequence and converting the output signals of said analog amplifiers after each second timing signal cycle for comparison with output signals from previous second timing signal cycles to determine when stability has been reached.",
    "status": "Expired - Fee Related",
    "citations_own": [
        "US3950733A",
        "US4084260A",
        "US4254474A",
        "US4326259A",
        "US4660166A",
        "US4737929A"
    ],
    "citations_ftf": [],
    "citedby_own": [
        "US4904881A",
        "US4906865A",
        "US4912652A",
        "US4912655A",
        "US4912647A",
        "US4912653A",
        "US4912654A",
        "US4912651A",
        "US4912649A",
        "US4914603A",
        "US4926064A",
        "US4926180A",
        "US4941122A",
        "US4943556A",
        "US4961005A",
        "US4967369A",
        "US4972473A",
        "US4975961A",
        "US4999525A",
        "US5023045A",
        "US5023833A",
        "US5034918A",
        "WO1991011027A1",
        "US5056037A",
        "WO1991019248A1",
        "EP0465200A2",
        "US5107146A",
        "US5109351A",
        "US5115492A",
        "US5129042A",
        "US5140531A",
        "US5167008A",
        "US5167006A",
        "US5170071A",
        "US5201029A",
        "US5202956A",
        "US5214747A",
        "US5216746A",
        "US5220559A",
        "US5222193A",
        "US5247605A",
        "US5248956A",
        "US5255349A",
        "US5257343A",
        "US5257389A",
        "US5276771A",
        "US5293459A",
        "US5315704A",
        "US5333239A",
        "US5355438A",
        "US5361328A",
        "US5369773A",
        "US5371835A",
        "US5371809A",
        "US5410635A",
        "US5424736A",
        "US5438645A",
        "US5448682A",
        "US5455583A",
        "US5475795A",
        "US5479169A",
        "US5479578A",
        "US5481484A",
        "US5485546A",
        "WO1996017307A1",
        "US5581662A",
        "US5592589A",
        "US5633989A",
        "KR19980042174A",
        "US5920851A",
        "US5995954A",
        "US20060107153A1",
        "US20080074912A1",
        "US20110119215A1",
        "US8918351B2",
        "US9218564B2",
        "US20190385049A1",
        "US10726331B1"
    ],
    "citedby_ftf": []
}